[{"topics": ["Endpoint Protection", "Java Exploits", "Java Programming", "Java Vulnerability", "Malware", "Patch Management", "SECURITY NEWS", "Vulnerability Assessment", "Vulnerability News", "WEBSENSE"], "title": "WEBSENSE: Most of Java Enabled Browsers are Vulnerable to Java Exploits Which Have Been Spreading on a Vast Scale", "body": "MAJORITY OF THE JAVA ENABLED BROWSERS ARE ASSAILABLE TO JAVA EXPLOITS WHICH HAVE BEEN SPREAD ON A VAST SCALE: SAYS WEBSENSEMajority of the browser installations that are being used have out-of-date versions of java plug in and are very much vulnerable to the exploits’ tools that have been spread on a large scale. This is according to a report that has been published on Monday by Websense. To monitor the requests originating from millions and millions of computer systems that have been protected by different products of this company, it has run its threat detection and intelligence network which will detect the different java versions that are being used in these computer systems and are also available on the web browsers. Email and web gateway products for the security of business operations are being provided by Websense and they have also entered into partnership with the Facebook authorities so that they can ploy a check on the clicks that users make on social networks for threatening content.The telemetry data which is gathered by the company reveals that only around 5.5 percent of the browsers that are java enabled have updated versions of software’s browser plug in i.e. Java 6 Update 43 (6u43) and Java 7 Update 17 (7u17). These versions were released back in the month of March to deal with the exploits and the vulnerability issue.As per Websense, a cool exploit kit already contains the exploits which is used by cybercriminals for the purpose of launching mass drive through downloading attacks that poisons computer systems with malware when one visits compromised websites. The kit requires a subscription fee of around 10,000 US dollars which means that it is not within the range of many of the cybercriminals. Websense’s data has also revealed that many browsers installations that are Java enabled are vulnerable through different exploit kits that are cheap to subscribe to.The company showed that around 75 percent browser installations that are java enabled are vulnerable or can be exploited with the use of four different exploit kits that are not only cheap but are also available on a wide scale. Balckhole 2, redKit, Gong DA and CritXpacks are the name of those kits and they target a vulnerability which is known as Java 7 Update 17 (7u17).  The company also went on to show that 75 percent of such browser installations are using Java versions which are about 6 months old and about two third of the systems (java enabled) are using versions that are more than one year old.Users are not banking on the java 7 update 11 which has been released by Oracle and which prevents java applets to enter inside the browser without a confirmation check by default.The data which has been investigated by Websense also reveals that the vulnerabilities which are already very much known to the masses at large (zero day attacks) are not be given much of an attention.Security experts have advised in the recent past that oracle should devise a way to improve on the rate of adoption for Java updates. They say that it can possibly be done via offering options such as automatic and silent updates as has been done by Google and similarly by Adobe in flash player, Adobe Reader and Chrome. Silent updates of software are not a popular ploy in the corporate worlds where patches are to be inspected for stability and compatibility issues before they are incorporated into the systems.  However if such updates are implemented in consumer space, they can shorten the fragmentation that occurs in Java versions.[Via: Websense]Follow @HackRead", "authur": "Waqas", "date": ""}, {"topics": ["hackers", "hacking", "SECURITY NEWS", "Vulnerability News", "Vulnerable IP Addresses", "Vulnerable Machines"], "title": "Hacker Maps Internet by Enslaving Thousands of Vulnerable Machines", "body": "A security researcher has raveled some fantastic results over the percentage of vulnerable networks and devices around the world. His technique as a hacker was pretty straightforward and was a big time a matter of concern for all the people around the world. Let’s then see what the researcher found through his researches and how was he able produce such results.A map showing the locations of the botnet’s hundreds of thousands of infected devices.Though, all these research was illegal it was carried out with nice intentions. The researcher in this scanned all the Ip addresses that were linked to the devices that were open for modifications. Through, this scanning, the researcher gained access to a number of devices all the compromised devices allowed him to gain to access to more IP addresses.This way he was able to gain access to botnets of more then 420,000 devices in a single day. Most of the devices were really easy top got hold off the researcher found most the devices password and username: ‘default’ and admin’. Though, all these devices were simple devices they aren’t much worth of. These included printer and appliances, which were connected to the internet.Working together these devices can trace ip addresses within an hour time. For researcher, it was a case in which robbing of one of one allowed him to find knobs of all the doors related to it. He himself admitted this as an illegal act in these words:“This is most definitely illegal,” Roel Schouwenberg, senior researcher at Kaspersky Lab, told NBC News in an email. “Even if the intentions are good, which we have no way of verifying. unauthorized access remains unauthorized access.” Even if the compromised devices were thermostats or modems, “it doesn’t matter if it involves a regular desktop computer or a router.”A map of the Internet, showing machines that responded to pings in various colors, while secure or unresponsive addresses are black.But, researcher at the same time admitted he hasn’t caused damage to any of the data he found from the compromised devices all the botnet were safe and were easily removable. As a proof he showed one of the devices compromised by malicious software. He helped it by some code to be protected from such softwares. He also has build a massive database on all the IP addresses he traced out, the size of the data is bigger then the largest hard drive available in the market i.e. 9 terabytes.A close-up of data relating to a range of IP addresses scanned by Carna.The main reason behind all this for the researcher was to give awareness to the people regarding the importance of strong login details in the internet world. Lastly, it determines how easily hackers can compromise the devices and steal significant data over the internet.Source of Images and News: NBC News.Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["4G USB Modems", "4G USB Modems Vulnerable", "Huawei 3G Modem", "Huawei 3G Vulnerable", "SECURITY NEWS", "Vulnerability News"], "title": "Huawei 3G and 4G USB Modems Vulnerable and a Security Threat", "body": "A Russian security researcher Nikita Tarakanov has found Huawei’s 3G and 4G devices vulnerable to the hackers. He has reported this matter to Black hat Europe. According to the researcher, Huawei’s sever update is one of the tools for hackers to lay down an attack on the systems.The server update was made in Netherland and it isn’t the most preferred server by Huawei. The researcher saw the server was working on hoary codes of Windows IIS 6.0 – a relic version of Windows server 2003. He believed that if the attacked got a way to break into this server, they could manipulate a large number of Huawei’s users.Furthermore, the researcher hinted towards easy plain text configuration as one of the drawbacks of the updated server. He said if hackers found a way to configure the server then they could easily be able to do it. It’s really easy to change the DNS of the server through the modem and if they are able to do that they can enforce all the users to be directed to malicious websites.The attacked could also modify the automated the anti-virus installer to a malicious software if they got a way to compromise the modem. While covering all the aspects of the vulnerabilities found in Huawei’s updated server, another researcher who was researching on Windows and OS X updates found vulnerabilities it too. He tweeted:“The Huawei OS X update app (ouc.app) has unrestricted access to /usr/local”.Though, all these researches were made from Russia but researcher s denied a probability of vulnerabilities found from specific country.Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["2shared.com", "2shared.com XSS Vulnerability", "Adobe Vulnerability", "Egyptian hacker", "SECURITY NEWS", "Virus_Hima", "Vulnerability", "XSS vulnerability", "Yahoo XSS Vulnerability"], "title": "XSS Vulnerability found on 2shared.com by Virus_Hima, who Hacked Yahoo last year", "body": "An Egyptian ethical hacker Virus_Hima who got famous after founding vulnerabilities in Adobe and breaching Yahoo server, last year; is back with another detailed report on XSS Vulnerability on file sharing and storage site 2shared.com.Virus_Hima who doesn’t sell the vulnerabilities or exploits online, has claimed to be in touch with the 2shared.com administration via email, explaining them about the vulnerability and how it should be fixed. Below are the screenshots of his conversation with one of the representatives of 2shared.com.   Hopefully 2shared.com will take Virus_Hima’s warning seriously, unlike Yahoo.Inc which is still vulnerable to hackers.Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["BackTrack 6 Download", "download", "Kali Linux", "Penetration tools"], "title": "Download now Kali Linux (BackTrack 6) [Download Link & Password in the article]", "body": "Earlier I wrote about BackTrack renaming itself as Kali Linux or BackTrack 6 will be available for download soon,  today is the day when all hackers and Backtrack users can download Kali Linux.Backtrack development team had announced that they are in process of a major change and the operating system, that will be replaced by the name of Kali. Kali Linux is based upon Debian Linux, instead of Ubuntu and new streamlined repositories synchronize with the Debian repositories 4 times a day, constantly providing users with the latest package updates and security fixes available.The Multi-language, free of cost operating system has over 300 penetration tools with GPG signed packages and Vast wireless device support.You can download Kali from Kali Linux and password is toor.Follow @HackRead ", "authur": "Waqas", "date": "March 13, 2013"}, {"topics": ["Facebook Black Malware", "Facebook Black Template Malware", "Facebook Malware", "facebook virus", "Facebook Virus News"], "title": "Facebook Black Malware Spreading Rapidly on Facebook", "body": "A new malware spreading rapidly on Facebook bluffing users into clicking an app link that supposedly allows Fake Facebook Black template replacing the default white one offered by Facebook.CWZ reports that Facebook Black malware asks users to click a link which installs an app on the users account. The app then spams itself through user’s account asking his/her friends to click the link for using Black Facebook template.In case if you are already affected by the malicious malware, just visit the below given link, search for the FaceBook Black Malware app and delete it.Image & News [Via: CWZ]Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["Microsoft", "Microsoft Vulnerabilities", "ms", "SECURITY NEWS", "Vulnerability News"], "title": "Mircosoft to Fix Some Critical Vulnerabilities by Tuesday", "body": "Microsoft has found seven vulnerabilities in its programs and has deemed of them critical. The critical are so serious that officials have said: “drop-everything-and-fix-this-now”. These loop holes are found in the following programs: Microsoft office, Windows, Internet explorer, Windows server and Silverlight.While commenting on the type attacks lay down through vulnerabilities the officials said it involved simple malware attacks which involved bobby-trapped emails that involve viruses that can attacks the user’s systems. Furthermore, malicious web pages are also part of this attack.Microsoft has warned all the users for a critical vulnerability on Silverlight, Office and IE. They have exposed a shocking truth regarding these which it can be remotely executed through codes. Furthermore, Microsoft has also predicted a complete deletion of the user’s information through major vulnerabilities.Microsoft also disclosed two vulnerabilities found in Windows and exchange, one of vulnerability is related to windows i.e. MS 13-012 which allows the hackers to get into the user’s system through some media file such as the ones in MPEG format. The files contain malicious malwares which allows the hacker to have access to the system and have same control the system as original user.Microsoft has announced a patch to be made every Tuesday of the week. So, the hackers each Tuesday would be tuning into Microsoft programs for finding vulnerabilities. Already, previous month 57 patches have been made by Microsoft. So, users need to remain updated to the Microsoft’s original site for patches as any missed can open a route for hackers to find a way into the systems.[Via:NakedSecurity] Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": [], "title": "Tunisian Cyber Army Founds XSS Vulnerability on Pentagon Website", "body": "The hackers from Tunisian Cyber Army backed with the help of Al Qaida Electronic Army have found and exploited a Cross-Site Scripting Vulnerability (XSS) on the official Pentagon – Army National Guard website.  Screenshot:The hackers who contacted me via email provided a screen shot which shows the execution of vulnerability. Other then the screenshot, the hackers also explained the whole back ground and reason for attacking the Pentagon website.The hackers claimed to have assistance from Chinese hackers during their #opBlackSummer, “Not only that we also have some important file we got after cookies stealing from the pentagon mail added to that there are some Chinese hackers who collaborate with us”.However, this is not the first time when vulnerability has been reported on Pentagon server; in past Anonymous hackers did not only exploited but also breached the military server, leaking high class secret information online.  Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["Chrome hack", "hacking", "MWL Labs", "SECURITY NEWS", "Vulnerability News", "Windows Vulnerability"], "title": "MWR Lab Wins $100,000 for Exploiting Google Chrome that leaves Windows 7 Vulnerable", "body": "Here is what researcher found exploiting into the most popular browser on web:“We were able to exploit the first vulnerability in multiple ways, allowing us to leak the addresses of several objects in memory, calculate the base address of certain system dlls, read arbitrary data, and gain code execution. This allowed us to bypass ALSR by leaking the base address of a dll, and to bypass DEP by reading that dll’s .text segment into a javascript string, allowing us to dynamically calculate the addresses of ROP gadgets.”The reason researcher told using chrome for demonstration was its popularity, so, understanding was easy. Furthermore, this competition provided an insight to the users on how easily their system’s security can be brached. To keep all simple researched exploited the chrome brwser using the default setting. Lastly, the researchers said:“Google Chrome is one of the most widely used Web browsers globally, and was perceived to be the hardest target in the competition,”“The reason Chrome was chosen as the target for the demonstration is to encourage understanding, as a security breach of this nature could expose millions of users to serious risk.”Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["Apple", "Apple HTTPS", "Apple iOS Vulnerability", "Apple Store Vulnerability", "iPad", "iPhone", "security", "Vulnerability"], "title": "Apple turns HTTPS on for App Store, fixing several vulnerabilities", "body": "Apple has finally fixed a vulnerability that was alerted about 6 six month back. This vulnerability was found in the iOS app store by Google. But, the interesting fact of the app was that it was reported by the Google’s security researcher, Elie Bursztein, but Apple doesn’t responded to it. This vulnerability could have been exploited over any public WIFI network and according to the security researcher can carry out following destruction:According to the Bursztein, this vulnerability was generated due to lack of HTTPS encryption in the App store. Now, Apple has applied more HTTPS encryption into the store.But, the most horrifying fact of this vulnerability was the delay made by Apple inc. They even didn’t notify their iOS users about this vulnerability  They could have easily fixed this vulnerability long time ago, but they didn’t was questionable and still a mystery for all tech-masters.  Follow @HackRead ", "authur": "Waqas", "date": "March 9, 2013"}, {"topics": ["Chinese hackers", "Chinese virus", "Cyber Warefare", "Cyberwar", "hacking", "Japanese government", "Malware found", "Seculert", "SECURITY NEWS", "Vulnerability News"], "title": "Malware connected to Chinese hackers found attacking Japanese government", "body": "Seculert, an Israeli based company that detects viruses and other Advanced persistent threats (APT), has claimed to detect  two different spear-phishing attacks which were using a fake Mandiant report to spy on Chinese and Japanese journalists. TheRegister reports that researchers are positive about the origin of these attacks is none other then China. “We resolved it and found it was reporting to an IP address in China with the same physical location as the previous attacks. They are up to something, Same infected PDF files.” Seculert spokesman told the media. The researchers found out that a malware was trying to infiltrate into the Japanese government based website from an IP address (218.53.110.203) belonging to Korea but shocking enough for all, the IP address contacts another local IP address (123.234.29.35), which is a server located in Jinan, the capital of the Shandong province of China.The malware was exploited as a result of recently patched Java vulnerability, sent via email in form of PDF attachment. Once the malware is downloaded and executed, it tries to download a new but a similar copy of itself and spreads like bacteria.It is unclear who was behind this sophisticated attack, but researchers stand still on their claim and blame China for planning and conducting cyber attack against government of Japan. However, the Chinese government had admitted to have a cyber warfare unit within the People’s liberation Army.Via: TheRegister & SeculertFollow @HackRead ", "authur": "Waqas", "date": "March 6, 2013"}, {"topics": ["Feross Aboukhadijeh", "SECURITY NEWS", "Venerability News", "Web Code Vulnerability"], "title": "Vulnerability in Web Codes causes Data Dumping onto Personal Computers", "body": "Caution: Weakness of Web Codes causes Data Dumping onto Personal ComputersA web developer has revealed that by creating a loophole in the web codes, junk data in gigabytes can be dumped onto PCs. It is the HTML 5 feature which defines the making of a website and the loophole exploits this feature to dump the junk data.Feross Aboukhadijeh is the web developer that has founded this bug and also gave Demo by setting up a page that filled its visitors’ hard drives with cartoon cat pictures.In another demo, he even went onto successfully dump about 1 gigabyte data per 16 seconds on an assailable Macbook.Ingenious CodeHe also added that many well established browsers such as Chrome, Safari, Opera, and Internet Explorer showed vulnerability towards the bug.Most website are being constructed presently using the version 4 of the HTML coding language, those codes are now being supplanted by the newer version which is 5.A new enhancement or upgraded feature which HTML 5 has brought is that it enables websites to store in more data on the PCs of visitors. Provisions for safeguard that have been devised in the ‘Local Storage’ specification will now pose a limit or restriction on the amount of data that can be stored. Browsers under different names have devised their own limits of data storage but each allow at minimum 2.5 megabytes storage.Even so, Mr. Aboukhadijeh has found a way out by creating numerous temporary WebPages which are linked to the website that the visitor visited. Through this method he founded that the sites which were associated with the visitors website managed to store data to the maximum limit. Reason being was that the browser developers have not incorporated any code for preventing it to happen. If one endlessly creates such linked or associated websites, then such bug can be utilized as a tube to pour in tons of Data into targeted PCs.Well he also found out that it was only Mozilla Firefox that showed invulnerability and restricted data storage at 5 MB.He mentioned in his recent blog related to the Bug that that only the websites which are coded cleverly have limitless storage space on the visitors’ PCs.Mr. Aboukhadijeh has devised a code which can be used to exploit or tap the Bug, and he has also set up a website for this purpose which has been named as ‘Filldisk’ which dumps cartoon cat images onto vulnerable PCs. No misuse has yet been reported about the exploits.As a step for resolution of this issue, bugs reports which relate to the exploit have been rendered to numerous well established browser makers.[Via: BBC]Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["BB", "BlackBerry hacks", "BlackBerry Security Advisory", "BlackBerry Vulnerability", "security", "Vulnerability"], "title": "BlackBerry Users Vulnerable to Hackers", "body": "Caution! Black berry users may become subject to a malicious act from hackers.The security advisory services of blackberry have recently indicated a threat from hackers by pointing out the possibility of a penetration into the BlackBerry servers. Hackers may do it embedding or planting a venomous code on the BES which is also used by other corporate concerns. These methods can really prove harmful for the working of your gadget.Hackers my drive the visitors to a web page through which they can embed or drive a venomous code into their mail box or through an instant message. The servers of BlackBerry are primarily functioning for this purpose and a lot depends on how they manage various TIFF images files which are viewed by millions of BlackBerry users. A recent report suggests that many of the malicious pages, links and images that contain the virus can penetrate even without users clicking or viewing them.Vulnerabilities exist in how the BlackBerry MDS Connection Service and the BlackBerry Messaging Agent process TIFF images for rendering on the BlackBerry smartphone.Successful exploitation of any of these vulnerabilities might allow an attacker to gain access to and execute code on the BlackBerry Enterprise Server.Depending on the privileges available to the configured BlackBerry Enterprise Server service account, the attacker might also be able to extend access to other non-segmented parts of the networkA threat alarm is that hackers might succeed in penetrating any of such codes into the BES systems which though only allow remote access. This can result in information stealing and can also be used to abandon or interrupt the communications that takes place though the server.No reports of any such attacks on the users of Blackberry have yet hit the market but the threat is a strong one and demands from all BlackBerry customers to update their cell phones before they become a victim to it.Workarounds from various companies that might not be able to achieve successful updating of their BES has been published by BlackBerry itself.  Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["Adobe reader vulnerability", "Cryptography and System Security", "CrySyS", "Fireeye", "Kasparsky", "MiniDuke Malware", "security", "Technology news", "Vulnerability"], "title": "Adobe Vulnerability: Hackers Target 23 Countries via MiniDuke Malware", "body": "In a report published by Kaspersky Lab and Cryptography and System Security(CrySyS) said that hackers targeted dozens of government owned computers in Ireland, Portugal, Czech Republic and Romania by a malicious malware known as MiniDuke.Fireeye about a week back, announced a new malware threat by the name of “Adobe Reader 0-day”. Since the induction of this new malware some unusual attacks in the world of internet has been observed. In response, some of these leading security labs have found some significant aspects of this malware which include:The first and foremost is that the malware is still around the world of internet. According to the researcher, this malware was professionally and wisely planned out by the programmers. The victims were left with no clue of them being trapped the cyber criminals. They choose the PDFs the root cause for the spread of the malwares, the most interesting fact was that the PDFs contained highly matured content there was no spammy content in the PDFs to give an idea of what was going on to the victim.Once the system has been exploited by the PDF file a small downloader is secretly installed into the system. This downloader is really tiny i.e. 20 kb which is designed to exploit the unique fingerprint of the system which the downloader finds out via some mathematical calculations. The data is used for encrypting communications in the system later on. If everything goes well, the part of the operation begins. The malware opens twitter through some specified accounts which are made through Miniduke’s command and control operators. The malware here looks for tweets having tags containing malicious urls. These urls allow additional data to be transferred into the system via GIF files.After a complete analysis over the malware the researcher came to know that the malware’s system was really flexible. It doesn’t really required Twitter to work properly or even the twitter accounts, it could all be done Google search too.Meaning it can easily work over two different web places to carry out its functions.The malware becomes fully in operation when GIF iles are installed into the system, through it malware can have full control over the system and can fully destroy the victim’s system by carrying out the actions it is designed for. Such destruction is due to the connecting of the malware to two of its server in Panama and Turkey, which allows the attackers to control the system manually.Till now 59 victims has affected through this malware living in 23 different countries:Belgium, Brazil, Bulgaria, Czech Republic, Georgia, Germany, Hungary, Ireland, Israel, Japan, Latvia, Lebanon, Lithuania, Montenegro, Portugal, Romania, Russian Federation, Slovenia, Spain, Turkey, Ukraine, United Kingdom and United States.  Follow @HackRead ", "authur": "Waqas", "date": "February 28, 2013"}, {"topics": ["VLC", "VLC Media Player", "VLC Vulnerability Found"], "title": "Critical Vulnerability Found on VLC Media Player", "body": "A researcher by the name of  Debasish Mandal has found critical command executing vulnerability on the latest versions 2.0.5 and earlier on famous VLC media playing software that can be exploited by attackers to execute malicious code on computers via ASF files. The developers at VLC organization have published an advisory according to which the vulnerability is located  in media player’s component responsible for playing ASF (Advanced Streaming Format) video files. The advisory states that: When parsing a specially crafted ASF movie, a buffer overflow might occur.If successful, a malicious third party could trigger an invalid memory access, leading to a crash of VLC media player’s process. In some cases attackers might exploit this issue to execute arbitrary code within the context of the application but this information is not confirmed.Exploitation of this issue requires the user to explicitly open a specially crafted ASF movie.The user should refrain from opening files from untrusted third parties or accessing untrusted remote sites (or disable the VLC browser plugins), until the patch is applied.Alternatively, the ASF demuxer (libasf_plugin.*) can be removed manually from the VLC plugin installation directory. This will prevent ASF movie playback.This issue is addressed in VLC media player 2.0.x source code repository by replacing a macro with a static inline and improved bounds checking.This patch is included in VLC’s future 2.0.6 release.Windows and Mac OS X builds can be found on the VideoLAN nightlies website.To read complete details and advisory, visit the official website of VLC.Source and credits: VideoLan.org  Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["Android Malware", "Android Malware Found", "Google Play", "Security and Vulnerability", "SECURITY NEWS"], "title": "Android Malware on Google Play, installs Trojan on PC, uses microphone to record you", "body": "Kaspersky, one of the leading security firms around the world has found something shocking in one of the android apps, which is said to be designed to free some memory from the device. But, instead the app is sort of a malware designed to exploit any operating system attached to the device. You might be wondering how an app installed in an android device can exploit a PC. Well, it’s true and we will prove it to you in this article. But, here we would like you to tell you some of the features of this malware, for the security team such varied features hasn’t been seen by them before in any malware:* Sending SMS messages.* Enabling Wi-Fi.* Gathering information about the device.* Opening arbitrary links in a browser.* Uploading the SD card’s entire contents.* Uploading an arbitrary file (or folder) to the master’s server.* Uploading all SMS messages.* Deleting all SMS messages.* Uploading all the contacts/photos/coordinates from the device to the master.”When one installs this app which is named as “cleaner” ( a name which replicate its function), the app like a normal app’s installation installs and reboots the device for its functions to work properly. But, which rebooting it isn’t allowing the functions to work properly, it’s allowing the files installed to work properly. The files installed, which are really unknown to the user involves: autorun.inf, folder.ico and svchosts.exe. These files are basically not installed at the directory user instructed for, but, in the memory card folder of the device. So, whenever the android device is attached to a PC, the svchosts.exe automatically starts running.However, the malware for windows isn’t too devastating, but, one of the other features of this malware is somewhat fascinating or one can say an out of the box feature. This feature allows the attacker to get attached to the user’s microphone and get all the data over it. Whatever, the user says is transferred to the attacker automatically.According to the researcher, this function only on the autorun function in the system, which is nowadays is disabled in most of the newer versions of windows, so, this attack could be more fitting for the previous of the windows. Here, researchers to regularly get upgraded to on newer versions of the operating system as old version could easily be exploited by the attackers.One of the shocking facts was that this app was on Google play which is recommended by many leading websites as one of the safe sites of downloading apps. Now, experts say to only download the apps which have been downloaded in large numbers previously and are from a trusted supplier.  Follow @HackRead", "authur": "Waqas", "date": "February 4, 2013"}, {"topics": ["Facebook", "Facebook Graph Search", "Facebook Graph search hacking", "Facebook Graph search Phishing", "facebook hacking", "Facebook Phishing"], "title": "Facebook Graph Search is the best tool for phishing attacks", "body": "Facebook shocked the world by unveiling its new Graph Search. Where users are waiting to test the new search features, the hackers are anxiously waiting to test their skills to hunt some Facebook accounts.  Facebook’s Graph Search is basically a search engine which will work within the network, finding results based on posts, tags, friends, families and uncountable Facebook members. Its an undeniable fact that this new Graph search engine is a genius concept and very useful medium of search based on your friends and their interest. For example, your friends who like Miami Vice and living in Miami or your friend’s Favorite coffee shop nearby. Yet, Graph search will also act as a heaven for the attackers as Andrew Storms, director of security operations for nCircle, says: The new Facebook Graph Search is a phishers’ dream come true. It takes the micro-targeting capabilities that have been available to online advertisers for years and puts them into the hands of cyber criminals.Just like Google hacking, where the endless useful information can be found, vulnerable servers, social engineering tool, sensitive data, files containing passwords, juicy information, web server directories, hence the endless help for hackers can be found on Google. Facebook Graph Search is adding more juice to it by providing same service as Google but with more personal context.  CORE Security‘s security strategist Alex Horan explains the upcoming headache for the Facebook users: This means Facebook will want it to have as much information available as possible to respond to each query, ensuring people have a positive experience. This directly goes against the desire expressed by people to keep their information private.By using Graph search, the attacker will be able to gain more personal and up to date information on the victim by matching their current info with the one available in past. Richard Wang, manager at Sophos Labs, says that: Graph Search might be a startling eye-opener for many. This will probably lead more users to discovering that they have shared more than they expected and gives scammers the opportunity to target particular groups of people.Robert Scoble praised the privacy model behind the tool. Scoble explains: “You can only see items shared to public or shared with you specifically due to your friend arrangements.”PC World reports that That is true, and Facebook deserves credit for building in privacy controls. Unfortunately, many of the billion-ish Facebook users aren’t aware of, or don’t properly use the security and privacy controls—so everything they post on the social network will be easily discoverable by cyber criminals.Horan clarifies, “From a hacker’s perspective, the data was already there and subject to target an attack, but this new feature makes it easier for attackers to collect similar targets for a more customized attack.”“If you thought the level of spam and phishing scams on Facebook couldn’t possibly get worse, I have bad news for you. We ain’t seen nuthin’ yet,” warns Storms.Follow @HackRead ", "authur": "Waqas", "date": "January 20, 2013"}, {"topics": ["Oil Mills", "SECURITY NEWS", "Vulnerability in Oil field"], "title": "Vulnerability of Oil and Gas Infrastructure Drives Security Investments", "body": "Gas and oil markets are one of the most profitable markets in the world. The projection in future for these markets looks very bright and chances of intense competitions loom. According to the statistics, a rise of over 13 billion is predicted by the year 2021 in comparison to the year 2012.But the sector is facing serious security issues physically and online. There were a number of instances where hackers attacked online gas and oil industries. Due to this, there have been heavy investments upon the security of online systems. A security analyst on this said:“”Global oil and gas companies are investing capital in new infrastructure projects, driving the need for security solutions at these facilities,”.“With increasing awareness of threats, companies are adopting a security-risk management approach and implementing risk assessment of their facilities to ensure security Return on Investment”There have been a number of systems introduced to combat cyber attacks, the systems include access control, video surveillance and intrusion-detection. You might be wondering why there has been such a wide range of system introduced. Why not go a simplistic one? So, the answer for it is that hacking these days have become such sophisticated that hackers somehow find a way to break into the system. The security expert on this said:“The threats may vary from information theft to a terrorist attack, but the economic impact and financial damage in case of an attack will be much more significant,”“It would also depend on the motive of the attacker. For example, a cyber attack to remotely control a SCADA system can have more serious consequences than a cyber attack to steal information”But, taking into consideration the current status of cyber security it doesn’t looks easy for the oil and gas industries as there has been a lack of investment in this way, especially by the governments. The security managements haven’t been up to the mark, they have been really slow in comparison to the hacker’s moves. To, this the expert advised the oil and gas suppliers:“Suppliers of security systems should aim at designing an integrated security solution that proactively identifies, assesses and mitigates risks and threats originating from within the facility as well as from well beyond it,”“On their part, oil and gas companies and operators of critical oil and gas facilities need to do a threat and risk assessment of their facility to ensure there is no over spending or under spending on security-related matters.”", "authur": "Waqas", "date": "January 18, 2013"}, {"topics": ["US Power stations Malware", "USB Malware", "USB Virus", "Virus found"], "title": "Malware Found in Two US Power Stations Infecting the Control System", "body": "The US Department of Homeland Security’s Industrial Control Systems Cyber Emergency Response Team (ICS-CERT) has reported that two US power stations were attacked and infected by a malicious malware in the last quarter of 2012.The experts have blamed not anyone else but USB flash drives filled with viruses for infecting and compromising the industrial control systems in both cases. Yet the names of infected power plant were not mentioned in the released report.The first case came to light when an engineer realized USB flash drive that was used by him for back up control system settings had become dubious. The engineer then referred the case to the station’s IT department, which found three different malicious malwares after scanning.The second case came into notice when another USB drive was scanned, this time an outsider contractor was blamed to plugin the USB and unintentionally spreading the malware in more then 10 computers at that power station.ICS-CERT reports that with confirmation that the sophisticated malware existed on the two engineering  workstations, attention shifted quickly to the remaining eleven operator stations in the  control environment. Manual analysis using the known characteristics of the malware  revealed no signs of the malicious software on these operator stations.After the onsite visit, ICS-CERT had two primary goals for assisting the organization.Identify effective and safe cleaning procedures that could be used to remove the   remaining malicious artifacts.Identify best practices to prevent and detect future malware infections in this   organization’s control environment.ICS-CERT is educating and updating the power station operators all over the US regarding the dangerous outcome of malware and using of USB flash drives in an industrial control system environments. If you want to get in more information related to the case and a research by ICS-CERT into SCADA security, click here.Follow @HackRead ", "authur": "Waqas", "date": "January 16, 2013"}, {"topics": ["Hacking LinkedIn", "LinkedIn", "LinkedIn fake emails", "LinkedIn fake page", "Linkedin hacked", "LinkedIn Malware", "LinkedIn Phishing", "Trojan JS BlacoleRef W"], "title": "Fake LinkedIn Notifications Lead to Malware and Phishing", "body": "Once again the LinkedIn users have been under massive spam attack  in form of an official LinkedIn lookalike notification about a supposedly received message from a potential new connection.Sadly for the users, it is not a real LinkedIn link- It is a fake link that redirected users to a different compromised site and asks for their personal details or welcome them with several malicious malware hosted on US, UK, Russian or Italian servers;  that steals information and hijacks users’ address book to spam their contacts.Bitdefender reports that the company detected one site which was hosting  Trojan JS BlacoleRef W, difficult to detect and deadly for the internet users. It takes control over the user’s computer when clicked, steals credit card details and other personal/sensitive information.“Malware writers are again taking advantage of LinkedIn’s popularity and users’ social media engagement after the holidays. With many people back to work and eager to strengthen their professional connections, the malicious campaign comes in really handy for the attackers,” Bitdefender concludes. This is not the first time when LinkedIn has been misused to hack users; In June 2012 similar Trojon took over several user accounts, which was an embarrassing situation for the company.Follow @HackRead ", "authur": "Waqas", "date": "January 12, 2013"}, {"topics": ["Cisco phones hacked", "Cisco products", "Cisco VoIP Vulnerability", "Hacked VoIP calls", "hacked VoIP Phones", "Voice call hacking"], "title": "Cisco Phones Hacked: Remotely listen in via hacked VoIP Phones", "body": "Can you imagine your voice being heard from miles away, even you are talking with someone verbally and that is too your phone on flight mode? Well, you would be shocked that it could be done with quite ease, especially, if you are having a Cisco phone nearby. Cisco phone was recently hacked and while hacking the phone hackers gave a clear idea of how Cisco phones with ease could be controlled remotely for miles away, in the demo they described how the microphone of the phone could be opened remotely and if the phone has a webcam what can be done with it.A Colombian University professor told how this hack could be made beneficial in these words:“Any government that would like to peer into the private lives of citizens could use this. This is a great opportunity to create a low-cost surveillance system that is already deployed. It’s a monitoring infrastructure that’s free, when you turn these into listening posts.”But, at the same time he also demonstrated how this phone could serve as a medium of hacking not only for the other phones but for the nearby computers and devices too. He said a hacked Cisco phone can lead to the hacking of all the phones on the network and also other devices too. He explained how in actual term all this works like in these words:“We could turn a phone into a walkie-talkie that was always on by rewriting its software with 900 bytes of code. Within 10 minutes, it could then go on to compromise every other phone on its network so that you could hear everything,”Though, Cisco had launched a patch remove affects of this hack and not allow eavesdropping to take place. But, the Colombian university professor said:“We don’t know of any solution to solve the systemic problem with Cisco’s IP Phone firmware except for the Symbiotic technology or rewriting the firmware.”But, Cisco officials said:“A-Team is working on mitigation and a permanent patch. The company plans to issue a security advisory and a detailed mitigation document later this week.”Those you who want to know how this hacking is carried out can see the Colombian University researcher’s PDF on this particular hack. In this PDF presentation, they have showed a device in the above picture known as “thingp3wn3r” is connected to a serial port and install a malware into it. They also showed this particular hack worked so do have a look at the presentation.  Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["Abysssec hacking", "Shahin Remezany", "XSS Venerability on Yahoo", "Yahoo DOM-based Vulnerability", "Yahoo email hacked", "Yahoo email hacking", "Yahoo Vulnerability"], "title": "Yahoo DOM-based Vulnerability is still active, See how Yahoo users can get hacked [Video Included]", "body": "In an report published by TNW, it has been revealed that despite of several claims by Yahoo Inc, the DOM-based XSS Vulnerability that resulted in compromising many of yahoo accounts is still active, putting millions of Yahoo users in danger.Earlier the experts find a vulnerability that resulted in emails account being hacked after clicking a malicious link sent to their inbox. Yesterday, the information security training and penetration testing firm Offensive Security said that while scanning they discovered that DOM-based vulnerability is still present and every Yahoo mail user is in danger and on the edge of loosing their accounts if they click the malicious link. Two days ago, a hacker  Shahin Ramezany (aka Abysssec) posted a video on YouTube showing how to hack Yahoo accounts by a using DOM-based XSS vulnerability. The information security training and penetration testing firm then contacted Abysssec and discussed the claim by Yahoo that vulnerability has been fixed but Abysssec told the firm that vulnerability can still work with a simple modification. With little modification to the original proof of concept code written by Abysssec, it is still possible to exploit the original Yahoo vulnerability, allowing an attacker to completely take over a victim’s account. The victim has to be lured to click a link which contains malicious XSS code for the attack to succeed. This can demonstrated by the video we have created just this morning (10:23 AM EST, Jan 8th, 2013) after Shahin kindly shared proof of concept code with us.Here is the video tutorial posted by Abysssec earlier: The new video by Abyssec with modification is available on here on Offensive Security blog.Yesterday, Yahoo! Inc released a statement according to which:At Yahoo! we take security very seriously and invest heavily in measures to protect our users and their data. We were recently informed of an online video that demonstrated a vulnerability. We confirm that the vulnerability has been fixed. In addition, we are investigating recent reports of increased abusive traffic and will work diligently to fix any vulnerabilities that are found. Concerned users are encouraged to change their passwords to a safe password that combines letters, numbers, and symbols.We at Hack Read, urge the Yahoo mail users NOT to click any link sent to your inbox by anyone known or unknown to you until the vulnerability is completely fixed.  Follow @HackRead ", "authur": "Waqas", "date": "January 9, 2013"}, {"topics": ["hacking news", "Yahoo emails hacked", "yahoo emails hacked list", "yahoo hacked", "Yahoo XSS Vulnerability"], "title": "Yahoo Mail Got Hacked via XSS Vulnerability", "body": "Yahoo users 2 nights’ back were hacked by probably the same spammy links route. A number of Yahoo users complained about their accounts being hacked and wrong messages were forwarded. After an investigation, Yahoo officials confirmed that the hacking took place through a spammy link which was mailed by the account holder’s friends who were already affected through this hack.Shahin Ramezany, a hacker then announced how the hacking took place, in a youtube video he demonstrated this type of hacking can take place in minutes. He also showed a loop hole in the Yahoo mail system through which all this happened i.e. The XSS vulnerability. About 400 million users were on risk due to this particular hack. The hacker promised Yahoo to help them out in getting off this particular loop hole.The situation created by the hacks could be demonstrated by this tweet from an actress:Friends and colleagues, don’t click the link that was sent to you from my Yahoo email account, I was hacked :/ Apologies!Tweet by Christina Vee.Many tweets like the above one were there on twitter two nights back if you search Yahoo Hacked on twitter. All were reportedly hacked through some spammy mail; the spammy mail consisted of malicious malware which opened the gate for hacking. Although, this was not the first time Yahoo’s system was breached in July 2012 also Yahoo’s system was hacked by D33d company. But that was not due to a security loop hole, it was a file that was swiped from the Yahoo’s server caused the hack.But, keeping online messaging and other accounts secure is really difficult especially with the number of hacking taking place these days. So, we advise you to keep different passwords from each individual account you make online and also keep a strong password that you can save in your system too if you can’t remember it. Finally, for all those people whose accounts were hacked much change their passwords as soon as possible to secure their account from the hackers.  Follow @HackRead ", "authur": "Waqas", "date": "January 8, 2013"}, {"topics": ["Code Execution", "Command Execution vulnerability", "EHC", "Ethical hacker", "Information security researcher", "Pakistani hacker", "Palpal site hack", "Paypal vulnerability", "Rafay Baloch", "XSS vulnerability"], "title": "PayPal Awards USD 10,000 to Pakistani Hacker for Reporting Vulnerability", "body": "An ethical hacker, security researcher and a writer Rafay Baloch was paid total USD 10,000 for reporting a Code Execution / Command Execution vulnerability on the sub-domain of Paypal.Paypal had started a *Bug Bounty program* for security experts around the world to report any bug or vulnerability if found on their server.The hacker writes on his official blog that while testing Paypal’s server, he found a critical command execution vulnerability allowing hackers to execute any command on the server.Rafay was initially paid USD 600 for reporting XSS Vulnerability on the main site of Paypal, later after reporting several other bugs, the company paid more USD 6000 for his expert services which obviously saved Paypal from a disaster and embarrassment.Here is a screenshot of an email conversation between Rafay and a Paypal representative about money reward.He claims that at the moment more then 20 of his reported vulnerabilities are still being validated by Paypal and it will not be a proper time to disclose the types of vulnerabilities.However, money is not the only thing awarded to Rafay, Paypal has also offered him a job as a Senior Pentester A.K.A SecurityNinja in their HQ at San Jose, USA.Here is another screenshot of an email conversation between Rafay and a Paypal representative Colley Grace regarding job officer at PayPal.  Speaking with HackRead, Rafay said that:He feels great and proud to serve his nation by providing the cyber world a secure future. If you would like to contact Rafay Baloch, he is available on Twitter and of course you can send him an email on his blog.Click here to follow Rafay on Twitter.Follow @HackRead ", "authur": "Waqas", "date": "December 25, 2012"}, {"topics": ["Database Security", "Databases", "Vulnerability News", "Vulnerable to hackers", "Website security"], "title": "88 Percent of the Total Databases Found Vulnerable to hackers [Survey]", "body": "We already on HackRead provided you all the details regarding new ways of hacking and now it’s been proved by a survey that the new ways of hacking are really harmful for databases in particular. But, before going into the depth of the survey let’s go into it’s background first:We told you before also that hacking is not now a name of entering a site with with it’s script or send some virus into it, these are all traditional methods of hacking and dangerous for hackers too as they allow the victims to have a proof against the hackers. Hackers now look into the system and find vulnerabilities in it and attack that part this leads to full system being hacked without any serious kind of proofs regarding the verdict. So, in order to have a know-how of what the firms are doing to stop these kind of security attacks a security firm launched a survey one question: what do you do in order to save your system from SQL injection attack ?The survey’s result were horrifying:About one-fifth of the sites were open for the attacks by the cyber crimes. Furthermore, no firm has idea of hacker’s new form of hacking into the systems i.e. the vulnerabilities. This stat is more than harmful for the online databases in the future years as cyber crime is getting really sophisticated. By seeing this sort of statistics we can only say that in future we can see a number of databases being hacked on daily basis. How threatening this stat is could be recognize the comments of the survey carrying out firm, Green SQL’s:The survey reveals that almost all companies are still vulnerable to internal and external threats. Simply improving code practices is not enough to protect databases from internal threats,” said Amir Sadeh, CEO, GreenSQL. “The vast majority risks damage to corporate reputations, fines, law suits, and loss of customers’ confidence and business by deploying no database protection whatsoever. This is tantamount to a corporate death wish.At the moment there are at least 70 attacks are laid over the system per hour by the cyber criminals. By this one can recognize how swiftly cyber criminal are working over the online databases. So, databases owners now need to be more then alert from the cyber criminals moves and need to hire specialist security firms as soon as possible to avoid any significant data being lost from the systems. One of the security teams we told you before in one of the articles could be contacted which has a know-how of modern ways of hacking.Follow @HackRead", "authur": "Waqas", "date": ""}, {"topics": ["Egyptian hacker", "SQL", "Virus_Hima", "XSS", "Yahoo Exploit 2012", "yahoo hacked", "Yahoo Vulnerability"], "title": "Egyptian Hacker finds Sql & XSS Vulnerability in Yahoo", "body": "An Egyptian hacker Virus_Hima has said to found vulnerabilities in the official website of Yahoo. This is probably the second time in 2 months, when the hacker has found vulnerability in one of the major technology websites. While telling about the vulnerabilities he said that he got a complete hold of the backup of several yahoo domains.Among other vulnerabilities he told there is a  cross-site scripting vulnerability and SQL  injection vulnerability in the site, according to his post on Pastebin.  But he denied to expose the data he hold off from the yahoo’s site and said that his vendors adobe, yahoo and others have respect for him so won’t be carrying this particular act. The hacker also denied to be or to have any connection with the personal selling a cross-site scripting vulnerability on a hacker forum for US$700 last week. The hacker previously entered into the system of adobe and got hold off a large amount of data. This resulted in adobe closing one of it’s forums i.e. Connectusers.com. But adobe’s officials soon contacted the hacker for resolving the matter, when he released a bundle of 200 emails which belonged to adobe, and U.S. Government agencies. The data contained encrypted passwords, email addresses, address and other details.  The hacker also provided a tip to the site owners to be proactive rather then being procreative, he added that he will not leak the data any soon and work according to the situation. He also claimed to find 0day vulnerabilities on Adobe/Microsoft/Yahoo/Google/Apple/Facebook and many more, yet he will not misuse the situation and will keep on reporting the issue to its respective vendors. However, there has been no statement from Yahoo Inc about the latest vulnerability claim. Follow @HackRead", "authur": "Waqas", "date": "December 17, 2012"}, {"topics": ["Cyber Criminals", "hackers", "Malware", "Nokia", "Samsung", "Smartphones", "virus", "Vulnerability"], "title": "7 Million Smartphone Users Vulnerable to Hackers", "body": "As we previously pointed out on HackRead that smartphones are probably the biggest form of hacking for the cyber hackers this year, another news from Malaysia have arose regarding the hacking scenarios through smartphone. The Malaysian cyber crime has reported that people nationwide has faced huge losses of money this year from the hands of cyber hackers. There has been hacks through SMS, apps and other vulnerabilities of the smartphones. Through SMS, hackers send some sort of Trojan in the mobile and people due to lack of knowledge get trap into it. Datuk Syed Ismail Syed Azizan the director of cyber hacking department describes this form of hacking in these words:“Their modus operandi is to send short messaging service (SMS) known as Trojan to consumers who unknowingly will be charged when replying to the SMS.“Consumers only realize this after receiving high phone bills although they did not use the service”Apps having malware were also a form of destruction in Malaysia. The hackers uploaded such type of apps that brought malware into their devices and thus resulting in consumers bearing the cost of downloading the app. This apps were uploaded outside the trusted app store Apple and Google. So, the director of the Malaysian cyber hacking department recommended to download only from these store.The Malaysian cyber statistics department showed a shocking figure of RM 21.8 Million losses during the year via smartphones. Out of which Online purchases were via phones recorded the highest losses of about RM14.5 million (1,298 cases), SMS or phone call losses marked RM3.4 million (412 cases), simple hacking caused RM3.3 million losses (24 cases) and internet banking and phone banking recorded RM590,000 losses (74 cases). Furthermore, there were 25 abusing through mobile phone cases were recorded.The customers registered a number of complains regarding unrecognized charges for their mobile phone usage. About 7.7 million smartphones were having the same complains this year. The director described this in these words:“In this regard, they can also channel their complaints to MCMC which can compound telcos for making unreasonable charges. This way, we can detect fraud by cyber criminals.”But the director also said the Malaysian cyber crime department is working on a system to protect smartphones and cell phones from being hacked. He said:In line with the development of cyber crime, improvement in terms of equipment and special technologies such as hardware and software that must always be updated to ensure effectiveness,”Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["Carlos Reventlov", "hack", "Hacking expertise", "Instagram", "iOS 6", "iPad", "iPhone", "iPod Touch hacks"], "title": "iPhone Instagram users are vulnerable to hackers [Expert Report]", "body": "An internet security expert, who goes by the name of Carlos Reventlov has found a vulnerability on Instagram app for iPhone and iPod touch. The vulnerability allows hackers to illegally access the user account and make changes against its will, for example: changing and deleting of uploaded pictures.The vulnerability was found on 11th November 2012 and Instagram authorities were informed but yet haven’t been fixed.The Instagram app communicates with the Instagram API via HTTP and HTTPs connections.During a test on two separate iPhone 4 units, both running iOS 6, Reventlov discovered that, login into Instagram profile, editing and uploading an image are done through secure channel, while, few other permissions are sent through plain HTTP without any security interruption, such permissions can be highly dangerous for the user and can allow hacker connected to the same LAN of the victim’s iPhone, to get in the user profile.He added that:“I’ve found that many iPhone apps are vulnerable to such things but not too many are high-profile apps like Instagram,” Reventlov added. He says that the fix for Instagram is rather easy. For API calls that utilize sensitive information, simply use HTTPS, or Hypertext Transfer Protocol Secure.Proof of concept is available on Reventlov’s blog. [via Computerworld] Follow @HackRead ", "authur": "Waqas", "date": "December 3, 2012"}, {"topics": ["Christy Philip Mathew", "Google Translator", "hacking 2012", "Phishing links", "XSS vulnerability"], "title": "XSS Vulnerability Found in Google Translator", "body": "An IT security expert from India who goes by the name of Christy Philip Mathew has found a critical XSS vulnerability in sub-domain of Google translator [www.translate.google.co.in].The expert reported that this vulnerability can an be later exploited by the hackers to attack the users via session Hijacking, phishing attacks or if exploited to git, it can also infect the users with dangerous spywares, adwares and malware by uploading a simple scripted TXT file on the Internet.The vulnerable link is mentioned below:XSS URL: http://translate.google.co.in/translate?hl=en&sl=sq&tl=en&u=http%3A%2F%2Fdemo.offcon.org%2Ftest.htmlThe script will be uploaded in a txt file and can be executed while the user clicks translation tab on the website.Follow @HackRead ", "authur": "Waqas", "date": ""}, {"topics": ["backdoor", "Forex Trading website", "hackers", "Malware", "virus"], "title": "Malicious Java applet found in FOREX Trading website", "body": "Some unknown hackers have installed a malicious Java applet on an international Forex Trading website, the program is designed to install malware on the visitor’s systems.The program was detected by an internet security company WebSence, which claims that the website [tradingforex.com] contained malware till Friday morning and now has been removed.An applet is a small Internet-based program written in Java, a programming language for the Web, which can be downloaded by any computer. The applet is also able to run in HTML. The applet is usually embedded in an HTML page on a Web site and can be executed from within a browser.The backdoor installed on the site was written in Visual Basic.Net and requires the Microsoft’s .NET framework to be successfully installed and running on a victim’s computer. Meanwhile the spokesman from Websense stated that: We can only speculate why. One of the likely reasons is that the ‘Blackhole exploit kit’ costs money either to rent or to buy,” . On the other hand, the attack vector that was used on that website can be created with tools that are available for free.“It’s important to note that there was no exploit involved in this attack but rather a social engineering trick that requires the victim’s involvement – if successful it will allow a backdoor Trojan to run on the victim’s machine.Now a days, hackers have been installing viruses on different websites in order to gain access of visitor’s computers. The tools for this purpose are easily available on under ground hacking forums, for example the famous Blackhole Exploit kit. [Via: TheRegister]Follow @HackRead ", "authur": "Waqas", "date": "November 30, 2012"}, {"topics": ["#Anonymous Hacker", "0day Vulnerabilities", "Israeli credit cards details", "ReVuln", "SCADA Systems"], "title": "ReVuln Found 0day Vulnerabilities for SCADA Systems", "body": "In a video presentation, the vulnerability experts known as ReVuln have revealed a 0day vulnerability for industrial SCADA Schneider Electric, General Electric, Siemens and Rockwell Automation. Yet the exact vulnerable products were not discussed in the presentation.According to ReVuln, the vulnerabilities are of high risk which allows uploading shells remotely, executing the code and session hijacking on the PCs that are responsible for running servers of SCADA installations. If ReVuln is correct in their claims then there are solid chances of taking over the SCADA servers as they are available on the internet due to their settings. The claims are yet not supported by any independent security expert.An inside view by any independent security expert over the vulnerabilities will play an important role in backing up or denying the claims made by ReVuln as in past it had published the vulnerabilities when they were reveled by some other source or after being fixed.SCADA systems are usually in news for their insecure servers and for the attacks carried out on them by the hackers. In past SCADA systems for Israel were hacked by Anonymous hackers and 7000 credit card details were leaked online.", "authur": "Waqas", "date": "November 23, 2012"}, {"topics": ["2011", "Anonymous hackers", "LULZSEC", "Sabu", "Verizon Yearly Study 2011"], "title": "Verizon Yearly Study: 2011 was The year of Anonymous", "body": "So far 2012 is a tough year for Anonymous with its leader ”Sabu” betrayed them as a government agent and their top most skillful members arrested.  But analyzing Anonymous hacks in last year, it shows that 2011 the year of Anonymous.Verizon, the well known cooperative giant has released a case study of  series of data gathered  from several government and law enforment agencies, such as Irish Reporting & Information security service, Australian Federal Police, United States Secret Service (USSS). Report revels that  174 million confidential records were breached in 2011 mostly by Anonymous.A 2.3 Mb PDF study file by Verizon can also be accessed an download from Google Docs.   ", "authur": "Waqas", "date": "March 24, 2012"}, {"topics": ["Chinese hackers", "Cyber Crime", "facebook fake profiles", "hacker news", "NATO Spy", "NEWS", "SECURITY NEWS"], "title": "Chinese intelligence was spying on NATO via facebook", "body": "Facebook is proving to be a goldmine for intelligence agencies — and not just ones that Zuckerberg is openly collaborating with. Just recently, a fake profile was created by Chinese hackers (or, more likely, intelligence agents) claiming to be that of US Navy Admiral James Stavridis, NATOs Supreme Allied Commander.They were able to trick numerous government workers, military offiders, and British Defense Ministry officials into becoming Facebook friends with the fake Stavridis. This allowed the hackers/agents to learn a great deal of personal information about Stavridis’s co-workers, including much about their loved ones that could conceivably lead to threats or blackmail-like pressure in a crisis.Supreme Headquarters Allied Powers Europe (SHAPE) officials confirmed their commander had been targeted. “This type of compromising attempts are called ‘Social Engineering’ and has nothing to do with ‘hacking’ or ‘espionage.Facebook says its very difficult to prevent such fake accounts from being created or even detected, although it shuts them down when they are discovered. The company admits that some 42 to 51 million Facebook accounts are fake, out of 483 million daily users. Its very unlikely that intelligence agency hijinx on facebook are going to stop anytime soon.“There have been several fake supreme allied commander pages,” a NATO spokesperson said in a statement. ", "authur": "Waqas", "date": "March 13, 2012"}, {"topics": ["cyber attacks", "cyber crimes", "DDOS attacks", "Vulnerable American servers"], "title": "America’s infrastructure still exposed to cyber attacks despite recent threats", "body": "A common man when thinks about cyber terrorism or cyber crime, they think it may be just an illegal activity over some credit cards or online bank accounts, DDOS attacks, hacked social networking website profiles etc but what they do not think is the water running down from the tap, lights inside their home and the gas heaters can be stopped and this can be done through “cyber crime”.The result of attacks on the basic necessities of life could be far be more important than those cyber frauds what people think about these crimes.The America’s Homeland Security Department in 2010 responded to nearly 116 requests (only) made for help by the cyber experts of its CSS program (Control System Security Program).By September 2011, this number raised to 342. All of these attacks were not home originated. On 8th November, an IP address from Russia attacked Illinois based water utility supply company and succeeded in controlling the supervisory control and data acquisition which resulted in the burning of related water pump. These types of attacks are not new and many people deeply related to the world of internet know such attacks made in the past. Like, back in 2007, a group of hackers attacked a diesel generator and managed to make it self-destruct.Currently, the companies which are in the prospect of these attacks can only avert 67 to 76% of such attacks. They can raise this percentage to 100% or even more than that but the only thing which pulls them back from doing this is “Money”. In other words, the relation between cyber security and money is directly proportional.At the present, companies are spending $5.5 billion for maintaining cyber security and to reach up to 100% they need to send more than $50 billion. They say, “The customers will not grant this increase”.In the midst of these true National threat created by cyber security, some people would expect the government to get involved and play its role of passing some bills for this very important improvement. Whereas, some would suppose that thisis a private sector issue and the government should not intercede.Although funny but this is said by some people that probably the World War 3 will be fought over the internet like Mr. Glen Derene in an article in October 2009 said “The next world war may not start with a bang, but a blackout”.", "authur": "Waqas", "date": "March 7, 2012"}, {"topics": ["featured"], "title": "Another Burn The Quran website taken down by ZHC(ZCompany Hacking Crew)", "body": "ZCompany Hacking Crew which previously DDOS’ed http://burn-the-koran.com/ and is still down , now struck another site  which is also said to be abusing all sorts of religion including Islam and the Muslim Holy Book Quran . According to what we observed that site was ddos’ed successfully by ZHC and it was showing Service Unavailable or not opening.  ZHC these days is on high fuel and has successfully struck these two sites.Here are some screen shots: ", "authur": "Waqas", "date": "February 29, 2012"}, {"topics": ["featured", "hacking news", "Hacktivist", "Z company hacking crew"], "title": "Burn-The-Koran.com taken down by ZHC(ZCompany Hacking Crew)", "body": "Reports coming from various groups on Facebook that the site  has been DDOS’ED by ZCompany Hacking Crew, the reason behind this is said to be , the site targeted the Holy Book Qur’an and various people are abusing Qur’an on this site, this site is supposed to say that for each click on the site they download a copy of Qur’an from various sources and when someone clicks “Burn” they delete that file permanently to show that Islam is being washed away from the surface of the Earth , we went to see the site and the results are as follows as we are reporting this to you the site still showed 403- forbidden or didn’t open.Stay with HackRead for more updates", "authur": "Waqas", "date": "February 27, 2012"}, {"topics": ["DDOS attacks on russia", "featured", "Russian election", "Russian webcams hacked", "webcam monitoring"], "title": "Russian election webcams attacked by DDoS attacks", "body": "Hackers have attacked a large network of  web cameras which were installed for monitoring voting in the country’s forthcoming presidential elections. These web cameras were installed by Russian Prime Minister Vladimir Putin to publicly monitor the votings.According to Deputy Communications Minister Ilya Massukh “We are launching this site ahead of time in order to understand the nature of the threats. Total 54,000 cameras were installed by Russian telecom company Rostelecom along with 182,000 networks planned to monitor voting at approximately 91,000 polling stations across Russia. There was no government statement on the effectiveness of these DDoS attacks, how much cams were effected by this attack or is there any chance of disruption during the election.Russian government has been under hacking attacks in past but this is the first time when web cameras were attacked by hackers to effect voting monitoring plan.", "authur": "Waqas", "date": "February 25, 2012"}, {"topics": [], "title": "Bangladesh Hackers Take Down India’s Zee TV Channel Site", "body": "Bangladesh Hackers Have taken down “Zee TV”, using denial of service method, Zee TV is one of India’s biggest TV Channels, This marks one of many ddos attacks of Indian sites, that have been taken down of the past few days by the bangladesh hackers.   In a official Facebook Post they say invite user from around to the world to attack it with a ddos tool(hackread does not promote the use of denial of service), the official post is below::  ” Target :http://www.zeetv.com/ :: First Download This Tool :: . com/download.php?famiivi799a9459 :: Open The App, URL=http://www.zeetv.com/  ”   Official Facebook Page:: https://www.facebook.com/pages/Bangladesh-Black-HAT-Hackers/223971171015070", "authur": "Waqas", "date": "February 16, 2012"}, {"topics": ["Samsung Galaxy phone", "Samsung Galaxy price", "Samsung Galaxy review", "Samsung Galaxy Tab 2 7.0", "Samsung Galaxy Tab price", "Samsung tablets"], "title": "Samsung Galaxy Tab 2 7.0", "body": "Another astonishing production by Samsung is Samsung Galaxy Tab 2 7.0. It has been named so because another Samsung Galaxy Tab 7.0 was previously released in October last year. Similar to the last year’s Galaxy Tab this creation of Samsung also supports GSM, SMS and MMS.The networks supported by the all new Samsung Galaxy Tab 2 7.0 are 2G (GSM 850/900/1800/1900) and 3G (HSDPA 900/1900/2100). It has been recently announced and is expected to be released in March 2012. It weighs about 344 grams and is 193.7 x 122.4 x 10.6 mm in dimension.Just like the older Tab, Samsung Galaxy Tab 2 7.0 has a PLS LCD with capacitive touch-screen having 16M colors. Size of the LCD is about 7 inches and has 600 x 1024 pixels or 170 pixels per inch pixel density. It also has Touch-Wiz UX UI (User Experience) (User Interface) multi-touch.It has vibration, MP3 and WAV ring tones alert type with a stereo loudspeaker and a standard audio jack of 3.5mm. The primary camera of this Galaxy Tab 2 7.0 is 3.15 MP, 2048 x 1536 pixels with Geo-tagging and smile/face detection features. The secondary camera of the previous Galaxy tab (Samsung P6200 Galaxy Tab 7.0) was much better than this Galaxy Tab 2 7.0 as the latter one had a 2MP secondary camera where as the former has a VGA camera. Samsung 7.0 Galaxy 2 also supports video recording with the rate of 1080 pixels @ 30 frames per second. The internal memory of the all new Samsung Galaxy Tab 2 7.0 will be 8/16/32 GB with 1 GB RAM and will support 64 GB micro SD memory cards. Again the “must be included feature” GPRS is there along with EDGE technology. It also has 802.11 a/b/g/n Wi-Fi with DLNA technology, Dual-band Direct Wi-Fi Hotspot. Bluetooth version in this Tab is 3.0 with A2DP, HS and has a micro USB version 2.0.The significant features of Samsung Galaxy Tab 2 7.0 are its Operating System which is Android 4.0 (Ice-creamSandwich) and a dual core 1 GHz processor.Sensors of this Tab are accelerometer, proximity, compass and gyro. It also has threaded view SMS, Push Email, MMS, Email, RSS and IM. It has an HTML browser with Adobe Flash. It also JAVA MIDP emulator and GLONASS GPS with A-GPS support. Some of its general features are Social Networking Service integration, image and video editor, organizer, Youtube, Google Talk, Google Search, Gmail, Picasa Integration and Google Maps, Predictive text input, Voice memo, Quick Office HD viewer and editor. MP3, MP4, DivX, WAV, eAAC, WMV, WMA, H 2.63-2.64 Flac, AC-3 and Xvid media player.The all new Samsung Galaxy Tab 2 7.0 will be available in two colors, Black and White. The stand-by time of the Tab is up to 1000 hours in both 2G and 3G networks and has a talk time of 20 hours and has a standard Li-ion battery of 4000 mAh. Many eyes are on to the release of this beautiful Tablet.  ", "authur": "Waqas", "date": "February 15, 2012"}, {"topics": ["Ammar Jaffri", "FIA", "Hacking attack", "how to secure from hacking", "International Cyber Drill", "National University of Sciences & Technology", "NUST", "Pakistan", "Pakistan Information Security Association"], "title": "Pakistan Wins International Cyber Drill", "body": "Pakistan has marked victory in International Cyber Drill Competition, the competition was based on tricks and techniques regarding ” Cyber Security and how to secure systems from hackers and hack attacks”.  Pakistan took part in the drill for the first time and beaten experts from 28 other countries.Ammar Jaffri, President at Pakistan Information Security Association ” Pakistan took part in this cyber drill for the first time and won” President at Pakistan Information Security Association was founded in 2005 to educate people on immediate response on hacking attacks. Four members from  Pakistan Information Security Association and four students from National University of Sciences & Technology (NUST) took part in the drill and successfully blocked hacking attacks from different hackers. ", "authur": "Waqas", "date": "February 15, 2012"}, {"topics": ["OpenSecrets.org", "venerability", "XSS vulnerability", "Z company hacking crew", "zhc"], "title": "XSS Vulnerability Found On OpenSecrets.org By Zhc Point", "body": "A XSS Vulnerability was found on the site called OpenSecrets.org, this site is ranked 3,674 in the US by alexa, This site is a“Center for Responsive Politics, a non-partisan, non-profit U.S. research group which tracks money in politics and its effect on elections and public policy. Aimed at creating a more educated voter, an involved citizenry, and a more responsive government.”Articles, Facts, Data And Info are frequently featured on Fox News, on NPR News, In The New York Times Magazine, in/on Associated Press, on MSNBC, in The Wall Street Journal, on CBS and many other main stream news agencies… It should be noted that he states, there are other Non-persistent And persistent xss vulnerability’s around OpenSecrets.org, but he has will only release those vulnerability’s if he doesn’t get contacted back from their webmaster or owner… Vulnerably Link:: ZcompanyHackingCrews Offical Facebook Group:: https://www.facebook.com//groups/zhcnews/ZcompanyHackingCrews Official Facebook Page:: https://www.facebook.com/pages/ZCompany-Hacking-Crew/260426207359798", "authur": "Waqas", "date": "February 10, 2012"}, {"topics": ["Android Security Software", "anti theft alarm", "anti virus protection", "antivirus for android", "antivirus free", "avast", "AVG Antivirus", "AVG Antivirus download app", "bitdefender", "block calls", "block numbers", "block sms and calls", "block sms messages", "block text messages", "call blocker", "eset", "find phone", "free security apps", "how to find lost smartphone", "Kaspersky", "lookout", "lookout mobile security", "Lookout Mobile Security Free app", "Lookout Mobile Security free download", "Lost Android", "malware protection", "mcafee", "netqin", "NetQin Anti-virus app", "NetQin Anti-virus free download", "NetQin's Anti-lost app", "Norton Mobile Security Beta free app", "Norton Mobile Security Beta free download", "phone finder. Competing apps include: avg", "phone locate", "phone locator", "phone lock", "privacy guard", "remote lock", "security alarm", "security lock", "trend micro", "Virus in Android", "webroot", "wireless security"], "title": "Protect Your Android Phone From Virus With Security Apps NOW", "body": "Android has finally joined the list of those phones which really and urgently needs an antivirus in order to save itself  from Trojans, virus, spyware and other types of dangerous worms, considering the fact that Android phones carry very sensitive data.  Recently on Russian Network, an SMS Trojan Horse was found in an Android phone  posing as a media player begin to effect Android phones at a large scale. Once the victim installed the malicious app, it starts sending text messages without the user’s  knowledge to premium rate mobile (gold) numbers, leaving the user with a huge phone bill.Don’t worry, Android has a huge stock of security apps  for itself, some provide hundred percent security while others are satisfactory.Below is the list of security software and apps, We at HackRead advice you to download and install on your android before you become a victim.Norton Mobile Security Beta [Absolutely Free to use]As we know most of the smartphone’s have very sensitive data, it can be personal emails, personal logins and passwords, family pictures, personal contacts, credit card number, hence any type of personal data. You may think in case if your phone is lost or stolen, the data inside will remain safe and secure. While the researchers have analyzed that such password can be easily cracked.Norton Mobile Security Beta does not only protect your phone against loss but also against theft and every type of virus, spyware, warm and malware. Save your personal data with the help of Norton Mobile Security Beta.By using Norton Mobile Security Beta you can also lock your sim card, in case the phone is stolen; thief can not swap the sim card it to another phone. Now the jackpot for using Norton Mobile Security Beta is that it allows the user to block their text messages and calls. So my guess is that Norton Mobile Security Beta is super for those who want to keep their phone protected from unusual circumstances.Kaspersky Mobile Security Lite [Absolutely Free to use]Kaspersky Mobile Security is also free  for your smartphone, it doesn’t  only scans the virus but also keeps the user’s emails, bank information, contacts and documents safe from going into criminal hands as The Kaspersky lab had earlier released a free to use security app for smartphones. The best thing about using Kaspersky is that it can remotely delete all private data from the device in case if the device is lost or stolen.Lookout Mobile Security [Available in Free and Premium version]Lookout is also very effective security solution for Android phones it is available in two versions. Free version allows you to scan virus, spyware, malware, and worms, allows you to restore your data online and backup your data, and in case of you have lost your phone or someone stolen it , you can also use Lookout’s GPS service to track your phone and get it back. There have been plenty proven cases when Lookout was mentioned in the news in which users got their phone back by using Lookout’s GPS.Premium version can be used by upgrading the free version for $3 per month or by paying $30 per year. It will allow you extra and maximum protection by providing tips and tricks regarding the security of your smartphone.NetQin Anti-virus  [Absolutely Free to use]Like Lookout, NetQin’s also helps you in tracking down your stolen phone. NetQin has an amazing NetQin’s Anti-lost feature that allows the user to find their cell phone if it is stolen. You can also lock the phone to avoid any kind of”misuse”. If you are like me who keep on losing his phone and can’t buy a new one then NetQin’s is the one you should use and get your phone back.AVG Antivirus [Absolutely Free to use]AVG is one of the best computer security software on the market if a virus is the only thing that you are worried  and everything else doesn’t matter, then AVG is the best option for you. It doesn’t only scans your phone but also scan the installed applications for virus and trojans. It also provides you backup and restoration option. If you receive a text message with a suspicious link, just scan it with the AVG. It will remove text without harming your files.These applications will help you in securing your Smartphone’s from thieves and from losing them, but the best thing while using your phone is to keep your eyes open and be careful with the people around you, rather try not to use them outside. While at home, keep them with you and don’t leave them for anyone to use it.Happy Androiding !!", "authur": "Waqas", "date": "January 12, 2012"}, {"topics": ["Anti hacking", "antivirus", "backdoor", "Control Panel", "cookie stealing script", "file sharing mode", "firewall", "Guest account", "how to save pc", "NT", "password protection", "registry", "trojon", "User account", "virus", "vista", "WINDOW 7", "Windows 2000"], "title": "How to Secure Yourself from Hackers", "body": "Getting hacked is one of the phases of internet life that has affected millions of people around the globe.Even if you have the world’s best antivirus, spyware or firewall installed in your system, it still does not provide 100% security. You can add more to make your cyber life secure. Below are some details, methods and tips to make your system safer from stealer and hackers.Imp: Some of the security tips include editing and changing of the Registry, so I will advise you to create a Restore Point and/or a backup for your registry.Always Install Windows In a different directoryWindows usually, automatically installs itself in Local Disk (C:), the WINDOWS directory. Windows 2000, NT, VISTA, and WINDOW7, Will provide an option for WINNT. That is when many of rough Exe files and virus are allowed to install automatically during windows installation. To get rid of these rough program, you have to install your window in any other drive then Local Disk (C:) – It is totally up to you whatever you name the directly during installation.        Disable OS/2 Subsystem and POSIXWindows vista, windows 7 and XP come with (little) documented subsystems which allow its compatibility with OS/2 systems and UNIX. These systems are enabled default or automatically but are rarely used by the user, or most of the user does not have any idea about these programs. Hence, if disabled, it will surely save your system from hackers.       Do not leave your default passwords blankDuring installation, Windows XP, 2000, Vista and windows 7 sets up an Administrator account with overall prompts and system access with the help of a password. Now Guess what? By leaving the passwords as default, it will allow the password to be blank. If you don’t want to put up a password, you can simply click NEXT.Always Disable the Guest accountWindows XP, Vista, and 7 provide an option for a Guest account, that sounds OK to everyone because it is for a guest? Yeah right!!  We know that it is used for limited access, but yet it is a danger for your PC and it can cause a lot of damages. If you are not using the guest account, then disable it forever.  Go to — Control Panel –User Accounts –Guest Account–Turn Off the Guest account.Disable simple File SharesIn Windows XP, Vista and windows 7, the file sharing mode is easily accessible and exploited, as it is easy to share files via LAN. Well, it is easy for hackers to access as well. So turn it off, click on My Computer–click Tools–Folder Option–View tab–uncheck and–Use Simple file sharing (Recommended).Turn off all unneeded ServicesWindows XP, 2000, window vista and 7, all come up with many background services and programs which are not necessary or are never to be used.  Remote Desktop Sharing, Messenger, Alerter, Servers, Remote Desktop Help Session Manager, Play Device, Host SSDP Discovery Service,  NetMeeting, Remote Registry, Routing and Remote Access Telnet and Universal Plug etc.Don’t save your password in browser historyMost of us are lazy to type our password on every time we access our email accounts, online banking account or any private account that has to be open via password on the internet. Type your password every time you sign in. Don’t save your password in browser history as it can be used by hackers and stealer via cookie stealing script.Enjoy and happy surfing!", "authur": "Waqas", "date": "January 3, 2012"}, {"topics": ["anonymous", "AnonymoX", "internet", "Privacy", "Proxy", "VPN"], "title": "Open Ban Websites Without Any Proxy Software", "body": "How to visit ban websites? this is a question that comes to mind whenever people realize that their favorite website is banned in the university, college, office or even at home sometimes.These websites may be banned for several reasons, sometimes to avoid people from wasting their time rather than working or studying or perhaps due to governmental factors. Also, websites with articles that breaks trademark or other perceptive residence privileges are often clogged in some parts. This event can be quite aggravating for many customers, as they cannot accessibility a lot of articles online, but with AnonymoX, an Industry add-on, you can use all such websites by surfing the web anonymously.With it, you can modify your IP deal with, place and check out websites that are clogged or unavailable in your nation. You can modify the IP and place with only a few easy important without having to use proxy servers. All you need to do is either press the pink choice next to the look for bar or in the add-on bar, and press Change Personality to get a new IP Address. Also, remove treats by merely simply clicking the More choice.If you don’t want to use AnonymoX on certain websites, simply click the blue button and select your website from the Settings for the drop-down menu, and uncheck the Active option. You can also change the country and the service for individual websites. Click More to change settings for cookies and user agents.     AnonymoX Preferences allows you to enable/disable the Show in Add-on-bar, Show IP-Address and Show Country Flag options. Additionally, you can also Reset the notification settings.      This add-on can also be useful if you do not want internet sites to keep on top of and monitor your web surfing around conduct. Check out the hyperlink below to set up this add-on, and look a the web without any constraints.https://addons.mozilla.org/en-US/firefox/addon/anonymox/Enjoy and happy surfing!", "authur": "Waqas", "date": "January 3, 2012"}]