[{"navigation": "Cryptocurrency", "news_list": [{"news_name": "Report: Expect more website ads to contain hidden cryptominers", "news_link": "https://www.scmagazine.com/report-expect-more-website-ads-to-contain-hidden-cryptominers/article/734945/", "title": "Report: Expect more website ads to contain hidden cryptominers", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "January 04, 2018", "body": "In addition to hiding cryptocurrency miners in the coding of websites, malicious actors may also increasingly conceal them within advertisements appearing on these sites, according to a new report from CoinDesk, citing officials from the Israeli adtech firm Spotad.\n\nThe mining activity was recently detected on Spotad's network, after its artificial intelligence-driven ad platform detected anomalies in the code of certain desktop and mobile legitimate ads, the report continues. Further analysis revealed that the ads were designed to trick viewers into clicking a pop-up that would execute a miner for Monero cryptocurrency.\n\nDespite the proliferation of Bitcoin, Monero has become a popular choice of digital currency to mine because transactions are highly anonymous in nature.\n\n\"Look at what's happening today around this entire cryptocurrency world. You see how much money is involved, you see the volume picking up week by week,\" said Tomer Horev, Spotad chief strategy officer, according to CoinDesk. \"I think people identify that as the next gold rush and they will try to do everything that they can in order to produce this kind of money.\"\n\nThe agency that provided the ad reportedly was not aware it had been tainted with malicious code, company co-founder Yoav Oz told the media outlet.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}, {"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/web-security/topic/47254/", "topic_name": "Web Security"}]}, {"news_name": "Free software downloads infecting users with NiceHash cryptominer, warns researchers", "news_link": "https://www.scmagazine.com/free-software-downloads-infecting-users-with-nicehash-cryptominer-warns-researchers/article/720450/", "title": "Free software downloads infecting users with NiceHash cryptominer, warns researchers", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "December 21, 2017", "body": "Adversaries are using the lure of free online software downloads to infect unknowing victims with a customized version of cryptocurrency mining software from the NiceHash marketplace.\n\nIn a Dec. 21 Securelist blog post, Kaspersky Lab reports detecting 16 websites with Russian .ru top-level domains that offer free (or seemingly free) applications or software packages, including such titles as OpenOffice, Adobe Premiere Pro, CorelDraw, and PowerPoint. Approximately 200 of these various files were determined to secretly include the cryptominer as a component.\n\nAn analysis of one of these files, presented as a full version of ABBYY FineReader, determined that its folders contained not only the NiceHash miner itself, but also text files containing wallet details and the mining pool's address. It also contained a BAT script, compiled into a PE file named \"system.exe,\" which initializes the miner's operation and retrieves a PowerShell script that assigns an ID to the infected computers and launches the actual mining operations. In this instance, zcash was the targeted cryptocurrency.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}, {"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/malware/topic/47215/", "topic_name": "Malware"}]}, {"news_name": "Digmine cryptocurrency botnet spreading through Facebook Messenger", "news_link": "https://www.scmagazine.com/digmine-cryptocurrency-botnet-spreading-through-facebook-messenger/article/720451/", "title": "Digmine cryptocurrency botnet spreading through Facebook Messenger", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "December 21, 2017", "body": "Facebook Messenger is the launching pad for a new Monero-cryptocurrency mining bot called Digmine that so far is hitting only a small sampling of nations around the world.\n\nTrend Micro is reporting that Digmine, which is written in autolt, poses as a video file but is actually an AutoIt executable script. When it comes across a Facebook account that is set to auto log in the user, Digmine is able to co-op Messenger to send the malware to the account owner's friend list. The fact that the miner is controlled from a command-and-control server means its authors or distributors can update it at will, potentially making it more dangerous in the future.\n\n“The abuse of Facebook is limited to propagation for now, but it wouldn't be implausible for attackers to hijack the Facebook account itself down the line,” said Lenart Bermejo and Hsiao-Yu Shih.\n\nDigmine has so far confined its activities to South Korea, Vietnam, Azerbaijan, Ukraine, Vietnam, Philippines, Thailand, and Venezuela, but because Facebook Messenger is used worldwide and on different platforms, there is every chance the bot will spread. One piece of good news is that it is only effective on desktop versions of the Chrome browser. If Digmine finds itself on a mobile device or different browser, it does not operate properly, Trend Micro said.\n\nOnce downloaded onto a computer, Digmine's first operation is to install an autostart mechanism and launch Chrome with a malicious extension. It then starts mining and finally connects with the Facebook account's friend list via Messenger and begins to spread. In order to keep the victim unaware, a video file is streamed from a website that is controlled by the cybercriminal and contains additional components for the malware.\n\nThe miner is a variant of the Monero miner XMRig and is downloaded by a codec.exe.\n\nTrend Micro notified Facebook, and the social media company was able to remove many of the Digmine-related links from its platform. Facebook is also telling users that if it believes their system is infected, it will provide a free anti-virus scan.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}, {"topic_link": "https://www.scmagazine.com/social-media/topic/47245/", "topic_name": "Social Media"}]}, {"news_name": "VenusLocker ransomware extortionists switch m.o., pursue Monero cryptomining", "news_link": "https://www.scmagazine.com/venuslocker-ransomware-extortionists-switch-mo-pursue-monero-cryptomining/article/720255/", "title": "VenusLocker ransomware extortionists switch m.o., pursue Monero cryptomining", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "December 21, 2017", "body": "A threat group that was responsible for extorting victims with ransomware known as VenusLocker last year has now shifted its attention to cryptocurrency mining, according to new research.\n\nIn a Dec. 20 blog post, Fortinet's FortiGuard Labs division reports that the attackers are actively mining Monero by using the miner XMRig v2.4.2 to leverage the computing power of infected machines in South Korea.\n\nVictims are infected via phishing emails that trick them into opening a malicious attachment that's compressed in EGG archive format. On such email purports to be from a garment merchant, warning recipients that their information leaked due to a breach, while another claims that the recipient's website liable for images that were abused without consent, Fortinet reports.\n\n“As a basic attempt to hide this resource hogging operation, the miner is executed as a remote thread under the legitimate Windows component wuapp.exe, which is executed beforehand to avoid raising suspicions,” states blog post author and threat researcher Joie Salvio. But even if this miner is discovered and subsequently terminated, the parent process establishes persistence by immediately opening it back up – meaning the parent process itself was be terminated, Fortinet explains.\n\nFortinet analysts conclude that the miner targets Monero, instead of Bitcoin, whose value has been surging, because the Monero mining algorithm is designed for ordinary computers, and therefore the potential pool of victims is much larger. Moreover, Monero transactions are even more anonymous than Bitcoin transactions because they use stealth addresses.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}, {"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/malware/topic/47215/", "topic_name": "Malware"}, {"topic_link": "https://www.scmagazine.com/ransomware/topic/47247/", "topic_name": "Ransomware"}]}, {"news_name": "More evidence emerges of North Korea targeting cryptocurrency industry", "news_link": "https://www.scmagazine.com/more-evidence-emerges-of-north-korea-targeting-cryptocurrency-industry/article/719395/", "title": "More evidence emerges of North Korea targeting cryptocurrency industry", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "December 18, 2017", "body": "State-sanctioned North Korean hackers allegedly continue to target cryptocurrency companies and exchanges, particularly as a means of enriching the nation and countering the effects of imposed economic sanctions, according to newly released reports.\n\nA pair of reports, from Dell Technologies' SecureWorks and Intezer, describe a spear phishing campaign whose lure emails feature a fake job opening at a cryptocurrency company. Meanwhile, Korean and global news outlets have reported that South Korea's National Intelligence Service spy agency suspects that North Korea is responsible for hacking attacks on one of its country's cryptocurrency exchanges.\n\nOn Friday, researchers from Secureworks' Counter Threat Unit reported that the Lazarus Group, an APT actor commonly linked to North Korea, commenced a spear phishing campaign on Oct. 25, using emails that falsely advertise an open CFO position at a European cryptocurrency company. In actuality, it appears the attackers  copied a LinkedIn CFO job profile from a  cryptocurrency company based in Asia and slightly tweaked it to create the phishing content. (Intezer released a similar report on Dec. 12.)\n\nThe emails used in this campaign, which is likely still ongoing, include a Word attachment containing malicious macros. The attackers attempt to socially engineer recipients into enabling these macros by asking the user to accept the Enable Editing and Enable Content functions. Doing so opens a decoy document, while secretly installing a first-stage remote access trojan capable of downloading additional malware.\n\nSecureWorks notes that elements in both the macros and the first-stage RAT, as well as components in the custom command-and-control protocol, share commonalities with former campaigns attributed to Lazarus.\n\nThe company also warns that this latest attack is part of an larger overall movement on North Korea's part to engage in malicious activities related to cryptocurrency. Indeed, SecureWorks reports that it has found evidence dating back to 2013 of \"multiple usernames originating from a North Korean IP addresses... taking part in bitcoin research,\" and using proxies to mask the originating IP address.\n\n\"CTU researchers assess that the North Korean threat against cryptocurrency will remain elevated in the foreseeable future,\" SecureWorks predicts.\n\nMeanwhile, The Chosun Ilbo, the Yonhap News Agency, the BBC and other news agencies have reported, citing unnamed sources, that South Korea's National Intelligence Service believes its neighbor to the north hacked the Seoul-based Bithumb cryptocurrency exchange last February, stealing millions of dollars as well as the personal information of roughly 30,000 people. \n\nAccording to the BBC, the stolen funds were originally worth $7 million but jumped in value to $82.7 million at time of publication last Saturday. The hackers reportedly compromised Bithumb via an employee's home PC, and subsequently began trading bitcoin and ethereum on the exchange.\n\nThe BBC also cited reports that the hackers attempted to extort Bithumb, offering to delete traders' stolen personal information in exchange for an additional $5.5 million payment.\n\nThe Chosun Ilbo reports that the South Korean government has fined Bithumb the equivalent of nearly $54,000 for the breach.\n\nThe National Intelligence Service also reportedly believes that North Korea hacked the exchanges Youbit (formerly known as Yapizon) and Coinis this year.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/apt/topic/47229/", "topic_name": "APT"}, {"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}, {"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/malware/topic/47215/", "topic_name": "Malware"}, {"topic_link": "https://www.scmagazine.com/phishing/topic/47212/", "topic_name": "Phishing"}]}, {"news_name": "DDoS attack paralyzes Bitfinex", "news_link": "https://www.scmagazine.com/ddos-attack-paralyzes-bitfinex/article/718191/", "title": "DDoS attack paralyzes Bitfinex ", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "December 13, 2017", "body": "As bitcoin prices fluctuate, Zeifman expects to see attacks escalate. An “alarming number of attacks” over 100Mbps in Q3, “targeting a relatively high number of cryptocurrency exchanges and services,” was “likely related to a recent spike in the price of bitcoin, which more than doubled in the span of the quarter,” he said. \n\nTuesday's DDoS attack against Bitfinex “could have been also launched to manipulate bitcoin prices, something offenders have been known to do,” Zeifman said.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}, {"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/ddos/topic/47213/", "topic_name": "DDoS"}]}, {"news_name": "Cyberthieves loot tens of millions in bitcoin from NiceHash cryptocurrency marketplace", "news_link": "https://www.scmagazine.com/cyberthieves-loot-tens-of-millions-in-bitcoin-from-nicehash-cryptocurrency-marketplace/article/712712/", "title": "Cyberthieves loot tens of millions in bitcoin from NiceHash cryptocurrency marketplace", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "December 07, 2017", "body": "Cyberthieves have raided the coffers of cryptomining marketplace NiceHash, apparently stealing tens of millions of dollars in bitcoin after compromising its payment system and online wallet.\n\nIn response, NiceHash has temporarily ceased all operations. The company's home page on Thursday featured a “Service Unavailable” message, along with an official press release.\n\n“Clearly, this is a matter of deep concern and we are working hard to rectify the matter in the coming days,” the company asserts in the release. “In addition to undertaking our own investigation, the incident has been reported to the relevant authorities and law enforcement and we are co-operating with them as a matter of urgency.”\n\nNiceHash also says it is “working to verify the precise number of BTC taken,” but according to CoinDesk and other reports, users have already been sharing an anonymous wallet address that likely belongs to the perpetrator containing 4,736 bitcoins, which as of mid-afternoon on Thursday was worth close to $76 million. CoinDesk also referenced posts on Reddit from users whose NiceHash-affiliated wallets were emptied.\n\nCryptocurrency exchanges, marketplaces, and initial coin offerings continue to represent a highly alluring target for cybercriminals who see an opportunity to steal a virtual fortune in crypto funds, especially bitcoin, whose value has been rapidly inflating. As of Dec. 7, 2017, one bitcoin is currently worth more than $16,000.\n\n“As a rule, extortionists and other cybercriminals are commonly drawn to successful online industries, especially emerging ones that are less likely to be well protected,” said Igal Zeifman, security evangelist at Imperva, who recently wrote in his company's Q3 report that bitcoin exchanges are among the 10 most-attacked types of websites. \"Attackers can make a lot of money when attacking crypto exchanges due to factors such as the anonymity of the cryptocurrencies, [which provides an] ability to get rid of the stolen goods with limited risk.\"\n\nImperva reported that 73.9 percent of bitcoin exchanges and related sites that use its company's cloud-based application delivery platform were targeted by distributed denial of service attacks in Q3. “The DDoS attacks we mitigated could have been attempts to manipulate the price of bitcoin and other cryptocurrency, something we know offenders had tried in the past,” said Zeifman, in emailed comments. \n\n“Unlike classic attacks where hackers get a hold of sensitive data which can lead to fraudulent activity, the actual value of the breach is usually vague and is constructed from fines, PR issues, etc. This is not the case for cryptocurrency hacks, or blockchain in general, where the attack can be immediately evaluated in exact money value,” said Guy Peer, VP of research and development and co-founder at Dyadic Security. “That's because hacking into a cryptocurrency system and being able to use the crypto secrets – private keys, in technical terms – is exactly like breaking into a bank safe and carrying out the gold.”\n\nMatt Walmsley, EMEA director at Vectra Networks, noted that cryptocurrency exchanges are not subject to the same stringent security regulations that traditional financial institutions such as banks are. Therefore, “If you are risk averse, transfer deposits made to your bitcoin wallet to a hard currency account with a bank,” said Walmsley.\n\nHowever, he added, \"Many exchanges may limit the amount you can transfer in one instance and you may not be able to empty your account, so buyers beware.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}, {"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/finance/topic/47209/", "topic_name": "Finance"}]}, {"news_name": "Study: 90 percent of top cryptocurrency apps carry security and privacy risks", "news_link": "https://www.scmagazine.com/study-90-percent-of-top-cryptocurrency-apps-carry-security-and-privacy-risks/article/710383/", "title": "Study: 90 percent of top cryptocurrency apps carry security and privacy risks", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "November 29, 2017", "body": "A study of 90 cryptocurrency mobile applications available on Google Play found that 90 percent of them contain security vulnerabilities or privacy risks.\n\nWeb security company High-Tech Bridge conducted the research, using dynamic, static, and interactive testing to search mobile apps for weaknesses, including the top ten mobile flaws listed by the Open Web Application Security Project (OWASP).\n\n“We took the most popular cryptocurrency mobile applications from Google Play from the ‘Finance' category and tested them for security flaws and design weaknesses that can endanger the user, his or her data stored on the device or send/received via the network, or the mobile device itself,” High-Tech Bridge reported in a Nov. 29 blog post.\n\nThe company divided the apps into three groups of 30: the most popular apps with a maximum of 100,000 installations, the top apps with up to 500,000 installations, and the top apps with more than 500,000 installations.\n\nWhen combined together, 84.6 percent of the apps were determined to contain at least two high-risk vulnerabilities, while 84.3 percent were found with a minimum of three medium-risk bugs.\n\nNearly half of the apps, 47 percent, were deemed vulnerable to man-in-the-middle attacks, while 48 percent were found to contain hardcoded sensitive data such as passwords or API keys. And 46.6 percent were said to feature functionality that can endanger user privacy.\n\nMoreover, researchers observed that 80.3 of the apps lacked any kind of hardening or protection on their back-end APIs or web services, while 19.3 percent have back-ends that can be exploited with the POODLE vulnerability.\n\nMany of the apps have encryption weaknesses as well: 61 percent send data without any encryption over HTTP, while 37 percent were found to have insufficient encryption altogether.\n\nFinally, 100% of the applications don't have any reliable protection against reverse-engineering, the study reveals.\n\nThe three vulnerabilities from the OWASP that were found most frequently across all 90 cryptocurrency apps were improper platform usage, insecure data storage, and insufficient cryptography.\n\n“For many years, cybersecurity companies and independent experts were notifying mobile app developers about the risks of ‘agile' development that usually imply no framework to assure secure design, secure coding and hardening techniques or application security testing,” said Ilia Kolochenko, CEO and founder of High-Tech Bridge. “However, this is just the tip of the iceberg. A mobile app usually contains much less exploitable vulnerabilities than its backend. Weakness in a mobile application may lead to breach of the mobile device or its data, while a vulnerable API on the backend may allow attackers to steal the integrity of users' data.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}, {"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/vulnerabilities/topic/47222/", "topic_name": "Vulnerabilities"}]}, {"news_name": "Cyberthieves swipe $31 million in tokens from Tether", "news_link": "https://www.scmagazine.com/cyberthieves-swipe-31-million-in-tokens-from-tether/article/709020/", "title": "Cyberthieves swipe $31 million in tokens from Tether", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "November 21, 2017", "body": "Cybercriminals on Sunday stole nearly $31 million in USDT cryptocurrency from Tether, prompting the digital currency converter to suspend its back-end wallet service and apparently causing cryptocurrency trading values to fall.\n\nIn an urgent online notification posted on Nov. 20, Tether disclosed that external actors removed $30,950,010 in  \"tether\" tokens from the Tether Treasury Wallet, and sent the funds to the unauthorized bitcoin address \"16tg2RJuEPtZooy18Wxn2me2RhUdC94N7r\". The company does not explain how this occurred.\n\n\"As Tether is the issuer of the USDT managed asset, we will not redeem any of the stolen tokens, and we are in the process of attempting token recovery to prevent them from entering the broader ecosystem,\" Tether stated in its announcement, advising users not to accept the stolen tokens from the offending address or any downstream addresses that received them.\n\nTether allows users to store, send, and receive digital tokens pegged to U.S. dollars (referred to as USDT) and other currencies, using blockchain technology that interfaces with the Omni Protocol, an open-source software that allows for cryptocurrency trading.\n\nAside from suspending the tether.to back-end wallet service and flagging the purloined tokens, the company also is responding to the incident by providing community members with new builds of its Omni Core software in order to prohibit the transfer of stolen currency from the attacker's address to other locations. \"We strongly urge all Tether integrators to install this software immediately to prevent the coins from entering the ecosystem,\" the company said in its announcement.\n\nFinally, Tether noted: \"We are working with the Omni Foundation to investigate ways that will allow Tether to reclaim stranded tokens and rectify the hard fork created by the above software. Once this protocol enhancement is complete, the Omni Foundation will provide updated binaries for all integrators to install. These builds will supersede the binaries provided above by Tether.to. After the protocol upgrades to the Omni Layer are in place, Tether will reclaim the stolen tokens and return them to treasury.\"\n\nAccording to The Hill, bitcoin prices dropped about 5 percent following news of the attack, while Ethereum's value sank 5.5 percent and Bitcoin Cash fell six percent. Prices somewhat rebounded by mid-morning Eastern Time today.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}, {"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}]}, {"news_name": "Coinhive cryptocurrency miner jumps onto Check Point's Most Wanted Malware list", "news_link": "https://www.scmagazine.com/coinhive-cryptocurrency-miner-jumps-onto-check-points-most-wanted-malware-list/article/707206/", "title": "Coinhive cryptocurrency miner jumps onto Check Point's Most Wanted Malware list", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "November 14, 2017", "body": "Cryptocurrency miners are becoming one of the most prolific threats facing everyone from CISOs to consumers, with Check Point Software Technologies naming this type of malicious software to its Ten Most Wanted Malware list for October.\n\nThe advent of using Coinhive and its variants to illegally mine bitcoin, monero and other digital currencies helped debut this cryptocurrency miner at number six on Check Point's list, right between the well-known Zeus, at number five, and Ramnit at number seven.\n\n“Cryptomining is emerging as a silent, yet significant, actor in the threat landscape, allowing threat actors to extract substantial profits while victims' endpoints and networks suffer from latency and decreased performance,” Check Point wrote.\n\nCoinHive is implanted via JavaScript, and proceeds to use a huge portion of the victimized computer's CPU power, severely impacting the machine's performance.\n\nAnother newcomer to the list was Seamless. This is a traffic distribution system malware, which operates by silently redirecting the victim to a malicious web page, leading to infection by an exploit kit. Successful infection will allow the attacker to download additional malware from the target.\n\nHere is how the rest of the list shook out for October:\n\n1.       RoughTed  \n\n2.       Locky \n\n3.       Seamless \n\n4.       Conficker\n\n5.       Zeus \n\n6.       CoinHive \n\n7.       Ramnit \n\n8.       Fireball \n\n9.       Pushdo \n\n10.     Andromeda\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}, {"topic_link": "https://www.scmagazine.com/malware/topic/47215/", "topic_name": "Malware"}, {"topic_link": "https://www.scmagazine.com/ransomware/topic/47247/", "topic_name": "Ransomware"}]}, {"news_name": "KISA fingers North Korea for boosting cyberattacks", "news_link": "https://www.scmagazine.com/kisa-fingers-north-korea-for-boosting-cyberattacks/article/707039/", "title": "KISA fingers North Korea for boosting cyberattacks", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "November 13, 2017", "body": "The Korea Internet & Security Agency (KISA) has issued a new report stating that 5,166 cases of ransomware were reported during the first nine month of 2017 with attacks targeting cryptocurrency markets on the rise.\n\nThe number of incidents, which KISA is attributing to North Korea, represents an almost 4-fold increase from the 1,438 that took place during the same period in 2016, reported the South Korean Yonhapnews.com. KISA, which suspects the attackers to be from North Korea, said the attacks included attempts in July and August to infiltrate South Korean bitcoin exchanges along with an attempt to manipulate digital wallet passwords in order to steal the cryptocurrency.\n\nThe attackers tend to favor phishing when looking for bitcoin and evidently these have proven successful as KISA estimated that about $90,000 in cryptocurrency was stolen every month from 2013 to 2015, reported Cryptocoinnews.com.\n\n", "topics": []}, {"news_name": "Cryptoshuffler trojan diverting bitcoin payments to criminal's pockets", "news_link": "https://www.scmagazine.com/cryptoshuffler-trojan-diverting-bitcoin-payments-to-criminals-pockets/article/704202/", "title": "Cryptoshuffler trojan diverting bitcoin payments to criminal's pockets", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "October 31, 2017", "body": "Cryptocurrency mining may be all the rage right now, but some malicious actors are finding it easier to use a specialized trojan that simply steals the money right out of a digital wallet.\n\nThe CryptoShuffler Trojan uses the devices clipboard and depends upon the user not paying enough attention during the transaction process, Kaspersky Labs reported. So far the process has allowed 23 BTC, or about $145,000, to be stolen in the year that CryptoShuffler has been in the wild. It is also capable of targeting Ethereum, Zcash, Dash and Monero.\n\nCryptoShuffler takes advantage of the transaction process the currencies use. Once installed on a device the malware monitors the clipboard, where the user's wallet ID is normally stored, and when a transaction is recognized as taking place it replaces the correct destination address with its own diverting the funds.\n\n“CryptoShuffler's ability to replace a destination literally takes milliseconds because it's so simple to search for wallet addresses – the majority of cryptocurrency wallet addresses have the same beginning and certain number of characters. Therefore, intruders can easily create regular codes to replace them,” Kaspersky said.\n\nThe other key aspect is the fact that most people do not pay attention to what is going on when conducting this type of transaction. \n\n“When making a payment, users do not usually check their multi-digit numbers, especially since the wallet addresses in blockchain are complicated and often very difficult to remember. Users don't pay much attention to checking any distinctive features in the transaction line, even if a slight change could cost them a lot,” the company said.\n\nThe bad guys can be stopped by simply paying attention and making sure the wallet ID pasted into the destination address to make sure it is your own.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/malware/topic/47215/", "topic_name": "Malware"}, {"topic_link": "https://www.scmagazine.com/trojan/topic/53138/", "topic_name": "Trojan"}, {"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}]}]}]