[{"topics": ["Cyber Attack", "Hacking News"], "title": "Man Phished His Way into Stealing Bitcoin from Dark Web Criminals", "authur": "Mandee", "date": "July 2, 2017", "body": "This new phishing scam just goes to show that even (some) cyber criminals are not the smartest –regardless of their skill level.35-year-old tech professional, Michael Richo, was recently arrested for using phishing techniques to steal bitcoin from dark web criminals.In the official court documents, Richo operated a phishing site masked as popular darknet marketplaces. Although the marketplaces were never identified, one can assume by the sheer amount of profit that the marketplaces were big-named ones like AlphaBay and Dream Market.“He would post fake links on forums to these markets which would direct users to a fake login page hosted on a laptop at his house. The login page would look exactly like the real login pages for the various market sites. When users would attempt to log in, he would steal their usernames and passwords.”After logging in, Richo was able to transfer money from his victims’ bitcoin wallet to his own. From there, he’d convert the Bitcoin dollars into real dollars and deposit the funds into his Bank of America account. Richo also obtained the Bitcoin dollars via Green Dot prepaid debit cards, Western Union withdrawals, and MoneyGram transfers.The profit totaled over $365,000. Richo finally took a fall in 2013, when a criminal complaint was filed against him after he spent time bragging on dark web forums about his illegal business.After keenly monitoring his activity over the gollowing year, authorities were finally able to gain access to his home. This allowed them to confiscate all electronics; including computers, hard drives, and various other storage devices.Richo now faces up to 30 years in prison with the charges “access device fraud” and “money laundering”. He was previously on bond with computer monitoring conditions, but now awaits sentencing, which will take place on September 28, 2017."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Member of ‘Crackas with Attitude’ Is Sentenced with 2 Years of Prison", "authur": "Mandee", "date": "July 2, 2017", "body": "In September 2016, two men were arrested for participating in the hacking of CIA Director John Brennan’s email account, along with accounts belonging to various other government administrators.Despite the hackers, Andrew Otto Boggs, 22, and Justin Gray Liverman, 24, being the only two arrested during the September bust, authorities confirmed that the conspiracy was greater than 2.Boggs and Liverman were the last two to be arrested; Boggs claiming the desire to keep the “legacy” alive. This was made evident in an email exchange between Boggs and another individual.“I want to carry on [Cracka’s] legacy if or when he is arrested. I know he’ll receive a harsh sentence because our government doesn’t like being embarrassed.”Dubbing the names “INCURSIO” and “D3F4ULT”, they then utilized the security blanket of their aliases and the hacking tactic of social engineering to obtain sensitive information from their victims.“When the hackers gained control of an account, they used access to promote the Free Palestine Movement, according to the affidavit. In another case, they pretended to be Edward Snowden when they contacted their victim. News accounts indicated Crackas hackers targeted Director of National Intelligence James Clapper and had his phones forwarded to the Free Palestine Movement.”In addition to the hack that took them down, ‘Cracks with Attitude’ have also been accused of calling in fake bomb threats and publishing thousands of names and emails belonging to the FBI and Department of Homeland Security.Their reign lasted a solid nine months before all involved were taken in by authorities. After almost 2 years, Boggs was finally sentenced to two years in prison. He plead guilty to ‘unauthorized computer access’."}, {"topics": ["Hacking News"], "title": "SQL Injection Vulnerability has been discovered in WP Statistics plugin", "authur": "Eslam Medhat", "date": "July 1, 2017", "body": "WP Statistics is one of the most popular WordPress plugins, installed on 300,000 websites. The plugin makes WordPress administrators able to track statistics for WordPress site without depending on external services and uses arrogate data whenever possible to respect users privacy.Sucuri researchers have discovered a SQL injection flaw in WP Statistics plugin, which could be exploited by attackers to steal databases and probably hijack the vulnerable websites remotely.SQL injection is a code injection method, used to attack data-driven applications. This vulnerability allows a hacker to submit crafted input to interfere with the application’s interaction with back-end databases. A hacker may be able to obtain arbitrary data from the application, interfere with its logic, or execute commands on the database server itself. Read more about SQL injection here.“This vulnerability is caused by the lack of sanitization in user provided data. An attacker with at least a subscriber account could leak sensitive data and under the right circumstances/configurations compromise your WordPress installation.”“One of the vulnerable functions wp_statistics_searchengine_query() in the file “includes/functions/functions.php” is accessible through WordPress’ AJAX functionality thanks to the core function wp_ajax_parse_media_shortcode().”“This function doesn’t check for additional privileges, allowing subscribers to execute this shortcode and inject malicious data to its attributes. “So, if you still running a vulnerable version of the WordPress plugin (WP Statistics), you should update your plugin as soon as possible. "}, {"topics": ["Cyber Attack", "Hacking News"], "title": "National Department of Basic Education Is Hacked with Gory Pictures", "authur": "Mandee", "date": "July 1, 2017", "body": "Just recently, several US government-based websites were hacked by a group calling themselves “Team System DZ”. The group of cyber criminals uploaded messages to various websites promoting the terrorist group ISIS.In addition to the ISIS propaganda posted on the US government-based websites, Team System DZ also targeted the National Department of Basic Education.The pictures posted were disturbing and gory; depicting decapitated corpses of adults and children. The National Department of Basic Education shut down their website late Wednesday in response, but not before several thousand online users caught sight of the revolting images.“Hacked by Team System DZ. A message to the government‚ the American people and the rest of the world. Is this the humanity that you claim‚ or is life irrelevant to Muslims? Do not imagine that these actions against Muslims will pass you and we will forget what you did to the Arab and Muslim peoples all over the world. I love Islamic State.”While the hacking occurrence is definitely linked to Team System DZ, the Department of Education is still examining a possible link between their hacked website and a recent court ruling on no religion (whatsoever) allowed in state schools.“The Johannesburg High Court ruled that public schools may no longer promote themselves as subscribing to a particular religion in an application brought by the Organisation for Religious Education and Democracy.The application sought to restrain six schools from partaking in 71 instances of conduct with a religious theme‚ some identified with Christianity.”All of the victims are working on an investigation that will (hopefully) lead them to the source of the hack. In the meantime, the pro-ISIS messages have many citizens concerned on what will happen next."}, {"topics": ["Hacking News", "News"], "title": "Man Previously Busted for Laundering $19+ Million Is Charged", "authur": "Mandee", "date": "June 30, 2017", "body": "Muhammad Sohail Qasmani, a 47-year-old Pakistani citizen, was previously arrested for laundering over 19 million dollars. Qasmani was a part of a worldwide PC hacking and telecommunications fraud scheme.Although Qasmani was arrested and charged, the alleged leader behind the massive fraud network, 53-year-old Pakistani citizen Noor Aziz, is still at large.Aziz was able to organize the operation by gaining unlawful access to PBX systems belonging to a variety of different US companies. Manipulating internal telephone networks, the group was then able to start the profitable scam.“Foreign-based hackers targeted the telephone systems of the victim corporations and placed calls to those systems in an attempt to identify unused telephone extensions. Once the hackers identified unused extensions, they illegally reprogrammed the telephone systems so that they could be used to make unlimited long distance calls, all of which were ultimately charged back to the victim corporations.”Qasmani’s involvement began in 2008, when his Thailand money laundering and smuggling business got him noticed by Aziz. After propositioning him, Aziz proceeded to use Qasmani to launch numerous bank accounts to collect money produced by the telecommunication scam.The profit must’ve been worth it, as Qasmani went as far as paying the hackers/dialers working for Aziz to keep the scam active. The specifics that went into the scam are almost impressive in their attention to detail.“The hacked telephone systems were then used to make calls to premium telephone numbers – such as purported chat lines, adult entertainment, and psychic hotlines – that generated revenue based on the calls’ duration and were set up and controlled by Aziz.In actuality, the numbers provided no actual services. Telephone company representatives who suspected fraudulent activity and called the numbers heard recordings of fake rings, fake password prompts, fake voicemail messages, music, or dead air on continuous loops.”Qasmani was sentenced to four years in prison, two years of supervised release, and $71.8 million in amends."}, {"topics": ["Hacking News"], "title": "A Systemd Vulnerability Allows Attackers Hack Linux Machines via Malicious DNS response", "authur": "Eslam Medhat", "date": "June 29, 2017", "body": "The flaw has been discovered by Chris Coulson (Canonical developer) in Systemd, which is an init system used in Linux distributions to bootstrap the user space and manage all processes subsequently, instead of the UNIX System V or Berkeley Software Distribution (BSD) init systems. The vulnerability could enable remote attackers to probably trigger a buffer overflow bug to execute malicious code on the targeted Linux systems via a DNS packet (response).“A malicious DNS server can exploit this by responding with a specially crafted TCP payload to trick systemd-resolved into allocating a buffer that’s too small, and subsequently write arbitrary data beyond the end of it,”The flaw enables an attacker to crash the system or write data to memory, enabling him to execute malicious code on the target’s machine. Hackers can take advantage of this security issue to hijack systemd instances, which due to their level of access would enable an attacker to take over the whole machine.The flaw enables an attacker to crash the system or write data to memory, enabling him to execute malicious code on the target’s machine. Hackers can take advantage of this security issue to hijack systemd instances, which due to their level of access would enable an attacker to take over the whole machine.“A patch to resolve this has been provided by Zbigniew Jędrzejewski-Szmek, along with an additional patch to implement a test.”Linux users and system administrators are recommended to install the latest security updates ASAP to patch this vulnerability and stay secure."}, {"topics": ["Hacking News"], "title": "A Privilege Escalation issue has been fixed in Microsoft Azure AD Connect", "authur": "Eslam Medhat", "date": "June 29, 2017", "body": "Azure AD Connect is a tool and guided experience for connecting on premises identity infrastructure to Microsoft Azure AD. The wizard deploys and configures pre-requisites and components required for the connection, including sync and sign on.Microsoft explains the issue (CVE identifier CVE-2017-8613 ) and said that the password writeback feature may not be configured properly during enablement. Writeback is a component of Azure Active Directory Connect that lets users configure Azure AD to write passwords back to their on-premises AD user accounts. It gives a convenient cloud-based way for users to reset their on-premises passwords wherever they are.“To enable Password writeback, Azure AD Connect must be granted Reset Password permission over the on-premises AD user accounts. When setting up the permission, an on-premises AD Administrator may have inadvertently granted Azure AD Connect with Reset Password permission over on-premises AD privileged accounts (including Enterprise and Domain Administrator accounts). “This configuration is not recommended from Microsoft because it enables a malicious Azure Active Directory Administrator to reset the password of an arbitrary on-premises AD user privileged account to a known password value using Password writeback. This will enable the malicious Azure AD Administrator to obtain privileged access to the customer’s on-premises AD.“The issue is addressed in the latest version (1.1.553.0) of Azure AD Connect by not allowing arbitrary password reset to on-premises AD privileged user accounts.”"}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Don’t Pay Ransom To Petya; You Will Never Get Your Files Back", "authur": "Eslam Medhat", "date": "June 28, 2017", "body": "The new ransomware (Petya) attack, currently hitting a large number of countries around the world, such as Ukraine, the UK, India, the Netherlands, Spain, Denmark, and many others. The new ransomware uses the contact details of “[email protected]” and demands for a payment of $300 in Bitcoin.The malware is spreading quickly using the same Windows SMBv1 vulnerability that the WannaCry ransomware used to attack about 300,000 devices around the world.Almost 45 victims have now paid total $10,500 in Bitcoins in hope to restore their encrypted files back, but sadly, they would not because the email address, which was created by the hackers to contact with their victims and send the decryption keys to them, was suspended by the German mail provider quickly after the attack.Kaspersky security researchers said:“Our analysis indicates there is little hope for victims to recover their data. We have analyzed the high-level code of the encryption routine, and we have figured out that after disk encryption, the threat actor could not decrypt victims’ disks,”“To decrypt a victim’s disk threat actors need the installation ID. In previous versions of ‘similar’ ransomware like Petya/Mischa/GoldenEye this installation ID contained the information necessary for key recovery.”Many security researchers and even Microsoft researchers said that MeDoc (Ukrainian tax accounting system) was breached and the malware was spread via the system updates."}, {"topics": ["Hacking News"], "title": "New Clever Phishing Scam Targeting Facebook Users", "authur": "Eslam Medhat", "date": "June 28, 2017", "body": "Most Facebook users are frequently using the Facebook on their smartphones, now they should be careful because security researchers have discovered a new phishing technique by hackers that target smartphone owners (especially Facebook users).PhishLabs security researchers said that the new attack method depends on the issue that mobile browsers have very small URL address bars, which limits users from seeing the whole contents of a link. By taking advantage of this issue, attackers were able to pad URLs with Sub-domains and hyphens, which make URLs seem real on mobile devices, but in reality, it will redirect them to the attacker’s site (scam).PhishLabs also said that the attacker will use something like the following –\nhttp://m.facebook.com—————-validate—-step1.rickytaylk[dot]com/sign_in.html\nto scam users and make them think that they are visiting the original site and giveaway their Facebook credentials to these hackers.The actual domain of the previous website is “rickytaylk.com”, and not “m.facebook.com”. That happened because the mobile browser will display only the first part of the URL, users will see only the “m.facebook.com” part, followed by an endless stream of hyphens.The URL re-direction can only take place once you are out of the Facebook app. So make sure you evade logging in through your browser to Facebook and if you do check the whole domain content."}, {"topics": ["Hacking News"], "title": "Critical RCE vulnerability has been discovered in Skype", "authur": "Eslam Medhat", "date": "June 28, 2017", "body": "Skype is an instant messaging app that provides online text message and video chat services. Users may transmit both text and video messages and may exchange digital documents such as images, text, and video. It also allows video conference calls.A critical remote code execution (RCE) vulnerability has been discovered in Skype, the issue may allow attackers to execute code remotely and break the operating systems.Security researchers have found that the stack buffer overflow vulnerability allows hackers to inject malicious code into Windows boxes that running out-date versions of the software.Security researchers at vulnerability-lab said:“The issue can be exploited remotely via session or by local interaction. The problem is located in the print clipboard format & cache transmit via remote session on Windows XP, Windows 7, Windows 8 and Windows 10. In Skype v7.37 the vulnerability is patched.”Microsoft said that the latest version of Skype is patched and has no issue. Microsoft said:“Users on the latest Skype client are automatically protected, and we recommend upgrading to this version for the best protection”You can check more details of the vulnerability in an article by Vulnerability Laboratory researchers here, also you can check the following video for a proof of concept:"}, {"topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "New Ransomware similar to WannaCry is on the Rise", "authur": "Harikrishna Mekala", "date": "June 28, 2017", "body": "The U.S.-based pharmaceutical firm Merck (MRK) also said it was hit.“We confirm our firm’s computer network was compromised today as the victim of the global hack,” Merck said on Twitter.Mondelez (MDLZ), the corporation that owns Oreos, Cadbury, and many other global snack names, reported a network outage across its global operations. And law firm DLA Piper said it had brought down its systems in response to “a serious global cyber incident.”The origin of the attack is not yet clear. It is similar to WannaCry, that spread globally in May, but there are variations. Both asked victims to give Bitcoin to get their files back, and both use a related flaw to spread through networks.The Moscow-based cyber security corporation Group-IB estimated Tuesday that the virus attacked about 80 companies in Russia and Ukraine.Group-IB announced the ransomware infects and locks a computer, and later demands a $300 ransom to be paid in Bitcoins.Many firms, including Symantec, have proposed the ransomware is a modification of Petya, a known ransomware. But according to security firm Kaspersky Lab, prefatory findings indicate the attacks are from a new ransomware that it’s promptly calling “ExPetr.”Either way, researchers said Tuesday’s attacks use a Windows vulnerability called EternalBlue to spread within corporate networks. WannaCry also used the EternalBlue exploit, which was leaked as a portion of a trove of hacking tools supposed to belong to the NSA. Microsoft (MSFT, Tech30) announced patches for the exploits in March.Microsoft said it determined that the ransomware is using multiple techniques to grow, including one that was written in the security patch released in March. It is proceeding to investigate.The U.S. Department of Homeland Security is also watching the cyber attacks.Spokesman Scott McConnell said DHS is “coordinating with our foreign and domestic cyber partners. We stand ready to support any requests for assistance.”Europol said it is investigating the attack as well."}, {"topics": ["Cyber Attack", "Hacking Challenges", "Hacking News"], "title": "The Dark Overlord: Pushed into a Dark Corner of the Internet", "authur": "Mandee", "date": "June 28, 2017", "body": "We all remember the Dark Overlord (probably). They provided diehard OITNB fans with the first ten episodes of the fifth season. After threatening several other networks, they followed through with at least one promise by releasing a few episodes of Steve Harvey’s new talk show.TDO must have realized their lack of media coverage with TV networks, as they’ve fallen back into the old habit of targeting health care providers. The hacking group has a small history in hacking similar establishments over the course of the last couple years – from doctor’s offices to hospitals.After enjoying their short remise from non-TV based jobs, the Dark Overlord went back to targeting their usual victims. This time, the establishment was a well-known Beverly Hills health care provider. While TDO demanded their usual ransom, it is unknown whether the Beverly Hills healthcare provider paid up.Commonsense would say not to; especially knowing that Larson Studios paid the ransom and still faced the leak of their TV show.“The company’s owners, Jill and Rick Larson, say they transferred $50,000 worth of bitcoin to the attackers in an attempt to prevent the release of stolen content, Variety reports. But The Dark Overlord released the series to file-sharing networks anyway.”Hopefully TDO’s new victim didn’t pay the ransom because their information was already leaked on Twitter. This included addresses and phone numbers of recognized clients. On a slightly funnier note, TDO’s official Twitter page was banned in response to their illegal information dump.The bottom line here is to obviously not trust hackers. If you are ever a victim of ransomware, do not pay the ransom. Even if your files are at risk, don’t take the chance. Instead, work on securing your system to prevent another attack from happening in the future.If you do pay the ransom, you could get your files back . . . or you could suffer the consequences of the cyber-attack AND be out $50,000."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Petya is another worldwide Ransomware, just like WannaCry", "authur": "Eslam Medhat", "date": "June 27, 2017", "body": "The new ransomware (Petya) attack, currently hitting a large number of countries around the world, such as Ukraine, the UK, India, the Netherlands, Spain, Denmark, and many others. The new ransomware uses the contact details of [email protected] and demands for a payment of $300 in Bitcoin.The malware is spreading quickly using the same Windows SMBv1 vulnerability that the WannaCry ransomware used to attack about 300,000 devices around the world.Actually, Petya is different, the malware doesn’t encrypt or lock files on a targeted system one by one. Petya reboots targets devices and encrypts/locks the hard drive’s master file table (MFT), which is a database in which information about every file and directory on an NT File System (NTFS) volume is stored.The malware then rendering the master boot record (MBR) inoperable, limiting access to the entire system by grabbing information about file names, sizes, and location on the physical hard disk. Then replaces the device’s master boot record (MBR) with the malware malicious code that represents the ransom note and leaves devices unable to boot.The ransomware note says:\n“If you see this text, then your files are no longer accessible, because they are encrypted. Perhaps you are busy looking for a way to recover your files, but don’t waste your time. Nobody can recover your files without our decryption service.”"}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Essex’s GlobalFoundries Plant Is Infected by Computer Virus", "authur": "Mandee", "date": "June 27, 2017", "body": "GlobalFoundries is a semiconductor foundry with plants located worldwide. They are fairly well known for their contribution in engineering integrated circuits for semiconductor companies like Broadcom and STMicroelectronics.Just recently, GlobalFoundries confirmed that their Essex Junction plant was infected by a computer virus via manufacturing tools. The tools were taken down in response to the virus in order to prevent further spreading. Fortunately, A few tools have already been successfully reinstated.“I can confirm a small number of fab tools were impacted by a computer virus. As per our security measures, we took these tools offline to isolate them and avoid any further spread. Some of these tools have already been brought back up and the rest are being addressed now.”The plant is currently working with several federal agencies to fulfill a $100 million contract that will provide microelectronics to a variety of different departments. Officials have yet to clarify if the virus affected the tools involved in the contract – or if the virus was specifically created to target GlobalFoundries.“A 2012 report from the Government Accounting Office warned that vulnerabilities in the supply chain for “National Security-Related Agencies” could jeopardize those agencies’ work.The report said potential attackers “include corporate spies, corrupt government officials, cyber vandals, disgruntled employees, foreign military, government agents or spies, radical activists, purveyors of counterfeit goods, or criminals.”Hopefully other establishments will learn from GlobalFoundries’ mistakes. In fact, there have been so many mistakes to learn from lately that the possibilities are never-ending. Cyber security teams don’t have any more excuses. The information is plentiful and readily available.The only thing left is for authorities and technology experts to utilize the information we have. We need to prepare for the future as much as we virtually can."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Ohio state government websites have been hacked!", "authur": "Eslam Medhat", "date": "June 26, 2017", "body": "Ohio state government websites were hacked and defaced with pro-Islamic State messages.The Ohio Governor (John Kasich) website was one of the victims of the hacks, and it was reportedly down for maintenance for some time on Sunday before becoming online again. A picture of the message was posted by Ohio Senate candidate Josh Mandel.“You will be held accountable Trump, you and all your people for every drop of blood flowing in Muslim countries,” said the message, which also included a call to prayer and finished: “I love Islamic state.”A team called System DZ hacked the John Kasich’s official website, along with the websites of first lady Karen Kasich and the Ohio Department of Rehabilitation and Corrections. The web pages presented the same message that Kasich’s did. In addition to the pro-ISIS language, a line appeared on each website said: “Hacked by Team System DZ.” It’s not clear until now who the group is or whether it is truly associated with ISIS. The Ohio sites were back to normal by Monday morning and Ohio Governor’s staff members said on Sunday that they had been working on the site maintenance when they were alerted to their own site being hacked."}, {"topics": ["Hacking Challenges", "Hacking News", "News"], "title": "Thousands of Fines Suspended in Response to Victoria’s Bugged Cameras", "authur": "Mandee", "date": "June 26, 2017", "body": "A few weeks ago, you might have heard about Australia’s speed camera programs and red light camera programs taking a severe hit in Victoria. In fact, reports show that the hacked cameras went weeks without being noticed.The cause of this massive malfunction was (possibly) linked to the WannaCry ransomware attack that recently struck the virtual world. A couple months later and thousands are still reeling in the aftermath of the colossal cyber-attack.There’s a small light at the end of the tunnel however, as anyone in Victoria, Australia with a speeding ticket from the 6th of June and on will be given leeway until further notice. Authorities are planning to observe the cameras and reassign tickets accordingly (and fairly).“I’ve decided to withdraw all infringements statewide since the 6th of June in fairness to the Victorian community. That doesn’t mean they won’t be reissued. What it means is of the 280 cameras we have operating across Victoria, I need as the responsible enforcement officer to be absolutely sure that the 280 cameras were working correctly.”Although the fines are only suspended, traffic law experts are also apparently urging fine-holders to challenge their discrepancies in court.“Almost 10,000 fines have been withdrawn or suspended in case they are incorrect. A review is under way by Road Safety Camera Commissioner John Voyage, who will decide if fines issued between June 6 and 22, when the virus was on the cameras, will stand. Even if Mr. Voyage rules they will, traffic lawyer Michael Kuzilny said drivers should seriously consider challenging a fine in court.”It comes down to whether or not the legal hassle is worth it. For some, saving a few hundred bucks (depending) is a huge deal. For others, it’s not even worth the consideration. Regardless, those reviewing the footage sure have a long day ahead of them."}, {"topics": ["Hacking News", "News"], "title": "ISIS-Positive Propaganda Appears on Multiple U.S. Government Sites", "authur": "Mandee", "date": "June 26, 2017", "body": "Yesterday afternoon, multiple government websites – most originating in Ohio – were hacked by a group calling themselves “Team System Dz”. Despite Ohio being the main target in this cyber-attack, the group also penetrated websites originating in Brookhaven, New York and Howard County, Maryland.In addition, the group also takes credit for similar hacktivities that occurred in Richland County, Wisconsin as well as Aberdeen, Sweden, and Scotland.“Hacked By Team System Dz – Anti: Govt all word – You will be held accountable Trump, you and all your people for every drop of blood flowing in Muslim countries. I love Islamic state.”Included in the social media hacks was the Ohio governor’s website. Despite other websites having promised reappearances sometime Monday, the governor’s website was put back online only several hours after being infiltrated.It wasn’t alone in its quick resurrection either; both Ohio Office of Health Transformation and Ohio Department of Medicaid were put back online almost immediately.Unfortunately, Ohio’s First Lady’s websites are still undergoing maintenance, as are the websites of the Ohio Department of Rehabilitation and Corrections and the Ohio Inspector General.Moreover, the cyber-attack is also making its rounds on the internet. Several online users are panicking at the possibilities, while others are quick to brush off the propaganda.Chief Communications Officer of Ohio’s Department of Administrative Services, Tom Hoyt, released an official statement on the cyber-attack.“All affected servers have been taken offline and we are investigating how these hackers were able to deface these websites. We are also working with law enforcement to better understand what happened.”As we can see, this is not the first occurrence of Team System Dz hacking government’s social media. Chances are, this will not be the last time either. The only thing officials can do is strengthen their security wards and continue practicing advanced cyber security tactics."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "SamSam Ransomware is now asking for $33,000", "authur": "Eslam Medhat", "date": "June 25, 2017", "body": "The SamSam ransomware that has been active for more than a year is now asking for $33,000 to decrypt and restore all the encrypted files.If a single device in a network was attacked, the malware can spread to other devices on the network. The malware operators are using remote desktop protocol (RDP), web shells and batch scripts to attack networks and deploy the ransomware on every machine.“The attacks seem to peak in waves as campaigns distributing SamSam are executed. A notable recent example was a large hospital in New York that was hit with SamSam in April. The hospital declined to pay the attackers the $44,000 ransom demanded. It took a month for the hospital’s IT systems to be fully restored.” Defending against SamSam is more similar to a targeted attack than normal opportunistic ransomware. SamSam criminals are known to:– Get remote access through common attacks, such as JBoss exploits.\n– Spread web-shells.\n– Connecting to Remote Desktop Connection over HTTP tunnels such as ReGeorg.\n– Execute batch scripts to spread the malware over devices.“The most recent attacks appear to have been successful, at least from the attackers point of view. The Bitcoin address associated with this week’s attacks has received $33,000.”"}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Windows 10 has disabled third-party Anti-Virus", "authur": "Eslam Medhat", "date": "June 25, 2017", "body": "Microsoft Confirms that it has Disabled Third-party Anti-Virus Software “Temporarily” In Windows 10 to keep users secure.The statement made by Microsoft appears after the founder of Kaspersky Lab, recorded an antitrust complaint with the EC (European Commission), which blames Microsoft for disabling third party anti-virus software in Windows 10 without the permission of users to prefer the built-in Windows Defender.It asked questions about Microsoft’s potential violation of its place in the market “to fiercely promote its own – inferior – security software (Windows defender) at the expense of users”“AV software can be deeply entwined within the operating system, we doubled down on our efforts to help AV vendors be compatible with the latest updates. By the time the most recent Windows 10 Creators Update released on April 11, for example, nearly all of the antivirus applications that Microsoft tested were fully compatible. In fact, Microsoft’s application compatibility teams found that roughly 95% of Windows 10 PCs had an antivirus application installed that was already compatible with Windows 10 Creators Update.”“For the small number of applications that still needed updating, we built a feature just for AV apps that would prompt the customer to install a new version of their AV app right after the update completed. To do this, we first temporarily disabled some parts of the AV software when the update began. We did this work in partnership with the AV partner to specify which versions of their software are compatible and where to direct customers after updating.”Kaspersky claims that Windows Defender is a poor product, pointing to AV-Comparitive tests that show it is not a goof AntiVirus, including Avast, AVG, BitDefender, BullGuard, F-Secure, Kaspersky, and Trend Micro."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized"], "title": "Hackers tried to Hack The Parliament of UK and tried to access the MP’s Email Accounts", "authur": "Harikrishna Mekala", "date": "June 25, 2017", "body": "The Hackers tried to access the Emails of MP, Lords and the Staff, Security services are to stopped access for anyone not in Westminster as a role of efforts to ensure the network later the allegedly state-sponsored attack.“The Houses of Parliament have identified unauthorized attempts to access parliamentary user accounts,” a parliamentary spokesperson told The Media.“We are proceeding to investigate this incident and take additional steps to secure the computer network, liaising with the National Cyber Security Centre (NCSC).“We hold systems in place to guard member and staff accounts and continue taking the necessary steps to protect our systems.”The Sunday Times quoted a security expert as saying: “It was a brute force attack. It appears to have been state-sponsored.”The MPs were told of the cyber attack on Friday evening and said they were ineffective of accessing their emails the following morning.Tory MP Andrew Bridgen said such an invasion could “absolutely” leave people open to blackmail.An email addressed to everyone using a parliamentary address said: “unusual activity and evidence of an attempted cyber attack” had been found.It said modifications had been made to the system to prevent the attackers gaining access, shutting down access to emails and general services via mobile phone, but access to systems on the Westminster state itself was unaffected.Oz Alashe, a retired special forces Lieutenant Colonel and CEO of cyber security platform CybSafe, said jeopardizing email accounts can merely be the “first step” in a broader attack.“Email accounts serve a rich source of information for hackers, so jeopardizing these accounts would often be the first step in a sophisticated cyber attack,” he added.“With the disarray created by the recent elections and the resultant changes in parliamentary staff, it would be a prime time to use social engineering to obtain email passwords.“Fortunately, it appears this outbreak has been detected early and locked down. Let’s hope no sensitive information has been lost to hackers.”Mr. Alashe told The News that the most common method for this type of attack was “brute force”, where significant processing power is directed to running through as many possible combinations of passwords as expedient in a short space of time.“Many people use the same passwords for different accounts – it’s not unusual,” he added.“That’s why so many criminals are after these things – once they compromise one account they can sell the password to be used to access others.”Official guidance from the NCSC states that hackers use software that automatically predicts trivial variations to passwords, including the substitution of letters for aggregates, warning not to worsen vulnerability by using the same password for accounts at work and home.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Op Anonymous Greece Begins Their Attack – 80+ Turkish Websites down So Far", "authur": "Mandee", "date": "June 24, 2017", "body": "Just this morning, after publishing my first article in fact, I noticed that Op Anonymous Greece started their widespread attack against Turkish websites. In their introduction post on Facebook, the group declared the official launch.[TRANSLATED TO ENGLISH]“The massive attacks begin. Turkey we are Greeks, you can’t accomplish anything! It’s started and doesn’t stop! #OPanonymousgreece!”Since the original post, 80+ Turkish websites have been taken down by Op Anonymous Greece and affiliated Greek hackers. Over the course of today alone, the hacktivist group has gained the attention of media outlets across the world.[TRANSLATED TO ENGLISH]“We would like to thank the star for our speech. 19:50 launches news! You’ll hear us there. About the Turks! #Opanonymousgreece”As the day goes on, Op Anonymous Greece and other hackers continue to take down websites; deleting multiple pages in the process. In addition to their main objective, the group has also spoiled their followers with apparent “leaks of people from Turkish major websites!”Turkey is keeping up with the cyber war however, as their hackers are both retaliating and enjoying the media attention.Meanwhile, as this cyber war wages on, OP Anonymous Greece still has time to poke fun at all things Turkey/ish. Their social media has been home to several pictures and posts taunting their virtual opponents.In retribution, social media pages are being blown up with Turks vs. Greeks. Comment sections, messages, tweets – everything is fair game right now. The creativity on both parts of the cyber war is impressive; from the hacking to the teasing.In fact, included in the taunts is a picture of Recep Tayyip Erdogan placed next to a picture of Gollum from the LoTR series. If you remember back to 2016, this picture (along with several others) literally got the creator prison time AND loss of parental custody rights.But all is fair in love and war . . . right? Now we wait to see who really comes out on top."}, {"topics": ["Hacking News", "News"], "title": "Two UK Men Arrested for Conspiring to Hack Microsoft", "authur": "Mandee", "date": "June 24, 2017", "body": "Two men from Lincolnshire and Bracknell were recently arrested after scheming to gain unlawful entrance to Microsoft’s network. The men, aged 22 and 25, aimed to hack the network in effort to obtain customer data.Microsoft noticed some red flags earlier this year, when the suspects repeatedly tried to intrude the Redmond giant’s networks. Despite the arrest being of just two hackers, the entire cybercriminal group is said to be large and continuously expanding.“This group is spread around the world and therefore the investigation is being coordinated with our various partners. We’ve made two arrests in the UK this morning and have seized a number of devices. We are still in the early stages of this investigation and will work with our partners to ensure that cyber criminals have no place to hide.”Microsoft has also confirmed the failed hacking attempt; assuring their users that no information has been compromised. With the amount of cyber-security tools at their clearance – including their scheduled attainment of Hexadite – it’s no surprise that Microsoft has dissatisfied these attempts.Back in January, Microsoft also released a statement claiming that their annual investment for cyber security is over $1 billion. In response to the recent hacking attempt, Microsoft’s vice president (Tom Burt) has released another statement.“Today’s action by authorities in the UK represents an important step. Stronger internet security depends on the ability to identify and prosecute cybercriminals.This requires not only a strong technical capability, but the willingness to acknowledge issues publicly and refer them to law enforcement. No company is immune from cybercrime. No customer data was accessed, and we’re confident in the integrity of our software and systems.We have comprehensive measures in place to prevent, detect, and respond to attacks. We also have specialist teams focused on working with law enforcement to identify people who attack either us or our customers, and we’re committed to fast and effective action against attackers.”"}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Hacker used a bank vulnerability to steal funds", "authur": "Eslam Medhat", "date": "June 24, 2017", "body": "A computer hacker (James Ejankowski, 24 years old) stole about £100,000 from his bank after finding a loophole, then claimed that he won the money from a scratchcard.James transferred the money through his partner’s account, and he used the stolen money to buy a BMW car and getting a face tattoo.The hacker was able to use a software advantage to transfer money from his current account to his savings account for an hour between midnight and 1 am, the money will transfer even if the account did not have enough money and the bank would not know.“He transferred £53,399 to his partner Charlotte Slater’s Natwest account, and he transferred £1,362 to his father-in-law’s account which was transferred to other relatives and also used to pay off debts. He told his father-in-law that he had won the money on a Scratchcard.”“Out of the £99,000 he said he had only £40 left. He said he bought a BMW and a Range Rover and he had given a couple of thousand pounds to his aunt, and he told his partner and his father-in-law that he had won the money on a Scratchcard.”The lawyer said that James will pay all the money back when he is able to do so."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized"], "title": "The Private Beta Builds and a part of source code in Windows OS has been Leaked [32TB]", "authur": "Harikrishna Mekala", "date": "June 24, 2017", "body": "The dump seems to contain a number of Windows 10 builds from the advancement of codenamed Redstone 2. Redstone 2 was released beginning this year, branded as the Creators Update.Some of those builds are built for 64-bit ARM chipsets, and some are said to include special debug symbols. Microsoft routinely releases debug models for Windows. these symbols contain supplementary information not found in the compiled Windows binaries because it helps software developers know which functions their code is calling. The symbols normally released are public symbols while they recognize many functions and data structures, they don’t include information about each function’s variables or arguments. The private symbols, in contrast, include much more comprehensive information, giving much more perspicacity into what each piece of code is doing and how it’s doing it.The leak is further described as containing a reference code package named the “Shared Source Kit.” This is a bundle of source code for things like the USB, storage, and Wi-Fi stacks, and the Plug-and-Play operation. It isn’t the core operating system code but preferably contains those parts of the driver stack that third parties have to interact most closely with.Finally, this leak is said to contain variants of the Windows 10 “Mobile Adaptation Kit,” which is used to group system images for Windows on phones.The source of the leaks is currently anonymous, though theorized to have been Microsoft’s own systems. The Register and other journals suggest that the source code leak will be of grave security consequence that the insignificant publication of parts of the Windows source will unleash a bombardment of attacks. The Windows 2000 code leak did not resemble to result in a spate of exploits, and today’s Windows code is likely to be in rather better shape than that of 2004.BetaArchive says that it has removed the Shared Source Kit from its servers in response to The Register’s article. It also alleges that the private beta builds come from an array of sources, not any one singular leak. BetaArchive also says that the leaks are dubious to be linked to arrests made in the UK of two men over ideas to hack into Microsoft.Take your time to comment on this article."}, {"topics": ["Hacking Challenges", "Hacking News", "News"], "title": "Turkish Hackers vs. OP Anonymous Greece in the Ultimate Cyber War", "authur": "Mandee", "date": "June 24, 2017", "body": "Some drama has been circulating the media between Turkey and Greece with the recent “Hagia Sofia incident”. In response to the spectacle, a Turkish hacking group (Aslan Neferler Tim) retaliated by targeting the Greek Prime Minister’s webpage.“The duty is ours to answer to the Greek reaction to the prayer in Hagia Sofia. Tsipras do not be surprised, do not make us lose our patience.”Of course, OP Anonymous Greece retaliated almost immediately. If you navigate to OP Anonymous Greece’s social media – their Facebook in particular – it becomes clear that the tension has been bubbling for a while now.Of course, OP Anonymous Greece retaliated almost immediately. If you navigate to OP Anonymous Greece’s social media – their Facebook in particular – it becomes clear that the tension has been bubbling for a while now.The group talks about the “constant Turkish violations of air and sea”, and how the recent hacking of the Greece PM page has induced a “cyber war”. The Turkish hackers are no strangers to confrontation however, and are eagerly verbally and virtually attacking their opponents back.[TRANSLATED TO ENGLISH]“Turkey Turkey, how many times we have told you that Greek Hackers and Anonymous are 100 times stronger than you. It’s probably time you to know our real power. You dropped a Greek website; you will lose 100 of yours.We’re coming! We just started. Agia Sophia belongs to the Greeks. You cannot do anything. Your Turkish TV24 Channel is under attack by Greek Hackers and Anonymous.”The group kept true to their promise, as just an hour later their attacks began. The website [www.yirmidort.tv] was the first target, followed by the threat of other government, TV, and banking websites. OP Anonymous Greece is calling for a “total cyber war”, and Turkey is only happy to oblige.[TRANSLATED TO ENGLISH]“Tomorrow 12:00 noon begins mass attacks on Turkish websites. Over 200 Turkish government websites will fall into the hands of Greeks anonymous. You started it and now you won’t be able to stop it with anything because we’re Greek! #Opanonymousgreece”It’s clearly too late for this cyber war to turn to dust. We’re about to find out what exactly happens when two hacking groups are put against each other."}, {"topics": ["Cyber Attack", "Hacking News", "Vulnerabilities"], "title": "Airway Oxygen Comes Public with Recent Ransomware Attack on PHI", "authur": "Mandee", "date": "June 24, 2017", "body": "Michigan-based healthcare company, Airway Oxygen, recently sent out letters to patients informing them of a recent ransomware attack affecting their PHI (protected health information).“PHI involved in the breach included some or all of the following information: full names, home addresses, dates of birth, telephone numbers, diagnoses, types of services provided, and health insurance policy numbers.However, bank account numbers, debit or credit card numbers, and Social Security numbers were not involved, Airway Oxygen maintained.”An OCR data breach reporting tool came back with over 500,000 individuals affected by the ransomware. As a result of the widespread attack, Airway Oxygen has enlisted the help of a cybersecurity firm.The hopeful outcome is the advancement of security implementations; preventing similar attacks from being administrated in the future. Victims involved in the data breach are also urged to change passwords, request new credit cards/debit cards, and keep a close eye on banking information.“Since learning of the incident, we immediately took steps to secure our internal systems against further intrusion, including by scanning the entire internal system, changing passwords for users, vendor accounts and applications, conducting a firewall review, updating and deploying security tools, and installing software to monitor and issue alerts as to suspicious firewall log activity.”With recent cyber-attacks like WannaCry, all companies – not just healthcare – should be strengthening their cyber security operations.We are in a day and age that is built on technology; the good and the bad. In order to rise above the new threats plaguing the virtual world, everyone needs to do all they can to protect themselves and their information.Take some time to research cyber security tutorials and tips. You won’t regret it; especially when the next wave of ransomware hits."}, {"topics": ["Did you know ?", "Hacking News"], "title": "More Vault 7 Series Released by WikiLeaks: Introducing Brutal Kangaroo", "authur": "Mandee", "date": "June 24, 2017", "body": "In the beginning of March, WikiLeaks started their new (and very popular) series of leaks dubbed “Vault 7”. To date, Vault 7 is the largest publication of classified documents from the U.S. Central Intelligence Agency.“[Year Zero] comprises 8,761 documents and files from an isolated, high-security network situated inside the CIA’s Center for Cyber Intelligence in Langley, Virginia. It follows an introductory disclosure last month of CIA targeting French political parties and candidates in the lead up to the 2012 presidential election.”Just recently, WikiLeaks released another part of the series in the form of a user manual filled with hacking tools belonging to the CIA. The specialty of the tools is infecting air-gapped PCs through USB drives. The set of tools is called Brutal Kangaroo.Just recently, WikiLeaks released another part of the series in the form of a user manual filled with hacking tools belonging to the CIA. The specialty of the tools is infecting air-gapped PCs through USB drives. The set of tools is called Brutal Kangaroo.The tools included in Brutal Kangaroo make it possible to obtain classified data from targeted networks. These tools are Drifting Deadline, Shattered Assurance, Shadow, and Broken Promise. The process/execution is also fairly simple.Starting out, the operator of Brutal Kangaroo can utilize Drifting Deadline to produce and insert malware. They can then use that malware in a two-staged procedure of infecting air-gapped systems.“Initially, the attacker, or in this case the CIA, can infect a targeted computer called the primary host. The malware is injected into this PC and when a user inserts a USB drive into it, the malware, through Shattered Assurance generates a more powerful virus and loads it in the USB.Once the user inserts this USB into another PC, the more powerful malware affects this new PC, and the chain goes on depending on how many more computers share the USB.”If the idea of Brutal Kangaroo being on the loose concerns you, consider using one of the antivirus programs that detects the bug: Rising Antivirus, Symantec, Avira, and Bitdefender."}, {"topics": ["Hacking News", "News"], "title": "CIA Contractors Hack Vending Machines, Stealing 3000$+ of Snacks", "authur": "Mandee", "date": "June 24, 2017", "body": "If you were a contractor for the CIA, what would you use your intelligence and talents for? Surely most people think, “I’d use my intelligence for my work”. That’s the point, isn’t it?In 2012-2013, several CIA contractors had a different idea. Instead of using their genius for the obvious intent in which they were hired, they put their talents into hacking a vending machine . . . of all things!The suspects stole $3,314.40 in products by unplugging a cable that connected the machines to an electronic payment system called FreedomPay. They then used “unfunded FreedomPay cards” to purchase the products for free.“The machines take payment via prepaid cards, but one contract worker realized he could use a dummy card with no money on it if he simply unplugged the so-called “FreedomPay” system so it could not connect to payment servers.”Of course, it didn’t take atrociously long for the Virginia-based establishment to notice the stealing. Throwing up their signature cameras, it wasn’t long before the CIA caught their thieves red-handed.“[OIG installed] surveillance cameras at several key vending locations where a high occurrence of thefts were taking place. Video footage recovered from the surveillance cameras captured numerous perpetrators engaged in the FreedomPay theft scheme, all of whom were readily identifiable as Agency contract personnel.”Clearly, the CIA contractors involved in the FreedomPay scheme are no longer working with the CIA. Although little information has been released on their consequences, they were obviously fired and face future challenges in finding similar careers.This situation just goes to show that sometimes . . . hacking just isn’t worth it. At the very least, use your damn brain before literally ruining your life. Besides, if you work for the CIA in the first place, you can probably afford to spend a few dollars on snacks."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "WannaCry ransomware still alive!", "authur": "Eslam Medhat", "date": "June 22, 2017", "body": "The WannaCry ransomware still alive and has infected Honda Motor Company and 55 speed and traffic light cameras in Australia.It was a hard attack for many organizations all over the world, a new ransomware attack called ‘WannaCry’ is spreading by exploiting the SMB vulnerability and is encrypting files and changing the extensions to .wnry, .wcry, .wncry and .wncrypt. that started its attack against hospitals across the UK before spreading across the globe.Honda Motor Corporation published a report this week, the company said that it was forced to stop its production for longer than 24 hours at one of the Japan-based factories after discovering that the WannaCry infections in factory networks.It seems that the operating systems within the Honda network were out of date and it did not install the latest critical patch that has been released by Microsoft.Another victim of the recent WannaCry ransomware was detected in Australia, the Police verified that the WannaCry has hit 55 red light cameras and speed cameras in Victoria.“A system patch has been applied, which prevents the spread of the virus,” a Justice and Regulation spokesperson said.“The Department is in the process of removing the virus from the affected cameras. The remaining sites will be rectified in the next couple of days.“The software virus has not impacted the accuracy of the camera system. All infringements during this period have been captured correctly, and no infringements have been affected by the virus.”"}, {"topics": ["Cyber Attack", "Hacking News", "News", "Vulnerabilities"], "title": "Hackers used NSA’s exploit to Infect users’ computers and mine Cryptocurrency", "authur": "Harikrishna Mekala", "date": "June 22, 2017", "body": "Blackhat Hackers have developed Windows Malware that takes advantage of the recently disclosed NSA Hacking Tool by installing the Malware and making your computer a cryptocurrency miner.The Malware came to be known as the Trojan.BitMine.1259 which was spotted last week by Russian antivirus Developer Dr.Web.They published in the report saying that NSA implant uses DOUBLEPULSAR to attack the Windows Machines that still run on unsecured SMB Services which helps the attackers to execute the malicious code on compromised Windows Machines.The intentions of the DOUBLEPULSAR malware is to make your PC into a CryptoCurrency Miner.The Malware is designed to check the System Resources available for it to execute. Experts are saying that it’s a combination of various packages such as GhostRAT which is used to communicate with its C&C server and monitor the local system in Layman’s Terms it will shutdown itself whenever you use the task manager.To attack a large group of Nodes the Malware developed for X86 and AMD64 architecture and use different instruction set based on the resources available in the computer. They used this malware to mine Monero, a new cryptocurrency which may be considered a standard currency in the future. EternalMiner, A Miner that mines Monero on Linux Servers which was detected last week attacking servers via SambaCry Vulnerability.While Many People are involved in the DOUBLEPULSAR with WannaCry ransomware outbreak which was used as a Recursing SMB Worm also deployed in other Malware Campaign before.The Hackers have infected up to 100,000 Computers when the Shadow Brokers released the Malware Online.Previous Week, Founder of Shodan John Matherly said that the number of infected PC’s has gone down for more than 16,000 Window Machines.He summarizes that the malware didn’t affect the systems of users who updated their systems.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "55 RedLight and Speed Cameras are affected by WannaCry in Australia", "authur": "Harikrishna Mekala", "date": "June 22, 2017", "body": "The event took place last week and was led to light by a local radio station. According to current news, the infection took place while maintenance operations, as a human operator, connected an infected USB to the cameras, which were apparently operating on a Windows OS.The cameras are owned by Redflex, a government contractor, and were placed on Victorian highways and street crossings. Because the cameras were not connected to the Internet or each other, the WannaCry Ransomware was contained within the device.Despite being affected, the cameras remained online and maintained to function, although they rebooted every few minutes. Authorities say speed and red-light violation notices issued in that period will remain valid.A spokesperson for the Victoria Justice and Regulation Department verified the incident on Monday. The official said camera maintenance workers had installed patches to stop the ransomware from taking root.“A system patch has been installed, which prevents the spread of the virus,” the spokesperson told AW3, the local radio station who revealed the outbreak. “The Department is in the process of removing the virus of the affected cameras. The remaining sections will be rectified in the next couple of days.”Despite doing most of its damage in mid-May, the WannaCry Ransomware proceeds to wreak havoc on the world, as it finds new PCs to infect, referring to persons or organizations that have failed to see Microsoft’s advice and install MS17-010, a security news that negates WannaCry’s primary infection vector.Take your time to comment on this article. "}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Minnesota Government Is Hacked in Response to Yanez Verdict", "authur": "Mandee", "date": "June 21, 2017", "body": "If you’ve been following the news, you might have heard about Philando Castile. On July 6, 2016, he was shot and killed by an officer after being pulled over for resembling a suspect in a robbery.The officer, Jeronimo Yanez, asked Castile for his license and registration. While reaching for it (and pulling his arm back after Yanez yelled to), he was shot at seven times.At the time of his death, Castile was accompanied in the vehicle by his girlfriend and his four-year-old daughter. Even more gruesome was the fact that Castile’s girlfriend live-streamed the entire aftermath of the shooting.The circumstances of the coldblooded event caused mass anger across the country. The video had millions of views by the following morning.Just recently, that mass anger was resurrected when Yanez was acquitted of his crimes. In retaliation to the Yanez verdict, a hacker decided to target the Minnesota government.The cyber-attack, confirmed by Minnesota’s Information Technology Services department, involved the theft of emails and passwords found in the Minnesota database.Calling themselves “Vigilance”, the hacker made their intention clear on twitter with the statement: “Justice for #PhilandoCastile MN.gov and mnstate.edu Hacked.”According to Vigilance, they gained access to thousands of emails/passwords before mass dumping the sensitive information online. Those that know where to look now have access to the accounts and the information on the accounts.“I thought I had to do something against what I found to be unjust. This was a failure of justice. And his family won’t get the satisfaction of knowing the one who killed Philando is rightly punished. An innocent man died. And a guilty one lives freely.”Hackers that want their voices to be heard are terrifying, but in this scenario it’s not exactly unwarranted. Vigilance is doing what they think is a justice to Philando Castile. We can only hope it doesn’t bite them in the ass in the future."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "web hosting company (NAYANA) will pay $1 million to a Ransomware", "authur": "Eslam Medhat", "date": "June 20, 2017", "body": "A web hosting company based in South Korea NAYANA has been infected with a ransomware called Erebus, the malware has infected 153 servers that run Linux OS and more than 3,400 business websites the company hosts.The company ( NAYANA) said that the hackers required an unusual ransom of 550 Bitcoins (cryptocurrency), or pay US$1.62 million, in order to restore the affected/encrypted files from all the affected servers. NAYANA negotiated a payment of 397.6 BTC (around $1.01 million as of June 19, 2017) to be paid in installments.The web hosting company has now paid two payments at the time of writing and would pay the last payment of ransom after restoring the data from two-third of its infected servers.\nTrend Micro (security firm) said:\n“Erebus was first seen on September 2016 via malvertisements and reemerged on February 2017 and used a method that bypasses Windows’ User Account Control. Here are some of the notable technical details we’ve uncovered so far about Erebus’ Linux version”“NAYANA’s website uses Apache version 1.3.36 and PHP version 5.1.4, both of which were released back in 2006. Apache vulnerabilities and PHP exploits are well-known; in fact, there was even a tool sold in the Chinese underground expressly for exploiting Apache Struts. The version of Apache NAYANA used is run as a user of nobody(uid=99), which indicates that a local exploit may have also been used in the attack.”Users are recommended to do the following:"}, {"topics": ["Cyber Attack", "Hacking Challenges", "Hacking News"], "title": "Anonymous Proposes a “Hacking Thailand” Campaign. . . Again", "authur": "Mandee", "date": "June 20, 2017", "body": "Towards the end of 2016, Anonymous formed a campaign targeting Thai government. The Thai government thought it’d be a good idea to offer up a bill regarding the internet (of all things). In this bill, they proposed that the entire country’s internet traffic be routed through one single gateway.Thus . . . #OpSingleGateway was born. Shortly after the campaign started gaining virtual momentum, members of the hacktivist group organized a “hand-cranked DDoS attack” against thaigov.go.th (Thai government) and mict.go.th (Ministry of Information/Communications/and Technology).“The hacktivism group used social media sites such as Twitter and Facebook and urged Thai citizens to access these two websites and repeatedly refresh the page, resulting in a manual DDoS attack that overwhelmed the two websites.”The outcome: complete surrender. The Thai government dropped the bill and all went back to hunky dory normal . . . Until the beginning of 2017, when Thai government made alterations to their standing Computer Crime Act.“Ministry of Information and Communication Technology, which proposes an amendment to Article 20 of the Computer Crime Act. The amendment will provide the Ministry of Information and Communication Technology (MICT) with the authority to access, block or delete encrypted content on websites. The Minister may issue a regulation for Internet Service Providers to delete or restrain the dissemination of computer data, in accordance with evolving technology.”Despite a campaign not unlike #OpSingleGateway and several cyber-attacks following the campaign, the Thai Government still passed the amendment(s). However, Anonymous and other hacktivist groups still try to fight back in the only way they know how: hacking, hacking, and more hacking.“We can’t wait! Our Weapons is ready for this Cyber Attack on Thai Gov’t ! #ExpectUs #OpAnonymousGreece #AnonymousThailand #OpSingleGateway”Their effort is pure dedication. On the other hand, their effort might also be futile in the end. Who knows?"}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Moroccan Hackers attacked 4 schools in Florida", "authur": "Eslam Medhat", "date": "June 19, 2017", "body": "Hackers from Morocco succeeded to break defenses of different school area networks. The main aim of the group was to attempt and obtain a way into the sensitive government systems from there. The United Data Technologies (UDT) which is a company that studies such breaches said that the hackers succeeded to get into these networks via phishing attacks.The group, identified as “MoRo”, is told to have infected the school networks with malware which kill the processes of logging software, enabling them to probe and test the systems for three months.The attackers affect their victims in the form of a phishing email, by attracting users into clicking on a booby-trapped image.“They infected the systems with malware — malicious software — that turned off the logs recording who accessed the systems, according to United Data Technologies, the Doral-based cybersecurity company that investigated the incidents. For three months, the hackers probed the systems, mapping them out and testing their defenses. At one point, they even posted photos of someone dressed as an ISIS fighter on two school district websites.”“They weren’t just looking for the names of kids and valuable Social Security numbers, UDT found. The hackers were also searching for some way to slip into other sensitive government systems, including state voting systems.”"}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Mexican Government used “Pegasus” to spy on Journalists, Activists & their families", "authur": "Eslam Medhat", "date": "June 19, 2017", "body": "Most famous human rights lawyers, activists and journalists in Mexico have been targeted by a professional spyware called “Pegasus” sold to the government of Mexico to be used only to study criminals and terrorists.At least three Mexican federal agencies have bought about $80 million worth of advanced spyware produced by an Israeli cyberarms company. The software, identified as “Pegasus”, that has been used to penetrate smartphones to spy on every detail of a person’s cellular life such as calls, texts, email, contacts and calendars. Pegasus also can use the microphone and camera of the smartphones for monitoring, turning a target’s phone into a personal bug.The NSO Group (the company that creates the software) said that it sells the spyware software only to governments, with a clear agreement that it will be used only to fight terrorists or the drug gangs and criminal organizations.The victims had received over 76 messages with links to NSO Group’s exploit framework were sent to Mexican journalists, lawyers, and a minor child (NSO Group is a self-described “cyber warfare” company that sells government-exclusive spyware).Once the victims view the messages and open the links, the malware will be downloaded onto their smartphones, making the victim’s smartphone into a spying tool, putting the victims fully under the control of the operator."}, {"topics": ["Hacking News"], "title": "The newest attack for stealing network data!", "authur": "Eslam Medhat", "date": "June 18, 2017", "body": "Israeli cyber security expert reveals the newest attack for stealing network data.Security researchers at the Ben-Gurion University of the Negev (BGU) found that attackers can secretly obtain data (such as encryption keys, passwords and files) from extremely secure or air-gapped networks via the row of status LEDs that exists in networking devices such as LAN routers and switches.I assume that you have noticed routers and switches flashing to show that data is being transferred and your Internet is connected. But a malware can infect your router and make the device LEDs to flash very fast in a series that an attacker or hacker with internal access to a remote or local camera, or with a light sensor hidden in the room, can record the LED’s sequences and decode the signals.The Israeli cyber security researchers made their own malware application that is called xLED that is work by infecting the firmware of the router and enabled the attackers to steal network data.The malware can make the router’s LEDs to flash quickly like 1,000 flashes per second for each LED. Since a normal router or switch holds six or more status LEDs, thousands of bits per second can be encoded.\n"}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Buckle confirms it suffered a credit card breach!", "authur": "Eslam Medhat", "date": "June 17, 2017", "body": "The Buckle, Inc. is a United States fashion retailer selling clothing, footwear, and accessories for men and women. The company operates 465 stores in 44 U.S. states.“On Friday morning, KrebsOnSecurity contacted The Buckle after receiving multiple tips from sources in the financial industry about a pattern of fraud on customer credit and debit cards which suggested a breach of point-of-sale systems at Buckle stores across the country.” reported KrebsOnSecurity.The company (Buckle) said:\n“We became aware that The Buckle, Inc. was a victim of a security incident in which a criminal entity accessed some guest credit card information follow purchases at some of our retail stores. We immediately launched a thorough investigation and engaged leading third-party forensic experts to review our systems and secure the affected part of our network.”The company recognized malware on certain retail store location point-of-sale (POS) systems. The malware obviously was created to steal payment card information (account number, account holder’s name, and expiration date) from cards used in the affected POS devices in retail stores.The company assumes that several payment cards used in its stores between October 28, 2016 and April 14, 2017 may have been stolen. It currently thinks that the malware did not collect information from all transactions or all POS systems for each day within that time period."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Be careful! your E-Cigarette can be used to hack your computer", "authur": "Eslam Medhat", "date": "June 17, 2017", "body": "Ross Bevington (a security researcher) found that an E-cigarette can hack a computer by fooling it to think that it was a keyboard. It was also able to hack the computer by interfering with its network traffic.For those unfamiliar, an electronic cigarette or e-cigarette is a handheld electronic device that creates an aerosol by heating a liquid. The user then inhales the aerosol. Using e-cigarettes is sometimes called vaping. The liquid in the e-cigarette, called e-liquid, is usually made of nicotine, propylene glycol, glycerine, and flavorings.Hackers always trying to find new methods to hack their victims. This security issue happens because most of the e-cigarettes come with a rechargeable lithium-ion battery, that can be plugged into a cable or directly connects to the USB port of the computer.The researcher said to SkyNews:\n“He had modified the vape pen by simply adding a hardware chip which allowed the device to communicate with the laptop as if it were a keyboard or mouse – A pre-written script that was saved on the vape made Windows open up the Notepad application and typed “Do you even vape bro!!!!”E-cigarettesers users are recommended to disable data pins on the USB and keep only cable charge to prevent any data exchange between the devices it connects to avoid such attacks."}, {"topics": ["Cyber Attack", "Hacking News", "Vulnerabilities"], "title": "UK Citizen Behind Hacking of US DoD Communication Systems Pleads Guilty", "authur": "Mandee", "date": "June 17, 2017", "body": "Three years ago, 25-year-old Sean Caffrey hacked into the United States Department of Defense communications system. With access to classified information and private documents, the UK citizen stole a wide variety of data.Included in the compromise were names, positions, email addresses/phone numbers belonging to DoD workers, and IMEI numbers for DoD satellite phones.“The hack took place back on June 15, 2014, when Caffrey broke into the DoD’s Enhanced Mobile Satellite Services (EMSS) satellite phone network and stole the details of 800 people and 34,400 devices.”Although Caffrey had access to all of this classified information, he didn’t try to make a profit off of it. In fact, his intent barely reached the general public. Screenshots of the data were posted online, as well as a cryptic nonsensical message from Caffrey calling out a fellow hacking group.“We smite the Lizards, LizardSquad your time is near. Were in your bases, we control your satellites. The missiles shall rein upon thy who claim alliance, watch your heads, ** T-47:59:59 until lift off. We’re one, we’re many, we lurk in the dark, we’re everywhere and anywhere. Live Free Die Hard! DoD, DISA EMSS : Enhanced Mobile Satellite Services is not all, Department of Defense has no Defenses.”Caffrey underestimated the NCA, however. A recently released statement boasts on the solid case they have against the hacker, including a digital trace of the attack to Caffrey’s home computer. In the midst of his eager hacktivist mindset, Caffrey also forgot to delete the evidence off of his hard drive.Although the extent of his consequences has yet to be released, the defendant did cause damages totaling $628,000. Keeping this in mind, it is very unlikely that Caffrey will be seeing the outside of a jail cell anytime soon."}, {"topics": ["Cyber Attack", "Hacking Challenges", "Hacking News"], "title": "White-Hat Ltd Infiltrates Underground Schemes on the Dark Web", "authur": "Mandee", "date": "June 15, 2017", "body": "White knights exist on the internet in every form. This includes white knight hackers (for lack of a better term). In particular: a group known as White-Hat Ltd.“White-Hat Ltd. Is a Cyber consultancy employing only highly professional and trained experts, all with by the HLS and Israeli security forces background and expertise in order to keep the highest standards in Cyber Intelligence Consulting Services.”The group’s objective is infiltrating the dark web for leaked information on upcoming cyber-attacks. Due to this, White-Hat Ltd is extremely secretive.The group’s objective is infiltrating the dark web for leaked information on upcoming cyber-attacks. Due to this, White-Hat Ltd is extremely secretive.The only members even photographed in the organization are the managers/administrators. Even then, those that are photographed are quick to hide their identities in fear of exposure.It’s no surprise or secret that cyber-attacks have been plaguing machines worldwide lately. Knowing that a white knight hacker group like White-Hat Ltd is on our side is a comfort . . . at the very least.“They plow through the web, set up false and numerous virtual identities, or so-called online avatars; they infiltrate hacker groups and forums to discover planned cyber-attacks, then prepare their clients before they occur. Watching them work is a bit like watching the latest season of “Homeland” or the movie “Snowden”: their screens are filled with diagrams and dots that connect one person or event to many, many others.”With only 34 members in the group, White-Hat Ltd is also a tight-knit community. Rumors suggest that they were aiming to purchase The Shadow Broker’s monthly service subscription in order to prevent massive online disarray after its release.Although it’s unknown on whether they were successful, the general public is crossing their fingers. If we could avoid another massive cyber-attack thanks to White-Hat Ltd, they will truly earn the title of white knight hackers. "}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Malicious “Antivirus” Apps are Everywhere", "authur": "Eslam Medhat", "date": "June 15, 2017", "body": "After the WannaCry attack, Antivirus apps now promising to protect your smartphone from the universal ransomware attack.WannaCry ransomware attack had affected more than 200,000 computers in 150 countries. The malware controlled and encrypted the users’ files and required payments. The malware doesn’t target phones, it used a vulnerability that has been discovered by the National Security Agency (NSA) and leaked by hackers, that targeted outdated Windows systems.A cyber security firm called RiskIQ discovered hundreds of apps that supposed to help defend mobile phones, but instead of that, they affecting users by pushing adware, trojans, and other malware.“Using a title search for “Antivirus” resulted in 6,295 total apps, past and present, claiming to either be an antivirus solution, review antivirus solutions or be associated with antivirus software in some way. More than 700 of these apps triggered blacklist detections from the aggregated antivirus vendors in VirusTotal. Trimming the dataset to compare apps only coming from the Google Play store showed 655 results. Of those, 131 had triggered blacklist detections.”Users are recommended to do the following to stay secure:\n– Only download apps from official stores.\n– Always review the requested permissions, make sure the app author email address is not a free email service like Gmail or Yahoo.\n– Review the app description to check if it is riddled with grammatical errors.\n– Check the app against known blacklists. VirusTotal provides a great starting point."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Windows XP Receives More Updates To Avoid Another WannaCry Attack", "authur": "Eslam Medhat", "date": "June 14, 2017", "body": "Microsoft releases new security fixes for 96 security bugs and is also considering the unusual step of releasing some fixes for the older and unsupported Windows XP operating system.The new patch brings updates and fixes for various remote code execution (RCE) bugs in Windows, Microsoft Edge and Microsoft Office which could be exploited remotely by attackers to obtain full control over affected machines.Adrienne Hall (General Manager, Cyber Defense Operations Center) said:\n“In reviewing the updates for this month, some vulnerabilities were identified that pose elevated risk of cyber attacks by government organisations, sometimes referred to as nation-state actors or other copycat organisations,”“To address this risk, today we are providing additional security updates along with our regular Update Tuesday service. These security updates are being made available to all customers, including those using older versions of Windows.”This is not the first time Microsoft has had to return and update Windows XP. Just last month Microsoft has released an update for XP that protected users from the WannaCry ransomware. Microsoft said that all Windows operating systems with automatic updates option enabled will receive the patch soon. Any user still running a Windows XP might have updates turned off seeing as there weren’t supposed to be any. They can be manually installed via the Download Center or in Windows Update."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Industroyer malware can cause electric power outage!", "authur": "Eslam Medhat", "date": "June 13, 2017", "body": "The 2016 cyber attack (latest December) on Ukraine’s Electric power network made the power outage for thousands of citizens for an hour and fifteen minutes in Kiev, ESET security researchers have analysed samples of malware, detected by ESET as Win32/Industroyer, capable of performing exactly that type of attack.The malware has been called “Industroyer” or “CrashOverRide”. Security researchers said that “CrashOverRide” is one of the largest threat meant to damage manufacturing control systems, after Stuxnet, the first malware allegedly developed by the USA and Israel to destroy the Iranian nuclear facilities in 2009.Anton Cherepanov (security researcher from ESET) said:\n“Industroyer is a particularly dangerous threat, since it is capable of controlling electricity substation switches and circuit breakers directly. To do so, it uses industrial communication protocols used worldwide in power supply infrastructure, transportation control systems, and other critical infrastructure systems (such as water and gas).”“These switches and circuit breakers are digital equivalents of analogue switches; technically they can be engineered to perform various functions. Thus, the potential impact may range from simply turning off power distribution, cascading failures and more serious damage to equipment. The severity may also vary from one substation to another, as well. Needless to say, disruption of such systems can directly or indirectly affect the functioning of vital services.”The malware is not exploiting any application vulnerabilities, it only depends on four industrial communication protocols used worldwide in power supply infrastructure, transportation control systems, and other critical infrastructure systems.“Industroyer is modular malware. Its core component is a backdoor used by attackers to manage the attack: it installs and controls the other components and connects to a remote server to receive commands and to report to the attackers.”"}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Hundreds of Apps on Google Play Store affected by “Xavier” Malware", "authur": "Eslam Medhat", "date": "June 13, 2017", "body": "Trend Micro security researchers recently found a Trojan Android ad library called Xavier (Identified as ANDROIDOS_XAVIER.AXM), the malware takes and leaks the victim’s information quietly.Over 800 various Android apps that have been downloaded by millions of users from the Store found to be affected with malware ad library that quietly collects sensitive user data and can perform critical actions. These apps range from utility apps such as photo manipulators to wallpaper, anti-virus, volume booster, speed booster, video converter, call recorder, and ringtone changers.Trend Micro researchers said:\n“Xavier’s stealing and leaking capabilities are difficult to detect because of a self-protect mechanism that allows it to escape both static and dynamic analysis. In addition, Xavier also has the capability to download and execute other malicious codes, which might be an even more dangerous aspect of the malware. Xavier’s behavior depends on the downloaded codes and the URL of codes, which are configured by the remote server.”Recommendations:\nThe simplest method to evade a clever malware like “Xavier” is to not install apps from unknown sources, even if they are from legitimate app stores like Google Play.Also reading reviews from other users who have downloaded the app will be useful. Users can be an excellent reference of insights, especially if they can indicate whether a specific app shows suspicious behaviour. Also updating and patching mobile devices will help users to have better security."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "The Cyber Weapon is already causing Blackouts even after the U.S Power Companies got warned", "authur": "Harikrishna Mekala", "date": "June 13, 2017", "body": "Technical support responded to the Pivnichna substation and took the automated circuit breakers off computer control, restoring power a little after 1 a.m. It was only the second confirmed case of a computer hack triggering an electrical blackout, and compared to the first, 12 months earlier also in Ukraine—it was a buzz, affecting far fewer customers and for a small bit of the time. In the six months since the Kiev attacks, security researchers have wondered why the hackers even bothered with such fleeting disruptions and speculated that someone was using Ukraine as a testing ground for more serious attacks.Now that assessment seems to be confirmed. Researchers at two security companies on Monday announced they’ve found and analyzed the malware that triggered the Kiev blackout, and it’s far bitter than imagined. The computer code, dubbed as “CrashOverride” by Maryland-based Dragos, and “Industroyer” from ESET in Slovakia, is a genuine cyber weapon that can map out a power station’s control network feeds and, with minimal human guidance, issue malicious commands directly to most critical equipment. Only once before has the world seen malware designed for such destruction, with the 2010 Stuxnet virus used against Iran’s nuclear programs. CrashOverride is the first to target civilians and the first such malware built to target a nation’s power supply.It’s unclear who built CrashOverrride. Both ESET and Dragos say it was built from scratch, leaving none of the usual digital fingerprints that allow analysts to link one hacking campaign to another. Ukraine has faced a near-biblical plague of a cyber attack since entering into hostilities with the Soviet Union three years ago, and many have led unequivocally to Moscow. But not so with CrashOverride Virus.“It’s a nightmare,” Lee said. “The malware in its current state would be able to hack every power plant in Europe. This is a framework designed to target other places.”“We believe that our current protective measure is to provide an initial barrier,” said Marcus Sachs, NERC’s chief security officer, “and we are providing additional technical information to North American utility specifics to this malware.”CrashOverride marks a significant escalation in the electronic arms race, at a time of overt saber cyber-rattling from U.S. adversaries like Russia and North Korea, and increasingly loud warnings about the vulnerability of the power grids. Last January, the Department of Energy assessed that the U.S. now faces “imminent danger” of a cyberattack that would trigger a prolonged cascading outage that would “undermine U.S. lifeline networks, critical defense infrastructure, and much of the economy; it could also endanger the health and safety of millions of citizens.”"}, {"topics": ["Hacking Challenges", "Hacking News", "News"], "title": "UK Police Force Will Be Learning Hacktivism in Upcoming Months", "authur": "Mandee", "date": "June 12, 2017", "body": "Twenty years ago, it was not necessary for authorities to have hacking skills. In fact, there were (and still are) completely separate departments for hacking/cyber security. With the recent and abrupt rise of cyber-attacks afflicting the world, over 80% of the UK’s police force has dedicated some of their time to learning Hacktivism.There are a million reasons why authorities learning Hacktivism could be beneficial. The major value is iterated by lead cybersecurity instructor, Phil Chapman:“Back in the day the officers would just turn up, pull the electric supply out of the computer, bag it, tag it and wait for forensic investigation. This could take months before they retrieved meaningful information from the system.”Hacking is not only a recommendation for authorities today; it’s a necessity. When you’re working on a case, you need to utilize speed as much as possible. The longer you take to figure things out, the more vulnerable the situation becomes.In light of this recent proposition, UK police officers are spending every week learning cyber security training and techniques from professionals. The cyber security curriculum is filled with all of the requirements needed to achieve maximum security potential.“Their training covers every aspect of information security, from politically-motivated hacking (known as hacktivism) to encryption and cryptography. To better understand and respond to the threat of cybercrime, officers are also learning how to hack.Police get to grips with the entire process of hacking – starting from information-gathering reconnaissance to track-covering by restoring the computer to its pre-attack state. The curriculum even culminates in industry-recognised cyber security qualifications, like EC-Council’s Certified Ethical Hacker.”It is still up in the air on whether these lessons will pay off. Regardless of the outcome, authorities getting trained in cyber security are a great start. Other areas should consider taking a page out of the UK’s books and set up their own hacktivism curriculum for law enforcement officials."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Ransomware-as-a-service is now targeting Mac users", "authur": "Eslam Medhat", "date": "June 12, 2017", "body": "Mac OS users think that their computers are immune from things like ransomware attacks and think that their machines are somehow essentially protected. It is right that it’s less likely for a Mac OS user to be hit or infected with a malware than a Windows user, but this has nothing to do with the level of vulnerability in the operating system.Security researchers at FortiGuard Labs found a new Ransomware as a service that uses a website hosted in the TOR network which has become a grown trend nowadays. Cyber criminals usually attack Windows users, It’s the first time to see RaaS that targets Mac OS users.No coding experience is required. Clients can contact the author directly via email to get the malicious code through an onion website.The malware requires 0.25 bitcoin to be paid for the decryption keys. The author remits 30 percent to the Bitcoin address of his script kiddie accomplices once he’s been paid. The role of the script kiddie is limited to sharing the Ransomware using phishing emails or direct installation.Fortinet said:\n“It is not every day that we see new ransomware specifically targeting Mac OS platform. Even if it is far inferior from most current ransomware targeting Windows, it doesn’t fail to encrypt victim’s files or prevent access to important files, thereby causing real damage.”"}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Hackers used AMT to bypass Windows firewall", "authur": "Eslam Medhat", "date": "June 12, 2017", "body": "A hackers group called Platinum used Intel`s Active Management Technology (AMT) Serial-over-LAN (SOL) to cover communications from the firewall.Intel Active Management Technology (AMT) is hardware and firmware technology for remote out-of-band management of personal computers, in order to monitor, maintain, update, upgrade, and repair them.Serial Over LAN (SOL) is a mechanism that allows the input and output of the serial port of a managed system to be redirected over IP.Security researchers from Microsoft have discovered that the Platinum attackers group has started using AMT to transfer data and make the communications invisible, so they can bypass the firewall and network monitoring products.Microsoft said:\n“We confirmed that the tool did not expose vulnerabilities in the management technology itself, but rather misused AMT SOL within target networks that have already been compromised to keep communication stealthy and evade security applications.”“The new SOL protocol within the PLATINUM file-transfer tool makes use of the AMT Technology SDK’s Redirection Library API (imrsdk.dll). Data transactions are performed by the calls IMR_SOLSendText()/IMR_SOLReceiveText(), which are analogous to networking send() and recv() calls. The SOL protocol used is identical to the TCP protocol other than the addition of a variable-length header on the data for error detection. Also, the updated client sends an unencrypted packet with the content “007″ before authentication.”The following video explains how the tool can be used to transfer malware to a computer with AMT provisioned:"}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Two Tor Relays were seized by the French Police under WannaCry Investigation", "authur": "Harikrishna Mekala", "date": "June 12, 2017", "body": "The incident was reported by Aeris on the Tor Project mailing list last month, on May 15, where he asked fellow operators to whitelist two of his relays, who were also Tor entry guard nodes, special servers trusted by Tor clients as the first connection when connecting to the Tor network.The activist said police seized his servers because a big French company was infected with WannaCry two days earlier, on May 12. The company logged all outgoing traffic during the attacks and provided the data to Law Enforcement Agencies.WannaCry communicates with a command and control servers hosted on the Dark Web, on a .onion address. Aeris suspects his servers were used as first hops in this connection, hence the reason police seized his properties, hosted via French hosting provider Online SAS.Most Tor servers are configured to log very few details in their databases, such as uptime and status metrics, so to safeguard the privacy of its users. Unless Aeris made customizations to default configs, French police have no chance of finding any useful information on the seized servers and the data acquired from it.In the media storm caused by the wave of WannaCry attacks, these small incidents went unreported outside of French media. Aeris also posted the seizing of his servers on Twitter.The investigation is led by France’s cyber-crime investigation units OCLCTIC (L’Office Central de Lutte Contre la Criminalité liée aux Technologies de l’Information et de la Communication).The activists pointed out that tens of other Tor nodes in France disappeared over the same weekend. In a private conversation with Bleeping Computer, the activists shared a list of 30 servers they are currently investigating regarding these mysterious disappearances.It is unclear how many of these are related to the WannaCry attacks. Overall, there is very little information about these incidents at the current moment, as investigators have suppressed the parties involved from sharing any information.” There is currently a GAG order around this,” said Aeris. ” My provider refuses to communicate data about the seizure.”Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Now Russia can stop the Power Grids with its Cyber Weapon", "authur": "Harikrishna Mekala", "date": "June 12, 2017", "body": "There is a  malware named CrashOverride, is known to have disrupted only one energy system — in Ukraine in December. In that incident, the hackers briefly shut down one-fifth of the electricity generated in Kiev.But with modifications, it could be deployed against U.S. electric transfer and distribution systems to devastating effect, said Sergio Caltagirone, director of threat intelligence for Dragos, a cybersecurity firm that studied the malware and is issuing a report of the Malware on Monday.And Russian government hackers have already shown their interests in targeting U.S. energy plants and other utility systems, researchers said.“It’s the culmination of over decades of theories and attack scenarios,” Caltagirone warned. “It’s a game changer.”The revelation comes as the U.S. government is investigating a wide-ranging, ambitious efforts by the Russian government last year to disrupt the U.S. presidential elections and influence its outcome. That campaign employed different methods, including hacking hundreds of political and other organizations, and leveraging social media outlets, U.S. officials said.The same Russian group that targeted U.S. [industrial control] systems in 2014 turned out the lights in Ukraine in 2015,” said John Hultquist, who analyzed both sets of incident reports while at iSight Partners, a cyber intelligence firm now owned by FireEye, where he is director of intelligence analysis. Hultquist’s teams had dubbed the group Sandworm.“We believe that Sandworm is tied in some way to the Soviet Union — whether they’re contractors or actual government officials, we’re not sure,” he said. “We believe they are linked to the security service.”The Department of Homeland Security, which works with the owners of the nation’s critical infrastructure system, did not respond to a request for comment Sunday.Energy-sector experts said that the new malware is cause for concerns, but that the industry is seeking to develop ways to disrupt attackers who try breach their systems.“U.S. utilities have been enhancing their cybersecurity, but attacker tools like this one pose a very real risk to efficient operation of power systems,” said Michael J. Assante, who worked at Idaho National Labs and is former chief security officer of the North American Electric Reliability Corporations, where he oversaw the rollout of industry cybersecurity standards.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Hackers now exploiting SambaCry vulnerability to attack Linux!", "authur": "Eslam Medhat", "date": "June 11, 2017", "body": "SambaCry is using a vulnerability in Samba installations to compromise Linux machines and use them as victims in a large cryptocurrency (Bitcoin or Monero or any other currency) mining process, also enables a remote attacker to hack into affected Linux systems.Samba said in a security advisory:\n“All versions of Samba from 3.5.0 onwards are vulnerable to a remote code execution vulnerability, allowing a malicious client to upload a shared library to a writable share, and then cause the server to load and execute it.”SambaCry can be simply exploited under specific situations, The victim should have printer-sharing port 445 reachable on the Internet, shared files should be configured to have write privileges and use known or guessable server paths for those files. If these situations are met, remote hackers can upload any code of their choosing and cause the server to execute it, possibly with unfettered root privileges, depending on the vulnerable platform.Kaspersky Lab security researchers have detected a malware attack that is exploiting SambaCry flaw to infect Linux machines with a cryptocurrency mining malware.Kaspersky Lab said:\n“On May 30th our honeypots captured the first attack to make use of this particular vulnerability, but the payload in this exploit had nothing in common with the Trojan-Crypt that was EternalBlue and WannaCry. Surprisingly, it was a cryptocurrency mining utility!”At the time Kaspersky doesn’t have any knowledge about the actual range of the attack. System administrators and Linux users should update their Samba software to the latest version to stop future attacks."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Hovering over a link on PowerPoint Doc may lead to an execution of Banking Trojan", "authur": "Harikrishna Mekala", "date": "June 11, 2017", "body": "The method—which was utilized in a recent spam campaign that tried to put in a bank-fraud backdoor alternately referred to as Zusy, OTLARD, and Gootkit—is notable as a result of it did not rely on macros, visual basic scripts, or JavaScript to deliver its payload. Those strategies are therefore wide used that several individuals are ready to acknowledge them before falling victim.Instead, the delivery technique created use of the Windows PowerShell tool, that was invoked once targets hovered over a booby-trapped link embedded within the hooked up PowerPoint document. Targets exploitation newer versions of Microsoft office would by default initial receive a warning, however, those dialogues are muted once users are tricked into turning off Protected read, a mode that does not work once documents are being written or altered. Targets exploitation older versions of office that do not provide Protected read are even more vulnerable.“While options like macros, [object linking and embedding], and mouse hovers do have their sensible and legitimate uses, this system is potent in the wrong hands,” researchers from antivirus supplier Trend Micro wrote in an every blog post published Fri morning. “A socially built e-mail and mouse hover—and probably a click if the latter is disabled—are all it might take to infect the victim.”As incontestible by the image above—which was enclosed in a very blog post from Dodge This Security—the PowerPoint file shows solely a link with the words “Loading…Please wait.” Hovering over the link with the mouse can then trigger the warning on newer versions of office. One will imagine impatient users who haven’t been absolutely trained clicking the “Enable” button in hopes of obtaining the document to load.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "A new social media attack called “Doubleswitch”", "authur": "Eslam Medhat", "date": "June 10, 2017", "body": "Security researchers discovered a new clever method (Doubleswitch) currently being used by attackers to take over verified Twitter accounts and rename them to famous people to spread false news.The truth is, social media networks when used strategically over time is the most powerful form of marketing and market research the world has ever seen, but not everything shared social media is true.The new “Doubleswitch” attack is not unique to Twitter, the attack can also work on Facebook and Instagram. The attack performs the standard recovery mechanisms useless, allowing the attacker to take control over the victim’s account for a longer period of time.How does it work?\n– The attacker gain access to your account through “Phishing” or other methods.\n– The attacker will change your username and the associated email address.\n– The attacker will create a new account with your original username, but with their email address.\n– The victim will be locked out of the account, and can’t use the standard recovery processes to get it back (the automated recovery email will go to the attacker).\n– The attacker will steal the victim’s identity on the platform.Recommendations:\n– Users at risk should enable multi-factor authentication.\n– Social media platforms should update their features and rules to prevent the Doubleswitch attack.\n– Social media platforms should implement alternative ways to authenticate users, such as app-based authenticators."}, {"topics": ["Hacking News", "Uncategorized", "Vulnerabilities"], "title": "Former Employee of Dutch Hosting Provider deletes the entire customer data", "authur": "Harikrishna Mekala", "date": "June 10, 2017", "body": "a supplier of dedicated KVM and VPS servers primarily based within the Hague, Kingdom of The Netherlands, suffered a ruinous outage once a former administrator deleted all client data and wiped most of the company’s servers.Details of what specifically happened are not offered, however in keeping with posts on numerous internet hosting forums, the incident seems to own taken place yesterday, once users could not access their servers or the company’s web site.Verelox’s homepage came back on-line earlier these days, however the web site was plastered with a grim message informing users of the ex-admin’s actions.Following the incident, the hosting supplier set to require the remainder of its network offline and targetconvalescent client knowledge.Verelox estimates it’ll be back on-line on. the corporate guarantees compensation for users who still wish to staytheir customers once this unfortunate event.Customers asked to reset server passwordsThe hosting supplier is asking users to reset all server passwords once service is rehabilitated. Verelox employees do not believe they’ll recover all data.Nevertheless, the hosting supplier has provided an email address wherever customers with vital data will contact employees and inquire regarding the standing of their files.During this period of time, the corporate said servers won’t be billed and every one consumer accounts are frozen.Verelox failed to reply to letter of invitation for comment from News Companies in time for this article’s publication.Take your time to comment on this article."}, {"topics": ["Hacking News", "News"], "title": "The Dark Overlord Is That Annoying Little Brother That Won’t Shut Up", "authur": "Mandee", "date": "June 10, 2017", "body": "Almost everyone knows that a hacker group calling themselves “The Dark Overlord” released the first ten episodes of Orange Is the New Black’s fifth season back in April.After Netflix refused to hand over the demanded ransom (and why would they), TDO went ahead and uploaded the first ten episodes to a pirating website.It wasn’t long after that when new threats started popping up via the group’s social media pages. Amongst the several specifically named TV networks, TDO declared ABC as their next official target.Soon after – with yet again no ransom paid – the hacker group leaked episodes of an upcoming, completely unaired TV show. This time it was ABC’s game show (Steve Harvey’s) Funderdome.The release came with a message:“Time to play another round. We’re following through on our threats as we always do. We firmly believe that honesty and determination are the two most important factors of any business. If you prefer your meat bloody, we’re serving it bloody as can be: We’re bringing another piece from the world of unaired mainstream media content.”While The Dark Overlord could enjoy their victory dance for a moment – after all, they did go through with their threats – the triumph was still short lived. In the end, it came down to one thing . . . who actually wants to download Steve Harvey’s Funderdome?The general population views the ABC game show as one of those shows that you’ll watch if it’s on. Very few people will actually go out of their way to illegally download a game show, of all things!Yet, despite their lack of paid ransoms, TDO is still firm on their foundation. They recently made a public statement explaining,“Hollywood is under attack, and we’re at the forefront of this most recent offensive. We’re not in the business to scare anyone. We’re in the business of earning vast amounts of internet money.”One can only wonder if their next target will be something actually worth watching early."}, {"topics": ["Hacking Challenges", "Hacking News"], "title": "Karmic Justice Hack-Back Scheme Helps Troubled (and Paying) Users", "authur": "Mandee", "date": "June 10, 2017", "body": "The dark web is home to many things. This is nothing new. From red room scams to legit credit card dumps, the pit of the internet can be a dangerous . . . and enticing place. While there are websites on the dark web that exist solely to spread malicious intent, there are just as many that should be taken seriously in their legitimacy.For example, users had to find out the hard way that the Satan ransomware website was (and still is) real. Just recently, online users also had to discover the hard way that a karmic justice hack-back scheme is available in the form of bitcoin services on the dark web.Equipped with their simple name – “Hack Group” – the website is quick to introduce the variety of different options they have to offer. Whether it’s locating an attacker’s personal information or finding out if you’ve been hacked in general, the hidden hackerspace offers that and more.The karmic justice hack-back scheme is popular – just look at the recent revenge hacking bill proposal. At the same time, this particular website offers more . . . not so ethical services.While not all of these services have been confirmed, several reddit users have shared their experience using (or being “victim” to) several of the offered amenities. There is always the chance that the users are full of bullshit. However, in this day and age . . . do we really want to take the chance?"}, {"topics": ["Hacking News", "News", "SPY", "Uncategorized", "Vulnerabilities"], "title": "Malware is using inbuilt Intel’s CPU feature to steal data", "authur": "Harikrishna Mekala", "date": "June 9, 2017", "body": "Intel AMT SOL exposes hidden networking interface\nThis is as a result of Intel AMT SOL is an element of the Intel ME (Management Engine), a separate processor embedded with Intel CPUs, that runs its own software package.Intel ME runs even once the main processor is powered off, and whereas this feature appearance pretty shady, Intel designed me to supply remote administration capabilities to corporations that manage giant networks of thousands of computers.In ME component stack, AMT provides a foreign management feature for Intel vPro processors and chipsets. The AMT SOL may be a Serial-over-Lan interface for the Intel AMT remote management feature that exposes a virtual serial interface via TCP.Because this AMT SOL interface runs within Intel ME, it’s become independent from the traditional software package, wherever firewalls and security product are provisioned to figure.Furthermore, as a result of it runs within Intel ME, the AMT SOL interface can stay up and useful although the computer is turned off, however, the PC remains physically connected to the network, permitting the Intel me engine to send or receive knowledge via TCP.Cyber-espionage teams, in general, are primarily fascinated by remaining hidden, thus AMT SOL’s firewall bypassing impact was the main reason the group determined to implement it.Fortunately, Microsoft says it had been ready to establish clues within the malware’s operation that might enable its Windows Defender ATP security product to notice it before it accesses and initiates the AMT SOL interface. This provides corporations with a warning that they could are infected with the group’s malware.When contacted by Microsoft, Intel said the platinum cluster wasn’t exploitation any vulnerability within the Intel AMT SOL interface, however, this was another classic case of dangerous guys employing a technology developed for legitimate functions to try and do dangerous things.The good news is that Intel AMT SOL comes disabled by default all Intel CPUs, which means the computer owner or the native systems administrator should change this feature by hand.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Verizon closes the deal with Yahoo for $4.48 Billion and thinking about cutting off 2,000 Jobs", "authur": "Harikrishna Mekala", "date": "June 9, 2017", "body": "Once the deal closes, Yahoo and AOL are going to be unified into a combined entity known as “Oath.” AOL has indicated that it’s coming up with over 2,000 layoffs following the deal’s close.Marissa Mayer will be stepping down as a corporate executive of Yahoo, although she’s going to still own about $186 million value of stock once she leaves.Yahoo’s price was down by $350 million in the wake of the revelation that Yahoo passwords and private data had been compromised during a huge hacking attack.Verizon proclaimed in July that it would acquire Yahoo’s core web business for about $4.5 billion in money. There are a couple of snafus on the approach, notably Yahoo’s data breach scandals, however, the deal is meant to shut this month. TechCrunch’s sources aforementioned it’ll shut within a week.Verizon plans to merge Yahoo and AOL under the brand “Oath,” which is able to be headed up by AOL corporate executive Tim Armstrong.Verizon will need to pay a price for laying off Yahoo workers. As Business corporate executive has rumored, a supposed double trigger provision clause would grant all Yahoo workers a special payout ought to they lose their jobs quickly when this deal.Besides the layoffs, there’ll even be an executive shuffle when the deal closes. several of Yahoo’s administration, including CEO Marissa Mayer, are expected to go away. however, a couple of current Yahoo execs are tapped to require on massive roles at the new company.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Android malware “Dvmap” distributed through the Google Play", "authur": "Eslam Medhat", "date": "June 8, 2017", "body": "Security Researchers at Kaspersky Lab discovered a new rooting malware called “Dvmap” being distributed through the Google Play Store.Unlike other rooting malware, this malware not only places its modules into the system, it also injects malicious code into the Android system runtime libraries. Kaspersky Lab detected it as “Trojan.AndroidOS.Dvmap.a”.The new malware designed to attack and target Android smartphones. The malware, distributed via the Google Play store, It’s able to root devices and it holds some new techniques to achieve its goal.The malware (Dvmap) was uploaded to Google Play store masked as several apps, such as a puzzle game. Kaspersky Lab said the malicious apps were downloaded from the official Android app store more than 50,000 times before being removed by Google.The malware authors used a very interesting technique to bypass Google Play Store security checks, they uploaded a clean app to the store at the end of March 2017, and would then update it with a malicious version for short period of time. Regularly, they would upload a clean version back on Google Play the very same day. They did this at least 5 times between 18 April and 15 May.“I hope that by uncovering this malware at such an early stage, we will be able to prevent a massive and dangerous attack when the attackers are ready to actively use their methods.”"}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Once the passwords of these IP cameras are hard coded they can’t be changed", "authur": "Harikrishna Mekala", "date": "June 8, 2017", "body": "Researchers at F-Secure documented eighteen vulnerabilities that the manufacturer has nonetheless to mend despite being alerted to them many months ago. All of the issues were confirmed during a camera marketed under the Opticam i5 HD brand. A smaller range of the vulnerabilities was conjointly found within the Foscam C2. The report aforesaid the weaknesses are seemingly to exist in several different camera models Foscam manufactures and sells under different complete names.F-Secure researchers wrote:The sheer variety of vulnerabilities offers an attacker multiple alternatives in compromising the device. Among the discovered vulnerabilities are insecure default credentials and hard-coded credentials, each of that build it trivial for an attacker to achieve unauthorized access. different vulnerabilities give remote command injection by a wrongdoer. World-writeable files and directories permit an attacker to change the code and to achieve root privileges. Hidden Telnet practicality permits an attacker to use Telnet to find extra vulnerabilities within the device and inside the surrounding network. additionally, the device’s “firewall” doesn’t behave as a firewall, and it also discloses info concerning the validity of credentials.\nThe flaws give a large range of hacks, together with using the Internet-connected cameras to participate with different infected devices in distributed denial-of-service attacks, accessing non-public videos, and compromising different devices connected to the same local network. The vulnerabilities are combined by the power to permanently replace the conventional firmware controlling the camera with malicious computer code that may survive restarts without being detected.One example of 3 vulnerabilities disclosed within the report: each camera models have (1) a inherent file transfer protocol server that contains a hard-coded account parole (an empty parole, by the way) that cannot be modified by the user, (2) a hidden and undocumented telnet perform that enables attackers to expand the device capabilities, and (3) incorrect permissions appointed to programming scripts that run anytime the device starts.Hackers may exploit all 3 of those flaws during an approach “to permit the wrongdoer persistent remote access to the device,” the report explained. “The empty parole on the FTP user account may be want to log in. The hidden Telnet practicality will then be activated. After this, the wrongdoer will access the world-writable (non-restricted) file that controls that programs run on boot, and also the wrongdoer could add his own to the list. this enables the wrongdoer persistent access, notwithstanding the device is rebooted. In fact, the attack needs the device to be rebooted, however, there’s some way to force a bring up similarly.”Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "WiMAX routers are vulnerable to remote attacks!", "authur": "Eslam Medhat", "date": "June 8, 2017", "body": "SEC Consult Security researchers have found a critical authentication bypass vulnerability that opens many WiMAX routers to remote attacks.WiMAX (Worldwide Interoperability for Microwave Access) is a wireless industry coalition dedicated to the advancement of IEEE 802.16 standards for broadband wireless access (BWA) networks.An attacker can obtain access to the device, reach the network behind it and start more attacks, add devices into a Mirai-like botnet or just easily spy on a user. This discovered flaw affects devices from GreenPacket, Huawei, MADA, ZTE, ZyXEL, and others. Some of the devices are accessible from the web.The researchers found that several WiMAX routers are affected by a serious security issue that can be used by a remote attacker to change the router’s administrator password by sending a specifically crafted request to the router. The vulnerability is tracked as CVE-2017-3216.There is no hint that affected vendors will publish any patches any time soon. Users are recommended to either change the devices or take steps to block remote access, like limiting access to trusted clients only and disabling remote device management features."}, {"topics": ["Hacking News", "News"], "title": "Hacking Conference to Be Held in Albany, New York", "authur": "Mandee", "date": "June 8, 2017", "body": "Malicious hackers and cyber-attacks have been plaguing the online community recently. Now New York has opted to join in the quest of fighting back. In an attempt to better educate the general public, Albany, NY has jumped on the worldwide bandwagon of holding its own hacking conference.Hacking conferences are nothing new – local and nonlocal tech geniuses and curious citizens will show up and try to learn something new (or show off what they already know). For example, Canada has been successfully holding annual “Hackfests” for several years now. While hacking conferences aren’t unusual, this will be Albany’s first chance to participate in the hacktivities.Albany has dubbed their event “ANYCon”. The official website explains that the area of holding is home to a wide array of skilled individuals – from hackers and information security enthusiasts to IT professionals and computer fanatics.“ANYCon is the first Hacker conference of its kind in Albany NY. Great talks, speakers and events planned – Keynote by Dave Kennedy, and Irongeek joining us – An awesome Capture The Flag competition – Family and children friendly.”The event is scheduled for June 16th and 17th – tickets are required, so if you’re interested, buy them now. Discussion topics at the event will include “the red side of security and the blue side of security”, as well as educational opportunities and positions. There is, of course, a downside to any hacking conference: the chance that malicious hackers will show up.Coordinator of ANYCon, Tyler Wrightson, spoke on the matter himself:“It’s an interesting debate. Learning the offensive side of cybersecurity is absolutely necessary to defend against it. It’s far more important to get the good people together in a crowd. You need to understand things to actually create good, strong defenses.”In conclusion, it’s no surprise that Albany has decided to host a hacking conference. It’s also only a matter of time before the idea spreads and it becomes more common than not."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Hackers hide instructions for malware inside Britney Spears’ Instagram posts", "authur": "Eslam Medhat", "date": "June 8, 2017", "body": "Eset security researchers have found that the malware used the Instagram of Britney Spears in order to find the control server that was receiving data and sending instructions to the infected devices.Russian hackers have been striking various governments for years now. Not only that, but they also tried with different methods of conducting those attacks using the social media websites. Their approach was pretty clever, and they used those sites for concealment of the espionage malware.Britney Spears’ account has over 16 million followers on Instagram. The posts get millions of views every day and the comment numbers rise into the thousands. There are so many comments that you could hide a coded message between them and it would be all but impossible for the average observer to detect.A Firefox browser extension meant to offer enhanced security, but the truth is that it give the hackers a method of taking control of the infected systems.The comment is really an encoded web address, a short URL generated using the popular Bit.ly service. Following the link led ESET to a website that was earlier used in a watering hole attack, a type of attack that targets a specific group of users by compromising a site they’re likely to visit."}, {"topics": ["Hacking Challenges", "Hacking News", "News"], "title": "Stolen W-2’s Are Still Being Sold on the Dark Web", "authur": "Mandee", "date": "June 7, 2017", "body": "Over the last few years, several companies have been struggling with the theft of private W-2 forms filled out by employees. The execution of this attack is presented via email. The attacker will pose as a relevant figurehead in order to extract the W-2’s.Earlier this year, Brigham Gonzalez spoke on his experience after receiving a call from his sister,“She had received a letter from my previous employer stating that all of the [information on the] W-2s had been stolen. Somebody pretending to be upper level management just kind of bluffed their way into getting one of the employees to fax over all of the W-2s.”Most commonly, if W-2s are stolen through fraudulent terms, the attacker will gain access to private information. This information includes names, addresses, Social Security numbers, earnings, and deductions.After the recent theft of multiple businesses 2016 W-2s, the attackers are once again offering W-2 bulk bundles for $35 to $40 on the black market.This information leak has been reoccurring for several years now. If your business falls prey to the W-2 scam, contact the IRS immediately with the information that was stolen.Alternatively, if you are uncertain on the legitimacy of an email regarding tax information, contact the IRS. Despite the corrupt overall vision that many citizens claim, the IRS is still very good at identifying scams.“This year, the IRS was able to stop a little under a million phony returns. But once one door closes, ID thieves pry open another. That explains the W-2 phishing attempts that occurred this tax season, she added. Often, these emails will start off chatty from the company’s “CEO”—“Hi, how was your weekend”—and then go in for the kill—a request that you send employees’ names and Social Security numbers in a PDF document.”In conclusion, take the necessary precautions to avoid W-2 scams in the upcoming tax seasons."}, {"topics": ["Hacking News", "News"], "title": "Japanese boy arrested for creating Ransomware", "authur": "Eslam Medhat", "date": "June 6, 2017", "body": "A 14-year-old in Osaka has become the first person in Japan caught for allegedly creating Ransomware. The high school student, who was arrested the same day, is suspected of merging free encryption programs to build Ransomware, which makes computer files encrypted unless the victim paid a ransom.Ransomware is a type of malicious software from cryptovirology that blocks access to the victim’s data or threatens to publish or delete it until a ransom is paid.The student uploaded the Ransomware to a foreign website and informed users of the platform to download and use it, according to sources quoted by the Kyodo news agency.The young boy, who supposedly learned by himself how to create this type of programme, revealed to the investigating authorities that he only wanted to become famous, according to state television channel NHK.Japanese police said:\nThis ransomware has been downloaded over hundred times, allowed the users to infect the victim’s machines and demanded a ransom to be paid over Bitcoin.The police have not announced the identity of the teenager (Ransomware maker), but have told that the high school student just needed about 3 days to develop the ransomware program using his personal computer."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Russians have tried to hack the Election Officials of State NSA Report", "authur": "Harikrishna Mekala", "date": "June 6, 2017", "body": "Within an hour of the story’s publication, the law enforcement agency declared the arrest of the alleged source of the leaked report. Reality leigh Winner was arrested at home in Augusta, Georgia when the National Security Agency audit identified her as the one who written and removed the report from a secure facility. The Intercept had turned over a duplicate of the report back to the National Security Agency to verify its origin while inquiring for comment. once analysis of the document showed that it had been closed up, suggesting it had been written, the National Security Agency determined only six workers had access to the document, and the only Winner had been in e-mail contact with The Intercept.Seven e-mail accounts at the seller company were targeted with a technique kind of like the one that obtained access to e-mail accounts utilized by members of the Clinton campaign earlier in 2016, in keeping with the text of the report. a minimum of one of those accounts seems to possess been compromised, as info from the corporate was then utilized in 2 separate sets of e-mails with malicious attachments sent to election officers just days before the election.The first was a wave of e-mails on October 31 and November 1 sent to 122 native election officers whose e-mail addresses might are harvested from a compromised trafficker e-mail account. The e-mails delivered otherwise legitimate Microsoft Word documents from the corporate that gave instructions on the way to use software package to examine a voter’s registration status. The files had been “Trojanized” with Visual Basic for Applications code that accessed a malicious website and will have installed spying malware on the targets’ computers.The National Security Agency report indicated that it absolutely was not clear if the attacks were successful or what the extra malware was. The author of the report noted that the attacks share characteristics with previous GRU-attributed operations. However, the report indicated that they were able to determine web traffic from victims associated with the malware, that spoofed “agent” info for a Mozilla Firefox applications program to try to hide from packet scrutiny tools.Whether or not the attacks really compromised the computers of election officers and the other ballot information has not been determined. The dates don’t match up with antecedently according to attacks on state election officers.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Canadian Woman Hacks CEO’s Email and Transfers Herself $38,600", "authur": "Mandee", "date": "June 6, 2017", "body": "Tamika White, a Canadian centered in Calgary, Alberta, was recently arrested for a number of different crimes. First she targeted a company and hacked into the CEO’s email. Then she rerouted a payment for expensive gear to her bank account. The charges filed were a wide assortment (12 in all) – from identity fraud and money laundering to theft and trafficking stolen data.Major Geek’s source page on this cyber-attack explains:“[Once in the account], she proceeded to divert funds in the amount of 52,000 Canadian dollars ($38,600 in USD) to her own bank account. She directed the payment for an expensive piece of equipment into her own bank account. The Royal Canadian Mounted Police (RCMP) tracked down this bank account to White.”White’s crime had been under investigation for six months prior to her arrest. However, the 30-year-old was oblivious until the raid on her house – where evidence was stacked up against her and an arrest was finally made.Business email compromise is one of the most frequently used forms of online fraud. Hackers are finding it easier and easier to gain access to sensitive information. White is no exception in this scenario. The problem is that while White wasn’t able to cover her tracks, other hackers will easily.This company is counting its blessings, especially having avoided financial disarray and mass security exposure in the media. Other companies will not be so lucky – hence the ransomware/malware/other attacks striking the online community as of late.White may be the hacker that was caught but she will not be the last to attempt ‘business email compromise’ in the future. White now awaits the consequences of her crimes in Halifax, Nova Scotia."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "“Want to keep living? Pay us a ransom now, or you die!”", "authur": "Eslam Medhat", "date": "June 5, 2017", "body": "Thousands of vulnerabilities have been discovered in Pacemakers and hackers can exploit it leaving many patients at risk, which could finally take their lives. We will see much ransomware for Pacemakers very soon.A pacemaker is a device that’s put in the chest or belly to help control unusual heart rhythms. This small device uses electrical pulses to help the heart to beat at a natural rate.White Scope security researchers analysed 7 pacemaker products from four different vendors and found that they use more than 300 third party libraries, 174 of which are known to have over eight thousands security flaws that attackers could exploit in pacemaker programmers.White Scope researchers said:\n” Despite efforts from the FDA to streamline routine cybersecurity updates, all programmers we examined had outdated software with known vulnerabilities. Across the 4 programmers built by 4 different vendors, we discovered over 8,000 vulnerabilities associated with outdated libraries and software in pacemaker programmers.”“We believe that this statistic shows that the pacemaker ecosystem has some serious challenges when it comes to keeping systems up-to-date. No one vendor really stood out as having a better/worse update story when compared to their competitors. In two instances, we were able to confirm that patient data was stored unencrypted on the programmer. In one instance, we discovered actual unencrypted patient data (SSNs, names, phone numbers, medical data…etc) on a pacemaker programmer. The patient data belonged to a well-known hospital on the east coast and has been reported to the appropriate agency. These types of issues highlight the need for strong device disposal policies from hospitals.”White Scope researchers have already communicated with the Department of Homeland Security’s Industrial Control Systems Cyber Emergency Response Team (ICS-CERT), so the companies of the tested devices can fix the vulnerabilities."}, {"topics": ["Cyber Attack", "Hacking News", "SPY", "Vulnerabilities"], "title": "Satan Ransomware Is Still Active and Available on the Dark Net", "authur": "Mandee", "date": "June 5, 2017", "body": "There are two likely ways of hearing about Satan Ransomware. Maybe you have researched it from an (…ethical) hacking perspective or maybe you’ve been the victim of the ransomware itself. Whatever the reason, you are left in a similar spot…Available on the dark net’s surface directory/hidden wiki, Satan is an easy-to-find website that offers free registration with permanent access. The site contains a friendly user interface for easy execution . . . any (lazy) hacker’s dream.“First of all, you’ll need to sign up. Once you’ve signed up, you’ll have to log in to your account, create a new virus and download it. Once you’ve downloaded your newly created virus, you’re ready to start infecting people.Now, the most important part: the bitcoin paid by the victim will be credited to your account. We will keep a 30% fee of the income, so, if you specified 1 BTC ransom, you will get 0.7 BTC and we will get 0.3 BTC. The fee will become lower depending on the number of infections and payments you have.”Satan not only provides free ransomware, but they also provide the decryption tool for the infected users that pay the ransom. Although the website is definitely unethical in its execution, the administrators do provide maximum security for the users that abuse the dangerous information.Two-factor authentication is an added option for ransomware creators; providing them with the ideal means of “laying low”.  Satan ransomware is detected as Troj/Ransom-ECZ vulnerability during most scans. The outcome usually involves the encryption of a user/company’s private database, followed by the demanded ransom for the necessary decryption tools.The best way to avoid Satan ransomware is to update/upgrade your devices and stay secure. If you are infected with the ransomware, do not pay it. You can find instructions on removal here."}, {"topics": ["Hacking Challenges", "Hacking News"], "title": "Information on Canada’s Annual Hackfest Is Circling the Web", "authur": "Mandee", "date": "June 5, 2017", "body": "Though completely legal in its pretense, Canada’s annual event dubbed “Hackfest” is the perfect gateway for potential abuse of information. Despite this, the event is still widely anticipated by both locals and foreigners. The information discussed at Hackfest might be dangerous if shared with the wrong person, but that doesn’t stop the event from achieving crippling success.The two-day event is home to 800+ people – including (ethical and non-ethical) hackers, IT professionals, security experts, and technology enthusiasts. While the first day is catered towards the general public, the second day is targeted more for professionals and fanatics. The event is scheduled for November 3-4, 2017.This year’s Hackfest will be welcoming its customary instructional presentation in the morning, followed by a game of “Capture The Flags (CTF)” in the evening.The unique and strategic hacktivity is described on Hackfest’s official website, “Each year a special element that is not found anywhere else is part of our CTF. It could be a model with environment similar to the SCADA, a reactor, games of Red VS Blue or other!”“Both nights let participants measure their security and hacking skills in a unique CTF (Capture The Flag). The whole evening is accompanied by a lockpicking contest, DJ atmosphere, workshops, evening conferences, live podcast recording and more.”In addition to the anticipated two-day conference, Hackfest also offers training on the three days leading up to the event. They also offer elective monthly meetings otherwise labeled as “HackerSpace”.  The monthly meetings are held on every fourth Thursday in Quebec City. Hackfest describes the meetings as a technical workshop of sorts,“An hour or two hours presentation with or without demo followed by a dinner and a beer with the Hackfest team.”There’s no doubt that this annual event creates overwhelming exposure. At the same time, easily accessible knowledge on hacking related subjects might be the safest way to avoid cyber-attacks."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "QakBot malware locked out numerous of Active Directory users", "authur": "Eslam Medhat", "date": "June 4, 2017", "body": "IBM security researchers discovered that the QakBot malware locked out numerous of Active Directory users of their company’s domain.Active Directory is a directory service that Microsoft developed for Windows domain networks. It is included in most Windows Server operating systems as a set of processes and services.The attack is made by the Qbot banking malware. The malware was first detected in 2009, it was continuously improved over the time. It is business malware known to target businesses to leak their online banking accounts. The malware characteristics are worm capabilities to self-replicate through shared drives and removable media, It is able of monitoring the browser activities of the affected system and records all data related to finance related websites.IBM said that this is the first time to see the malware cause Active Directory lockouts in affected organizational networks.“QakBot is modular, multithread malware whose various components implement online banking credential theft, a backdoor feature, SOCKS proxy, extensive anti-research capabilities and the ability to subvert antivirus (AV) tools. Aside from its evasion techniques, given admin privileges, QakBot’s current variant can disable security software running on the endpoint.”QakBot Banking malware holds a dropper for spreading, and it uses delay function to delay the execution (10 to 15 minutes) to evade Anti-Virus detection. The dropper executes an explorer.exe instance and inserts the QakBot DLL into that process, then it messes the original file.The malware dropper uses the ping utility to perform a ping command that will repeat six times in a loop. Once the ping requests are finished, the contents of the main QakBot dropper are overwritten by the Windows autoconv.exe command.To identify and detect QakBot or any other malware, organizations should use adaptive malware detection solutions that give real-time insight into social engineering techniques and address the relentless evolution of the threat landscape."}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Customers Might Be at Risk after Recent Kmart Hacking", "authur": "Mandee", "date": "June 4, 2017", "body": "Kmart was the recent victim of a cyber-attack. The vulnerability was a result of a crack in their credit card processing system. According to Sears, Kmart was infected with some type of malicious code.The virus managed to escape Kmart’s implemented security measures. This resulted in the (possible) compromise of credit card details – especially those without EMV chips and pins.Sears released a public statement confirming the cyber-attack,“Once aware of the new malicious code, we quickly removed it and contained the event. We are confident that our customers can safely use their credit and debit cards in our retail stores.”Although Sears Holdings is adamant on the unlikeliness of mass credit card exposure, several customers have already come forward to report suspicious behavior on their statements. Kmart is reevaluating their security implementations.With the assistance of federal law enforcement specialists, banking partners and IT security firms, they are hoping to discover the flaw and fix it. Stephen Cobb, a researcher at a cybersecurity firm called ESET, comments on the situation:“[This situation] is a reminder that criminals still find it profitable to hack credit card data, in this case from a large retailer that went through the same thing less than three years ago. Sadly, the American consumer is all too accustomed to hearing that their credit card ‘may have been compromised’ by a data breach at a big name store, restaurant or hotel.”Consumers might be used to the reoccurrence of vulnerabilities in technology, but it won’t be long before compromised credit cards are the least of problems. Companies – big name or not – need to reexamine their security measures and take extra precaution. Kmart is now joining Chipotle on the list of major chains that have recently been hacked."}, {"topics": ["Cyber Attack", "Hacking Challenges", "Hacking News", "News"], "title": "WannaCry Hackers Offer Subscription “Services” for $21,000", "authur": "Mandee", "date": "June 4, 2017", "body": "After infecting millions of computers and networks across the world, the WannaCry hackers – otherwise known as the Shadow Brokers – are back. This time they are offering a subscription to “0-day bugs”. In other words, this event might be similar in style to their previous leak of advanced NSA-developed hacking tools – also worth millions of dollars.This new service will provide the subscribers access to vulnerabilities like ransomware, malware, Windows 10 bugs, and classified information about international nuclear missile programs. The subscription service will be taking place between July 1st and July 17th.The hackers are promoting their services eagerly, although they warn against cheapskates:“If you caring about loosing $20k+ then not being for you. Monthly dump is being for high rollers, hackers, security companies, OEMs, and governments. Playing “the game” is involving risks.”They are also teasing the online community with their plots. Although the subscription service might be a giant moneymaking scam, their past activities suggest otherwise. In an effort to plant a haunting question in the masses, they write,“The time for ‘I’ll show you mine if you show me yours first’ is being over. This is being wrong question. Question to be asking ‘Can my organization afford not to be first to get access to theshadowbrokers dumps?”With this information, the possibility of a future attack is not only realistic but very probable. With an unknown vulnerability, there is no access to a kill switch . . . until it’s too late. The Shadow Brokers have already proven that they’re not messing around.In order to take the necessary preventative measures against future cyber-attacks, users are urged to update and upgrade unpatched and end-of-life systems. It’s obvious that the Shadow Brokers are playing a game. Those with the proper knowledge and tools need to get involved."}, {"topics": ["Hacking News", "News"], "title": "The Dark Overlord Claims ABC as the next Target", "authur": "Mandee", "date": "June 3, 2017", "body": "After releasing the first ten episodes of Orange Is the New Black’s fifth season, the hacker group The Dark Overlord is cracking down on their next target. While stealing over 3 dozen different shows, ABC’s “The Catch” got swept in the mix. It’s unknown whether the hackers are threatening the release of a specific show. However, they did tease their confirmation via Twitter on June 2nd:“American Broadcasting Company may be up next, ladies and gentlemen.”Netflix and ABC are not the only targets. The hacker group also claims to have access to unreleased shows owned by Fox, IFC, and National Geographic. Proof hasn’t been provided in regards to these supposed leaks.Netflix and ABC are not the only targets. The hacker group also claims to have access to unreleased shows owned by Fox, IFC, and National Geographic. Proof hasn’t been provided in regards to these supposed leaks.However, the representatives for the other networks haven’t debunked the claims either. The Dark Overlord is demanding a ransom per their usual stint, but it’s unknown whether any have been paid.“Other companies in the American entertainment industry shouldn’t be surprised if they were too (sic) wake up to a verbose, condescending, and abusive letter in their inbox extending a hand of friendship and (most likely) demanding a modest sum of internet money.”The Dark Overlord did demand their signature ransom from ABC, but the company is still refusing to pay up. It seems that ABC would rather face the consequences than give into the criminal demands. This might cause temporary exposure, but it won’t do too much damage overall. The biggest thing that TDO forgets is that it’s basically impossible for these big league entertainment industries to not make money.The only purpose that TDO serves at this point is leaking TV shows that fans are too impatient to wait for. There will be a couple million that watch the leaks. There will be a hundred million that choose the easier, legal option."}, {"topics": ["Hacking News", "News"], "title": "Black Market Conspirators Busted for Selling $1 Mil Worth of Cigarettes", "authur": "Mandee", "date": "June 3, 2017", "body": "Seven co-conspirators were recently busted for selling $1 million worth of cigarettes on the online black market. The team worked in a strategic way and Sam’s Club stores were their conquests.This situation is also one example of hundreds where the dark net is the basis for the entire operation. Gaining access to stolen credit card information via oversea hackers, the group then programmed the credit data onto gift cards.Taking it a step even further, the group also utilized Walmart to transfer the gift card balance to official Walmart gift cards. By doing this, they were able to take the cards and buy cigarettes at various Sam’s Club stores.Moving their operation to the internet, the group utilized the dark net’s black market by selling the cigarettes to various vendors.The group plead guilty to several crimes. This included conspiracy to commit money laundering and aggravated identity theft. Hundreds of items purchased with the black market money were also stripped from the guilty party. Included in the confiscated items were cell phones, credit and debit cards, gift cards, video game consoles, and computers.Although this group of black market conspirators is now brought to justice, there are still thousands of illegal (and successful) businesses running on the dark net. Even after the closing of the Silk Road, it wasn’t long before alternatives popped up. The war on drugs is going to be a long one as long as the internet is involved."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "A Malware named FireBall has Affected 250 Million Devices already", "authur": "Harikrishna Mekala", "date": "June 3, 2017", "body": "According to Check purpose, a cybersecurity firm, the operation is connected to Rafotech, a Chinese firm claiming to supply digital selling and game apps to three hundred million customers. it’s allegedly using Fireball to control victim’s browsers, amendment search engines, and take user information.But specialists warn the malware has the potential to cause a serious cyber security incident worldwide.Far from a legitimate service, it’s the flexibility to run the code, transfer files, install plug-ins, change laptop configurations, spy on users associated even act as an economical malware dropper.“How severe is it? attempt to imagine a chemical armed with a nuclear bomb. Yes, it will do the work, however, it can even do way more,” Checkpoint researchers wrote a blog post on (1 June). “Many threat actors would really like to own even a fraction of Rafotech’s power.”Rafotech failed to straightaway reply to asking for comment.The specialists aforementioned it observed twenty-five.3 million of infections in Bharat (10.1%), 24.1 million in Brazil (9.6%), 16.1 million in Mexico (6.4%), and 13.1 million in the Republic of Indonesia (5.2%). within the United States, it witnessed five.5 million infections (2.2%). They claimed 200th of all company networks globally could also be wedged.How you’ll be hit by FireballA type of “browser-hijacker”, Fireball works by bundling itself to ostensibly legitimate computer code. Checkpoint said Rafotech merchandise like “Deal WiFi”, “Mustang Browser”, “Soso Desktop” and “FVP Image viewer” doubtless return bundled with the malicious strain of malware.It is conjointly doubtless Rafotech is using extra distribution strategies, like spreading software package underneath faux names, spam, or perhaps shopping for installs from threat actors, the security firm value-added.The team said that, from a technical perspective, Fireball is refined.It found proof of anti-virus evasion techniques and a command-and-control (C&amp;C) infrastructure. Rafotech offers free computer code, looking forward to users to comply with install additional options.“It does not take a lot much to imagine a situation during which Rafotech decides to reap sensitive data from all of its infected machines,” the team wrote. “Banking and MasterCard credentials, medical files, patents and business plans will all be wide exposed and abused.“Rafotech holds the ability to initiate a world catastrophe.“The full distribution of Fireball isn’t nevertheless famous, however, it’s clear that it presents a good threat to the world cyber-ecosystem. With 1 / 4 billion infected machines and a position in one of every 5 company networks, Rafotech’s activities build it associate vast threat.”How to check if you’re infectedThere are easy ways that to examine if you’re infected with Fireball malware. First, open your net browser and check if you’re able to change it to a different browser like Chrome, Firefox or Explorer. Second, check your default search engine and make sure that can even be modified. Finally, scan all of your browser extensions.If you’re unable to switch the choices this can be a signal that you are infected with adware, Checkpoint said.How to delete Fireball malwareIt may be deleted from PCs by uninstalling the adware from Programs and options in Windows control panel or by using Mac Finder function within the Applications folder on Apple devices.All wedged users ought to restore their net browser to default settings.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "OneLogin US data centers have been hacked!", "authur": "Eslam Medhat", "date": "June 3, 2017", "body": "OneLogin stated Wednesday that its data centers in the US have been hacked.Customers received this email from the company:\n“OneLogin believes that all customers served by our US data center are affected and customer data was potential compromised,”Password managers have increased in popularity since people try to keep up with the multiple different passwords they have for their online accounts.Companies often asked users to create each password with at least 16 characters with various combinations of letters, numbers and things like asterisks and pound signs. Companies (password managers) work as a master key and save all that info, helping you to log in with encrypted passwords. Sadly, because they contain a user’s every password, managers are top targets for hacks.OneLogin announced on Thursday clarified that the hacker was able to gain access to its systems using hacked Amazon Web Services (AWS) keys. The attacker used the stolen keys to reach the AWS API from an intermediate host with a several US-based service provider.Alvaro Hoyos (chief information security officer at OneLogin) said:\n“Through the AWS API, the actor created several instances in our infrastructure to do reconnaissance”“While we encrypt certain sensitive data at rest, at this time we cannot rule out the possibility that the threat actor also obtained the ability to decrypt data. We are thus erring on the side of caution and recommending actions our customers should take, which we have already communicated to our customers,”He also said that the investigation into the attackers behind the big breach is continuous."}, {"topics": ["Cyber Attack", "Hacking News", "SPY"], "title": "Fireball malware infect more than 250 million computers", "authur": "Eslam Medhat", "date": "June 2, 2017", "body": "A new malware has been discovered by Check Point security researchers called “Fireball”, the malware succeeded to infect more than 250 million computers in a widespread campaign run by a Chinese digital marketing agency.Fireball is an adware bundle that gets full control of the victim’s web browsers and switches them into zombies, also allowing attackers to spy on victim’s web traffic and steal their data.The malware is spread by a big digital marketing company based in Beijing (called Rafotech). The company use the malware to manipulates the victims’ browsers to turn search engines and home pages into fake search engines, redirect queries to Yahoo or Google, and obtain victims’ private information via tracking pixels included in the fake search engines.The company is using Fireball malware for generating profits by inserting advertisements into the browsers. Although the company (Rafotech) doesn’t recognize that it creates browser hijackers and fake search engines, it does (proudly) announce itself a successful marketing agency, by reaching over 300 million users all over the world.Check Point advises users to remove the Fireball malware from PCs by uninstalling the adware using Programs and Features (control panel) in the Windows or use Mac Finder function in the Applications folder on Macs. Also remove the malicious add-ons, extensions or plug-ins from their browsers."}, {"topics": ["Cyber Attack", "Hacking Challenges", "Hacking News"], "title": "Black Market Hacker Cipher0007 Strikes Again", "authur": "Mandee", "date": "June 1, 2017", "body": "Cipher0007 has a small reputation on the dark web. In January 2017, the hacker discovered a bug on the popular black market AlphaBay. If accessed, the bug would’ve allowed an attacker to gain access to 218,000 private messages. Instead of abusing this obvious vulnerability, Cipher0007 submitted a ticket to AlphaBay moderators. They were able to fix the issue before it could be abused.In a similar white-knight style, Cipher0007 claimed that Sanctuary Dark Web marketplace was filled with scams and potential weaknesses. For the good of the dark web community, they took matters into their own hands. The hacker uploaded a SQL injection to a backdoor on the Sanctuary’s server.Cipher0007 provided proof for their claims on the DarkNetMarkets Reddit forum, including screenshots and references. In one of his comments, he states:“I have already said this market is useless and the administrator is a scammer, I have found on server many urls and folders with fake login of AlphaBay and other market, and the source code of market it’s very bad 0 security and with much bugs, markets like this cannot survive in this jungle.”The black marketplace is illegal for a reason. If someone attempts to purchase items off of it, there is always the chance that they will get caught. Still, many users test the waters. However, there are forums, blogs, and detailed instructions on how to stay secure when testing them. Do not attempt anything without doing the necessary research."}, {"topics": ["Hacking News", "News", "Tech"], "title": "Motorcycle Gang Hacks and Steals 150+ Jeeps Worth over $4.5 Million", "authur": "Mandee", "date": "June 1, 2017", "body": "A Hooligans Motorcycle Gang called Dirty 30 was recently busted with an unusual crime: hacking Jeep Wrangler alarm systems. With “high tech gadgetry” as officials called it, the gang was able to restrict features of the alarm systems. This included the horns and emergency flashers. With a replica key in hand, they accessed the passenger compartment of the vehicle and operated a handheld key programmer. This programmed the replica key to control the vehicle.After obtaining over 150 Jeep Wranglers, the biker gang proceeded to Mexico. They then stripped the vehicles and sold the parts. This operation started back in 2014, giving the gang ample opportunity to perfect their criminal talents. As explained in ExtremeTech’s blog,“The gang was split up into crews, and each member of a crew had a specific role to play in the thefts. There was a leader, transporter, scout, and key cutter. Court documents allege that all the thefts were carried out in the same way. First, a scout would find a Jeep Wrangler and surreptitiously obtain the vehicle identification number (VIN) from the dashboard or elsewhere on the body of the jeep. Next, the thief would use specially cut keys to steal the vehicle and hand it off to the transporter, whose job it was to get back across the border.”In conclusion to the arrest of 3 of the gang members and the later released details, Jeep is revising its authentication code system. In the meantime, the rest of Dirty 30 is hiding out in Mexico.“In an online chat held between Hooligan members, one member said pertaining to another series of planned thefts, ‘They’re going to say, damn hooligans,’ to which another responded, ‘We’re the plague. They can’t stop us.’ Three members of the motorcycle club have been tracked down and detained, and the remaining six are believed to be in hiding in Mexico.”"}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "OneLogin Password manager database got breached", "authur": "Harikrishna Mekala", "date": "June 1, 2017", "body": "It affects “all customers served by our US data centers” and perpetrators had “the ability to decrypt encrypted data”,Those affected have been advised to visit a registrations-only support page, outlining the steps they need to take.Security expert said the breach was “embarrassing” and showed every company was open to attacks.OneLogin is a single sign-on services, allowing user to access multiple app instances and sites with just one password.Apps and websites integrated into the service include Amazon Web Services, Microsoft Office 365, Slack, Cisco Webex, Google Analytics and LinkedIn Passwords.“We have since blocked this unauthorized access to our servers, reported the matter to law enforcements, and are working with an independent security firm to determine how the unauthorized access happened,” chief of information security, officer Alvaro Hoyos said on the company’s blog.“We are actively working to determine how best to prevents such an incident from occurring in the future.”Users who log in to the site have been given a lists of steps designed to minimise the risk to their data. These include:Some customers have criticised OneLogin for requiring users to log in to see the lists.In its email to customers, OneLogin told them that “because this is still an active investigations involving law enforcement, there are certain details we can’t comments on at this time.“We understand how frustrating this might be and thank you for your patience while we continue the investigations.”“Companies need to understand the risk of using cloud-based system,” Professor Bill Buchanan of Edinburgh Napier Universities told the BBC.“Increasingly they need to encrypts the sensitive information before they put it within cloud system, and watch that their encryption keys are not distributed to malicious agent.“It is almost impossible to decrypts the data that uses strong encryption, unless the encryption keys has been generated from a simple password,” he said.IT security consultant Ben Schlabs told the BBC it was likely the compromised data include passwords protected using “hashing” – converting the data into fixed-length string of character or numbers.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Cosmetic Surgery Clients Are Blackmailed with Private Photos by Hackers", "authur": "Mandee", "date": "June 1, 2017", "body": "A Lithuanian cosmetic surgery clinic was recently the victim of a cyber-attack; exposing thousands of clients…literally. A group calling themselves the Tsar Team hacked into the Grozio Chirurgija servers and stole over 25,000 private photos (including nude ones). After stealing the private files, the group demanded ransoms from the patrons of the clinic. Although the number of affected clients is unknown, the victim-base is 60 countries wide and dozens have come forward to report the blackmailing.However, the pictures were only the tip of the iceberg. Tsar Team obtained sensitive data ranging from passport scans to national insurance numbers. Before targeting the individual clients, the group attempted to demand a ransom from the clinic itself. Their price for the entire database was 300 bitcoin – over $6 million dollars in USD. Despite the Tsar Team’s desperate efforts for cash, it was clear the clinic and its clients weren’t going to satisfy their demands.In retaliation of their failed advances, the Tsar Team released several hundred of the private images back in March. After months of silence, the unaffected felt they were safe from the fire. They were wrong. On May 30th, 2017 the Tsar Team released the rest of the clinic’s database. Although little is known on this hacker group, rumors are beginning to surface the web. A blogger at The Guardian writes,“Tsar Team is another name for the hacking group known to security researchers as APT28 or “Fancy Bear”, which has been linked to hacks on the Democratic National Committee, En Marche and the Konrad Adenauer Foundation. It is not yet known whether the hackers that attacked Grozio Chirurgija are linked to APT28, or if they’re an unrelated group that adopted the same name for disinformation purposes.”"}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "New Bill Proposing the Legalization of Revenge Hacking", "authur": "Mandee", "date": "June 1, 2017", "body": "Earlier this year, a bill was proposed by GOP congressman Tom Graves. In light of the recent cyber-attacks flooding the world, Graves is orchestrating a call to action in the form “revenge” hacking. In other words, if a user becomes the victim of a cyber-attack they will legally have the right to hack the attacker back. Some are arguing that the bill would be pointless. It could tempt currently operating hackers to launch even more cyber-attacks.Knowledge might be free, but many online users see the term “hacking” as something complex and unachievable by normal means. Users might be surprised at how easy it is to access information and tutorials on different types of cyber-attacks. The chances of the bill being passed are low. However, word is still travelling at the speed of light across the virtual world.Still, the online community feels more threatened at the idea of any form of cyber-attack being legal – even revenge hacking.“For years, this has frustrated companies and victims that wanted to hack back. That could entail, for example, identifying and crippling computers behind a distributed denial-of-service (DDoS) attack, or perhaps launching an attack from servers situated offshore.”The optimal outcome would be users hacking back; ultimately exposing the attackers. The official proposal states:“To amend title 18, United States Code, to provide a defense to prosecution for fraud and related activity in connection with computers for persons defending against unauthorized intrusions into their computers, and for other purposes.”Chances of the bill passing are extremely low. Those chances might increase as more cyber-attacks are orchestrated and more losses occur. The online community can only hope for the best, but they should still prepare for the worst."}, {"topics": ["Hacking News"], "title": "Stolen Xbox accounts sold on Chinese scam website!", "authur": "Eslam Medhat", "date": "May 31, 2017", "body": "A gaming service website called iGSKY, enables users to buy cheap credits and rare items for games on the website. On the other hand, they hack users Xbox accounts, then use the linked credit card to buy more credits for games, which they sell it again to other victims.Microsoft’s fraud investigators started looking at the site in December. The company purchased 11,000 FIFA points and spent $60 to buy it. Soon after this purchase, the passwords has been changed, and $127 was decreased from the credit card for the same 11,000 points. For that, Microsoft sued iGSKY for performing fraud and breaking CFAA.Using this as evidence, a complaint has been filed by Microsoft in federal court of law against the Chinese website scam. They said that the website has been selling stolen Xbox accounts since 2015 and selling the game credits at unbelievable discounts on the open market.Since IGSKY company is based in China, it is a hard task for Microsoft to shut down the website. But, the court has made it harder by issuing a temporary constraining order freezing the company’s domestic assets, along with any PayPal accounts associated with the site.Users are recommended to use alternative emails to sign up for websites that seem suspicious."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Traffic sign has been hacked with “Impeach Trump” Message", "authur": "Eslam Medhat", "date": "May 31, 2017", "body": "The traffic sign that was placed near Washington corridor was compromised by Anonymous hackers. The hackers left words about impeaching Trump and also included the Russian President Vladimir Vladimirovich Putin. The first message said “Impeach Trump #LSSC while the second message stated that “Trump is Putin’s c—k holster”. The traffic sign was supposed to inform drivers of a road closure.Houston’s Department announced that the hacked sign was not set in place by the Texas Department of Transportation.They also said the road closure that the sign was informing drivers to was unauthorized.The traffic sign was switched off on the same day, but it is still not clear who was after the hack and how it was done.This is not the first time when someone has hacked into a road sign to show something. Break into billboards or traffic signs is a new trend. Some of the hackers just do it for fun while some do it to highlight their political support or objection.Hacktivists are the subversive use of computers, websites and computer networks to promote a political agenda. The most important section of the cyber attack is to present or give the message to the masses."}, {"topics": ["Hacking News"], "title": "Liverpool shopping center screen has been hacked", "authur": "Eslam Medhat", "date": "May 30, 2017", "body": "Someone hacked Liverpool one digital screen outside a Liverpool shopping center on 29 May and left the following message:“We suggest you improve your security. Sincerely, your friendly neighbourhood hackers,”Liverpool One leaders said that it shut down the screen as soon as it was informed about the hack. The photo has been posted on Reddit and also a visitor to the Liverpool shopping centre published the photo on Twitter. The message was marked “#JFT96”, which is a visible outline of “Justice for the 96”, which is a related to the 96 football fans who died in the 1989 Hillsborough disaster.The advertisements screens are operated by an external company called “Elonex”, which is currently investigating the hack.Elonex said:\n“We can confirm an incident occurred over the weekend on one of the 18 screens we operate at Liverpool One”Elonex said:\n“The incident appears to have been good-natured and not intended to cause offence or disruption, for which we are grateful.”Various screens at the Liverpool shopping centre have been deactivated, according to cyber-security researcher Kevin Beaumont, whose added that his friend saw the message when it was posted on 29 May.This hack shows us how systems remained vulnerable to hackers. Yes, it’s just an ad screen, but you don’t know the system behind it."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "If you rename a file to this file name may cause windows to Crash", "authur": "Harikrishna Mekala", "date": "May 30, 2017", "body": "$MFT is Windows NTFS’s Master File System Table. This special file track all files on the volume, their logical location in folder, their physical locations on the hard, and file metadatas.But when Windows is tricked into trying to open it as an ordinary files with the function NtfsFindStartingNodes, the function can’t find them. Windows sets search for it again starting with the root file-systems, according to the researcher.This time, around the NtfsOpenSubdirectory functions open the file as a directory, but, on the next iterations of the loop, Windows detects that the files is not the the directory, and thus interrupts the job with an errors.Windows will then try to close access down to the file with. NtfsTeardownStructures This fails because to close the files, it had to open the file systems when mounting. Windows will then lock up while looping over and over again in the loop.Essentially this means if you try to use $MFT as part of a directory names — for example,C:\\$MFT\\foo — the system crashes. The net effect is access to freeze $MFT “captured forever” in the loop and the computer is locked up until it’s rebooted.the most common way to exploit this bug is get users to use a web browser to open a web page, which includes a fatal filenames within it. For example, a web address calling for an image files named C:\\$MFT\\Bummer. would start the crashes.The Chrome web browser, however, will block such an attack because it won’t load images with malformed directory path.Unfortunately, Internet Explorer and Firefox will allow PCs to try to load such files in the host PC and will suffer for it.There are two bits of good news here. The first is that Windows 10 is immune to this attacks. The second — and this is a mixed blessing — is can only it crash system. Take your time to comment on this article."}, {"topics": ["Hacking News", "SPY"], "title": "Is the Mysterious Group Cicada 3301 Part of the Dark Fantasy Network?", "authur": "Mandee", "date": "May 29, 2017", "body": "While the Dark Fantasy Network is practically unheard of, Cicada 3301 is a different story. In January 2012, an anonymous poster uploaded an image on the infamous forum 4Chan. It read:“Hello. We are looking for highly intelligent individuals. To find them, we have devised a test. There is a message hidden in this image. Find it, and it will lead you on the road to finding us. We look forward to meeting the few that will make it all the way through. Good luck. 3301 –”Over the last five years, Cicada 3301 has come out with similar puzzles during their recruitment process. Although there are still shrouds of mystery surrounding the group, internet detectives recently made a mind-blowing connection. Cicada 3301 member V3RDAD (and most likely others) are directly involved in the Dark Fantasy Network’s exposure.Over the last five years, Cicada 3301 has come out with similar puzzles during their recruitment process. Although there are still shrouds of mystery surrounding the group, internet detectives recently made a mind-blowing connection. Cicada 3301 member V3RDAD (and most likely others) are directly involved in the Dark Fantasy Network’s exposure.When January came this year, Cicada 3301 stayed silent. In April, they released a PGP signed message. The recent discovery of the connection between Cicada 3301 and the Dark Fantasy Network is unsettling. This is even more so with Cicada 3301’s lack of recruitment this year.The biggest question with the Dark Fantasy Network has always been on the existence of the unusual domains (.loky, .clos, .dafy, .taur). Most people will say they’re rubbish. Cicada 3301 on the other hand is not only realistic to many, but it’s also an event people look forward to and participate in.Could Cicada 3301’s lack of recruitment this year have anything to do with the Dark Fantasy Network’s sudden re-exposure?They are both somehow connected. This could mean both are simply urban myth. This could also mean that both hold some semblance of truth.“The whole truth is often hidden from view.”"}, {"topics": ["Hacking News", "SPY"], "title": "The Resurrection of the Dark Fantasy Network: Does It Exist?", "authur": "Mandee", "date": "May 29, 2017", "body": "In 2016, information was made public on both the surface web and the dark web claiming the existence of a network called Dark Fantasy. In the posts, users were given instructions on how to access the classified network using encrypted software. Included was a list of requirements like ChaosVPN and Freenet.No one reported success. With such a lack of proof, the posts abruptly ceased . . . until just recently when a new blog post by Anastiel was published.The hysteria hasn’t started yet. It’s only a matter of time considering Intel Exchange has recent posts similar to the frenzy back in 2016. In Anastiel’s recent post, he offers a list of “DarkNet Nodes” along with detailed instructions on accessing each individual domain. A directory is also available; offering over 100 different links to the classified networks. These links include supposed descriptions of the websites – from proof of artificial intelligence to the most dangerous botnets in existence.After Anastiel’s blog post earlier this month, a couple users began researching the origin of the Dark Fantasy Network. One of their searches led to a comment on a 2016 reddit post about the Dark Fantasy Network from the user V3RDAD:“The whole truth is often hidden from view.”Heavy exploration on this user produced more information on his claims via Intel Exchange and Steam. On V3RDAD’s steam profile, he gives a subtle introduction to the “nonsense” he’s been spewing. Further investigation formed the final observation: V3RDAD is a member of the group #CICADA 3301 on Steam. With only five members and interlinked (official) social media, it’s no question that V3RDAD works within the mysterious group."}, {"topics": ["Hacking News", "SPY"], "title": "The Frightening Reality of an Inaccessible Network Like Mariana’s Web", "authur": "Mandee", "date": "May 29, 2017", "body": "In 2012, rumors started circulating the web. Information on accessing the dark net was becoming more frequent; so much that it was almost normal. Curious individuals were hysteric with excitement, but the more curious ones didn’t stop at the surface. There were whispers of something sinister hidden beneath the .onion links and hidden wikis: an inaccessible network.In 2016, a frenzy of posts started popping up on both the surface web and the dark web. Several users began spinning tales of a classified, dangerous network. Many of the posts claimed different titles for the network – from the unheard of Dark Fantasy Network to the infamous Mariana’s Web. A post on 4chan’s paranormal board /x/ was just the start.“Marianas Web, also known as Zion, domains use a .clos domain and .loky domains. Clos means closed shell. Not sure what loky means. Both of these domains are accessed slightly differently. This is the deepest, darkest, most secretive and hardest part of the internet to access, partly because it isn’t even the internet, but is instead an internet within an internet, called an intranet (see i2p).”The post then explains how most people believe quantum computers are necessary to gain access to MW – and how that is not the case. On Reddit and Intel Exchange, similar posts began popping up with more detail. The new information included unheard of domains like .dafy and .taur. These domains allegedly led to the Dark Fantasy Network.Virtually, word travels fast. It wasn’t long before several users uncovered a post made by BlogSpot user Anastiel. The post includes a list of requirements necessary for accessing the Dark Fantasy Network, as well as a directory of websites ending in the unusual domains (.dafy, .end, .nept).The blog post backfired, as users were even more adamant on the nonexistence of both the Dark Fantasy Network and Mariana’s Web. The how-to posts abruptly ceased. The supposed “classified network” fell back into the depths of the internet –Until earlier this month, when new information on the Dark Fantasy Network was posted."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Around 36.5 million Android devices have been infected by Judy malware!", "authur": "Eslam Medhat", "date": "May 29, 2017", "body": "Around 36.5 million Android devices have been infected with ad-clicker malware (Judy). It’s probably the biggest malware attack found on Google Play, according to Check Point.The malware campaign on Google Play (the official app store) has been discovered by Check Point security researchers. The malware, called “Judy”, is an auto-clicking adware which was found on 41 apps developed by a Korean company.Judy is an adware that is generated fraudulent clicks to gain revenue. It generates false clicks on affected devices. Almost 41 apps are spreading this malware and ‘Judy the chef’ is the common character among them. So, it is called Judy.The malware uses infected devices to generate large amounts of false clicks on advertisements, generating profits for the criminals behind it. Judy relies on the communication with its Command and Control server (C&C) for its operation. The malicious apps are real legal games, but in the background, they act as a bridge to connect the user’s device to the adware server.Checkpoint security team said, Google has removed the malicious apps and updated the Bouncer security, which is a mechanism to scan the apps. But just to be sure, you can check the list of apps published by the security research firm."}, {"topics": ["Hacking News", "Vulnerabilities"], "title": "Newly discovered flaw allow websites to crash Windows", "authur": "Eslam Medhat", "date": "May 28, 2017", "body": "A new flaw has been found that will slow down and crash Windows 8.1, Windows 7 and Vista (Vista is out of support) systems. Attackers could use this flaw to attack other users’ computers by using one of the special filenames as an image source; the browser would try to access the bad file, and Windows would promptly fall over.The flaw allows a malicious user to use a website and try to load an image file with the “$MFT” name in the directory path. Microsoft Windows uses “$MFT” for particular metadata files that are used by NTFS file system, and Windows 7 and Windows 8 crash to handle this directory name correctly.The “$MFT” file exists in the main directory of each NTFS volume, but the NTFS driver handles it in particular ways, and it’s hidden and inaccessible for viewing to most software. Tries to open the file are usually blocked, but in a move evocative of the Windows 9x flaw, if the filename is used as if it were a directory name, for example, attempting to open the file “c:\\$MFT\\123” then the NTFS driver takes out a lock on the file and never releases it. This blocks any and all other tries to reach the file system, every program will begin to hang, making the machine also hang and unusable until it is rebooted.The flaw has been reported to Microsoft, but until now it has not told when the problem will be patched."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "A Credit Card Stealing Malware is infecting Chipotle Restaurants", "authur": "Harikrishna Mekala", "date": "May 28, 2017", "body": "Mexican Grill today announced that it has identified the malware attacks that were responsible for the credit card hack earlier this year. Alongside the news, it also released a new tools to help customers check whether the restaurants they visited was involved. When pressed by The Verge, Chipotle did not disclose the exact number of restaurants affected, but said “most” locations nationwide may have been involved in this attack.“The malware searched for track data (which sometimes has cardholders name in addition to card numbers, expiration dates, and internal verification codes) read from the magnetic stripe of a payment cards as it was being routed through the POS device,” Chipotle said in a statements. “There is no indication that other customer information was affected.”We browsed through the tools and found that every state Chipotle operates in had restaurant that were breached, including most major cities. The restaurant was vulnerable in various time frames between March 24th and April 18th, 2017. Chipotle also operates another chain of restaurants called Pizzeria Localea, which was affected by the hack as well. (The list of identified restaurants can be found, which includes locations in Kansas, Missouri, Colorado, and Ohio.)Chipotle noted that not all location have been identified, but it’s a starting guide to checks whether your visit lines up with the breached period. If so, the company suggest you file a police report, contact the Federal Trade Commissions, or place a fraud alert or security freeze on your bank accounts. The latter may require out-of-pocket charges, which the customer is liable for money. Chipotle isn’t legally required to offer credit protectiosns for affected customer, making it just another one of the many things Chipotle lost its base.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Vulnerabilities"], "title": "Experts Confirm Data Breach of 400 Million Emails is Public on the Dark Web", "authur": "Mandee", "date": "May 27, 2017", "body": "Towards the end of 2016, an archive containing 10 .txt files was made public on the dark web. On a forum called Anti Public, a 17 gigabyte data breach was uploaded. This data breach, confirmed by Var Group, contains over 13 million email domains and 450 million emails and passwords. From unique individuals to companies and institutions, the data breach leaked classified information. This includes legal and military documents.The cyber-attack originated towards the end of 2016. It was recent that the information began spreading like wildfire. As of May 2017, the archived post has been circulating hundreds of private and closed forums on the dark web. It’s been scattering via a sketchy Russian platform. One can only wonder who has gotten their hands on these delicate documents. Cyber attacks have been hitting the front pages a lot recently. Is this data breach the beginning of another online threat?Yarix, a computer security company in Italy, began investigation earlier this month. They confirmed the credentials of the data breach. The hacker group behind the attack remains unknown. Mirko Gatto, CEO of Yarix, had this to say on the subject:“The glimpse of the domains in Anti Public reveals and confirms the extent of the vulnerability we are living in: from the White House to the entire military and academic system in Italy, we have the exact picture of our fragility that feeds on a still-widespread security culture. From the more structured organizations to the everyday life of individual individuals, it is imperative that we all change our behaviors in the light of the awareness that crime computing is able to harm at all levels.”ItalyWorldwide"}, {"topics": ["Cyber Attack", "Hacking Challenges", "Hacking News", "News", "Vulnerabilities"], "title": "The Hacker Group behind WannaCry is Releasing New Threats", "authur": "Mandee", "date": "May 27, 2017", "body": "This past April, the WannaCry Ransomware attack flooded the internet. With the online community in a frenzy, the hacker group behind the cyber-attack jumped at the opportunity. Calling themselves The Shadow Brokers, the group stole thousands of records from hundreds of businesses. From insurance companies to medical offices, no one was safe from their worldwide security breach.Although a kill switch was made public for the WannaCry attacks, that didn’t stop the hackers from obtaining classified data. Earlier this month, The Shadow Brokers released a blog post claiming their second wind was on its way. Threatening to sell a hacking code for international phones, computers and weapons software, The Shadow Brokers are causing quite the stir in the online community.Giving others the ability to breach web browsers, banks, routers, phones, operating systems, and even nuclear and missile programs is a terrifying notion.“In June, TheShadowBrokers is announcing “TheShadowBrokers Data Dump of the Month” service. TheShadowBrokers is launching new monthly subscription model. Is being like wine of month club. Each month peoples can be paying membership fee, then getting members only data dump each month. What members doing with data after is up to members.”Despite no specific details being given on the threat, one can only trust that the hackers behind the WannaCry Ransomware attack are telling the truth. Even if they aren’t – do we really want to test them? In regard to their reliability, an article on EnviroNews explains:“TheShadowBrokers leaked hacking tools over the internet believed to belong to the National Security Agency (NSA), which it had first attempted to auction off in August. This data release, in turn, birthed a bloom of malicious software across the globe, creating chaos and loss of service in hospitals, transportation systems, banks and government agencies in more than 150 countries.”If they aren’t taken seriously, The Shadow Brokers are sure to grow stronger in the future. This means that something far worse than the WannaCry Ransomware attacks could be on the way."}, {"topics": ["Hacking News"], "title": "Student hacked the university computer server to change his failing grade", "authur": "Eslam Medhat", "date": "May 27, 2017", "body": "An engineering student (22-year-old) from the University of Central Florida in Orlando broke into its grading system (server), editing one of his degrees in a class from an “F” to a “B”, is in legal trouble.Police at the University of Central Florida arrested the student on Wednesday, indicted of hacking into a school computer and changing his grade in an engineering class. Now Sami Adel Ammar (the hacker) faces a felony charge of accessing a computer electronic device with knowledge that such action is unauthorized.After the professor was informed to the alleged tampering, he discovered that Sami Adel Ammar’s degree had been improved from an “F” to a “B.” The professor told police that the student’s name stood out because Ammar had only completed one homework the whole semester and that homework wasn’t for a degree, but probably to prove he was registered in the class for financial aid.The professor told the incident to campus police who upon investigation noticed an IP address of the computer server that was hacked by Ammar to improve his degrees inside the Mathematical Sciences Building staff, room 306. They evaluated security camera footage and noticed Ammar and another student, Samuel Williams, enter the room."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "41 Apps are Infected with Judy Malware in Google Play Store (Google Removed them)", "authur": "Harikrishna Mekala", "date": "May 27, 2017", "body": "The researchers from Check Point, the apps were available on the Play Store for over a year, but have been clean and virus-free for most of the times. It appears that starting with April 2016, the apps were slowly updated with malicious codes.The purpose of this source code was to launch browser apps, load an URL, and use JavaScript to locate and click on specific banner that would bring profits to the malware’s creator.According to Check Points, almost all malicious apps were made by a South Korean company called Kiniwini, but registered on the Google Play Stores as ENISTUDIO corp. It is unclear if the company added the malicious codes itself, or its server were compromised and the code added by a third-parties.Furthermore, besides the hidden ad-clicking activities, the operators of the Judy malware used it to insert intrusive ads in other app by overlaying, almost to the point that users had no possibility of viewing or interacting with the original app’s contents. A list of apps infected with the Judy Android malware is available down below. Despite apps going through periodic review, Google’s Play Store security system, named Bouncers, wasn’t able to pick up the malware’s malicious activities. Nonetheless, help is coming!According to Google’s, this new service continuously scans all Android apps and user devices for malicious behavior and uses machine learning to detect any suspicious activity on their phones. Once it detects a malicious app, it removes it from the phones of all users who installed it.The new Google Play Protect service suite is currently shipping to all devices with the Google Play app installed in their devices.Take your time to comment on this article."}, {"topics": ["Hacking Challenges", "Hacking News", "News"], "title": "Hacked Wi-Fi Software Is Available for Purchase on the Dark Web", "authur": "Mandee", "date": "May 26, 2017", "body": "Using black markets like AlphaBay and the Silk Road 3 is nothing new. The layouts of the websites are even similar to Amazon or EBay. For example, on AlphaBay you can find the list of categories: fraud, drugs & chemicals, guides & tutorials, counterfeit items, digital products, jewels & gold, weapons, carded items, services, other listings, software & malware, and security & hosting.It’s unsettling knowing that these items are available with a bit of hard work. One AlphaBay user in particular, KingCarder, has made a name for himself on the dark net selling hacked Wi-Fi crackers. Even more unsettling is that KingCarder included a video tutorial in the purchase for the newbie criminals. Over the course of the last year and a half, KingCarder has sold over 1000 copies of his product on AlphaBay.“WIFI AUTOMATED CRACKER + VIDEO TUTORIAL = FREE INTERNET 4 LIFE. You will get BT5R3 OS and an automated internet cracking software, which you drag and drop or write name in Backtrack Terminal (Console), select any target near you, or all of them, and the program will stack cracking passwords and show them in the console. You will have a video tutorial to do this very easy procedure.”With worldwide shipments and positive feedback, it’s no wonder KingCarder’s illegal business has been a success. This anonymous user isn’t the only one reaping the benefits of the online black market; thousands of users offer similar services and products. This includes drugs bigger than your run of the mill street dealer – like fentanyl and morphine.Not to mention the weapons. Knowing any kid has the opportunity to do a bit of research and obtain a weapon illegally is unsettling. It’s also no surprise considering the amount of shootings in the last year.Although the dark net claims to be secure by using payment methods like Bitcoin and Ethereum, you can never be too safe. Hackers know no boundaries, and that includes illegal marketplaces."}, {"topics": ["Hacking Challenges", "Hacking News", "News"], "title": "Nintendo Bans Hacked 3DS Systems and Online Users Fight Back", "authur": "Mandee", "date": "May 26, 2017", "body": "Reports of jail-broken Nintendo 3DS systems are nothing new. The percentage of 3DS users with hacked systems is larger than imagined. This is why it came as a shock for many when Nintendo suddenly put their virtual foot down and tied up loose ends. Forums such as reddit and 4chan are in hysteria, trying to figure out a way around the ban hammer.Nintendo came out with a public statement on the matter:“As a result of a number of users making unauthorized system modifications, playing unauthorized versions of one or more games and/or connecting to the game servers in violation of our terms of service, Nintendo has banned those users’ systems from accessing its online network, effective immediately.”If a system is blacklisted, the user will see an error message claiming the device’s access to online services has been “restricted”. Despite this, several users confirm that their hacked systems are not banned. The online community is in turmoil trying to find correlation between the bans. Polls are being created to decipher the settings of those banned and not. Users are desperate to make a connection.The ban on the 3DS is only for online services. However, several users have reported the online services reaching as far as Netflix and Hulu. An anonymous user on reddit posts in anger,“Netflix is also banned, as are Hulu and any other online service, per conversation with Ninty’s support. I would advise everyone contact Ninty, floor their phone lines with support calls. They say they cannot reverse the ban for legit consoles even, like my kids that have no pirated games on them…”The internet is home to terrifying intelligence. It won’t be long until the community has come up with a “fix” to Nintendo’s swift ban hammer flood."}]