[{"title": "Hackers Target 32 University Websites Across Japan", "authur": "William Fieldhouse", "body": "A wave of hacking attacks on university websites between mid-December and early January left online contents of at least 18 institutions across Japan tampered with, The Asahi Shimbun has found.The string of cyberattacks targeted a total of 32 websites of research labs, officially recognized extracurricular clubs and other groups belonging to the 18 schools located in Tokyo and 11 prefectures, including the University of Tokyo, Keio University and Nagoya University.The Asahi Shimbun contacted the universities individually after learning of the attacks from online sources.The infiltrators replaced the website content with pages saying they had been hacked, as well as posting lists of URLs believed to connect to scam websites.The universities said no confidential or personal information were stolen by the hackers. Nevertheless, the attack has alarmed the authorities, as many universities handle research that requires strict confidentiality as well as huge amounts of information regarding intellectual assets.“It’s a situation that could compromise the reliability of a university,” the education ministry warned the institutions on Jan. 13, while urging them to inspect their websites and bolster security. Police are also investigating the matter.The cyberattacks were concentrated on Dec. 18 and Jan. 7, and around that time some business websites were also hacked.The universities said that they have since implemented stronger security measures, including shutting off network connections to the websites that were tampered with.In the case of the Nara Institute of Science and Technology, a prototype bulletin board system made by a research lab was replaced with a page listing an array of online links believed to connect to scam sites offering concert tickets and credit cards.The school said its website “may have been used as a springboard to guide viewers to malicious websites” and reprimanded the professor and associate professor managing the page.In addition, Keio University, Mie University and other institutions had their online contents changed to display the phrase, “Hacked by Team System Dz.”That hacking group has been accused of involvement in a mass cyberattack in 2015 that altered more than 1,000 websites across the globe. The group claims to be of Algerian origin and even has some posts supporting the Islamic State, according to its social networking service website.", "date": "January 31, 2017", "topics": ["Hacking News"]}, {"title": "Linux devices infected by Linux.Proxy.10 malware", "authur": "William Fieldhouse", "body": "The open-source operating system, Linux was once considered as the most secure OS in present the world, but things have changed quite a bit since the security researchers have again found a malware like Bashlite and Mirai infecting Linux-devices and turning them into a DDoS botnet. Now, A new malware has been found targeting Linux.This was dubbed as Linux.Proxy.10 by the researchers at the Dr Web. The malware was developed to run a Socket Secure (SOCKS), which is an Internet protocol which routes the network packets between a client and server through a proxy server by the freeware source code of Satanic Socks Server.According to the Dr Web’s blog post, “To distribute Linux.Proxy.10, cybercriminals log into vulnerable devices via SSH protocol, and at same time list of devices, as well as  logins and the passwords («IP address: login: password») that also go with them, are then stored on the server they own.” For an example of such list can be found in following picture: Based on this pattern, the researchers noted that Linux.Proxy.10 takes over the devices which are already infected by another malware or have used the standard settings. The Linux.Proxy10 also comes with BackDoor.TeamViewer, a Spy-Agent administrator panel and a build of Windows malware from a known family of Trojan spyware.If you are a Linux administrator make sure to remotely scan your device on a daily basis, change security setting from standard to advance and keep an eye on new logins. Also, encrypt data communication, use Linux security extensions, don’t forget to lock user accounts after login failures, disable root login, and last but not the least configure logging and auditing to collect all hacking attempts.", "date": "January 31, 2017", "topics": ["Hacking News", "News"]}, {"title": "New Tactic Used by Dridex Trojan to Bypass User Account Control", "authur": "William Fieldhouse", "body": "Recently a campaign, Dridex distribution is leveraging a fresh UAC (User Account Control) bypass method, warns Flashpoint security researchers.First, this was discovered back in 2014, Dridex is considered as the successor of the GameOver ZeuS malware, as it often uses an improved version of GameOver ZeuS ’s peer-to-peer architecture in order to protect its (C&C) command and control server. Dridex emerged as one of most dangerous banking Trojan families present, still its recent activity has subsided compared to the levels seen in 2014 and 2015.Recently observed a small distribution campaign that is targeting the UK financial institutions which was characterized by the use of “previously-unobserved” Dridex UAC bypass which leverages recdisc.exe, which is a Windows default recovery disc executable. This malware was also observed while loading malicious code using impersonated SPP.dll, and using spoolsrv and svchost to communicate to peers and then first-layer C&C servers.As usual, Dridex is being distributed through spam emails with attached Word documents that feature malicious macros designed to download and execute the malware. The initially dropped module was designed to download the main Dridex payload. After infection, the Trojan moves itself from the current location to the %TEMP% folder.On the infected machine, Dridex leverages the Windows default recovery disc executable recdisc.exe to load an impersonated SPP.dll and bypass the UAC protection on Windows 7. It does so because the platform automatically elevates the program, along with other applications white-listed for auto-elevation. Dridex leverages this feature to execute two commands on the computer.In order to bypass this UAC, Dridex created a directory in Windows\\System32\\6886, and then copies legitimate binary from Windows\\System32\\recdisc.exe to the Windows\\System32\\6886\\. Next, it copies itself to %APPDATA%\\Local\\Temp as a tmp file, and then moves itself to Windows\\System32\\6886\\SPP.dll. Then the malware deletes wu*.exe and po*.dll from Windows\\System32, after doing which it executes the recdisc.exe and then loads itself as impersonated SPP.dll with admin privileges. ", "date": "January 31, 2017", "topics": ["Hacking News", "News"]}, {"title": "38% of Android VPN Apps on Google Play Store Contain Malware", "authur": "William Fieldhouse", "body": "Downloading an app means you are allowing that software to open access into your mobile phone and all of your data that is stored on it. Most of the times, these applications are used to spy an individual. The criticism received by Huawei and ZTE for collecting and sending the data to China shows us how these apps can invade our privacy without us being notified about it.As we know, VPNs or Virtual Private Network are often considered as a reliable way to ensure the safety of data while using applications. VPNs encrypt data that is shared by you online and hence, provide you full security of the information. But contrary to this popular belief, not all the VPNs are so reliable and secure. Research conducted by the Australia’s Commonwealth Scientific and Industrial Research Organisation (CSIRO) and UC Berkley University of South Wales and found that nearly 38% of all the Android VPN apps in the play store are infected with malware; making this blind trust of these apps a not so trustable move.The research teams studied around 234 VPN apps that were uploaded on Google Play Store and a startling one-third were identified to be tracking users via malware. There were apps which carried out malvertising campaigns while 18% of them didn’t encrypt internet data as promised. 8 out of 10 apps requested permission to access sensitive data such as text messages and user account credentials. This proves that the primary function such VPN apps are required to perform, which is to ensure the protection of user data, is not being performed by the available apps at all. The fact cannot be overlooked that these VPN apps are used by hundreds and thousands of users across the globe. The top ten worst VPNs as finalized by the research team include these apps: 1. OkVpn. 2. EasyVpn. 3. SuperVPN. 4. Betternet. 5. CrossVpn. 6. Archie VPN. 7. HatVPN. 8. sFly Network Booster. 9. One Click VPN and 10.Fast Secure Payment.", "date": "January 31, 2017", "topics": ["Hacking News"]}, {"title": "Hotel Pays Hackers After Guests Got Locked Out of Their Rooms", "authur": "William Fieldhouse", "body": "A top European hotel had to pay hackers in order to regain control over its electronic key system.According to The Local, hotel managers of Romantik Seehotel Jaegerwirt, a 4-star hotel in Austria, decided to reveal the ordeal they went through, knowing that other hotels have been going through the same thing. Set up with a modern IT system, including key cards for hotel doors, something that’s widespread in the hotel industry, the hotel thought it offered guests everything they wanted. Until hackers hit.They explain that in the past few months, they’ve been hit by hackers who managed to break into the hotel’s electronic key system, locking hundreds of guests out of their rooms. The last attack took place on the first day of the winter season when they were completely booked, which left 180 people unable to enter their rooms.This was the third time this had happened. The first time an attack happened was during the summer season. The hotel had to pay a ransom then too before the hackers released control over the system. It seems, however, that the first time this happened, hackers left a backdoor in the system which they used again for later attacks.It cost the hotel thousands of Euros to fix, money they did not get back from the insurance company since the hackers can’t be found.The last successful attack, the one that took place in the opening weekend for the winter season, a time when mountain hotels are notoriously booked, made managers pay a ransom of €1,500, or roughly $1,600. With so many guests to think about, they chose to give in to hackers yet again, which left the police unable to help.Following each paid ransom, the key registry system was unlocked, along with all the other computers, putting everything back together.Thankfully, after being hit three times, the hotel finally changed things in order to reject the attack. The computers had been replaced, the latest security standards integrated, while some networks had been decoupled. The backdoor was no more.", "date": "January 30, 2017", "topics": ["Hacking News"]}, {"title": "A Ransomware Took Down CCTV of Washington DC Days Before Trump’s Inauguration", "authur": "William Fieldhouse", "body": "The data recording devices from D.C Police surveillance cameras were infected but by ransomware by hackers, days before the inauguration of president Trump.According to the Washington Post, nearly 70 percent of the storage devices mentioned above are infected, this forced citywide reinstallation efforts, especially ever since it all happened eight straight days before one of the biggest events of this year.What kind of virus is used to attack the storage devices? Well, it seems that this was one of the most popular types used in the recent days – ransomware. The whole thing left for the police cameras is being unable to record any footage between January 12 and then January 15, putting entire population at risk even despite officials rebuttal of this notion.The cyber attack reportedly affected 123 of total  187 video recorders in that city’s closed-circuit TV system, the police admitted. The intrusion was then confined to the CCTV cameras that monitor public areas, without expanding deeper into city’s computer network.It seems that no ransom was actually paid before the storage devices were put back to rights and the surveillance cameras were back to work. Instead, the devices were taken offline, all software was removed, and the systems were restarted at each site.Ransomware malware is one of the most used types of hacking methods used these days. Hackers trick people into clicking on a link or open an email attachment, such as a PDF, which then lets loose the malware into the computer. The files are immediately encrypted, and users are locked out until they pay a sum of money, usually after Bitcoin since it is untraceable.This is a method that is now tentatively crossing over to mobile devices too, although it is not nearly as widespread.\n", "date": "January 30, 2017", "topics": ["Hacking News"]}, {"title": "XSS and Sql Injection Bugs Fixed With WordPress 4.7.2 Update", "authur": "William Fieldhouse", "body": "Developers at WordPress fixed three major security bugs last week. the security issues include an SQL injection vulnerability and a cross-site scripting, in the latest version of the most popular CMS.The latest update, 4.7.2, was released last Thursday. Which is just two weeks after their previous version release.Aaron Campbell, one of the core contributors, made the announcement about the latest update. You can read it on the WordPress’ blog.There is an SQL injection among these major issues and it has affected WordPress’s  WP_Query, which is a class that is used to access the variables, it also checks and functions code into WordPress core. A web developer Mohammad Jangda at the Automattic, the WordPress’ parent company discovered that the class is vulnerable when passing unsafe data. While this issue didn’t affect the WordPress core, he wrote that WordPress added hardening in order to prevent these plugins and themes from causing any vulnerabilities in future.Another huge issue with the cross-site scripting bug (XSS) that existed in posts list table, which is a core class that is used by WordPress to implement the displaying posts in a list table. A very little is known about the vulnerability apart from the fact that Ian Dunn, a member of WordPress’ Security Team, reported it.The remaining vulnerability is in the Press This function, which allows the users to publish blog posts with a web browser bookmarklet. According to David Herrera, a software developer at Alley Interactive who found the bug, the user interface for assigning taxonomy terms in the function was shown to users who did not have permission to view it.WordPress received an update for the second time this year. Earlier this month WordPress addressed eight security issues in the CMS, including a handful of XSS and CSRF bugs, with version 4.7.1.", "date": "January 30, 2017", "topics": ["Hacking News", "News"]}, {"title": "Malicious “Charger Ransomware” Steals Data, Locks Your Phone and Asks for Ransom", "authur": "William Fieldhouse", "body": "Renowned security firm the CheckPoint has recently discovered that at least one app on Google Play Store was infected with the Charger Malware. This malware is technically a ransomware as it steals contacts and SMS/messages data from infected devices and then gains the admin permissions to lock that device so that the victim cannot use it. To get back the control of the device and the data back, the victim has to pay a ransom of 0.2 Bitcoin ($180 approx).The ransom payment message reads as follows:The CheckPoint’s mobile malware software has identified the presence of this Charger malware in EnergyRescue app on the Google Play, but company suspects that this malware is also present in many other apps as well. EnergyRescue app was available on Google Play to download only for four days yet it has 1,000,000 to 5,000,000 downloads have occurred in this timeframe. According to the security analysts at the CheckPoint, Oren Koriat and Andrey Polkovnichenko, “EnergyRescue has largest arsenal of the evasion methods we have seen to this date; Charger could be an indicator of the wider effort by mobile malware developers to gain on their PC ransomware cousins.”Google has deleted the app and also thanked CheckPoint for pointing out the malware in an official statement, which read: “We appreciate Check Point’s efforts to raise awareness about this issue. We’ve taken the appropriate actions in Play, and will continue to work closely with the research community to help keep Android users safe.”", "date": "January 30, 2017", "topics": ["Hacking News", "News"]}, {"title": "Kaspersky Lab department Head arrested for treason", "authur": "William Fieldhouse", "body": "The head of computer incidents and investigation team at the Kaspersky Lab Ruslan Stoyanov was arrested for treason, reported the newspaper Kommersant on this Wednesday, citing the unnamed sources.The Kaspersky Lab has confirmed the news of Stoyanov’s arrest, they have stated that he was at Lefertovo prison since the December 2016. The company also stated that the Stoyanov is now being investigated as a private citizen and also there was no case against the company.The Kommersant’s sources indicate that the Stoyanov’s arrest is linked to an investigation into the activity of the Sergey Mikhaylov who is the head of one of the departments of the FSB’s cyber security division. Mikhaylov is also arrested.The investigative team says that an employee of the FSB’s cyber security division (it is unclear whether the employee in this question is Mikhayalov or not) received the money from a foreign company using a Russian-based intermediary legal entity that is operating in the field of cyber security.The founder of this online payment platform, the Pavel Vrublevsky has told Kommersant that Mikhaylov “in many regards informally determines policies of the entire cyber security industry and also of the Internet commerce. As a result of this, his arrest may have repercussions on the cyber security and the Internet commerce markets.Kaspersky Lab has confirmed that the case against Stoyanov is based on his activities before 2012, that is before he began working for the company.", "date": "January 29, 2017", "topics": ["Hacking News", "News"]}, {"title": "HummingWhale Malware infected Android Apps With Millions of Downloads", "authur": "William Fieldhouse", "body": "CheckPoint security firm has recently detected the presence of the very dangerous HummingWhale malware in 20 about Android apps, which are very commonly used by Android users since these are downloaded millions of times (nearly 2 to 12 million you know that play store doesn’t give you accurate downloads right).According to this analysis of CheckPoint, back in 2016, there is a version of HummingWhale malware known as HummingBad which was found in official apps available on Google Play Store which managed to affect 10 million or even more devices. In this case, Yingmob, a Chinese hacker group, was claimed to be the responsible one behind these.CheckPoint noted that the HummingBad is also a “sophisticated and a well-developed malware” which employed a rootkit and a chain-attack tactic to acquire the complete control over infected phone/device. It targeted many non-Google apps and exploited the unpatched vulnerabilities and security flaws which provided it the root privileges on the devices running on older Android OS versions. Google will eventually shut it down, but by then HummingBad would have installed in over 50,000 apps as it was infecting apps on daily basis. It has displayed 20 million malicious ads and helped attackers make $300,000 per month as the revenue. Out of the 10 million users who downloaded apps that are infected with HummingBad, around 286,000 were located in the US alone.HummingWhale is different from HummingBad regarding impact and severity. It is much more sophisticated than HummingBad and launches different fake apps and ads after gaining control of the device. It also controls its command and control center to virtually kill the device it inhabits. It has so far affected 20 apps on Google Play Store. Unlike previous version HummingBad, HummingWhale doesn’t root devices but includes virtual machine tactics that let the malware perform ad fraud more convincingly. ", "date": "January 29, 2017", "topics": ["Hacking News"]}, {"title": "FSB Arrested Hackers Involved In Publication Of Putin Aide’s Correspondence", "authur": "William Fieldhouse", "body": "The Russian Federal Security Service detained the alleged founder of the Shaltay-Boltay (Humpty-Dumpty) website, Vladimir Anikeev, who gained notoriety after publishing the correspondence of high-level officials. The detention took place in October 2016. On the 28th of January 2017, Rosbalt reported on this event with a reference to its own source. Anikeev was taken into custody in Saint Petersburg after arriving from Ukraine.According to the edition, he was engaged in publishing the correspondence of Russian presidential aide Vladislav Surkov on one of the local websites. Rosbalt’s source said that Anikeev was lured out of Ukraine.The Federal Security Service charged him with violations of Article 272 of the Russian Criminal Code, illegal access to computer information. Anikeev mentioned the Deputy Head of FSB’s Information Security Center, Sergei Mikhailov several times in his testimony.The Federal Security Service charged him with violations of Article 272 of the Russian Criminal Code, illegal access to computer information. Anikeev mentioned the Deputy Head of FSB’s Information Security Center, Sergei Mikhailov several times in his testimony.Mikhailov was detained in December 2016. It is reported that hackers were spotted in the summer of 2016. Searches were conducted in Saint Petersburg although the exact location of the searches wasn’t disclosed.The Agency further claims that Shaltay-Boltay found itself on a hook by the Federal Security Service after these events and was forced to publish materials on instructions from the Agency’s employees. On the 25th of October 2016, a gigabyte of data from the [email protected] mailbox, Surkov’s reception office, for the period of 2013-2014 was published on the Internet.The detailed reports on the situation in Ukraine, Abkhazia, documents on funding the DPR and LPR, lists and contacts of employees of the Office of the Russian President on socio-economic cooperation, data on meetings and conferences of the Russian presidential aide, scanned copies of passports of Surkov and his family were found in the released files. After publication, the Kremlin stated that Surkov does not use that email address.Source: uawire.org", "date": "January 29, 2017", "topics": ["Hacking News"]}, {"title": "Hackers Attack Washington DC Police Cameras", "authur": "William Fieldhouse", "body": "Over the past year, ransomware has become an increasingly big problem, not just for you and me, but for larger organizations and governments too.According to Washington DC’s police department and the city’s technology office, police surveillance cameras were hit little over a week before newly elected President Donald Trump’s inauguration. Around 70% of storage devices that record data from D.C. police surveillance cameras were affected and left the police unable to record any footage from the cameras between January 12 and January 15.The attack incapacitated 123 of 187 network video recorders in a closed-circuit TV system for public spaces across the city, officials said late Friday.Brian Ebert, a Secret Service official, claims that the attack did not compromise public safety, however. Archana Vemulapalli, the city’s Chief Technology Officer, said that the problem was resolved by simply removing the storage devices, wiping them, and then restarting them, and that no ransom was paid to the attackers. An investigation into the source of the hack continues, said Vemulapalli, adding that the only cameras affected were the police CCTV cameras that monitor public areas and that the attack did not extend deeper into D.C. computer networks.The network video recorders are connected to as many as four cameras at each site, explained Vemulapalli, “There was no access from these devices into our environment.”The attack was discovered on January 12, when police officers found four cameras that weren’t working. Upon closer inspection, they discovered that the cameras had two types of ransomware embedded. This prompted an investigation of other cameras in a city-wide sweep. The cameras are now back up and running after roughly 48 hours of maintenance.Source: Washington Post", "date": "January 29, 2017", "topics": ["Hacking News"]}, {"title": "WWE Social Media Accounts Hacked By OurMine", "authur": "William Fieldhouse", "body": "According to the latest reports from Mashable, over half a dozen official Twitter and Tumblr accounts of WWE and its superstars, including the one of John Cena, was hacked earlier this morning by the notorious hacker group OurMineAccording to the site, the accounts which were compromised include the Twitter accounts of WWE Universe, WWE NXT, John Cena, WrestleMania, WWE Network, SummerSlam and the Tumblr page of WWE.After hacking in, they sent out a tweet from each account stating that they were just testing the security of these accounts, and asked the WWE to contact them for more information, as can be seen in the photo below:After hacking in, they sent out a tweet from each account stating that they were just testing the security of these accounts, and asked the WWE to contact them for more information, as can be seen in the photo below:When Mashable spoke up with the representative of the hacking group, he revealed that they hacked into all the above-mentioned accounts using the account of the head of WWE Social media accountsWe just hacked it using the head of WWE social media accounts, it is linked to all of WWE Superstars’ accounts — Twitter and Facebook.”It looks like all the hacked accounts have been recovered by WWE Officials as all the tweets made by OurMine hackers have been erased from the affected IDs. Mashable has contacted WWE for their comments on this situation, but till now they have not sent out any official reply regarding it.Source: mashable.com", "date": "January 29, 2017", "topics": ["Hacking News"]}, {"title": "Investigation Is Underway After Aberdeen City Council’s Website Hacked", "authur": "William Fieldhouse", "body": "An investigation is underway after Aberdeen City Council’s website was taken over by hackers last night.An anonymous group, identifying themselves a Team System Dz, had control of the webpage between 7.20pm and 10pm.Users visiting site were confronted with the following message:No reason was given for the hack.The city council has given assurances that no personal data of residents is held on the website.", "date": "January 29, 2017", "topics": ["Hacking News"]}, {"title": "Hackers Breach California Lawmaker’s Website", "authur": "William Fieldhouse", "body": "The campaign website of Assemblyman Evan Low has been hit by hackers, whose motive seems linked to Low’s leadership of the Legislature’s Lesbian, Gay, Bisexual and Transgender Caucus.The Campbell Democrat, re-elected in November to a second term, said Thursday that he learned of the hacking earlier in the day. Authorities have been notified, he said, including the Assembly sergeant-at-arms.On its Facebook page, “Shadows Team Hackers” claims credit for the attack and lists other websites and social media handles for the lawmaker. The post identifies Low is chairman of the LGBT caucus and the page also features an image of fire burning the rainbow flag that symbolizes gay pride and diversity.“Certainly the imagery would indicate animosity to the LGBT community,” Low said in an interview. The hacking, he added, came only days after Democratic lawmakers had a briefing on cybersecurity.“It’s not a matter of if, it’s a matter of when,” Low said of the threat posed by hackers.As of midday Friday, Low’s campaign website had been blocked as a security risk.Source: sacbee", "date": "January 29, 2017", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "BackBox – Ethical Hacking and Penetration Testing Linux Distribution", "authur": "William Fieldhouse", "body": "BackBox Linux is an Ubuntu-based Linux distribution. The main purpose of developing of BackBox  is to perform security assessments and penetration tests. It is well designed to be fast and still easy to use. It provides a minimal but still complete desktop environment. All of this is made possible due to its own software repositories. It’s software repositories are which are always updated to their latest stable versions of the most often used and also best-known ethical hacking tools.DOWNLOAD THE BACKBOX Here ", "date": "January 28, 2017", "topics": ["Cyber Attack", "Did you know ?", "Hacking News"]}, {"title": "Breach Notification Website LeakedSource Raided, Shut Down", "authur": "William Fieldhouse", "body": "A website dedicated to informing the public about data breaches named LeakedSource, went offline and it has been 24 hours since it is down. Speculations say that the website has become the target of a raid from the law enforcement for becoming a controversial platform about breach notification. This assumption came from a message posted on the Pastebin by a user. The message reads as follows:“LeakedSource is now down forever and it won’t be coming back. The owner was raided early this morning. He wasn’t arrested, but all SSD’s are got taken, and the LeakedSource servers are subpoenaed and placed under the federal investigation. If somehow he recovers from this attack and launches LS again, then I will be wrong. But I am not wrong.”If all of what is said above is true, then it is very likely the US law enforcement authorities are responsible for this raid.It is indeed true that the LeakedSource is a controversial website for some since it has garnered criticism to some extent resentment from some companies that wanted to keep information about the data breaches confidential. Till now the site has highlighted numerous data breaches that include FriendFinder Networks, Last.fm, VerticalScope, Rambler, LinkedIn, and DailyMotion.It is also worth noting that last year has been quite a difficult year for the organisations and the users alike since it showcased a record-breaking number of data breaches and nearly 4.2 billion records are exposed. Ever since then, this website has been sticking out like a sore thumb for those affected by the breaches for the most.Since 10th January, the Twitter account of LeakedSource has remained inactive and on various occasions, LeakedSource users have complained about the website being unresponsive or offline. The same seems to be the case in this scenario as well but this time users are speculating that the site may never come back online. Users are naturally irritated as some of the site’s users claimed on hacker forums that they recently bought LeakedSource subscription.source: hackread ", "date": "January 28, 2017", "topics": ["Hacking News", "News"]}, {"title": "Facebook Launches “Security Key” Feature to Protect User Accounts", "authur": "William Fieldhouse", "body": "Security Key is one of the latest features added to the Facebook’s always expanding features. It was introduced exclusively for two-factor authentication, which is now required at the time of logging into website. Through Security Key, mandatory requirement of receiving the verification code via SMS will be eliminated.The team of Facebook security announced in this blog post that they would be supporting FIDO U2F Security Key in order to protect accounts from hackers. It is basically a physical key that is to be plugged into computer’s USB port and to confirm the login information including the password; all you got to do  is tap on it.Their team also mentioned that sending codes using SMS messages was not a reliable option since majority of users never create a phone back-up. Registering for physical security key will be a better and reliable way to enable the login approvals. Although some may feel that the requirement of another physical device would be little troublesome, Facebook states that the primary focus here is on the security of public data and the profiles from hackers and the phishing attacks. The feature is only compatible with Opera or Chrome.The security team explained on the blog:“Security keys for the Facebook logins currently only work with some web browsers and mobile devices, so we will ask you to register an additional login approval method, like your cell phone or any Code Generator. At this time we do not support any security key logins for our mobile Facebook app.” To add your Security Key, you need to use your computer and install the latest Chrome or Opera browser version. Though the feature cannot be accessed from the mobile Facebook app, if you possess an “NFC-capable Android device with the latest version of Chrome and Google Authenticator installed” you can use the key to log in from your mobile website.", "date": "January 28, 2017", "topics": ["Hacking News"]}, {"title": "New Hack Allows A Full Game Library On Your NES Classic Edition", "authur": "William Fieldhouse", "body": "Few days ago a hack had been released which allowed NES Classic Mini owners the ability to edit and add to the 30 games which come pre-loaded on the console out of the box.A new hack has now emerged which goes one better; you can now put the full NES library onto the machine.The process requires a PC and, as you can see from the video guide, is quite time consuming. It also goes without saying that deploying such a hack has its risks, and should the process go wrong, it’s unlikely that Nintendo will be too sympathetic should you try and arrange a repair under warranty. Finally, there’s the obvious caveat that using ROMs is legally questionable.", "date": "January 28, 2017", "topics": ["Hacking News"]}, {"title": "Jennifer Lawrence Case: Hacker Jailed For Nine Months", "authur": "William Fieldhouse", "body": "Oscar-winner Jennifer Lawrence (who told Vanity Fair the hacking was a “sex crime”), the 29-year-old has also been ordered to pay $5,700 (A$7,564) in restitution for counselling services for one undisclosed celebrity whose photos were disseminated online.The Illinois local and son of two former police officers used a phishing scheme, sending emails which appeared to be from security accounts of internet service providers to gain illegal access to over 300 Apple iCloud and Gmail accounts.Other celebrity targets included Kate Upton and actress Kirsten Dunst, however no names were officially mentioned in the court documents.“I was just so afraid. I didn’t know how this would affect my career,” Jennifer Lawrence told Vanity Fair in 2014.“Just because I’m a public figure, just because I’m an actress, does not mean that I asked for this. It does not mean that it comes with the territory.”With the charge carrying a maximum of five years, Majerczyk’s lawyer attributed his behaviour to suffering depression at the time of the leak and anxiety-induced panic attacks in the months since.“Mr Majerczyk was suffering from depression and looked to pornography websites and Internet chat rooms in an attempt to fill some of the voids and disappointment he was feeling in his life,” the defendant’s lawyer wrote in a sentencing memorandum filed last week.According to the Chicago Tribune, U.S. District Judge Charles Kocoras said while handing down the sentence that cyberattacks like the one orchestrated by Majerczyk are a consequence of living in a world that “inspires secrecy and anonymity and intrusion into the affairs of people’s private lives.”", "date": "January 28, 2017", "topics": ["Hacking News"]}, {"title": "Hacker Selling 126 Million Cell Phone Details of “U.S. Cellular” Customers", "authur": "William Fieldhouse", "body": "A couple of days ago, we have reported on a Dark Web vendor selling nearly 1 Billion accounts stolen from the Chinese Internet giants. Now, the very same vendor is selling something that is not only unique but also highly sensitive and something which Intelligence agencies around the world would take as a great chance to get their hands on.Here the vendor is selling a database that has personal and cell phone number information of 126,761,168 citizens of United States that are taken from the United States Cellular Corporation (U.S. Cellular), which is a regional carrier that owns and operates the fifth-largest wireless telecommunications network in United States, with their services extended to 4.9 million customers in 426 markets in 23 of U.S. states.The DoubleFlag claims that the database is updated till this month and has never been leaked on the Internet. According to him, the database has details such as first name, last name, state, address, city, and phone numbers of 126,761,168 Americans.The price to buy this database is 0.5497 Bitcoin (USD 500). Which means anyone with access to this database can scan and check all the cell phone numbers and details of millions of American citizens.Inorder to confirm if the U.S. Cellular has actually suffered a data breach, hackread has contacted the company by using their website chat service where an operator has simply refused to provide media contact for their company, however, we are able to find three of their media contacts and an email was sent for an official comment as to whether the database breach on U.S. Cellular servers or not but it has been 24 hours since the email was sent to their media team and still there is no response whatsoever.This is not the first time when personal details of US citizens were being sold on the Internet. Last year, a hacker going by the handle of “DataDirect” was selling full access to voter registration records of the US citizens on The Trade Deal marketplace.source: hackread", "date": "January 26, 2017", "topics": ["Cyber Attack", "Hacking News", "News"]}, {"title": "Largest Trading Platform On DarkWeb, AlphaBay Hacked", "authur": "William Fieldhouse", "body": "The AlphaBay is considered as the largest trading marketplace on Dark Web and that is something which makes the platform inquisitive about the prevailing vulnerabilities and security flaws. Recently a hacker has identified the existence of two very high-risk bugs and revealed that information on the Reddit’s forum posts. The hacker, who uses the alias name Cipher0007, has managed to steal 200,000 private messages of AlphaBay. These messages are exchanged between the buyers/users and sellers.The ZDNet reported that the Cipher0007 has disclosed the vulnerabilities he found earlier on this week and revealed them on Reddit that these flaws can be used to steal many private messages on AlphaBay. He also compromised the website and took first and last names of both the sellers and buyers on the AlphaBay along with their addresses, nicknames and tracking IDs of their orders. The messages were not protected by any PGP keys, which made it even easier for Cipher0007 to steal them in such huge proportions.The AlphaBay has posted an official statement on the Pastebin in which they have admitted presence of those bugs and also confirmed that the Cipher0007 hacked nearly 218,000 messages. It must also be noted that those hacked messages were not older than 30 days since the website’s system purges messages that are more than 30 days old automatically.Cipher0007 has posted numerous screenshots in order to prove that he really managed to infiltrate AlphaBay and stole the private messages.The Cipher0007 has also the opened support tickets on AlphaBay to warn other trading posts on Dark Web about the potentially dangerous security bugs and flaws that can expose their private identities of users. AlphaBay rewarded Cipher0007 for not selling these flaws or exposing that stolen data to the public. Then Cipher0007 disclosed the methods he used to exploit the AlphaBay to the company and finally the developers at the trading platform managed to fix the flaws.This is not the first time when a Dark Web domain has been hacked. In 2015, Anonymous hackers defaced the official website of so-called Islamic State (Daesh, IS, previously ISIS/ISIL) terrorist group on Tor with a viagra advertisement.", "date": "January 26, 2017", "topics": ["Hacking News"]}, {"title": "Fake Netflix App Takes Control of Users’ Android Devices", "authur": "William Fieldhouse", "body": "Security researchers at Zscaler security have recently found a fake Netflix app that is installing a Remote Access Trojan (RAT) variant onto victims’ devices.Depending on the popularity of applications is not a new technique, with the fake Super Mario Run games on Android have recently used the same trick to distribute the DroidJack and Marcher Trojans. It seems that the actors are now behind the SpyNote RAT decided to use the same technique and get the enormous traction Netflix has among its users who are looking to stream full movies and TV programs on their mobile devices.In the place of a video streaming app,  the attackers, however, used a RAT that can take advantage of users device in many ways, like listening to their live conversations by using the microphone, executing random commands, sending files to command and control (C&C) server, viewing contacts, recording screen captures, and reading SMS messages.This fake Netflix app is supposedly created by using an updated version of  SpyNote RAT builder, which was leaked online last year, Zscaler says. Once it is installed, the app displays the icon of legitimate Netflix app on Google Play, but it should by no means be mistaken for the real one.When user clicks on icon for the first time it then disappears from the home screen and nothing else seems to be happening, a trick that is commonly used by mobile malware. But in the background, the malware starts its onslaught of attacks.The SpyNote RAT was found to be using a free DNS service for C&C communication, and also to leverage Services, Activities components and Broadcast Receivers, of Android platform to remain up and running on users’ infected device.“Services can perform long-running operations in the background and does not need a user interface. Broadcast Receivers are Android components that can register themselves for particular events. Activities are key building blocks, central to an app’s navigation, for example,” Zscaler researchers note.", "date": "January 26, 2017", "topics": ["Hacking News"]}, {"title": "Americans Are Bad at Protecting Themselves Online : Study", "authur": "William Fieldhouse", "body": "Online security is of the highest importance, so it goes without saying that most of the Americans are concerned about how they protect their online self on the internet. This being said, they do a very little to protect themselves according to a study.A survey from the Pew Research Center has conducted a study on 1,040 US adults only to find that 41% have shared their online account passwords with friends or family members, which is pretty much the basic thing you are not supposed to do.Other 39% claim they have used the same password or similar passwords for most of their online accounts. That puts them at very high risk as hack of one of the accounts means their online presence is pretty much messed up. One very good example for this is Yahoo data breach in which 1 billion people had their account data exposed. If you are one of those who used the same passwords elsewhere, expect those accounts gone.One-quarter of those who are interviewed have admitted that the passwords they use are very weak than they like, but they are the way they are because they are easy to remember.However, nearly half of Americans believe that their personal information is not secure now than it was five years ago. This is in-direct correlation with fact that Americans lack the faith in various private and public institutions to protect their data for them. Of course, many data breaches that have affected online companies in past few years have not helped much in restoring the faith in them.The survey goes deeper into the issue and unveils that 64% of US adults have been impacted by different types of data theft. For instance, 41% discovered fraudulent charges on their credit cards, while 35% have been notified that some information had been compromised. Another 16% admit to their email accounts being taken over, while 13% said the same about their social media accounts.\n", "date": "January 26, 2017", "topics": ["Hacking News"]}, {"title": "Android Users Under Attack – Banking Malware Source Code Posted Online", "authur": "William Fieldhouse", "body": "The security researchers warns us that the source code of an Android banking malware is posted online, along with some information on how is should be used, this means that users of Android devices are likely to face a hike in the number of attacks in the very short time.The security firm Dr. Web revealed that they have already found one malware that is developed with this leaked source code, adding it is distributed as the popular applications directly injected in APKs available online.The malware was flagged as Android.BankBot.149.origin and it tries to get the administrator privileges on the compromised computers. Once it is granted the full privileges, this malware removes the app’s icon from home screen, thus tricking the people into believing it was actually removed.On the other hand, this remains active in the background, and thus connects to a command and control server to await commands. It can also perform a wide range of tasks, such as send and intercept the SMS messages, track devices, steal contacts, show phishing dialogs, make calls, and steal sensitive information, like banking details.“Like many other Android bankers, Android.BankBot.149.origin steals confidential user information by tracking the launch of online banking applications and payment system software. One sample examined by Doctor Web security researchers controls over three dozen such programs. Once Android.BankBot.149.origin detects that any of the aforementioned applications have been launched, it loads the relevant phishing input form to access user bank account login and password information and displays it on top of the attacked application,” the firm explains.Once a popular application is launched, including here Instagram, WhatsApp, Facebook, YouTube, and even Google Play Store, the malware launches its phishing dialog similar to the one that shows up when you make purchases on Google Play, asking for your credit card information.Beware of such malware. It doesn’t hurt to be wise.source: softpedia\n", "date": "January 26, 2017", "topics": ["Hacking News"]}, {"title": "Top 25 Worst Passwords Of All Time", "authur": "William Fieldhouse", "body": "In its sixth annual Worst Passwords report, SplashData, a provider of various security applications and services, listed the 25 weak and easy-to-guess passwords most frequently posted on various hacker forums and websites.The list is based on 5 million leaked passwords, and almost 4% of hacked users used “123456” as their password of choice while more than 10% used another from the list.Most had a single word password, which is a dream come true for any hacker planning a quick and effective dictionary attack. Using this method, a hacker pretends to be the user and tries to log into their account, using a predetermined set of words or phrases from a list called “dictionary”.\nFrequent usage also applies to another group of passwords on the list: sequences. “123456”, “qwerty” or “zaq1zaq1” are key sequences, which means the used symbols are near one another on the physical keyboard. This kind of passwords is another dictionary favorite, but is also susceptible to a brute force attack. This tactic is similar to a dictionary attack, since it also happens on the login screen, but instead of using ready-made lists, a hacker uses a special algorithm which attempts to enter different character combinations until a password match is found (i.e. attacker will try using “1234”, then “12345”, etc.).", "date": "January 26, 2017", "topics": ["Hacking News", "How To"]}, {"title": "Hacker Selling 1 Billion user accounts stolen from Chinese Internet Giants", "authur": "William Fieldhouse", "body": "Dark Web is the marketplace where people can buy anything from illegal weapons to drugs and many other products including digital goods. In the recent listing, a famous dark web vendor going by handle “DoubleFlag” is found selling data stolen from various Chinese Internet giants.According to that listing, this data belongs to several companies like NetEase Inc and its subsidiaries 126.com, Tencent Holdings Limited owned QQ.com, 163.com and Yeah.net. TOM Group’s Tom.com 163.net, Sohu, Inc.’s Sohu.com and Letter Network Information Technology Co., Sina Corporation’s Sina.com.cn/Sina.com, Ltd owned eYou.com.NetEase, Inc, a huge Chinese Internet technology company which provides various online services focusing on content, communications community and commerce. And 163.com is the official website of NetEase while 126.com is another popular Chinese email provider and subsidiary of NetEase. The hacker here is selling 1074,795,268 accounts stolen from 163.com, 143,725,840 accounts from 126.com, and 163.net, 91,239 from vip.163.com domain respectively.Yeah.net is yet another domain owned by the NetEase providing email services to users. Although this domain is widely used for various phishing scams, the hacker here has now access to its 3,281,420 accounts all of which are now available for sale.QQ is a famous instant messaging software service also recognized for providing a variety of services, including music, microblogging, voice chat, online social games, movies and shopping. The data available for sale belongs to their primary QQ.com domain and the total number of user accounts are 126,936,489 and 2.759.960 from vip.qq.com.As we mentioned above, Experian categorically has denied that their servers were ever breached leaving a question mark about the listings uploaded by DoubleFlag. However, looking at his Feedback Ratings on the marketplace there hasn’t been a single negative rating of his 60+ successful sales.", "date": "January 26, 2017", "topics": ["Hacking News"]}, {"title": "Cops Arrest Hacker Group Which Stole e-vouchers Worth $130,000+", "authur": "William Fieldhouse", "body": "The Delhi police has arrested four hackers for digitally shoplifting vouchers worth about Rs 92 lakh of an e-commerce company by hacking its payment gateway through data tampering.A complaint was registered by Voucha Gram India at the Hauz Khas police station alleging that its website was hacked and vouchers around Rs 1 crore were digitally shoplifted through data tampering of payment gateway “PayU”, on December 30. A case of cheating and relevant provisions of IT Act was registered on the complaint.A special team including ACP Rajender Pathania and SHO Hauz Khas Sanjay Sharma was formed to crack the complex cyber offence that went through voluminous data procured from various online shopping portals and loss was pegged at Rs 92 lakh.During investigation, the team went through relevant IP addresses, e-mails and phone numbers, and managed to trace the prime accused, Sunny Nehra (23), a BTech drop-out. He was picked up from a five star hotel in Gurggram and put through sustained interrogation, said Ishwar Singh, DCP (South).“We tracked Sunny through his facebook and putting mobile phones on surveillance that he purchased from redeeming the vouchers of the website,” said a senior police official. Information provided by him led to arrest of his three associates Azad Chaudhary (19), Prakhar Agarwal (19) and Tejveer Sheroran (18). Azad is also a BTech dropout, while Sheoran is a BCA student, he said.All the four accused, including Nehra, had developed online associations with hackers in the country and abroad and were involved in hacking for money by breaking weakly encrypted e-commerce portals.Nehra had learnt from one of his hacker friend that PayU, a leading payment gateway, was suffering from vulnerability and could be tested for data tampering. They managed to hack the online systems, including the payment gateway and indulged in manipulating cash backs by enhancing their value, using same gift card again and again, placing online orders without any actual payment and making small payments, said the officer.The digital money siphoned off by them was used on living a luxurious life and buying sophisticated proxy servers, virtual private networks, high end laptops used by them.The e-vouchers digitally shoplifted by the accused were spent also in five star hotels, air tickets, and renting expensive cars to go to parties and hotels with their girl friends, he said. “The prepaid mobile phone Sunny was using had balance of Rs 43,000. He was also looking for potential customers to sell out the mobile phones and other gadgets he purchased redeeming vouchers fraudulently,” added the senior police official.Police has recovered a laptop used for high level programming, with 256 GB RAM and capable of supporting hacking software, and latest I-phones and pads.Investigation in the case is progressing with analysis of data and logs of recovered equipment to detect and establish other cyber crimes and digital shoplifting committed by the gang, he added.Source: asianage.com", "date": "January 26, 2017", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "New Android Malware Secretly Purchases Apps from Google Play Store", "authur": "William Fieldhouse", "body": "Android devices are now the targets by a whole new level with a type of malware which secretly purchases and downloads applications from Google Play Store, and it is also capable of stealing information, such like the configured Google account.Codenamed Skyfin, new infection reaches Android devices by using the the help of a different malware known as Android.DownLoader. This usually spreads as part of applications posted in third-party stores. To simply put, users who are downloading apps from an store than Google’s are exposed to these attacks, so they should double-check each APK to make sure it’s not infected.Security company Dr Web says Skyfire can compromise the Google Play Store process to automatically download apps on users’ devices. These apps are not installed, though, but the file is stored in the downloads folder to make sure that the user does not notice any difference on their phones.“It steals a mobile device’s unique ID and the account of the device’s owner which are used to interact with Google services; it also steals various internal authorization codes for connecting to the Google Play catalog as well as other confidential data. Then the module sends this data to the main component of Android.Skyfin.1.origin, after which the Trojan sends the data to the command and control server along with the device’s technical information,” the firm says.The malware listens to a series of commands and can search the Google Play Store for a specific app, purchase it, accept terms of service should there be any, add reviews and rate apps.It goes without saying that the app can be used by attackers to increase the popularity of certain Google Play applications without users even knowing that their devices are affected.Furthermore, it turns out that Skyfin can even click on banner ads in apps, which means that authors can use them to generate revenue using compromised devices.", "date": "January 25, 2017", "topics": ["Hacking News"]}, {"title": "US Makes HTTPS Mandatory for All New .Gov Websites", "authur": "William Fieldhouse", "body": "To increase the security of the government websites that are usually targetted by the hackers, United States will default to HTTPS to all the new .gov websites starting this year.During the administration of Obama, the government has set December 31 as the deadline for all government websites to switch to HTTPS, but from some unofficial stats, we know that only 60 percent of these websites actually completed did the transition.Now the General Services Administration announced that from 2017, all new .gov websites will have HTTPS automatically.“As new executive branch domains have been registered, dotgov.gov program will submit all these websites to the web browsers for “preloading”. After the submission, nearly three organisation time is taken to complete the “preloading” in the modern browsers. All these changes will be issued to the dotgov customers when they register a new domain now under the Executive Branch, and will not have any effect on existing or any renewed domains,” reads the announcement.GSA says that the HTTPS will be applied to all subdomains of freshly registered executive .gov websites, that include intranet web sites, saying that sticking with HTTP even for the intranet is not at all secure and is  “discouraged.”If you are to have a target date, GSA claims it is aiming for this new measure to take place in the spring of 2017, and the domain customers will be notified 30 days before changes taken place.“GSA provides extensive guidance to agencies on HTTPS deployment at https.cio.gov and encourages .gov domain owners to obtain low cost or free certificates, trusted by the general public. As a general matter, more expensive certificates do not offer more security value to service owners, and automatic deployment of free certificates can significantly improve service owners’ security posture,” the GSA adds.\n", "date": "January 24, 2017", "topics": ["Hacking News"]}, {"title": "China Takes Internet Censorship to Next Level With “clean up” Campaign", "authur": "William Fieldhouse", "body": "China has announced their new 14-month campaign to “clean up” the internet service providers and bring down devices like virtual private networks (VPNs) that are used to evade their strict censorship.The ruling party oversees a huge apparatus designed to censor the online content that deemed politically sensitive and blocking many Western websites and the services of the internet giants including Twitter, Facebook and Google.China passed a controversial cybersecurity bill in the last November, increasing restrictions on online freedom of speech and also imposing some new rules on the service providers.But companies and individuals use VPNs quite often to access the unfiltered internet that is beyond China’s “Great Firewall”.Internet service providers and telecom will no longer be allowed to set up or even rent any special lines such as VPNs without the official approval, said the ministry of industry and information technology Sunday.Their “clean up” campaign would last upto March 2018, as said in a statement on their website.The announcement came a few days after President Xi Jinping extolled the globalisation and denounced protectionism in a speech at World Economic Forum in Davos, where he said that China is committed to “opening up”.The internet access services in the Chinese market has grown rapidly, and “first signs of disorderly development are also appearing, making an urgent need for regulation”, the statement said.The new rules were required to “strengthen internet information security management”, it added.IT expert Li Yi told the Global Times newspaper, which often takes a nationalistic tone, the new regulations were “extremely important”.While some multinationals such as Microsoft needed VPNs to communicate with overseas headquarters, other companies and individuals “browse overseas internet pages out of illegal motivations”, Li said.A 2015 report by the  US think tank Freedom House found that China had the most restrictive Internet policies of 65 countries it studied, ranking below Iran and Syria.China is home to the world’s largest number of internet users, which totalled 731 million as of December, the government-linked China Internet Network Information Center said Sunday.", "date": "January 23, 2017", "topics": ["Hacking News"]}, {"title": "Heartbleed Vulnerability Still Affects 200,000 Devices", "authur": "William Fieldhouse", "body": "Even though the number of services that are affected by the OpenSSL flaw also knows as Heartbleed has considerably decreased over the past decade, the Shodan search engine has still found more than 200,000 vulnerable devices.The Heartbleed, tracked as CVE-2014-0160, is a very critical vulnerability which allows the hackers to steal information that is protected by the SSL/TLS encryption. Some researchers believe that this flaw is used in an attack where hackers stole 4.5 million healthcare records.The search for vulnerable devices was conducted by Shodan in November 2015 and returned 238,000 results, those numbers dropped by roughly 1,000 by March 2016. A new search was carried out on this Sunday showed that there are 199,594 services which are still vulnerable to Heartbleed attacks.Most of the affected devices are located in the United States (with 42,000), followed by South Korea (with 15,000), China (with 14,000), Germany (with 14,000), France, (with 8,700), Russia (with 6,600), UK (with 6,500), India (with 5,800), Brazil (with 5,500) and Italy (with 4,800). HTTPS accounts for a major part of the impacted services.Initially, South Korea occupied the 8th place, but it now in the recent scans it became the second most affected country, apparently due to the devices operated by Boranet, SK Broadband and KT Corporation (formerly Korea Telecom).The list of top affected organizations also includes Verizon Wireless, Amazon, OVH in France, German ISP Strato, Comcast, German hosting firm 1&1 Internet, and Taiwan-based HiNet.Apache HTTP Server (httpd) is by far the most affected product, particularly versions 2.2.22 and 2.2.15, while the top operating system is Linux 3.x. Shodan also found that more than 70,000 of the affected services have expired SSL certificates.", "date": "January 23, 2017", "topics": ["Hacking News"]}, {"title": "Securities And Exchange Commission To Investigate Yahoo’s Disclosures", "authur": "William Fieldhouse", "body": "Officials at the U.S. Securities and Exchange Commission are reportedly digging into the timing of Yahoo’s hack disclosures to see whether the incidents should have been announced sooner.According to a report in the Wall Street Journal, the SEC took up an investigation into the matter and sent out requests for related paperwork back in December. Though the Journal noted the SEC has never yet done so in relation to a “cyberbreach,” the agency could potentially bring a suit against Yahoo for failing to disclose a cyber incident that could affect investors in a timely manner in keeping with guidance the Commission issued in 2011.Under the microscope here are two breaches announced by Yahoo late last year, including a late 2014 hack announced in September impacting 500 million accounts and an August 2013 infiltration announced in December that impacted more than a billion accounts. Both disclosures occurred more than two years after the fact, and the incidents were not mentioned during negotiations with U.S. wireless carrier Verizon, which agree in July to acquire Yahoo for $4.83 billion.Though the Journal noted the SEC has investigated other companies – including Target, which announced a breach of its systems within weeks – over hack disclosures, former SEC lawyers told the paper the Yahoo incidents seem to offer a better opportunity for the Commission to clarify the timing mentioned in its 2011 note.Though several executives have said the Yahoo deal still makes sense, Verizon has been pretty tight-lipped about whether or not it plans to follow through with the deal in light of the incidents. In a short statement back in December, the company said only it will “evaluate the situation as Yahoo continues its investigation” and will “review the impact of this new development before reaching any final conclusions.”Source: wirelessweek", "date": "January 23, 2017", "topics": ["Hacking News"]}, {"title": "Western Union Agrees Facilitating Wire Fraud and Pays $586 Million", "authur": "William Fieldhouse", "body": "The Western Union, A global financial services company has admitted to facilitating a wire fraud and it has agreed to pay $586 million as part of a settlement with U.S. Federal Trade Commission (FTC) and Department of Justice.The services of Western Union are used by many fraudsters and cyber criminals, and the authorities in the United States are very displeased with the company failing to maintain a proper anti-fraud program.Moreover, the company was accused of not taking an immediate action against the agents that knowingly processed the fraud payments in return for a share of the illegal profits. Since 2001, Department of Justice has convicted 29 employees and owners of Western Union agents for the fraud schemes they are involved in.According to the authorities, Western Union has violated many laws, those include the Bank Secrecy Act (BSA) and the FTC Act.The FTC said that more than 550,000 complaints are received by the Western Union in between January 2004 and August 2015, regarding these fraudulent transfers involving online dating, lottery, advance-fee, and family emergency scams. All these transfers sums-up to more than $632 million, but all this is believed to represent only a fraction as not all complaints are logged and not all victims filed a complaint.As a part of its settlement with FTC and the Justice Department, Western Union agreed to pay  $586 million, a sum that will be used to compensate the innocent fraud victims. The process by which the money will be distributed will be established later.The company will also implement and maintain a comprehensive anti-fraud program, thoroughly vet new and renewing agents, and suspend or terminate agents that don’t comply with its policies.The FTC has ordered Western Union to stop processing fraud-induced and telemarketing-related money transfers, provide more fraud warnings, create additional channels for fraud complaints, and refund fraudulent transfers.MoneyGram, Western Union’s main competitor, was also targeted by the FTC. The company agreed to pay $18 million in 2009 to settle charges.", "date": "January 23, 2017", "topics": ["Hacking News"]}, {"title": "Oracle Will Not Trust MD5 Signed JAR Files from April", "authur": "William Fieldhouse", "body": "The Jave developers are given more time regarding the JAR files that are signed with MD5 algorithm.Oracle wants to make sure that none of them exist. The Java Runtime Environment (JRE) will not support these types of files starting with the April of this year.Back in October Oracle has announced their plans to stop trusting JAR files that are signed with the MD5 algorithm, which is now very well known to have a lot of collision vulnerabilities. Oracle has stopped using the MD5 as their default JAR signing option in 2006 itself and now the company want to take things even to next level.From Java SE 8u131, that was scheduled to release with the April 2017 Critical Patch Update (CPU), the JAR files that are signed with MD5 will be treated as unsigned files and they will not be trusted anymore. Initially, Oracle had planned to stop trusting MD5-signed files from January 2017, but many developers have requested Oracle for additional time to prepare for the change.Developers are advised to check if their JAR files are signed using MD5 and then re-sign them with any stronger algorithm or key size. They will be using the below command in Zip to remove existing MD5 signatures:zip -d test.jar ‘META-INF/*.SF’ ‘META-INF/*.RSA’ ‘META-INF/*.DSA’“If you are using JARS you did not sign or build yourself, you need to contact your vendor for more information,” explained Oracle’s Erik Costlow in October. “If it can no longer be established if a JAR you are using has been signed with MD5, the recommended practice is to re-sign affected JAR files using a more modern algorithm.”They are other cryptography-related changes planned by Oracle this year for the JRE and JDK. They include disabling SHA-1 in certificate chains anchored by roots which is included by default in the JDK, and increasing the minimum key length for TLS and SSL to 1024 bits. ", "date": "January 22, 2017", "topics": ["Hacking News"]}, {"title": "Hackers Hijacked Radio Station and Played F*** Donald Trump Song", "authur": "William Fieldhouse", "body": "Crescent Hill Radio WCHQ 100.9 FM – a non profit radio station in Louisville has posted on Facebook that hackers have hijacked their station on last Friday afternoon and they broadcasted an anti-trump song was broadcast on it instead of regular transmission. The Facebook post appeared on the radio station’s page at 2:30 pm on Friday.The post says: “OK, not funny. Someone has hacked into out transmitter tower, and the FM was playing a mp3 clip repeatedly of %$^# Donald Trump.”WCHQ program director Gary Sampson said that the song broadcast was sung by rappers YG & Nipsey Hussle. The title of the song was “FDT (F*** Donald Trump).”Explaining further, Sampson said that this particular song interrupted the FM Feed of WXCHQ and continually played on the station for 15 minutes and then the station manager, Kathy Weisbach somehow broke the loop.Even though they managed to stop the broadcast, the damage has already been done. The song was played automatically and was strictly against the policy and vision of WCHQ, which is to remain unbiased radio station for the entire community. The main focus of the WCHQ is to promote local talent from Southern Indiana and Kentucky. Sampson said that they have deliberately avoided the topics of politics and other sensitive topics like religion. “It’s a matter of providing a community outlet for the musicians and artists. It is very disheartening that someone would take an opportunity to make a political statement. I want to apologize to the people who might have heard it and have been offended. We kind of feel like we are being used,” he added.The Courier-Journal reported that the WCHQ will be facing a complaint with the Federal Communications Commission because of this rap song incident.According to Sampson, the hackers most probably used a software to intercept and override the program that was already on-air at the time of hack.This is the song that was played:source: Hackread ", "date": "January 22, 2017", "topics": ["Hacking News"]}, {"title": "Popular Horse Racing Website in India Hacked with Dharma Ransomware", "authur": "William Fieldhouse", "body": "A famous horse racing website (Racingpulse.in) which operates from Bangalore city, India was hacked on this Tuesday. The attackers who hacked left a notice on the home page of this website that they have encrypted the entire data of this website. In the norm they left, they also informed about what they want as ransom. Their ransom note suggested that want ransom amount in Bitcoins while the amount to be paid was not disclosed clearly.They also mentioned an email address for further communication and it was registered at india.com. Here is a weired part, the hackers who encrypted all athe data in Racingpulse.in ofered an unimaginable favour to the website owners. They gave the decryption key of a maximum of three files for free which should not be more than 10mb of size. They probably did this to prove that they really hacked and encrypted all the files on the site. The note read:“All your files are encrypted: All your files are encrypted due to a security problem with your PC. If you want to have them back, write us to the e-mail [email protected], You have to pay for the decryption in Bitcoins. The price depends on how fast you write to us. After payment, we will send you decryption tool which will decrypt all your files. “Free decryption as a proof: Before paying you can send to us up to 3 files for free decryption. Please note that files should NOT contain valuable information, and their total size should be less than 10Mb.”Looks like the hackers are concerned about getting the facts straightly laid out, which is why they have also included the information on “How to obtain Bitcoins” in their ransom note with a detailed guideline on which site to access, how to register and buy the bitcoins using a certain payment method. The message has a link to the beginners’ guide to Bitcoins too.source: Hackread", "date": "January 22, 2017", "topics": ["Hacking News"]}, {"title": "Researcher claims to expose identity of Mirai Botnet Author", "authur": "William Fieldhouse", "body": "Famous infosec journalist Brian Krebs, had a website KrebsOnSecurity and it was targeted with a massive attack of Mirai botnets to launch a huge DDoS attack in October 2016. He has managed to identify the criminal. Looks like Brian Krebs has been working hard to find the creator of Mirai botnet that has become a huge online security threat by compromising a huge number of Internet of Things (IoT) devices and creating a series of infected botnets.Krebs started investigating to find the identity of the person after his website went down for four straight days due to a massive attack with up to 665 Gbps data traffic. Kerbs wanted to find out who that was and who is responsible for the attack. There are many more attacks on high-profile organisations including DynDNS. According to the Krebs, his analysed “hundreds of hours of research” as he was “desperately seeking the missing link between seemingly unrelated people and events.”He stated that the majority of DDoS attacks were launched to make quick money. For example, a company which offers DDoS protection may want to launch DDoS attacks on certain targets so that they get will be convinced about the dangers of not taking their service and then hire them for DDoS protection.In his opinion, the very same thing happened to his website and many other big websites such as Deutsche Telekom and French hosting service provider OVH that were attacked with Mirai malware by the use of hundreds and thousands of botnets in 2016.Now the most important revelation; Who was behind the attack on Krebs website?As per Krebs research, Protraf Solutions owner Paras Jha is responsible for recent attacks involving Mirai botnets, including the attack on his website krebsOnSecurity. Protraf Solutions is a DDoS protection service provider firm.source: hackread", "date": "January 22, 2017", "topics": ["Hacking News"]}, {"title": "Famous Email Encryption Service Provider ‘ProtonMail’ is Now on Tor", "authur": "William Fieldhouse", "body": "A group of experts from MIT and CERN launched ProtonMail in 2014 and it is the largest email encryption service provider in the world with more than two million users. Activists and journalists who like to keep their information secret usually choose ProtonMail.Last month, the co-founder of ProtonMail Dr Andy Yen announced that they would start allowing the users to access their mails directly using the Tor network. This move is taken to counteract against the steps taken by the governments around the world to reduce the user’s privacy.Dr Yen also said that they are proactively working to prevent the inevitable censorship in many countries. Further explaining why they choose Tor, he said, “Tor provides a way to circumvent certain Internet blocks so improving our compatibility with Tor is a natural first step.”This action sure looks like it is taken in a right direction considering the recent government actions to curb the public’s access to encrypted platforms and secure internet usage. Like the Egyptian government blocked encrypted chat platforms and application Signals and the UK government approved the Investigatory Powers Bill which aims to track the activities of the web browsers.We should note that ProtonMail consulted Roger Dingledine, the developer and President of Tor Project before they made their onion site. This is why the dependence upon the Tor in security email exchange is not avoidable. With their recent step, the Swiss company is now the world’s largest encrypted service provider offering Tor support.According to Shari Steele, the executive director of Tor Project, “Tor is an invaluable tool for protecting online freedom and guarding against state surveillance and censorship. We are always glad to see the increased adoption of Tor, and this appears to be a good example of how Tor onion services can be utilised for the public benefit.”", "date": "January 21, 2017", "topics": ["Hacking News"]}, {"title": "Quimitchin Malware Targets Macs and Linux Systems", "authur": "William Fieldhouse", "body": "The IT security researchers have recently found a new malicious code that affects Mac and Linux systems. It was dubbed by the Apple Inc., as Fruitfly while the Malwarebytes named it as Quimitchin, the name is inspired by Aztec spies. The newly identified malware can spy on biomedical research centres. It was speculated that this malicious code is active for many years only to be detected now.This malicious code was recently discovered by Malwarebytes after one of the IT administrators in there identified a strange pattern of incoming network traffic from one of the compromised Macs. Reportedly, the malware was designed to compromise the webcam and capture screenshots of Mac machine and simulate mouse clicks and key presses. Apart from all these features, it can also perform the regular malware function of providing the hacker or attacker with the ability to remotely control the machine.According to a blog post from a researcher Thomas Reed at the Malwarebytes, both Apple and Malwarebytes are yet to discovered how this malware is being distributed. What they have managed to find so far is that it is based made using some old-school coding techniques, which are so old that they date back to 2001 when the Mac OS X was launched.The most disturbing aspect is that Fruitfly also contains Linux shell commands and when Reed tried to run the malware on Linux machine, it worked “just fine” and only the Mac-specific code didn’t run. This means, the malware developers didn’t know much about the Mac system and they used old documentation for its development.“The presence of Linux shell commands in the original script suggests that there may be a variant of this malware that is expressly designed to run on Linux, perhaps even with a Linux executable in place of the Mach-O executable. However, we have not found such a sample,” noted Reed. ", "date": "January 20, 2017", "topics": ["Hacking News"]}, {"title": "Upto 40% Rise In Data Breaches In 2016", "authur": "William Fieldhouse", "body": "A record 1,093 data breaches were reported in 2016, a jump of 40% compared with the 2015 total of 780 breaches. A total of 36.6 million records were exposed last year, well below the 169 million records exposed in 2015. Partly the big year-over-year increase is due to better reporting and partly the jump is due to determined efforts by hackers and crooks to steal, or more recently hold for ransom, user data.The leading type of attacks for the eighth consecutive year were hacking/skimming/phishing attacks, accounting for 55.5% of all data breaches. According to the Identity Theft Resource Center (ITRC), much of the increase came from what are known as CEO spear-fishing attacks that fool corporate executives into revealing confidential employee records.ITRC chairman and founder Adam Levin noted:More than half of the breaches reported by the ITRC included the skeleton key to our lives: the Social Security number. This trend, which has accelerated since 2015— when just four breaches exposed over 120 million Social Security numbers to state-sponsored hackers and cyber criminals— represents the point of no return for millions of Americans. While credit and debit card numbers can be changed, SSNs cannot. Therefore, monitoring and damage control become even more important than ever before.The final tally on 2016 data breaches shows the following breakdown of the 1,093 breaches by category and records exposed. The medical care sector led all sectors in the number of records compromised in 2016, with 34.4% (376) of all data breaches last year. The number of records exposed in these breaches topped 15.9 million, or about 43.6% of the 2016 total. The government sector suffered 72 data breaches last year, representing about 37.9% of the total number of records exposed and 6.6% of the incidents. Over 13.8 million records were compromised in this sector in 2016. The business sector accounted for more than 5.6 million exposed records in 495 incidents. That represents 45.3% of the incidents, and 15.5% of the exposed records during 2016. The number of banking breaches totaled 52 for the year and involved about 72,000 records, some 4.8% of the total number of breaches and about 0.2% of the records exposed. The educational sector saw 98 data breaches in 2016. The sector accounts for 9% of all breaches for the year and more than 1 million exposed records, about 2.9% of the year’s total.Since beginning to track data breaches in 2005, ITRC has counted 6,789 breaches through December 13, 2016, involving more than 886 million records.Source: 247wallst", "date": "January 20, 2017", "topics": ["Hacking News"]}, {"title": "You Can Be Hacked If You Use This Browser Settings", "authur": "William Fieldhouse", "body": "If you do a lot of shopping online, taking advantage of your browser’s auto-fill setting may seem like a smart choice. Instead of digging your credit card out of your wallet every time you want to buy something, all the information you need appears automatically. But a new discovery made by a Finnish developer shows why the extra time you save per purchase may not be worth it: Hackers have found a sneaky way to retrieve your stored info.As Thrillist reports, anyone can fall for the scam by submitting a couple basic pieces of information. Web users think they’re just entering their name and email address, but “hidden” text boxes are automatically filled in with more sensitive data like address, phone number, and credit card number. Viljami Kuosmanen illustrates what this might look like in the Tweet below This is why I don’t like autofill in web forms. #phishing #security #infosec pic.twitter.com/mVIZD2RpJ3— Viljami Kuosmanen ⭐ (@anttiviljami) January 4, 2017//platform.twitter.com/widgets.jsEven if you’re extra careful about where you use the autocomplete feature, disabling it altogether is probably your best course of action. Saved credit card info could mean a free shopping spree for thieves if your laptop were to get stolen. Some browsers like Chrome save personal information by default: To deactivate the feature in Chrome, go to Settings, Advanced Settings, and uncheck the boxes beneath Passwords and Forms. ", "date": "January 20, 2017", "topics": ["Hacking News"]}, {"title": "Hackers Can Now Steal Your Fingerprints From Photos", "authur": "William Fieldhouse", "body": "Stop using the peace sign in your photos, hackers are stealing your fingerprints! Yes, we all know better than to post personal information on social media, but now hackers have the capability to steal your fingerprints from photos. Therefore, if you’re showing up the peace sign in photos you better stop it.Researchers at Japan’s National Institute of Informatics say that hackers have the capability of stealing your fingerprints from photos that are close up and clear.With your fingerprints, hackers may be able to get into your private account(s) and more. Thus, researchers at NII are advising people to beware of this latest form of infringement.While this may be shocking to some, we should remember that hackers have used the iris of some in photos to hack into accounts too. Perhaps we need to use those filters to our advantage and blur out some important information in photos posted on-line.", "date": "January 20, 2017", "topics": ["Hacking News"]}, {"title": "Friends May Hack Our Facebook Accounts", "authur": "William Fieldhouse", "body": "New research discovers it is relatively common, and easy, for someone to hack into our personal social media account. Surprisingly, the attack often comes from people we know and may happen on our own computer or device.In a survey of 1,308 U.S. adult Facebook users, University of British Columbia researchers found that 24 percent – or more than one in five – had snooped on the Facebook accounts of their friends, romantic partners or family members, using the victims’ own computers or cellphones.“It’s clearly a widespread practice. Facebook private messages, pictures or videos are easy targets when the account owner is already logged on and has left their computer or mobile open for viewing,” said Wali Ahmed Usmani, study author and computer science graduate student.People admitted to spying on their friends, family, and romantic partners out of simple curiosity or fun–for example, setting a victim’s status or profile picture to something humorous. But other motives were darker, such as jealousy or animosity.“Jealous snoops generally plan their action and focus on personal messages, accessing the account for 15 minutes or longer,” said computer science professor Ivan Beschastnikh, a senior author on the paper.“And the consequences are significant: in many cases, snooping effectively ended the relationship.”The findings highlight the ineffectiveness of passwords and device PINs in stopping unauthorized access by insiders, added electrical and computer engineering professor Kosta Beznosov, the paper’s other senior author.“There’s no single best defense–though a combination of changing passwords regularly, logging out of your account and other security practices can definitely help,” said Beznosov.Source: news.ubc.ca", "date": "January 20, 2017", "topics": ["Hacking News", "News"]}, {"title": "XSS Vulnerability Found in Acrobat’s Silently Installed Chrome Extension", "authur": "William Fieldhouse", "body": "Researcher Tavis Ormandy who was a part of Google Project Zero has discovered that a Chrome extension installed by Adobe silently last week had been affected by an XSS(cross-site scripting) vulnerability. After learning of its existence, Adobe quickly patched the flaw.The Adobe released an update to Adobe reader on January 10 and it was to address 29 vulnerabilities in it. However, some users are not pleased that the updates also automatically installed an Adobe Acrobat Chrome extension which was designed to convert web pages into PDF files.This extension is available only for Windows. This extension requires the permission to access data on the websites that the user visits, communicate with cooperating native apps and manage downloads. This tool also collects information from the system, but still, Adobe claims no personal information is involved and the “anonymous data will not be meaningful to anyone outside of Adobe.”After thoroughly analysing this extension, which already has like 30 million installs, Ormandy identified that a DOM-based XSS vulnerability which allowed privileged JavaScript code execution. The experts classified this security hole as a “critical severity.”“I think CSP [Content Security Policy] might make it impossible to jump straight to script execution, but you can iframe non web_accessible_resources, and easily pivot that to code execution, or change privacy options via options.html, etc,” the Google researcher explained in an advisory.The issue was reported to Adobe back on January 12 and it was patched a few days after that. It is not surprising that the vulnerability was fixed quickly considering that many of the flaws found in Adobe products are reported by Google Project Zero researchers or through the Chromium Vulnerability Rewards Program.This was not the first time Ormandy identified a vulnerability in a Chrome extension. Roughly one year ago, the expert revealed that an extension automatically installed by AVG AntiVirus exposed user’s personal data and other browsing histories.", "date": "January 19, 2017", "topics": ["Hacking News"]}, {"title": "Hacker Exploited A Remote Code Execution Bug On Facebook", "authur": "William Fieldhouse", "body": "A security researcher named Andrew Leonov has discovered a critical remote code execution bug on Facebook. This allows him to breach the security of the social media giant using ImageMagick flaw which was previously patched in 2016. Andrew was successful in using the bug to carry the attack against the Facebook servers.In his blog post, Andrew explained that he reported this issue to Facebook back in October 2016 but the ImageMagick bug is still relevant and active in Facebook. Andrew was awarded $40,000 for providing Facebook security team with an in-depth proof of concept (PoC) and they said they have patched it.AAndrew explained that all of this happened unintentionally when he was searching for a flaw in a different service which then redirected him on Facebook and further analysing it allowed him to discover the remote execution bug.“Once upon a time on Saturday in October I was testing some big service (not the Facebook) when some redirect followed me on Facebook. It was a “Share on Facebook” dialogue. “I am glad to be the one of those who broke the Facebook,” said Leonov.You must be noted that the largest payment awarded ever given by Facebook as a part of its bug bounty program was $33,500 to Reginaldo Silva back in 2014, he also reported a similar remote code execution bug. To confirm the payment, The Register has contacted Facebook.By the time of publishing this article, there was not a single official statement from Facebook or CrowdBug confirming whether Leonov was awarded $40,000. However, this is not the first time when ImageMagick security flaw is in the news for all the wrong reasons. In 2016, a hacker used the same flaw to destroy Fur Affinity Art Gallery website.", "date": "January 19, 2017", "topics": ["Hacking News"]}, {"title": "This Malware Campaign Targets Chrome Users", "authur": "William Fieldhouse", "body": " A recently observed malware distribution campaign has been specifically devised to target users of the Chrome browser on Windows-based computers, Proofpoint security researchers warn.The campaign uses the infamous EITest infection chain, which has been previously associated with numerous exploit kit attacks leading to ransomware, information stealers, and other malware. First documented in 2014, EITest has seen numerous changes, and the switch to more targeted attacks instead of relying on exploit kits for infection is one of them.The newly observed attack change was first noticed in December, when a compromised website was dropping the “Chrome_Font.exe” file onto visitors’ computers. The site, Proofpoint discovered, was EITest-compromised, and was dropping the file only after a series of filtering mechanisms were triggered.The attack, security researchers found out, was targeting Chrome for Windows users specifically. As soon as the visitor was determined to use this browser, the code injected in the page would make text unreadable, and a fake alert was displayed, prompting the user to download and install a file supposedly containing new fonts.“The infection is straightforward: if the victim meets the criteria – targeted country, correct User-Agent (Chrome on Windows) and proper referer – the script is inserted in the page and rewrites the compromised website on a potential victim’s browser to make the page unreadable, creating a fake issue for the user to resolve,” Proofpoint researcher Kafeine explains.The website, however, would attempt to infect Internet Explorer users as well. As long as they met specific criteria, they were exposed to a more “classic” exploit kit attack, the researcher notes.The attack on Chrome users relied on storing all the data between HTML tags in an array, then replacing them with “&#0”. Because this is not a proper ISO character, the browser would display the replacement character � instead.", "date": "January 18, 2017", "topics": ["Hacking News"]}, {"title": "Anonymous Warns Donald Trump: We Know What You Did", "authur": "William Fieldhouse", "body": "The ever so popular hacking group Anonymous has posted a series of tweets today to warn the US President-elect Donald Trump that they would expose his Russian relations.These messages are published by the Anonymous after Donald Trump took Twitter to suggest that outgoing CIA head John Brennan may be involved in the spreading of the fake news which made the headlines in the past few weeks, thia includes “Crimea, Syria, Ukraine and the build-up of Russian nukes.”The @YourAnonCentral Twitter handle, which more than 150,000 followers, and was one of the first to reply to the Donald Trump’s tweet. In the tweet, they accused the President-elect of being directly involved in some shady activities in Russia.“[email protected] you have financial and personal links with Russian mobsters, money launderers, and child traffickers” said Anonymous in their first message.“This isn’t the 80’s any more, information doesn’t vanish, it is all out there. You will regret the next 4 years. We could care less about Democrats attacking you @realDonaldTrump, the fact of the matter is, you are implicated in some really heavy s**t. Roy Cohen and your daddy are not here to protect you anymore. Oh and please tell your interns to not waste money hitting us with your Moldavian bot farm, stay frosty @realDonaldTrump.”\nIt can go without saying that the Donald Trump did not respond to the Anonymous’ tweets, and there is absolutely no chance he did not notice them since he’s such a big Twitter fan.In the other news, Donald Trump said he will keep his personal Twitter account in the next four years, so expect similar messages to be posted occasionally during his tenure at the White House.As far as Anonymous is concerned, the hacking group hasn’t said anything about when and how it could leak the information about the new President of the United States.", "date": "January 18, 2017", "topics": ["Hacking News"]}, {"title": "Our Private Cell Number On Facebook Is Not So Private Hacker Claims", "authur": "William Fieldhouse", "body": "A Belgian hacker named Inti De Ceukelaire who is also a security researcher has recently discovered a new method that sabotages the Facebook’s claim to protect the users’ data through its comprehensive privacy setting features. The hacker has discovered that he can use this exploit and obtain cell phone numbers of users on Facebook, which they have kept private.According to Ceukelaire, he can easily identify the mobile numbers of popular personalities and also celebrities just by simply checking out their Facebook profile. He did it by analysing the numbers which are associated with their profiles. You should note that these numbers are supposed to be private and not available to be seen by anyone.Reportedly, De Ceukelaire proved that his claim is true by obtaining the cell number of Jan Jambon, Interior Minister for Belgium, just from his Facebook profile. He further stated that: “For clarity, I can find out his number on his account but not vice versa. Roughly, I think you get the number 20 percent of the Flemish people could find that way. Rest all the people who have their mobile number linked to their profile goes into the huge bite of 80 percent.”twitter.com/intidc/status/819176305824591872/photo/1Ceukelaire has already warned the Facebook security team about this issue twice and he stated that he might expose it to the public if they did not fix the issue and make necessary changes as soon as possible. However, according to Facebook’s representatives, this is not a vulnerability and it has been seen as a feature rather than as an exploit. He also notified law enforcement authorities about the exploitable aspect of this feature. ", "date": "January 18, 2017", "topics": ["Hacking News"]}, {"title": "Super Cell got hacked!! 1.1 Million accounts stolen!! Clash of clans isn’t safe anymore", "authur": "Harikrishna Mekala", "body": "If you have a Supercell account then the time has come to change your password.If you don’t know supercell they are the creators of trending Games such as Clash of Clans, Clash Royale, Boom Beach and HayDay.It is said that 1.1 Million accounts are hacked and the hackers have even started to trade the information of the victims.It should be noted that the hack affects the vBulletin forums belonging to Supercell, with the hack quite possibly relating to an unpatched critical vulnerability made public a number of months ago.In words of Super CellAs we’ve said before, to provide our forum service we use software from vbulletin.com. We’re currently looking into report that a vulnerability allowed third party hackers to gain illegal access to some forum user information, including a number of emails and encrypted passwords. Our preliminary investigation suggests that the breach happened in September 2016 and it has since been fixed.We take any such breaches very seriously and we follow very strict policies when it comes to security. Please note that this breach only affects our Forum service. Game accounts have not been affected.To make sure your account is not being accessed without your knowledge, please change the password you are using on this forum as soon as possible. You can reset your password here: https://forum.supercell.com/login.php?do=lostpwWe also strongly advise you to change the password in any other systems you are using with the same login. As a general guideline, matching credentials should not be used on multiple sites.We apologise for the inconvenience this has caused.It is said that the breach occurred last year in the time September however it was posted in the companies forums that users should change their password.The hacked data consists of email ID’s , hashed passwords and IP address of the users if you are on a static IP the hacker might know your IP now.It is said that Supercell uses VBulletin Forums software which will hash passwords but the password hashes are aren’t strong.A website named LeakBase claims that around the database of 1.1 Million user accounts all the data is verified by using the email address, A company called motherboard verified that data using the email address are included when they tried to create new accounts the forum is showing that the account already exits.In the official statement, supercell stated that it will take these hacks very seriously and it ensures it’s users to follow strict security measures to ensure a good secure forum.This isn’t the only company that got affected but many companies such as Epic Games, LifeBoat, GTA and Clash of Kings still use the same older versions of the VBulletin software.It is recommended to our readers to use the different password for different online accounts.Take your time to comment on this article. ", "date": "January 18, 2017", "topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized"]}, {"title": "Largest National Health Service in UK Faces Cyber Attack", "authur": "William Fieldhouse", "body": "The Barts Health NHS Trust in London UK has suffered an unspecified ‘IT attack’ on this January 13. First reports suspect that it was due to a ransomware attack, but that has since been ruled out. Nevertheless, a number of drives offline drives are taken by the trust as a precautionary measure.The Barts (Wikipedia) is the largest National Health Service (NHS) Trust in the London, United Kingdom. It is being operated in five hospitals in London: Newham University Hospital, Mile End Hospital, St. Bartholomew’s Hospital in Smithfield in the City, The Royal London Hospital in Whitechapel, and Whipps Cross University Hospital.The health service journal HSJ reported this Friday that(subscription required), “The largest NHS hospital trust in England has been infected with a ransomware causing it to take its pathology service offline, HSJ can reveal.”The claim was made based on the reports of an internal email to the employees warning that the trust was suffering a “ransomware virus attack issue,” which is followed by an afternoon communication warning that three of the trust’s four hospitals had engaged “operating downtime procedures” for their pathology systems.However at the time of this report, the only official statement from Barts rules out ransomware. “On 13 January Barts Health became aware of an IT attack,” it states. “We continue to urgently investigate this matter and have taken a number of drives offline as a precautionary measure. Importantly, we can now rule out ransomware as the root cause. We have also established that in addition to the Trust’s core clinical system Cerner Millennium, Radiology and imaging from X-rays and scans continue to be used as normal. We have tried and tested contingency plans in place and are making every effort to ensure that patient care will not be affected.”The nature of the attack is yet ti be specified. It is not yet known whether it is an attempt to steal confidential data, or a just a virus/worm infection spreading through Bart’s networks.", "date": "January 18, 2017", "topics": ["Hacking News"]}, {"title": "Many Mobile Apps Leak Hardcoded Keys Unnecessarily", "authur": "William Fieldhouse", "body": "Many third-party applications are unnecessarily storing keys or secrets which could be abused to leak a variety of user details and credentials and other kind of sensitive data, warns software security startup Fallible.Reverse engineering tools are used to extract the data from these android applications, the data is in hardcoded keys or secrets which should not be there in the very first place.All these keys can leak data related to some of the popular online services, including Flickr, Slack, Dropbox, Twitter, and Uber, as well as Amazon AWS data, which can be incredibly damaging to both the users and affected companies. Although the percentage of these insecure apps is very small, their existence is still something to worry, researchers say.The tools used to reverse-engineer these Android apps and discover secrets stored in them are accessible online and have been used to analyse more than 16,000 apps since the initial launch in November 2016. In these tests, they found that most of these apps didn’t have any sort of key or secret present in them, about 2,500 were found to have pack hard coded keys or secrets pertaining to a third-party service.“Some keys are harmless and are required to be there in the app, for example, Google’s API key but there were lots of API secrets as well which definitely shouldn’t have been in the apps,” reveals Fallible. 304 such applications are filtered out in the end.“The type of secret leaks we found in Android apps ranged from AWS credentials some with full access which could be used to shutdown services and lead to data leak and destruction, API secrets of various services like Uber, Twitter, Dropbox, Instagram and Stripe secret key, SMTP server credentials, MySQL/RDS/Mongo credentials along with connection string which in turn leads to user data leak and more,” he Abhishek Anand, Fallible co-founder. ", "date": "January 17, 2017", "topics": ["Hacking News", "News"]}, {"title": "Gmail Phishing Attack: Do Not Open It", "authur": "William Fieldhouse", "body": "Gmail users have been warned to beware a new online scam which could leave them open to hackers.Hackers are tricking customers of Google’s email service into clicking on fake links which then let criminals steal their personal information.Discovered by Mark Maunder, the CEO of WordPress security plugin Wordfence, the attack first sees the hacker send an email appearing to contain a PDF with a familiar file name.That PDF, however, is actually a cleverly disguised image that, when clicked, launches a new tab that looks like this: It’s the Gmail sign-in page, right? Not quite. A closer look at the address bar will show you that all is not quite as it seems:However the page is actually a portal for hackers to steal your email address and password information – giving them full access to your account.The hackers can then spread their virus even further by sending emails to all of your contacts.And even worse, if you use the same login details for other websites or accounts, the hackers will be able to gain access to these to. If you’re worried that a phishing email has landed in your inbox, there’s an easy way to make sure you don’t hacked.The second login page, which opens when you click on the infected link or attachment, will display a web domain a world apart from what it should be.That’s because the criminals use a tactic called “data URI” (shown above), where a legitimate-looking web address is put in the domain name, but then followed up by a load of white space which hides a malicious link.The best way to make sure you don’t caught out is to make sure that the domain you use to log in has nothing before the hostname ‘accounts.google.com’ other than ‘https://’ and the green lock symbol.Source: wordfence.com", "date": "January 17, 2017", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "3 Indian Banks Are Under Cyber Attack", "authur": "William Fieldhouse", "body": "Systems of three banks have been infiltrated by hackers to create fake trade documents that may have been used to raise finance abroad or facilitate dealings in banned items. The banks are government owned and two of them are headquartered in Mumbai and one in Kolkata.The banks in question discovered that their SWIFT systems – the global financial messaging service banks use to move millions of dollars and documents across borders every day – have been compromised to create fake documents. However, they aren’t still sure about the origin of the attack and the intention of the hackers.It’s learnt that soon after the breaches were reported to the Reserve Bank of India, the regulator last month directed several banks to cross-check all trade documents issued over the past one year.“The nature of the attack is unfamiliar to Indian banks. While there is no monetary loss and ransom demand as yet, there are fears that the banks’ systems have been misused. There was fraudulent duplication of trade documents like letters of credit (LC) and guarantees. These the hackers may have encashed or are planning to encash with some offshore banks. It’s also possible that hackers did not present the fake LCs to raise funds but to carry out trade of prohibited or illegal commodities,” a person familiar with the breaches told ET.An LC, serving as a guarantee, is a letter that one bank writes to another bank (particularly in another country) to ensure payment to the supplier of goods when certain conditions are met. Besides messages for fund transfers, the SWIFT system is also used to communicate trade documents. Thus, a cyber-criminal who generates fake LC may attempt to place it with an offshore bank for finance. The Indian bank (whose system has been misused to create false LC) may later face a monetary claim when the foreign bank tries to recover the money released against an LC or guarantee.", "date": "January 17, 2017", "topics": ["Hacking News"]}, {"title": "Russian Hackers At It Again Over Brits", "authur": "William Fieldhouse", "body": "Russian hackers get blamed for everything these days – from Hillary Clinton’s loss of the presidential election in November to, in a latest, the leak online of the final episode of the BBC drama Sherlock a day before it was due to air.\nAnd Russian state broadcaster Channel One blamed hackers for the leak of the final episode of the fourth series of the popular detective drama starring Benedict Cumberbatch on Saturday, complete with Russian dubbing.It was shown just after midnight Moscow time Monday, simultaneously with Britain.In a rare show of cooperation, spokeswoman Larisa Krymova Channel One “has been in close contact with the BBC from the moment it learnt of the leak and is carrying out an investigation to identify the source of the material uploaded onto the Internet.”The BBC reportedly said Sunday that it had launched a full investigation, with a source at the corporation as claiming that the leak was “more than an accident.”On Russian-language Twitter, hashtags and jokes about the leak were trending over the weekend. “That moment when the Russians have watched your show before you,” wrote one Twitter user, nfzaz1995.", "date": "January 16, 2017", "topics": ["Hacking News"]}, {"title": "Hackers Found A Way To Bypass Google Security And Watch Porn In YouTube", "authur": "William Fieldhouse", "body": "Hackers have found a simple trick to bypass Google’s stringent policy on hosting sexual and pirated content via its YouTube service. These Internet scoundrels are uploading illegal and inappropriate content to the streaming content provider and YouTube is undergoing a serious crackdown to stop the secret porn and stolen content rush.A report from website Torrent Freak shares how users are able to trick Google’s high-end Content-ID security system by simply listing uploaded video as “private” content. These unlisted videos are then given direct links with content coming straight from Google’s servers. Typically, Content-ID has checks and balances in place to note what kind of content is going on the site.While YouTube has a host of pirated videos, albums, and movies, the stashing of porn via the site has seen a recent uptick.This hosting hack has given a rise to adult sites using Google’s servers to host their illegal content. The direct links grabbed from the uploads are then embedded on other websites, pulling content directly from YouTube on the back end and giving the pirates endless opportunities to stream unbeknownst to Google or, if the content is pirated, the original owners.Google has been doing its best to take down the adult content as it discovers it but the task is arduous at best. Trying to locate the content has proven difficult and unless original owners say something, the company is unable to identify much of the videos.No reports or data area available as of yet to determine how likely this hosted pornographic content could show up. If you have kids or otherwise don’t wish to see this type of content up on your various YouTube video watching sessions, there are a number of tips online on browsing safely. Still, due to the nature of this type of security breach, results could be unexpected and random.Source: yahoo.com", "date": "January 16, 2017", "topics": ["Hacking News"]}, {"title": "Hackers Target Putin’s Website Thousands of Times A Day", "authur": "William Fieldhouse", "body": "One of the Russian officials revealed that the country Russia faces hundreds and sometimes thousands of cyberattacks every day, many of those are launched from the United States.Russia is the country that’s most often blamed for cyber attacks that happen on other nations. Even the United States claims that Kremlin had tried to disrupt the election process in 2016. But the country’s Security Council head Nikolay Patrushev told that the Russia itself was a target for hackers.In a public statement, Nikolay said that the US authorities accusing Russia of hacking their systems has no proof and they are just false allegations.“Obama’s administration accuses Russia of hacking attacks without giving any proof, but deliberately ignores the fact that all major internet servers are located on US territory and are used by Washington for intelligence and other purposes aimed at retaining [US] dominance in the world,” he said.Moreover, the Russian official said that his country itself is a target for hackers, who are always trying to break into the Kremlin government’s computers to steal data.“Recently we noted a great increase in attempts to inflict harm on Russia’s informational systems from the external forces,” he stated.President Vladimir Putin is also one of the popular targets for hackers, and his website is continuously under attack, Patrushev revealed. There are days when the number of cyber attacks launched against Putin’s website exceeds one thousand, he said, and many of these attempts are launched from the Europe, United States, China, or India.“However, it does not lead to a situation when we say that we know [US President Barack] Obama ordered [this attack] and the White House is behind it,” he continued.", "date": "January 16, 2017", "topics": ["Hacking News"]}, {"title": "Venezuela Government Websites Hacked", "authur": "William Fieldhouse", "body": "Three websites that belong to Venezuela government are recently hacked by Kapustkiy, a hacker who managed to access private databases which has sensitive information.These three sites are estudiosydesatres.gob.ve, snv.gob.ve, and sunaval.gob.ve, all of which belong to various departments of the Venezuelan government. These websites contain vulnerabilities which are exploited by the white hacker Kapustkiy.In a statement provided to the Softpedia earlier, Kapustkiy said that the cyberattack was launched in protest to the dictatorship of president Nicolas Maduro. This is the second time he hacked Venezuelan government websites with that intention in mind.“I am against dictatorship of Nicolas Maduro on the Venezuela. I am tired of seeing, Nicolas Maduro running as president. It is time to leave, you m******r,”  reads a message that was included in a database dump.Kapustkiy is a part of New World Hackers. He revealed that he managed to breach one of the websites using a Local File Inclusion (LFI) vulnerability it’s database, while he hacked the other two using typical SQLi exploit.A database dump that was provided to us included what seem to be emails, names, phone numbers, and passwords (hashed) belonging to several individuals. While we can’t tell how critical these details are(yet), they all seem to be private information and none of the exposed emails are found online.At the time of writing this article, all websites are still running fine, and it’s not yet clear if authorities in Venezuela are aware of the breach. The attempts to contact the Venezuelan government and several individuals made by the Softpedia regarding this topic ended up with no response, which is probably an indication that site administrators aren’t very keen on patching vulnerabilities exposing user data.", "date": "January 15, 2017", "topics": ["Hacking News", "News"]}, {"title": "German Governmental Computers Gets Average Of 20 Attacks Every Day", "authur": "William Fieldhouse", "body": "Different hacking groups conduct an average of 20 attacks against the computers of Germany’s government every day, local media reported Friday.The Bild newspaper reported citing the government response to the parliamentary request of Germany’s Die Linke (The Left) party that at least one attack a week was conducted by security services of foreign countries.Earlier in the day, German media reported citing officials from the country’s Defense Ministry that about 47 million of hacking attacks had been registered by December 2016, while some 9 million of them had been classified as very dangerous.The issue of hacking attacks against government networks in different countries has come under the spotlight in recent months after a number of US officials has claimed that Russia has affected the 2016 US presidential election, hacking the country’s political institutions and individuals. Moscow has repeatedly denied Washington’s allegations it was behind the breach or that it had any desire to interfere with the US election.Source: sputniknews", "date": "January 15, 2017", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Cyber Expert Advise: Think Twice Before You Download Apps", "authur": "William Fieldhouse", "body": "Now you know that pirated phone applications are now being used to hack into personal details, including photographs and bank credentials, of mobile phone users. With the help of malware implanted in them, hackers are accessing mobile wallets and banking applications on people’s mobile phones.This has become a cause for concern as online transactions have increased in the wake of demonetisation, and the number of such malware entering mobile phones are also on the rise, experts have said. The victims are also led to malware implanting websites through links sent through WhatsApp messages.Pavan Duggal, Supreme Court advocate specialising in cyber law, said that the number of cases pertaining to mobile wallets being comprised in Bengaluru itself has gone up. “In the wake of demonetisation, breaches in cyber security have increased,” he said.Mobile users should be aware that the malware, including ransomware, keylogger and coat-trailing trojans, can be transmitted through the applications. “These malwares infiltrate the mobile phones and computers too,” said N. Vijayshankar, cyber security expert. They point out that there are three methods in which a phone or laptop can get compromised by a malware – via an application-led attack, through browsers or through Internet networks like free Wi-Fi.“Once a malware such as ransomware is implanted in the phone, it either locks the phone or encrypts the data. Important data like photos, bank details and other information can be stolen,” said Kapil Awasthi, security evangelist, Checkpoint, India, a cyber-security company.With the increase in digital payment mechanisms, ransomware operators can be expected to launch more attacks. “Earlier, laptops used to be the targets for malware. Now, even mobile phones are targets. In the last eight months, we have seen desktops, which are behind layers of security in an organisation, also being attacked by ransomware,” he said.Once locked or encrypted, the hackers demand a ransom. “Most often the payment has to be through bitcoins. However, the ransom is most often an amount that is affordable by the victim,” added Mr. Awasthi.Meanwhile, the key logger malware captures the key strokes and in this manner steals the credentials. The accompanying trojan on the other hand enters a particular site, like that of a bank, when the victim logs in and then transfers the money into different accounts.Mr. Duggal added that there is a need to have a proper legal framework to assist victims who lose money to cyber criminals. “There should be dedicated cyber security laws as India is already on the way to a cashless economy,” he said.Source: thehindu", "date": "January 14, 2017", "topics": ["Hacking News"]}, {"title": "WhatsApp Says The ‘Backdoor’ Claim Is Just Bogus", "authur": "William Fieldhouse", "body": "Recently the allegations of WhatsApp having a backdoor that is used for third-party snooping went viral on social media platforms. Now all these allegations are shot down by WhatsApp, which called the allegations false.On last Friday, news outlet from The Guardian reported that a cryptography researcher found a backdoor in WhatsApp’s messaging service which could “allow Facebook and others to intercept and read the encrypted messages.”In a short statement, WhatsApp said the claim was not true:“WhatsApp does not give governments a ‘backdoor’ into its systems and would fight any government request to create a backdoor. The design decision referenced in The Guardian story prevents millions of messages from being lost, and WhatsApp offers people security notifications to alert them to potential security risks. WhatsApp published a technical white paper on its encryption design, and has been transparent about the government requests it receives, publishing data about those requests in the Facebook Government Requests Report.”The Guardian report included the research by Tobias Boelter who is a cryptography and security researcher at University of California, Berkeley. Last April, Tobias took these findings to WhatsApp and published a report that what he posted could be either a backdoor or a flaw in WhatsApp’s messaging platform. Tobias Boelter later said The Guardian that the “backdoor” gave WhatsApp ability to read messages because of the way the company has implemented its end-to-end encryption protocol. Reporters quoted Kirstie Ball, co-director and founder of the Centre for Research into Information, Surveillance and Privacy who verified Boelter’s research and stated the “backdoor” made WhatsApp an “an extremely insecure platform.”The Guardian explains Boelter’s alleged backdoor like this:WhatsApp’s end-to-end encryption relies on the generation of unique security keys, using the acclaimed Signal protocol, developed by Open Whisper Systems, that are traded and verified between users to guarantee communications are secure and cannot be intercepted by a middleman. However, WhatsApp has the ability to force the generation of new encryption keys for offline users, unbeknown to the sender and recipient of the messages, and to make the sender re-encrypt messages with new keys and send them again for any messages that have not been marked as delivered.The recipient is not made aware of this change in encryption, while the sender is only notified if they have opted-in to encryption warnings in settings, and only after the messages have been re-sent. This re-encryption and rebroadcasting effectively allows WhatsApp to intercept and read users’ messages. ", "date": "January 14, 2017", "topics": ["Hacking News"]}, {"title": "Adobe Sneaks a Google Chrome Extension in Latest Security Update to Collect Data", "authur": "William Fieldhouse", "body": "I noticed the Google Chrome Extension for Adobe Acrobat added to my browser when I opened Chrome. I am sure you also would have found the same. If you did and clicked on Remove button, you are safe but if you chose to let the extension be there in your browser, you might be in a little trouble.On this Tuesday, Adobe released some latest updates that fix security issues and vulnerabilities regarding Adobe Reader. But, according to SwiftOnSecurity, the Google Chrome extension has another purpose. It is not there to fix vulnerabilities but to extract data about your system. The extension also asks for various permissions such as to Read and Change the entire data you have entered on other websites that you often visit. This plugin asks permission for three things:“Read and change all data on the websites you visit,” “manage your downloads,” and “communicate with cooperating native applications.” The extension gets installed on the system directly and also includes telemetry features for collecting data. The data is sent to the Adobe’s servers, there the company uses it for their own purpose. Adobe claims that they only use information about your browser type and version installed on the system and no personal data is being collected. But still, combining a Chrome extension into a security update is very suspicious act considering that most users are going to install it unknowingly.The extension has been named Adobe Acrobat and it automatically gets added to Chrome while the system is installing Adobe’s latest update. But, it does require users’ permission for its activation on the system. However, users are not prompted to let it be installed on the system while the security patch is deployed and therefore, it is evident that Adobe is trying to embed telemetry data collection extension on systems where Adobe Acrobat Reader is installed. ", "date": "January 14, 2017", "topics": ["Hacking News"]}, {"title": "Hackers Failed Attempt To Sell Stolen NSA Hacking Tools", "authur": "William Fieldhouse", "body": "In August, a mysterious group known as the Shadow Brokers claimed to have obtained computer programs that are believed to be associated with the National Security Agency.The Shadow Brokers posted snippets of the files online, which security experts determined were likely to belong to the Equation Group, a similarly mysterious hacking group. The group then tried to auction them off to the highest bidder, and said that if they received 1 million Bitcoin, they would release everything to the public.Yesterday, the Shadow Brokers abandoned their effort. They failed to attract serious bids in part because, according to The Wall Street Journal, “the auction wasn’t structured in a way that would attract serious buyers, such as instructing bidders to send funds in bitcoin with no way to recover the funds if they lost.”They also went dark by dropping 61 new files online, many of which CyberScoop is calling outdated exploits against the Windows operating system.“Despite theories, it always being about bitcoins for TheShadowBrokers,” their farewell message reads, in broken English. “Free dumps and bullshit political talk was being for marketing attention. There being no bitcoins in free dumps and giveaways. You are being disappointed? Nobody is being more disappointed than TheShadowBrokers.”", "date": "January 14, 2017", "topics": ["Hacking News"]}, {"title": "McAfee: Hackers Faked Locations In DNC Hack", "authur": "William Fieldhouse", "body": "Cyber Security expert and founder of the anti-virus software McAfee, and MGT Capital Investments CEO John McAfee firmly believes Russia wasn’t involved in the Democratic National Committee, hereinafter DNC, hack.According to the Joint Analysis Report released by the FBI, the group of cyber criminals that allegedly hacked the DNC used various locations apart from Russia to breach the DNC’s servers. In fact, the majority of IP addresses listed in the report were traced all over the world outside of Russia.By the variety of IP address traces alone, McAfee states that the group of hackers faked their location and eliminated any branches of data that could have linked back to them. It is more likely that a third party organization or group initiated the attack to create controversy involving the Russian government.By the variety of IP address traces alone, McAfee states that the group of hackers faked their location and eliminated any branches of data that could have linked back to them. It is more likely that a third party organization or group initiated the attack to create controversy involving the Russian government.According to McAfee said in an interview with Larry King, “If I was the Chinese and I wanted to make it look like the Russians did it, I would use the Russian language within the code, I would use Russian techniques of breaking into the organization. There simply is no way to assign a source for any attack.”Whether it was the Russians or independent hacking groups from all over the world that hacked the DNC isn’t necessarily important. In actuality, it is more urgent to evaluate the vulnerability of the IT infrastructure and the poor security measures of government-owned platforms.As of late, the United States government and its investigators are allocating their resources solely to unraveling the faces behind the hacking. Less time has been spent on analyzing how the DNC was hacked in the first place and if the government can develop resilience towards similar types of attacks in the future.Cases like the DNC hack are pushing the demand for non-backdoorable and decentralized technologies, wherein information is securely kept, transferred in a decentralized ecosystem and processed efficiently.The reliance and dependence on central servers to store any type of data can easily expose important information to sophisticated hacking attacks or data breaches.As a response to various controversial cases stemming from manipulation of data banks and financial institutions are increasingly testing Blockchain technology to process transactions securely.Source: cointelegraph", "date": "January 14, 2017", "topics": ["Hacking News"]}, {"title": "Notorious Hacker Group Quit Operation and Giving Away Windows Hacking Tools For Free", "authur": "William Fieldhouse", "body": "Earlier this week, we have reports which state that the notorious hacking group Shadow Brokers is selling their hacking tools. These tools can be used to hack Windows-based devices. Today to our surprise, the group has suddenly decided to quit its operation and is now giving away some of its stolen Windows hacking tools to public for free.In a goodbye note on the hackers’ website, they revealed that they are going dark as all they want os money(in their case bitcoin) and since they are not able to get enough Bitcoins, they decided to quit. But, the address of bitcoin of hackers group is still active and if they receive 10,000 BTC they vow to come back and dump the passwords for Windows and Linux.In the very same time, the hackers group wants to sell some of their Windows hacking tools for a total of 750 BTC. Thi sure seems like a desperate move before they vanish into the dark world of Internet. An analysis of the tools provided by the hackers is available at Heimdal Security’s blog post.https://twitter.com/shadowbrokerss/status/819537298245218304/photo/1Here is a list of hacking tools that are being sold by the group:ST1.14 – DanderSpritz Backdoor – 25.0 BTCUtBu – DanderSpritz Plugin – 10.0 BTCDark Skyline – DanderSpritz Plugin – 10.0 BTCDemi – DanderSpritz Plugin – 10.0 BTC Pacu – DanderSpritz Plugin – 10.0 BTC\nTedi – DanderSpritz Plugin – 10.0 BTC\nZbng – DanderSpritz Plugin – 10.0 BTC\nPc – DanderSpritz Plugin – 10.0 BTC\nLegacyWindowsExploits – DanderSpritz Exploits – 25.0 BTC\nSCRE – DanderSpritz Plugin – 10.0 BTC\nDf – DanderSpritz Plugin – 10.0 BTCGath – DanderSpritz Plugin – 10.0 BTC\nDAPU – DanderSpritz Plugin – 10.0 BTC\nEP – DanderSpritz Plugin – 10.0 BTC\nDanderSpritz Base – DanderSpritz LP Only – 25.0 BTC\nGrDo – DanderSpritz Plugin – 10.0 BTC\nGeZu – DanderSpritz Plugin – 10.0 BTCDmGz – DanderSpritz Plugin – 10.0 BTC\nGrCl – DanderSpritz Plugin – 10.0 BTC\nStLa – DanderSpritz Plugin – 10.0 BTC\nPfre – DanderSpritz Plugin – 10.0 BTCDsky – DanderSpritz Plugin – 10.0 BTC\nDanderSpritz All – DanderSpritz Everything – 250.0 BTCGrok – DanderSpritz Plugin – 10.0 BTC\nPC2.2 – DanderSpritz RAT – 25.0 BTC\nFlav – DanderSpritz Plugin – 10.0 BTCThe Shadow Brokers first made the news back in August 2016 by stealing hacking and security tools from reportedly NSA’s sponsored Equation Group.", "date": "January 13, 2017", "topics": ["Hacking News"]}, {"title": "Hackers Hacked Mobile Hacking Company", "authur": "William Fieldhouse", "body": "The mobile hacking company Cellebrite has been pretty popular last year due to its involvement in the hacking in the iPhone that belongs to the terrorist from San Bernardino scandal. Now the company again made it to the headlines, not because of their accomplishment, but the reason is different. A hacker managed to hack the company and steal more than 900 gigabytes of data.According to a report from the Motherboard, an unnamed hacker has breached Cellebrite’s systems and managed to steal 900 Gb of data. The data includes the customer usernames and passwords, the data collected by the company from various mobile devices, and other technical information of the company.All the stolen files and data is reportedly traded in some IRC chat rooms, but the hacker claims that he did not leak the data to the public. The motivation of the hacker is still not clear, but he seems to have dome this against the changes in surveillance legislation and the “recent stance taken by Western governments.”The data provided by the hacker is legitimate, confirmed Motherboard. They also said that one of their external servers had been accessed by an unauthorised party. The company launched an investigation team and the analysis suggested that an attacker has breached their server that is storing a legacy backup of the Cellebrite firm’s end-user license management system.“The company had previously migrated to a new user accounts system,” Cellebrite stated. “Presently, it is known that the information accessed includes basic contact information of users registered for alerts or notifications on Cellebrite products and hashed passwords for users who have not yet migrated to the new system. To date, the company is not aware of any specific increased risk to customers as a result of this incident; however, my.Cellebrite account holders are advised to change their passwords as a precaution.”The company is in the process of notifying affected customers and it has informed law enforcement about the incident. ", "date": "January 13, 2017", "topics": ["Hacking News"]}, {"title": "Airtel Zambia Hacked By Hackers", "authur": "William Fieldhouse", "body": "A Kabwe Magistrate’s Court has fined a 28-year-old man K5,000 or eight months simple imprisonment for hacking into Airtel Zambia network to reroute international calls.Chanda Chiti of Highridge Township in Kabwe pleaded guilty to one count of securing access to an electronic communication network contrary to section 77 (2) (d) of the Information and Communication Technologies Act.\nFacts before Magistrate PumuloMubita yesterday were that Chitiused an electronic gadget known as simbox to intercept international calls on Airtel network and bill them at the local rate.The court heard that his action between January and March last year resultmagistrateed in the loss of more than US $24,000 by the mobile phone company. Airtel Zambia had reported to the police on April 8, 2016 that it had lost more than US $24,000 in phone call re-routing between January and March 2016.\nThe ideal situation is that Airtel bills the other mobile service provider making an international call for using its network and part of the charge is paid to the Zambia Information and Communication Technology Authority (ZICTA).However, the court heard that Chiti had procured more than 1,000 simcards from an Airtel agent and inserted them into the prohibited simbox which is also known as simfarm machine to hide international calls received on Airtel network. This meant that Airtel could not bill the other networks as the international calls were disguised as domestic calls. Police investigations led to the arrest of Mary Mupeta a sales agent who had sold more than 1,000 simcards to Chiti.Officers also recovered one simbox in Mukobeko area which was not operational but all the electronic gadgets including his personal laptop were taken to ZICTA for examination.In mitigation, Chiti, the father of two, begged for the court’s leniency, saying he regretted his action and that he had recently lost his mother.\nMagistrate Mubita said she had taken into consideration the mitigation and sentenced him accordingly.Mupeta, the sales agent who had sold the simcards to Chiti was also recently fined K2,000 after pleading guilty to unauthorized access to interception of or interference with data.Source: times.co.zm", "date": "January 13, 2017", "topics": ["Hacking News"]}, {"title": "Two Men Arrested For Drug Dealing On Dark Web", "authur": "William Fieldhouse", "body": "We all know that the Dark Web has become a source for malicious activities and crimes. Drug trading is an evil act by all means and it is often conducted via the Dark Web, as the chances of preventing detection by law enforcement are quite high. However, in the case of 34-year old Richard Charles Patrick Sinclair and a 26-year old guy Kyle James Hall the story is a bit different.According to the Belfast Telegraph, the duo was involved in a drug trade on the Dark Web. Sinclair, living in Cranagh Road, Coleraine, Co Londonderry UK, ran this trade from his grandmother’s house while the Hall from Chamberlain Street, east Belfast, followed the scheme from his home.It must also be noted that there is another co-accused, a 29-year old Stephen Rodgers from Glynn Park Close, Carrickfergus, Co Antrim. As his involvement in the crime was noticed as “pasty” in nature by the court, he received the sentence of 240 hours of community service. The Irish Times reported that Rodgers was accused of supplying Class-C, Class-B, and Class-A, drugs as well as converting criminal property. Sinclair has received 7 year jail time whereas Hall has been given 5 years sentence. The sentence was passed by Justice Geoffrey Miller QC.According to documents filed in the court by the law enforcement authorities, Sinclair bought drugs from Holland and distributed it via the Dark Web where he received payment in bitcoin and delivered the drugs to customers by hiding them inside DVD covers. He was charged with numerous offences including possession of Class-A drug with intention of supply and importing Class-A drug.Police obtained search warrants in August 2016 and searched Sinclair’s home where he was staying with his grandmother and using one of the rooms in the house to carry out the drug trade. The police found him inside the bedroom trying to destroy “evidence” from his computer. From his home, detectives discovered 5 sealed packages bearing names and addresses of Sinclair’s customers. The packages were already stamped and ready for postage. Three of them were full of DVD covers all filled with MDMA powder while two packages contained £1,500 in total and were sent by Hall.", "date": "January 12, 2017", "topics": ["Hacking News"]}, {"title": "Woman buys iPhone and finds contact details of top celebs in it", "authur": "William Fieldhouse", "body": "Imagine that the new iPhone that you recently brought has mobile numbers of top celebrities including  Adele and Nick Grimshaw? This is not a fable or fairy tale because the same has actually happened to a woman who bought a brand new iPhone 5S.Sophie Highfield from Erdington, Birmingham, bought a new phone in June 2014 and after a while, she found that there were personal contact numbers of many celebrities stored in her phonebook. Some numbers began with the UK with starting code +44 while others were from the US since they displayed the starting code +1.She found the presence of so many new contact names when she typed the letter M to search for her mom number and suddenly she saw numbers of four other “moms” appearing on her screen. She then started checking out other letters and with call them, she discovered numbers of popular personalities including television and music industry celebs, Olympic athletes and even Radio 1 DJs.“I didn’t notice it at first because the contacts aren’t in my address book but when I go into messages to send a text and type in the letter ‘A’, it comes up with ‘A’ for Adele,” says Sophie.Also included were somewhat weird contacts such as ‘Mark Pest Control,’ ‘Lev the Ledge,’ Kieran Window Cleaner,’ and ‘Suzie Next Door.’ Then there were numbers of BBC personnel and production team members of a number of popular TV shows including Britain’s Got More Talent and the Loose Women.To our surprise, the 31-year old Highfield felt annoyed on receiving so many numbers of popular personalities without even asking for it. According to Highfield:“It is quite annoying having them all there. The phone was supposed to be brand new and completely untouched. I actually have no idea how many numbers there are. There must be hundreds. I haven’t purchased these numbers they’ve just fallen into my hands.”", "date": "January 12, 2017", "topics": ["Hacking News"]}, {"title": "Hackers Target Cannabis Dispensary Tracking Software", "authur": "William Fieldhouse", "body": "Amidst all the current paranoia about hackers infiltrating the highest levels of American politics comes the disturbing news that software used by cannabis businesses in over 20 states was attacked and compromised.The story was reported both by the cannabis industry trade website Marijuana Business Daily and tech sites that monitor such attacks, including Hackbusters and DataBreaches. The software, known as MJ Freeway, is used for “seed-to-sale” tracking of cannabis in states that have legalized or passed medical marijuana laws. The Denver-based company said its main servers and backup system both went down the morning of Jan. 8 and remained offline as of the next afternoon.The outage sent 1,000 retailers nationwide “scrambling to handle everything from sales and inventory management to regulatory compliance issues,” Marijuana Business Daily reported. Some dispensaries had to close their doors entirely.The company’s director of data and marketing, Jeannette Ward, said: “Our initial analysis indicates that this was a direct attack on MJ Freeway’s infrastructure.”Tucson dispensary Botanica tweeted: “Our inventory system (@mjfreeway) is down & we are unable to process any transactions. We’ll post more updates as they become available!”The Boston Globe reported that New England Treatment Access, with locations in Brookline and Northampton, was among the outlets affected by the hack. A message on its website said transactions would take longer than usual at both locations because staffers would need to “conduct certain sales functions manually.”Comfortingly, Ward said encryption prevented the hackers from reading data about MJ Freeway’s retail clients. And the company emphasized that the attack affected only its currently operational system—not the new, overhauled platform it is just beginning to market. The new software is slated to be operational later this month at cannabis retailers that have signed up to use it.Source: Hightimes", "date": "January 12, 2017", "topics": ["Hacking News"]}, {"title": "Virginia Man Pleads Guilty For Hacking Ohio High School", "authur": "William Fieldhouse", "body": "A Virginia man who pleaded guilty to helping hack an online account to draw attention to a 2012 high school rape case in Ohio has been sentenced to eight months in prison.Noah McHugh was sentenced on Monday in federal court in Lexington, Kentucky, after pleading guilty to one count of computer fraud. McHugh had admitted helping Deric Lostutter, known online as “KYAnonymous”,” access fan website for Steubenville High School athletics. Lostutter pleaded guilty in November and faces up to 10 years in prison.The hack drew additional media coverage to rape charges against two football players from the Ohio school. The players were convicted in 2013 of raping a West Virginia girl at a party.Court records show McHugh testified against Lostutter during a grand jury hearing.Source: bigstory.ap.org", "date": "January 12, 2017", "topics": ["Hacking News"]}, {"title": "Egyp: Hackers Arrested Over Online Blackmail", "authur": "William Fieldhouse", "body": "Egyptian authorities have arrested a suspected hacker accused of stealing females’ Facebook accounts and blackmailing them for their private photos, the Interior Ministry said in a statement Thursday.The suspect, 31, from the coastal province of Alexandria, was busted by the police IT department after pursuing his device IP address based on a report from a 20-year-old victim.“The suspect hacked the victim’s personal computer and remotely opened its camera and microphone to track her and her family at home,” the report said, noting the police found a folder on the suspect’s computer containing relevant private clips and photos.The man confessed that he learned the tricks from hacking tutorial websites and that he had already hacked about 1,270 devices. He forced his victims to send him more private photos, threatening to make public what he had already captured if they did not comply.Source: xinhua", "date": "January 12, 2017", "topics": ["Hacking News"]}, {"title": "Los Angeles Valley College Pays $28,000 In Ransomware Incident", "authur": "William Fieldhouse", "body": "The Los Angeles Community College District paid a $28,000 ransom in bitcoin last month to hackers who took control of a campus email and computer network until a payment was made.The “malicious” cyberattack was detected at Los Angeles Valley College on Dec. 30 after a virus locked the campus’ computer network as well as its email and voicemail systems, Chancellor Francisco C. Rodriguez said in a statement.Attackers gave the school a week to pay the ransom. LACCD announced last Friday, January 6, 2017, that they’ve agreed to pay the ransom demand to quickly recover access to their systems and data.The District might have had their hand forced by the fact that classes resumed on Tuesday, January 3, with the start of the winter session.Officials used funds from a cybersecurity insurance policy to pay the ransom. After making the payment, LAVC staffers received a decryption key from the crooks who hijacked the school’s network.LAVC officials said the decryption key worked as expected and the school’s IT staff is currently slowly unlocking encrypted files and restoring service to computers, one at a time.The Los Angeles Community College was lucky in the respect that after paying the ransom, a key was delivered which successfully restored access to systems although the process will be a long one. ", "date": "January 11, 2017", "topics": ["Hacking News"]}, {"title": "Hackers Can Stop Pacemakers and Kill Patients Warns US Government", "authur": "William Fieldhouse", "body": "The United States Food and Drug Administration (FDA) has issued a notice today to warn that a lot of pacemakers are vulnerable to hackers, the attackers can get full control of the devices.The FDA specially said that they are aware of what the  [email protected] transmitters manufactured by St. Jude Medical can be hijacked by other hackers, once hacked, attackers can send various commands and can even develop shocks that can kill the patents.These transmitters use a wireless Radio Frequency signals that connect to home monitors and doctors’ systems. They transmit data regarding the cardiac activity and upload the information to the Merlin.net Patient Care Network, where the information is can be closely inspected by physicians.This is where hackers come in. They can intercept the signal and control the pacemakers. The  FDA warns, that there’s a chance that this could put patients’ lives at stake.“The FDA has reviewed information concerning potential cybersecurity vulnerabilities associated with St. Jude Medical’s [email protected] Transmitter and has confirmed that these vulnerabilities, if exploited, could allow an unauthorized user, i.e., someone other than the patient’s physician, to remotely access a patient’s RF-enabled implanted cardiac device by altering the [email protected] Transmitter,” the FDA says in the notice.“The altered [email protected] Transmitter could then be used to modify programming commands to the implanted device, which could result in rapid battery depletion and/or administration of inappropriate pacing or shocks.”No attacks have been recorded so far, but the FDA says that St. Jude Medical has already developed a software patch, and all pacemakers need to be running it to be fully protected against the vulnerability. Available since January 9, the patch is automatically applied once the transmitter is plugged and connected to the Merlin.net network.", "date": "January 11, 2017", "topics": ["Hacking News", "News"]}, {"title": "The Privacy Settings in Windows 10 Creators Update Pleases Everyone", "authur": "William Fieldhouse", "body": "The Windows 10 Creators Update will introduce many new settings and controls for the Windows 10’s privacy and data collection capabilities.The changes have two parts. There is an immediately available Web-based “privacy dashboard” which gives you access to, and the ability to delete, the information collected from you by Cortana (if you have chosen to share information with Cortana in the first place): search terms, browsing history, interests, contacts, location history, and more.The Windows Creator Update coming this year is a reworking of the operating system-level privacy controls. The important thing these will do is to make the choice more descriptive; instead of just allowing the users t0 pick “Express settings,” which puts a bunch of privacy options but does not fully describe them, this Windows 10 out-of-box experience shows a bunch of privacy-related options. To complete the process, particular settings must be chosen explicitly. The settings page is going to be more descriptive about what each setting controls and the features will be disabled when a given option is unselected.As such, this moves the Windows 10 privacy settings from a model of tacit consent—most people pick Express settings because it’s an easy default, without really considering what the implications are—to explicit affirmation.In tandem with this, the Windows 10 telemetry and diagnostic data collection is changing. Currently it has three settings—basic, full, and enhanced. These settings are being reduced to two options—basic and full—and Microsoft says that it is further reducing the amount of data collected by the basic setting. However, the company still isn’t explicitly clear about what data is collected, only that it includes information about device “capabilities,” error reports, and what’s installed. ", "date": "January 11, 2017", "topics": ["Hacking News", "News"]}, {"title": "Hackers To Target Cloud Technology, IoT Systems", "authur": "William Fieldhouse", "body": "Hackers are expected to take advantage of vulnerabilities associated with cloud technology and the Internet of Things, according to McAfee Labs 2017 Threat Predictions report, released late last year.Other predictions, including a major advancement in threat intelligence sharing, hacktivists targeting consumer privacy and a decline in mobile app vulnerabilities are outlined in the report.According to the report, an area of vulnerability is data contained in cloud technology. With more businesses reliant on storing information in the cloud, the report predicts that cloud breaches will increase. This is the result of more sensitive data being stored in the cloud and hackers’ growing interest in obtaining stored information deemed valuable to them.According to the report, there will be continued conflicts surrounding speed, efficiency and cost that are pitted against control, visibility and security.Credential theft will be the initial focus of cyber attacks, according to the report, as people and their passwords “remain the biggest weakness throughout most technologies for the foreseeable future.”The McAfee report outlined how hackers will attack, explaining the current north-south attack pattern, which is a way to move up or down systems to gain access through a system vulnerability, will continue to be used. In addition, hackers will explore east-west attacks, meaning they will try to jump from machine to machine or between the cloud and a server. Multiple organizations within a cloud service provider will be targeted. In addition, the growth of the Internet of Things devices will cause vulnerability in cloud security models. According to the report, “attackers, including for-hire attackers, will use clouds for scale, speed and anonymity.”There is a significant threat of IoT attacks; however, the financial gains from such attacks are not completely known. The report predicts ransomware will migrate to this area of cyber security vulnerability. Consumer privacy will be impacted negatively by IoT, according to the report. In addition, the lack of appropriate security of these devices will likely lead to cyber criminals using IoT devices as a gateway to more comprehensive attacks on intellectual property and infrastructure disruption.Another significant area of concern, are the aggregation points where data is collected within IoT systems. Hackers could get a big payday by attacking the data storage for all of the information derived from a particular company’s IoT device, the report stated.Medical devices continue to be targeted as hackers seek medical data.Despite the risk, IoT adoption will remain high, the report stated, the result of its benefits outweighing its disadvantages.As hackers continue to get creative in obtaining cyber data, security vendors and IoT providers will be working to develop better security controls through new encryption options, device control systems and behavioral monitoring.Source: claimsjournal.com", "date": "January 11, 2017", "topics": ["Hacking News"]}, {"title": "Netflix Users Falling For Credit Card Phishing Scam", "authur": "William Fieldhouse", "body": "Daredevil hackers are targeting Netflix users with a new phishing attack that attempts to break bad with their credit card details. Security outfit FireEye discovers the scam, which targets binge watchers using an email asking them to update their Netflix membership details.If users are fooled into clicking the malicious link within the email, they’ll find themselves directed to a legitimate looking Netflix login page. One signed in, they will be asked to enter further details such as their name, date of birth, billing address and payment card information, and then directed to the official Netflix website.As pointed out by FireEye, the scam uses some clever techniques to evade phishing filters. The first is the AES encryption, which encodes the content presented at the client’s side, and host-based evasion to ensure the phishing pages are not displayed to users at certain IP addresses.“The host name of organisations such as ‘phishtank’ and ‘google’ are blacklisted,” FireEye explains. “The host name of the client is compared against a list of blacklisted host names. If there is a match against the blacklist, a “404 Not Found” error page is presented.The security firm goes on to note that the phishing campaigns it observed are no longer active, so it’s unlikely this scam will bring whole House of Cards down for the streaming giant. Stranger Things have happened, though.Hackers used two methods, the first involving a malware that tricked people into believing they’ve downloaded official Netflix software. Clicking on the dodgy file downloads a trojan in the form of Infostealer. Banload, which is capable of lifting sensitive information including banking details.The second method, like this latest scam, targets users via phishing campaigns that attempted to redirect people to a fake Netflix website.Source: theinquirer.net", "date": "January 11, 2017", "topics": ["Hacking News"]}, {"title": "Hackers Crash Macs Using Dos Attacks", "authur": "William Fieldhouse", "body": "Once again Hackers are targeting Apple products and customers, but this time the malware they used can easily crash Macs by creating draft emails again and again until your device freezes due to system overload.Malwarebytes, a popular security company already warns that the attackers are exploiting the vulnerabilities in Safari and the Mail app to use up the total amount of RAM your system has and crash the device.The task this malware does is really simple, it creates email drafts over and over until the Mac can no longer handle them and then crashes.To infect a user, the attacker must make a user click on a link that is delivered to him by email.That is the first step to infect them. If you receive a link from someone you do not know, do not open it. There is a great chance that it spreads malware.According to Malware bytes, if the user receives emails from any of these two emails, they have to delete them without having to look.They are [email protected] and [email protected] There is a great chance that the attacker might use other emails so keep an eye on your inbox if you want to be safe.According to the security firm, the malware spreads using a number of compromised websites, including (but not limited to) the following: safari-get[.]net, safari-get[.]com, safari-serverhost[.]net. and safari-serverhost[.]com Of course, much more might be compromised already, so again, don’t click on links that you don’t trust.First and foremost, if you’re running the latest version of macOS (10.12.2), you’re already secure. Malwarebytes says that Apple has already included a fix in this particular version and in the latest betas, but this doesn’t necessarily mean that you’re entirely safe and you should open any links without caution.\n", "date": "January 10, 2017", "topics": ["Hacking News"]}, {"title": "Hello Kitty Database Hacked, 3.3 Million User Details Breached", "authur": "William Fieldhouse", "body": "Hello Kitty parent company Sanrio, has been breached including 3.3 million user credentials.The breach was originally reported in December 2015, but at the time Sanrio denied any data was stolen as part of the breach. The breach was tied to a misconfigured MongoDB installation that was discovered by security researcher Chris Vickery.On Sunday a website that specializes in harvesting leaked credentials called LeakedSource, said the Sanrio database of 3,345,168 million users has surfaced. The disclosure was part of the website’s January 2017 update. According to original reports of the 2015 breach, 186,261 of the records belonged to Sanrio users under the age of 18.Three days after the story broke, on December 22, 2015, Sanrio said they investigated the problem and fixed it.“In addition, new security measures have been applied on the server(s); and we are conducting an internal investigation and security review into this incident. To the Company’s current knowledge, no data was stolen or exposed,” the statement concluded.Unfortunately, someone did copy the database before the configuration error was fixed. It just isn’t clear when that copy was made. On Sunday, Salted Hash learned that the Sanrio database was added to the LeakedSource index.The data available via LeakedSource is reportedly identical to what Vickery found and includes first and last name of users, encoded birthday data, gender, country of origin, email addresses, user name, unsalted SHA-1 hash passwords, password hint questions and answers. Oddly, added to the data Sanrio data is an “incomeRange” field with values ranging from 0 to 150.  ", "date": "January 10, 2017", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "ESEA Hacked, 1.5 Million User Records Stolen", "authur": "William Fieldhouse", "body": "The E-Sports Entertainment Association said in a statement on Monday that after it refused to pay a $100,000 ransom, hackers released the data of many of its users, including names, email addresses, gaming IDs, hashed passwords, dates of birth and phone numbers.Information such as registration date, city, state (or province), last login, username, first and last name, bcrypt hash, email address, date of birth, zip code, phone number, website URL, Steam ID, Xbox ID, and PSN ID may have been obtained by the hackers according to breach notification service LeakedSource“We do not give into extortion and ransom demands and we take the security of customers’ data very seriously. In addition to investigating the incident and reporting it to the authorities, we have been working to isolate the vector attack and secure the vulnerability,” the ESEA said in its statement.The ESEA, a company that organizes primarily Counter-Strike: Global Offensive matches and tournaments, has not released an official tally of how many accounts were compromised, but it did acknowledge in its statement that LeakedSource.com has the full dataset. LeakedSource.com, a site that collects hacked information so individuals can verify whether they have been compromised, shows 1,503,707 accounts from ESEA.net in its database.“We have been working around the clock to further fortify security and will bring our website online shortly when that next round is complete,” the organisation said, adding, “this possible user data leak is not connected to the current service outage.”  ", "date": "January 10, 2017", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Hackers Found This Hidden Message In The Famicom Mini", "authur": "William Fieldhouse", "body": "In recent hack, both the NES Classic Mini and its Japanese sibling the Famicon Mini have been hacked by hackers already, by installing additional games.Now hacker named Bakueikozo has discovered something rather unexpected during his efforts – a message left in the console’s code:This is the hanafuda captain speaking. Launching emulation in 3…2…1. Many efforts, tears and countless hours have been put into this jewel. So, please keep this place tidied up and don’t break everything! Cheers, the hanafuda captain. 大変！ファミコンミニの内蔵エミュレータの中身をのぞいていたらメッセージを発見したよ　…　ごめんキャプテン！！ズタボロに壊し始めちゃったｗｗｗｗｗｗ #ニンテンドークラシックミニ #開発者からのメッセージ #削るとなぜか動かない系とはちょっと違う pic.twitter.com/C2dvIQlEuU— ひろみつ(85.1kg) (@bakueikozo) January 6, 2017This message was left in the console’s code, and hints that someone at Nintendo obviously knew that at some point the system would be hacked.", "date": "January 9, 2017", "topics": ["Hacking News"]}, {"title": "MongoDB Database Hit By Ransomware Attack", "authur": "William Fieldhouse", "body": "MongoDB databases have suffered a surge of ransomware attacks, with over 27,000 servers currently compromised as hackers steal and delete data from unpatched or poorly-configured systems.Used for analytics and data study, MongoDB is a famous open-source NoSQL database. In popular rankings, it comes after giants like Oracle, MySQL and Microsoft SQL Server.According to ethical hacker Victor Gevers, one-fourth of 99 thousand MongoDB instances which are open to the internet have been attacked. It has been said that ransom criminals target mainly those accounts which do not have password protected admin accounts.Hackers use automated scanning tools searching the web for signs of insecure or improperly configured MongoDB systems, he added.Currently, the situation is really bad for MongoDB owners and there is no sign of hope. The worse part is many groups are hacking the same servers again and again, and exchanging notes on ransom which makes are almost impossible to track victim’s data. And this results in paying ransom to other people.Hackers use ransomware to attack computers specifically of organisations and then encrypt delicate and important data, before asking for a ransom to give the data back. Small businesses to big enterprises, no one without proper resources is safe for such threats. Ransomware is used for encryption of valuable files and it is impossible for companies to get them back, and has to give in to the ransom demands.", "date": "January 9, 2017", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Hackers Add More Games To NES Classic Edition", "authur": "William Fieldhouse", "body": "Hackers have figured out a way to score even more games that will make you nostalgic for the way gaming used to be. According to Ars Technica, hackers in Japan and Russia have discovered a modification that can allow users to find new classic games.First, you need to create a save file in Super Mario Bros, which you’ve probably already done anyway. Then, connect the NES Classic to a computer with a micro-US cable and boot it in “FEL” mode (hold the reset button while pushing the power button).Then, as Ars Technica writes:While you’re booting, you should also run a “sunxi-FEL” interface on your computer. (An open-source version of compatible “USBBoot” software can be found here.) The rest of the steps land firmly in “operate at your own risk” territory, as they require copying your NES Classic’s internal data to your computer, then modifying and adding files via an application made by hackers. Doing so, by the way, includes the dubious step of supplying your own ROM files, which you may have either dumped from your own cartridges or downloaded from other Internet users. One tool linked from that Reddit community, however, comes with two open-source NES ROMs that are in the legal free-and-clear to upload to your hardware.Once you’ve added your own game files, which should also include custom JPGs that will appear in the NES Classic’s “box art” GUI, you’ll have to repack the hardware’s kernel, then fully flash the hardware yourself. (Again, we remind you, these kinds of technical steps can result in a bricked NES Classic if anything unexpected happens.) Do all of those steps correctly, and you’ll see every single game you’ve added appear in the slick, default interface. Short video on Nintendo Nes Mini jail hacked mod.Note: Make sure you should take caution. If you mess this up, you might render your system useless. And as you probably know, the NES Classic isn’t always easy to find.", "date": "January 8, 2017", "topics": ["Hacking News"]}, {"title": "DragonOK Hackers Group From China Is Now Expanding Their Operations", "authur": "William Fieldhouse", "body": "DragonOK, A China-linked hackers group has updated the toolset. Following the new decoy documents they are using to attack, researchers came to a conclusion that the hacker group is expanding their territory to Russia and Tibet.Earlier in September of 2014, an article is published on the activities of the DragonOK was and it was published by FireEye. For the first time, the security firm said that the group is now focussing on high-tech companies in both Japan and Taiwan and noticed that their goal is to collect money as ransom.In Japan, considered DragonOK’s main target, the group has recently attacked organisations in several industries, including manufacturing, higher education, technology, energy and semiconductor, Palo Alto Networks said in a blog post published on Thursday.DragonOK has attacked many organisations in Japan, which is now considered as the group’s main target. The list of organisations includes several industries, including manufacturing, technology, energy, higher education and semiconductor, Palo Alto Networks said in a blog post published on Thursday.A piece of malware used by the hacker named “Sysget,” was delivered to attack in Taiwan. The same security firm has identified three new versions of Sysget and all of them have improved over the previous generation malware which makes them hard to detect and analyse.Sysget was delivered using phishing emails and it through specially crafted documents set up to exploit CVE-2015-1641, one of the most widely used Microsoft Office vulnerabilities to date. CVE-2015-1641 is known to have been exploited by APT actors that focus on East Asia.The group also targeted Taiwan with a piece of malware named “IsSpace.” This Trojan is believed to be an evolution of the NFlog backdoor, which has been used by both DragonOK and a different China-based threat group tracked as Moafee. IsSpace was previously seen in a watering hole attack targeting an aerospace company, but the samples spotted recently appear to have been updated. ", "date": "January 8, 2017", "topics": ["Hacking News"]}, {"title": "Massachusetts Makes Data Breach Notification Available to Public", "authur": "William Fieldhouse", "body": "This week, the Commonwealth of Massachusetts has made an important step towards increasing their data breach transparency. In the event, the Office of Consumer Affairs and Business Regulation (OCABR) has made the Data Breach Notification Archive publicly available to people.Just like the name suggests, the Data Breach Notification Archive is meant to keep the records of accidental or malicious/intentional compromises of personal information. This archive was built as notifications came from the entities that keep a Massachusetts resident’s personal information because all of these are required by the Massachusetts Data Security Law to notify the OCABR,  affected residents, and the Attorney General’s Office of such incidents.Up to now, the records and information maintained by the OCABR were available only through Public Records Requests, but that has changed this week when the archive became publicly accessible.All the data breach reports are now available on OCABR’s official website in the form of PDF files which include information on the affected organisation, when the breach was reported, the number of impacted individuals, and also the information on the type of compromised personal information.This report also includes the details on the cyber attack, as well as the information on the incidents that occur in the real world.  Information on unintentional data leaks, external hacks, misplaced documents or devices, insider attacks, and other similar incidents are also included in these reports.Data included in the reports was gathered from various industries, including financial, retail, healthcare, manufacturing, education, hospitality, and more. Each entry is marked as an electronic (cyber) compromise or not.A quick look at the 2016 Data Breach Report (PDF) shows that hundreds of such incidents have been reported last year, and that tens of thousands of Massachusetts residents were affected. Some 33,000 were impacted by the malware attack that hit Eddie Bauer stores, for example, while the Omni Hotels incident impacted only 1,000. ", "date": "January 8, 2017", "topics": ["Hacking News"]}, {"title": "Google’s First Move in 2017, Patches 22 Critical Vulnerabilities in Android", "authur": "William Fieldhouse", "body": "On this Tuesday, Google released their first Android Security Bulletin for 2017. In this, they mentioned that Google patched a total of 95 vulnerabilities in the operating system, 22 of those are rated critical. About 50 of these bugs are addressed as Elevation of privilege flaws.Since the process has been going over the past several months, the security bulletin of January is split in two. This makes it easy for the manufacturers to sort out the patches: while the 2017-01-05 security patch level addressed 72 bugs affecting drivers and other ODM software, the 2017-01-01 security patch level resolved 23 issues which affect various Android components.Among these 22 vulnerabilities mentioned above with a Critical severity rating, a Remote code execution flaw was resolved in Mediaserver. This is one of the Android components that are most impacted. From the time Google kicked off the monthly patch program in 2015 summer, several Critical issues are found in Mediaserver. The list starts with the ever so popular Stagefright, and followed by a second Stagefright vulnerability a few months later.The remaining 21 Critical flaws patched this month include Elevation of privilege issues affecting the kernel memory subsystem, Qualcomm bootloader, kernel file system, NVIDIA GPU driver, MediaTek driver, Qualcomm GPU driver, and Qualcomm video driver. Three other Critical vulnerabilities were patched in various Qualcomm components, Google’s advisory reveals.While only one of the 23 vulnerabilities addressed in the 2017-01-01 security patch level was rated Critical, 14 of them were rated High severity. These included Remote code execution bugs in c-ares and Framesequence; Elevation of privilege vulnerabilities in  Audioserver, Framework APIs, libnl, and Mediaserver; an Information disclosure vulnerability in External Storage Provider; and Denial of service flaws in Mediaserver, core networking, and Telephony.Eight of the bugs resolved by this security patch level were Medium risk: an Elevation of privilege vulnerability in Contacts, two Information disclosure vulnerabilities in Mediaserver, and five Information disclosure issues in Audioserver.", "date": "January 5, 2017", "topics": ["Hacking News"]}, {"title": "Hacker Hijacked MongoDB Databases For Ransom", "authur": "William Fieldhouse", "body": "An unknown hacker is trying to monetize on MongoDB databases that are exposed to the Internet by hijacking them and then demanding a ransom for the data, revealed the security researcher Victor Gevers.This hacker goes by the online handle Harak1r1. He searches for  insecure and exposed MongoDB databases and then he attempts to compromise them. Once if he gains the access to the database, eh steals allthe data inthere and replaces the databases with the one called WARNING, containing just one table with just one record, both called WARNING too.All the victims are instructed to send a total of 0.2 Bitcoins (BTC) to a specific Bitcoins address if they want to get their data back. Morethan a dozen companies have already paid the ransom total.“Send 0.2 BTC to the address 13zaxGVjj9MNc2jyvDRhLyYpkCh323MsMq and get in touch with this email [[email protected]] using the IP of your server to recover your database!” says the warning.According to Victor Gevers, co-founder of GDI Foundation, a non-profit organisation, the attackers may be using an automation tool, however they would have chossen the databases manually to focus on. Basically, the hackers seem interested solely in those informationbases that contain vital data, as companies with important data are more likely to pay ransom to gain their data back.", "date": "January 4, 2017", "topics": ["Hacking News"]}, {"title": "This is probably the biggest Windows Blue Screen of Death ever seen", "authur": "William Fieldhouse", "body": "Most of the Windows users are familiar with The Blue Screen of Death. It has been around for a very long time and recently they changed it to The Green Screen of Death. This blue screen is bigger than any other you have seen so far.This massive video wall of height more than 50 feet is the you entrance to the CentralFestival, which is a shopping mall in Pattaya, Thailand. When this windows based thing tripped over itself,  Blake Sibbit happened to be outside and captured this awesome image.We assume that this is not one of those smart and geeky advertising campaign. It certainly doesn’t look like it, especially with the inclusion of ftser2k.sys called out as the culprit. This particular file has to do with USB-connected serial device, and these are very commonly used with signage systems. This singage system just happened to run into some problem that it can not handle and decided to take down the Windows along with it.It is not quite as cool as seeing a Nine Inch Nails perform this in front of a Blue Screen of Death when they did it a decade ago (it was put there intentionally according to the Trent Reznor).You may not have seen it yet, but Microsoft finally gave the BSOD a makeover for Windows 8. Instead of all that messy, nerdy stuff it’s now a big, frowny emoticon and a bit of plain English that’s probably not quite so frightening to the average Windows user. We haven’t seen one of those pop up in such spectacular fashion just yet, but give it time.", "date": "January 3, 2017", "topics": ["Hacking News", "News"]}, {"title": "Hardware Wallet For Bitcoin Storage Breached", "authur": "William Fieldhouse", "body": "Popular hardware wallet KeepKey  which is designed to store bitcoins and other forms of virtual currency has informed to its users that company’s systems got breached by a hacker on the Christmas Day.The founder of KeepKey, Darin Stanchfield said that the attacker activated a new phone number using his PIN-protected Verizon account and used that to hijack his email via its account recovery mechanism. The attacker then changed the passwords to all the accounts including Twitter account by resetting the passwords of accounts.Stanchfield told that they managed to shut down the affected email services just in half an hour and began reversing the account resets from a secure email server.In the meantime, the cybercriminal contacted the company and demanded 30 bitcoin. In return, he promised to stop the attack, destroy the data he had stolen, and inform KeepKey of the methods he used in the attack. The company decided not to give in to the extortion attempt and instead notified the FBI and provided the law enforcement agency with information on the attacker.According to Stanchfield, KeepKey computers, servers and network were never compromised and the company does not store information on customer balances. Funds stored on the hardware wallets were never at risk.The attacker gained access over the sales distribution channel, services of a vendor used for shipping and logistics, and an email marketing account. Attacker may have stolen physical emails and phone numbers, addresses, and Stanchfield said.KeepKey has collected the IP addresses, browser information, email headers and phone numbers used by the attacker, but the firm believes much of it is likely fake. Nevertheless, the firm is offering 30 bitcoin ($30,000) to anyone who can provide information leading to the attacker’s arrest. ", "date": "January 2, 2017", "topics": ["Hacking News"]}, {"title": "Booking Your Journey Tickets Online ? Be Careful. -Researchers", "authur": "William Fieldhouse", "body": "Researchers have warned that the lack of enough security measures in the travel booking systems exposes the passenger’s personal information and thus allows the attackers to steal tickets and info about the passengers.At the 33rd Chaos Communication Congress in Hamburg of Germany, security researchers Nemanja NIkodijevic and Karsten Nohl from Security Research Labs explained in detail about the vulnerability that is affecting the major travel booking systems. He demonstrated them how easy it is to exploit these popular services.His analysis is focused on Global Distribution Systems (GDS), that serve as a central point for service providers (e.g. hotels, airlines, travel agencies) to manage reservations. The records that are stored by these systems, which are called passenger name records (PNR), can include information like name, ticket data, contact information, passport number, itinerary, date of birth and even payment information. The world’s top GDS providers are Sabre, Amadeus and Travelport.One of the main problems, according to Nohl and Nikodijevic, is these airlines, travel agencies and third-party service providers often use to authenticate users is based on passenger’s last name.This code typically contains a 6-digit alphanumeric string. This is embedded in the barcode found on boarding pass and it can also be printed in clear text on the baggage tags. Since some users share pictures of their boarding pass on some social media websites, it is not a difficult task for fraudsters and cybercriminals to obtain these codes.Another problem that is given a lot interest is the fact that these authenticators can also be obtained using brute force as some web services have neglected to implement limiting the rate mechanisms. In some cases, GDS providers exclude certain characters (e.g. “0” and “1” might be excluded as they can be confused with “O” and “I”) or they assign booking codes sequentially, making brute-force attacks even more efficient.Once a traveler’s booking code is obtained, an attacker can gain access to personal information and abuse it for various purposes, including phishing and social engineering attacks. In the case of airline passengers, malicious actors could also steal flights and divert frequent flyer miles to their own account. ", "date": "January 2, 2017", "topics": ["Hacking News"]}, {"title": "Fancy Bear Gang Is Linked To Election Hack Reports FBI-DHS", "authur": "William Fieldhouse", "body": "In a report released Thursday the Federal Bureau of Investigation and the US Department of Homeland Security implicated Russian hacking group Fancy Bear in attacks against several election-related targets.According to the Joint Analysis Report, the hacking group Fancy Bear, believed to have ties to the Russian government, used a combination of techniques ranging from spear phishing, spoofed domains and malware to harvest credentials in order to gain access to accounts controlled by a political party.Attacks against U.S. targets came in two waves starting in the summer of 2015 and as recently as November 2016, according to the report. The FBI-DHS implicates Russian intelligence services who allegedly initiated the attacks via Fancy Bear, also known as Cozy Bear, APT28 and Sofacy.The 13-page report (PDF) said attackers “masqueraded as third parties, hiding behind false online personas designed to cause the victim to misattribute the source of the attack.” It said hackers aimed “to compromise and exploit networks and endpoints associated with the U.S. election, as well as a range of U.S. Government, political, and private sector entities.”In June, researchers at Crowdstrike implicated Cozy Bear in hacks against the Democratic National Committee. Crowdstrike said Cozy Bear has also been behind attacks against the White House, State Department and Joint Chiefs of Staff, as well as numerous organizations in critical industries around the Western world, Central Asia and the Far East.According to the FBI-DHS the malicious cyber activity, it designated as Grizzly Steppe, began in April 2015 and included a spear phishing campaign that targeted over 1,000 recipients.“APT29 used legitimate domains, to include domains associated with U.S. organizations and educational institutions, to host malware and send spear phishing emails. In the course of that campaign, APT29 successfully compromised a U.S. political party,” according to the report.The spear phishing campaign lured at least one victim to download a file that contained malware that “established persistence, escalated privileges, enumerated active directory accounts, and exfiltrated email from several accounts through encrypted connections back through operational infrastructure,” according to the report.", "date": "January 2, 2017", "topics": ["Hacking News"]}, {"title": "Malware Easily Bricked The Smart TV Running Google TV", "authur": "William Fieldhouse", "body": "You might not remember the Google’s own smart TV platform named as Google TV as it was a pretty bad failure. Even though it was not so successful, there are still some people who actually brought the devices that run Google TV.The Google TV popularity is going down along with the number of devices that run it. On this Christmas, another smart TV running Google TV went dark.A user named Darren Cauthon took the incident to Twitter and revealed that his LG smart TV which is running Google TV was infected with a malware when they tried to install a movie streaming application. By analysing the image he posted, it looks like a ransomware which requires the user to pay to gain access to the device storage.We can conclude that the ransomware is not made to infect TVs but to target Android devices. Due to this, the TV is completely bricked due to its limited number of ports and functionality compared to Android device.The only thing that we can do with the TV now is to flash a new firmware, for which we are left with only one option that is to use the firmware provided by LG. Ironically, LG is not willing to help the user remove the ransomware from his TV unless he pays. From his tweets, we can easily say that he could buy a new TV with the money that the company is asking for the service.The cost of removing the malware by flashing the stock firmware is $340, which, given the fact that this is an old TV running a platform that’s no longer supported, makes absolutely no sense.\n", "date": "January 2, 2017", "topics": ["Hacking News"]}, {"title": "Serious PHP Issues Found From PHPMailer and SwiftMailer", "authur": "William Fieldhouse", "body": "Experts have determined that the remote code execution vulnerabilities affecting the PHPMailer and SwiftMailer email-sending libraries are caused by PHP design flaws.Researcher Dawid Golunski from Legal Hackers recently discovered that PHPMailer has a critical flaw that can be exploited by a remote, unauthenticated attacker for arbitrary code execution in the context of the web server user. The weakness, exploitable by submitting specially crafted input through contact and registration forms, can allow an attacker to completely take over the targeted web application.PHPMailer developers attempted to patch the vulnerability (CVE-2016-10033) with the release of version 5.2.18. However, Golunski determined that the fix could be bypassed. The new flaw (CVE-2016-10045) was patched on December 28 with the release of version 5.2.20.In the meantime, the researcher found the same security hole in the SwiftMailer library (CVE-2016-10074). SwiftMailer developers included a fix for the vulnerability in version 5.4.5, released on December 29, but it may not be complete either.Researcher Paul Buonopane believes that CVE-2016-10033, CVE-2016-10045 and CVE-2016-10074 are just the tips of the iceberg as they are caused by PHP design flaws that could expose many applications.The issues, according to Buonopane, revolve around the lack of proper input sanitization, particularly related to the PHP functions escapeshellarg and escapeshellcmd. escapeshellcmd is designed to escape characters that might be used to trick a shell command into executing arbitrary commands, while escapeshellarg escapes a string that will be used as a shell argument.Buonopane has pointed out that the escapeshellarg function is incomplete and escapeshellcmd was never meant to sanitise user input, which leaves room for abuse. The expert said PHP developers have known about some of the issues surrounding the problematic functions for several years.“The underlying vulnerability is really a design flaw and will take many years to fix. That cannot begin without the active participation of the greater PHP community,” Buonopane said.Both PHPMailer and SwiftMailer are very popular. PHPMailer is used by projects such as WordPress, Drupal and Joomla, while the SwiftMailer library is leveraged by PHP frameworks such as Yii2, Laravel and Symfony. While disclosures have focused on PHPMailer and SwiftMailer, Buonopane believes nearly all other PHP email libraries are affected by these vulnerabilities.source: securityweek", "date": "December 31, 2016", "topics": ["Hacking News", "News"]}, {"title": "U.S. Government Maps Election Hacks to Russian Threat Groups", "authur": "William Fieldhouse", "body": "The Department of Homeland Security (DHS) and the Federal Bureau of Investigation (FBI) on Thursday published a Joint Analysis Report (JAR) to detail the tools and infrastructure that Russian hackers used in attacks against the United States election.The JAR was meant to offer technical details on the cyber activities of Russian civilian and military intelligence Services (RIS), some of which targeted the US government and political and private entities. This is the first time the malicious cyber activity, which the US calls GRIZZLY STEPPE, has been officially attributed to a specific hacking group.As expected, U.S. President Barack Obama on Thursday announced several retaliatory actions against Moscow, imposing sanctions on two intelligence agencies, expelling 35 diplomats and denying access to two Russian compounds inside the United States.In October this year, the US government officially accused Russia of involvement in the cyber-attacks against US political organisations, saying that some states had seen scanning and probing activity originating from servers operated by a Russian company, but no attribution was made at the time. The report (PDF) not only makes an attribution but also provides recommended mitigations and suggested actions to take in response to indicators provided.The JAR reveals that two different actors participated in the intrusion into a U.S. political party, one in the summer of 2015, namely Advanced Persistent Threat (APT) 29, and the other in spring 2016, namely APT28. The former is also known as Cozy Bear, or CozyDuke, while the latter is referred to as Fancy Bear, Pawn Storm, Strontium, Sofacy, Sednit and Tsar Team.This falls in line with what intelligence firm CrowdStrike revealed in June, after assisting the Democratic National Committee (DNC), the formal governing body for the U.S. Democratic Party, to investigate cyber-attacks against its network. Later during summer, two security firms uncovered evidence that Fancy Bear breached the U.S. Democratic Congressional Campaign Committee (DCCC) as well.Both Cozy Bear and Fancy Bear were previously linked to attacks against US government organisations and other governments worldwide. Their attack methods include spearphishing to deliver malicious droppers to the victims’ computers or the use of short URLs upon the creation of domains closely resembling those of targeted organisations.“Once APT28 and APT29 have access to victims, both groups exfiltrate and analyse information to gain intelligence value. These groups use this information to craft highly targeted spearphishing campaigns. These actors set up operational infrastructure to obfuscate their source infrastructure, host domains and malware for targeting organisations, establish command and control nodes, and harvest credentials and other valuable information from their targets,” the JAR reads.Source:", "date": "December 31, 2016", "topics": ["Hacking News"]}, {"title": "Vermont utility confirms system hacked by Russians", "authur": "William Fieldhouse", "body": "Evidence of Russian hacking has been detected in a Vermont utility system, a company spokesman confirmed Friday night. A representative of Burlington Electric Department said in statement that a Russian campaign linked to recent cyberattacks had breached a single laptop within the utility, though it was not connected to the organization’s electrical grids.“We took immediate action to isolate the laptop and alerted federal officials of this finding,” Mike Kanarick, a spokesman for the utility, said in the statement. “Our team is working with federal officials to trace this malware and prevent any other attempts to infiltrate utility systems.”The intent of the Russian hacking operation, known as Grizzly Steppe by the Obama administration, has yet to be determined, but the breach could signal vulnerabilities within the American electrical grid. The penetration, first reported by the Washington Post, which cited U.S. officials including at least one senior administration official, could also signal an attempt to test Russian capability to disrupt other utilities.The intent of the Russian hacking operation, known as Grizzly Steppe by the Obama administration, has yet to be determined, but the breach could signal vulnerabilities within the American electrical grid. The penetration, first reported by the Washington Post, which cited U.S. officials including at least one senior administration official, could also signal an attempt to test Russian capability to disrupt other utilities.Kanarick indicated that state officials, in addition to the Department of Homeland Security, had been briefed on the matter and that the utility organization would fully support the investigation into the breach.A senior administration official declined to comment specifically on the new report, but told POLITICO, “By exposing Russian malware in the JAR [Joint Analysis Report] yesterday, the Administration sought to alert all network defenders in the United States and abroad to this malicious activity to better secure their networks and defend against Russian malicious cyber activity.”In a statement to POLITICO, a Department of Homeland Security official didn’t comment directly on the investigation, saying, “DHS regularly shares information with our private and public partners to help them defend their network and mitigate vulnerabilities. As part of these efforts, we shared technical information with critical infrastructure entities to aid them in identifying the malicious cyber activity known as Grizzly Steppe. When we become aware of a potential vulnerability, DHS offers our assistance and upon request, can provide technical analysis and support. Information shared with DHS as part of these efforts, including the identity of affected organizations, is confidential.”The FBI and the Electricity Information Sharing and Analysis Center, an industry cyber defense organization, did not respond to requests for comment.Source: politico.eu", "date": "December 31, 2016", "topics": ["Hacking News"]}, {"title": "Russian Cyber Attacks Against US An ‘act of war’", "authur": "William Fieldhouse", "body": "McCain, a Republican from Arizona, has scheduled a hearing for next week on foreign cyber attacks targeting the US, which will also focus on Russian hacking.He has invited Director of National Intelligence James Clapper, Director of the National Security Agency Mike Rogers and Undersecretary of Defense for Intelligence Marcel Lettre, to next week’s hearingMcCain, who is chairman of the Senate Armed Services Committee, is one of Washington’s most well-known foreign policy hawks.“When you attack a country, it’s an act of war,” McCain said of the recent hackings on Ukrainian TV while on a visit to Kiev.“And so we have to make sure that there is a price to pay so that we can perhaps persuade Russians to stop this kind of attacks on our very fundamentals of democracy,” he said.McCain and other top congressional leaders have pledged to press legislation next year on sanctions against Russia in addition to those announced by President Barack Obama this week. The senator has criticized the recent sanctions as insufficient and overdue.However, incoming President Donald Trump has repeatedly questioned the accuracy of US intelligence pointing to Russia’s responsibility for the hacks and has said it was time to “move on.”The US claim has been rejected by Moscow. Julian Assange, the founder of WikiLeaks, which published the stolen emails, has denied that the Russian government provided the files.Obama took unprecedented steps Thursday to retaliate against alleged Russian interference in this year’s presidential election, including expelling 35 Russian diplomats from the US.Source:  presstv.com", "date": "December 31, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Major Cyber Attack on OSCE By The Company", "authur": "William Fieldhouse", "body": "The Organization for Security and Co-operation in Europe, an international election and war monitor, said Wednesday it had become the latest global institution to suffer a “major” cyber attack.The Vienna-based OSCE has its origins in the Cold War but after 1991 it expanded and now has 57 member states including the United States, Russia and Ukraine.It currently has 700 monitors focused on the conflict in eastern Ukraine and is also active in observing elections and tracking media freedom.OSCE spokeswoman Mersiha Causevic Podzic told AFP in an email that it “became aware of a major information security incident” in early November.The attack “compromised the confidentiality” of the organisation’s IT network and put “its integrity at risk”, although it was still able to operate, she said.According to French daily Le Monde, which first reported the incident, a Western intelligence agency believes that Russian hackers group APT28 was behind the attack.This group, also known as Pawn Storm, Sofacy and Fancy Bears, is believed to be behind other high-profile cyber attacks and to be linked to Russia’s security services.The OSCE said “the way in which the attacker accessed the OSCE was identified, as have some of the external communication destinations”.France’s ambassador to the OSCE played down the dangers from the attack, saying officials in Vienna — long seen as a hotbed of espionage — are trained to be aware to the risks.“Diplomats at the OSCE are warned that attempted spying, in whatever form, are part and parcel of this organisation,” Veronique Roger-Lacan told AFP.But cyber attacks by criminals and governments are on the rise, with states and firms spending billions of dollars to defend and arm themselves.The issue has become contentious between the United States and Russia, with the latter alleged to have hacked party computers and leaked documents during the US election campaign.The White House has said Russian President Vladimir Putin was directly involved and President Barack Obama has vowed Washington will retaliate “at a time and place of our own choosing”.", "date": "December 31, 2016", "topics": ["Hacking News", "News"]}, {"title": "Police Arrests Three More Hackers For Involving In The Recent Cyber Attack", "authur": "William Fieldhouse", "body": "The military has handed over three more suspected hackers to police for their alleged involvement in the recent cyber attacks on government agency websites, a Royal Thai Police spokesman said yesterday.Police Colonel Krissana Pattanacharoen, deputy spokesman for the police force, said that the three suspects, all men, had been charged with taking part in a criminal syndicate, in addition to violations against the Computer Crime Act.The suspects were identified as Udon Thani resident Danai Pairoh, Chon Buri resident Jatuporn Wattanaponlasak, and Nakhon Pathom resident Chaowalit Chomphai.The military handed over a 19-year-old suspect to police on Monday for his alleged involvement in the apparently concerted hacking attacks. He was charged with the same offences as the other men.Deputy Prime Minister and Defence Minister Prawit Wongsuwan had said that nine suspected hackers were arrested.Five suspects remain in military detention and are expected to be handed over to the police soon for further legal proceedings, according to a source.Source: nationalmultimedia", "date": "December 30, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Smart TV’s Are Vulnerable To Hacks And Malware", "authur": "William Fieldhouse", "body": "Darren Cauthon said his wife downloaded an app advertising free movies to the family’s smart TV, then a message popped up rendering the TV useless.“Said that it wanted $500, the FBI wanted $500 to get the TV to work again,” said Cauthon.Cauthon is a computer programmer and knew right away someone was trying to take his money and infiltrate his TV.Cauthon is a computer programmer and knew right away someone was trying to take his money and infiltrate his TV.“Pure anger you know. You buy a TV and you expect it to work and it, a hacker gets in the TV,” said Cauthon.“Any device that is connected to the Internet can get hacked. That goes for TVs, smartphones, tablets and even vehicles,” said technology expert Burton Kelso.The problem is the information you put on your TV. Hackers can find out your email and log in through the apps you download.“It’s the email and password information that hackers want to get a hold of because they can use that email and password combination to log on to other online accounts such as Amazon, banking and credit card web sites,” said Kelso.To make sure this doesn’t happen to your smart TV, Kelso suggests making sure your Internet connection and TV software is up to date. Also, make sure you are downloading well known apps and not apps that could possibly be scammers at work.“The FBI will not contact you via your TV to demand money from you, so if anything on your TV demands money from you don’t pay them,” said Cauthon.", "date": "December 30, 2016", "topics": ["Hacking News"]}, {"title": "‘Pokemon Prism’ is not dead", "authur": "William Fieldhouse", "body": "After Nintendo released a cease and desist to the developers of Pokémon Prism, it appears the fan-made game is not as “dead” as it seems. Some leakers have obtained the Pokémon Prism project and released it on the internet.The pirates posted a notice on 4Chan claiming that they are “a group of people interested in seeing ROM hacks succeed.” The document also states that they have no affiliation with Pokémon Prism developer Koolboyman and the rest of the team and got the files because “a developer got careless.”In a chat with Kotaku the pirates explained their actions and why they believe Nintendo is wrong for handing out the C&D.“Regardless of Nintendo’s legal rights, we do believe that they are destroying their fans’ hard work for no reason and at no gain,” they said. “Nintendo could have used this (and any other good ROM hack) as an opportunity to promote the Pokémon series in general. They don’t even have to do anything other than let the games live.”Pokémon Prism was a ROM Hack of Pokémon Crystal that introduced two new types of Pokémon (Gas and Sound-type), allowed for trainer customization, the ability to play as your Pokémon and a new region to explore.The game was in development for eight years and gained a following when the Twitch Plays Pokémon community began to play one of the earlier versions of the game.Prism developer Koolboyman was ready to release the full game on Dec. 25 but received the cease and desist from Nintendo on Dec. 21. Koolboyman then shut down his website, which hosted another ROM Hack called Pokémon Brown (a hack of Pokémon Red ) as well as Rijon Adventures , which was a Hack of Pokémon FireRed.Source: idigitaltimes.com", "date": "December 30, 2016", "topics": ["Hacking News", "Tech"]}]