[{"topics": ["Hacking News", "News", "Uncategorized"], "title": "A Seller lost $200,000 because Amazon got tricked by Fake Law Firm", "authur": "Harikrishna Mekala", "date": "September 8, 2017", "body": "The email that arrived in his inbox said the merchandise was moving to be removed from the site because of an intellectual property violation. In sequence to resolve the thing and get the product redeemed, the owner would have to reach the law firm that registered the complaint.But there was one problem: the firm didn’t exist.Brushes4Less was provided the contact information for a company named Wesley & McCain in Pittsburgh. The website wesleymccain.com has portraits for five lawyers. A Google image search reveals that all five really work for the law firm Brydon, Swearengen & England in Jefferson City, Missouri.The telephone number for Wesley & McCain doesn’t operate while the address belongs to a firm in Pittsburgh called Robb Leonard Mulvihill. The man who supposedly filed the complaint is not filed to practice law in Pennsylvania. One part on Wesley & McCain’s site stole letters from the website of the Colby Law Office.The partner of Brushes4Less agreed to tell his story to News but asked that we not use his name out of firm for his privacy. As far as he can tell, and based on what News could confirm, Amazon was tricked into shutting down the seller’s key product workdays before the site’s active shopping event ever.“Just minutes of detective work would be known that this website is a fraud, but Amazon doesn’t appear to want to do any of that,” the owner said. “This is like the Wild Wild West of intellectual property complaints.”Brushes4Less is just one short business among millions that use Amazon’s large global operation to reach customers. But as the marketplace has grown to value for more than half of all goods sold on the site and as Amazon has increased its dominance across online commerce, seller complaints have increased.Hot items are booted and honest sellers are suspended, victims of hateful complaints that some experts doubt are coming from rival sellers masquerading as lawyers. Just ahead of last year’s Black Friday and Cyber Monday rush, a product of Samsung device sellers was suspended due to inaccurate claims of infringement. And sellers of hot brands extending from Nike to Michael Kors say they’ve got violation claims and stay notices even if they’re purchasing inventory from authorized distributors."}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Equifax, A Credit Reporting Company got Hacked and Data of 143 Million Customers is leaked", "authur": "Harikrishna Mekala", "date": "September 8, 2017", "body": "Equifax said in a report that the three officials sold a “small percentage” of their stock on Tuesday, August 1, and Wednesday, August 2, adding they “had no information that an invasion had happened at the time they sold their shares.”The SEC refused to comment on the stock sales.Shares of Equifax fell higher than 12 percent in after-hours trading.The organization said the revealed data include names, birth dates, Social Security numbers, addresses and some driver’s license numbers, all of which Equifax tries to protect its consumers.Equifax figured that 209,000 U.S. credit card numbers were taken, in addition to “certain discussion documents with individual identifying data for approximately 182,000 U.S. consumers.”“Most often, safety questions to enter those websites use that data, like a former address, so this fits an open-source intelligence nightmare, worse in several ways that the Office of Personnel Management government breach. It’s dangerous. If I can get my hands on that data I can call a bank. They’re going to request me for your Social, address, the data that was leaked here, to get access.”Equifax Chairman and CEO Richard Smith confessed to customers and noted that he’s conscious the breach changes what the company is supposed to protect.Equifax said it is now warning consumers whose information was involved in the breach via email and is operating with state and federal authorities. It’s private research into the breach is complete. News, praising law enforcement sources, stated that the FBI was actively examining the incident and that the organization has been cooperating with the bureau.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "You can send malicious commands to Siri and Alexa using UltraSonic Frequencies", "authur": "Harikrishna Mekala", "date": "September 7, 2017", "body": "The comparatively simple method is called DolphinAttack. Researchers first turned human voice commands into ultrasonic frequencies over 20,000 Hz. They then just played them back from a regular smartphone provided with an amplifier, ultrasonic transducer and battery smaller than $3 worth of parts.What performs the attack scary is the evidence that it works on just about anything: Siri, Google Assistant, Samsung S Voice and Alexa, on gadgets like smartphones, iPads, MacBooks, Amazon Echo and also an Audi Q3 16 tech products and seven system in total. What’s worse, “the muffled voice commands can be accurately interpreted by the SR speech recognition operations on all the tested hardware.” Suffice to say, it runs even if the attacker has no device way and the owner has taken the basic security precautions.The group successfully tested instructions like “Call 123-456-7890,” “open Dolphinattack.com” and “Open the rear door,” leaving owners exposed to data, or worse, real life attacks. It was even able to modify the navigation on an Audi Q3.There’s one bit of good news: At this time, the device has a range of five or six feet, so it’s of short use unless researchers can improve the power. You’d also have to have your assistant activated, in the case of Siri or Google Assistant, and if a high ultrasonic commanded activated, those arrangements would make a tone or reply back, alerting the user.So, for a hack to work, you’d have your assistant unlocked and not really be paying thought, a fairly unlikely scenario. However, if you’re in a public place with your phone unlocked, a nearby attacker could probably gain access.Device producers could stop this simply by programming it to ignore commands at 20 kHz or other wavelengths that humans can’t possibly speak in. However, the team found that every major AI assistant-enabled Tech Piece currently accepts such commands without dropping a beat. As to why the microphones even work at such frequencies (up to 42,000 Hz), cleaning them out might lower a system’s “inclusion score,” an industrial designer told Fast Co. Some devices, like the Chromecast, also use it for high ultrasonic device pairing.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "SPY", "Uncategorized"], "title": "More than 750,000 Lenovo Laptops have Spyware in them", "authur": "Harikrishna Mekala", "date": "September 6, 2017", "body": "FTC chairman Maureen Ohlhausen told News Tuesday while a teleconference that unusual 750,000 Lenovo laptops sold in August 2014 and June 2015 arrived pre-installed with a program called visual discovery, made by the Palo Alto, California-based firm SuperFish. The application would act as a “man-in-the-middle” within a consumer’s browser and the website people visited.“Imagine the online equivalent of someone, externally your knowledge, hindering your mail, opening it, reading it, resealing it and placing it back in your mailbox,” Ohlhausen said. “That’s what we claim the software did.”If you’re interested how Visual Discovery scraped user data to obtain money, Security Firms offers this great example: “If you’re watching at an ad for a chest of drawers, Superfish, going by the model on its own website, can help you obtain a matching sideboard (credenza).” The software would then “keep its eye out for similar sites, all based on models instead of relying on old-fashioned keywords.”It would also hold its eyes on consumer’s individual info, like log-in creds, Social Security numbers, bank account data, medical information, and emails, researchers learned. And if you went to a “spoofed” website, i.e., one that seemed like a furniture store but was especially data-capturing one, you’d be up a spring.How did this mess, exactly? Superfish is a third-party merchant, and while Ohlhausen didn’t say that Lenovo was ignorant this software was spying on users, she did call on machines-makers to be careful about partnering up with entrepreneurs that might not have the best purposes.“Everybody in the chain wants to pay attention,” she said. “This appeared to be one of the world’s biggest computer manufacturers and I think it sends an essential message: If you are going to install these sorts of software, you need to pay regard to what it’s collecting, what you’re saying consumers and the kinds of risks that it might be creating.”Affected Lenovo models carry many in its affordable range the below half of its range according to the possible criticism that Superfish was targeting low-revenue or young consumers. Included brands were the E-Series, Edge Series, Flex-Series, G-Series, Miix Series, S-Series, U-Series, Y-Series, Yoga Series, and Z-Series.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "The Mass Surveillance Advocate is going to protect your Privacy Rights according to Trump", "authur": "Harikrishna Mekala", "date": "September 5, 2017", "body": "This indifference comes notwithstanding former President Barack Obama’s movement to expand to information sharing among agencies just days before Trump took position and after the Trump government indicated its desire to maintain widespread surveillance.Amid this lack of awareness toward the NSA, the president lately called a staunch advocate of mass surveillance to chair one of the few obstacles standing between interfering government spying and the American people’s privacy. The Retreat and Civil Liberties Oversight Board (PCLOB) was founded in 2004 at the suggestion of the 9/11 Committee and was intended “to help the executive branch discretion national security preferences with individual rights,” the News reported earlier this year.“PCLOB is thought to have five members, no higher than three of whom appear from the same political party; to engage a full-time chairperson; to have proper access to the 17 intelligence agencies; and to issue unclassified versions of its evaluations of U.S. surveillance powers.”However, as of March of this year, the council was down to just one part-time post, and this lack of organization rendered it largely impotent.“But with just one part-time board member left, after different member’s term ended last week, the company has very few formal powers to guard the so-called ‘deep state’ until President Trump nominates a new board,” the News published pursuant to emails they received regarding the outstanding single member.Though the board had been declining before Trump became president, it may presently be further weakened as a result of his new appointment.“Mr. Klein is the Robert M. Gates Senior Fellow at the Center for a New American Security, where his research concentrates on the junction of national security policy and law. He earlier served as a law clerk to Justice Antonin Scalia of the U.S. Supreme Court and Judge Brett M. Kavanaugh of the U.S. Court of Appeals for the D.C. Circuit.”Though the usually hated late Antonin Scalia was deemed somewhat of a defender of the 4th amendment, Klein fails to offer a powerful buffer between interfering policies and the American people.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Artificial Intelligence will bring the third world war", "authur": "Harikrishna Mekala", "date": "September 4, 2017", "body": "His fears were aroused by a report from Vladimir Putin that “artificial intelligence is the prospect, not only for Russia but for all humankind … It begins with large opportunities, but also threats that are hard to guess. Whoever matches the leader in this field will become the leader of the world.”Hashing out his feelings in public, Musk explained that he was not just concerned about the possibility of a world leader causing the war, but also of an overcautious AI ruling “that a pre-emptive strike is the most likely path to victory”.He’s less concerned about North Korea’s frequently bold nuclear purposes, arguing that the result for Pyongyang, if they started a nuclear missile “, would be self-destruction” – and that it doesn’t have any complications that would point to a world war even if it did. His opinion is that AI is “vastly further risky” than the Kim Jong-un-led country.Musk’s fear of AI combat has been a driving power in his public comments for a long time. Last month, he was one of higher than 100 signatories calling for a UN-led ban of deadly autonomous weapons.“Once advanced, lethal autonomous defenses will permit armed struggle to be fought on a scale larger than ever, and at timescales quicker than humans can comprehend,” the letter read. “These can be threats of terror, weapons that dictators and terrorists use against natural populations, and weapons chopped to behave in undesirable ways.“We do not have hard to act. Once this Pandora’s box is opened, it will be difficult to close.”Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "More than 4 Million Customer Records got leaked from Time Warner Cable", "authur": "Harikrishna Mekala", "date": "September 4, 2017", "body": "Charter Communications bought Time Warner Cable last year, and the two organizations currently work under the Spectrum brand name. Previous to its purchase, Time Warner was the second-largest cable firm in the U.S. and worked in 29 states.Some of the seized records date back to 2010, but it’s unclear precisely how many people were affected by the incident. Though four million documents were likely breached, that doesn’t mean the data of four million people is at risk.Some of the endangered info included duplicate material, but an unrevealed number of Time Warner subscribers’ email addresses, MAC addresses, financial transaction info, usernames and device serial numbers were fully available online.The billing numbers, phone numbers and common contact info for hundreds of thousands of Time Warner users were further left on unsecured servers.The servers also filed corporate emails, internal company documents, and database dumps.“A vendor has informed us that certain non-financial data of legacy Time Warner Cable consumers who used the My TWC app displayed potentially visible by external sources,” Charter told the Hollywood Reporter on Friday. “Upon hearing, the data was removed immediately by the vendor, and we are currently reviewing this incident with them. There is no evidence that any Charter systems were affected. As a general security measure, we support customers who used the My TWC app to modify their user names and passwords.”Online security is a thriving concern – unsecured data and illegal breaches will cost companies a total of $8 trillion over the next five years, according to a global release from U.K-based market intelligence firm Juniper Research.Take your time to comment on this article."}, {"topics": ["Hacking News"], "title": "MacEwan University wastes $11.8 million after being a victim of phishing attack", "authur": "Eslam Medhat", "date": "September 3, 2017", "body": "MacEwan University wastes $11.8 million after staff failed to call one of its vendors to confirm whether emails requesting a change in banking information were legitimate.The university said that the staff was tricked by fraudulent emails requesting them to change electronic banking information for one of the school’s major vendors.According to the University:\n“On Wednesday, August 23, MacEwan University discovered it had been the victim of a phishing attack. A series of fraudulent emails convinced university staff to change electronic banking information for one of the university’s major vendors. The fraud resulted in the transfer of [Canadian] $11.8 million to a bank account that staff believed belonged to the vendor,”Three payments were performed to the fraud account: The first one on Aug. 10 for $1.9 million; the second payment on Aug. 17 for $22,000 and a third on Aug. 19 for $9.9 million. The money has been traced to accounts in Montreal and Hong Kong, those funds have now been frozen.After the fraud was uncovered, the university conducted an audit of business processes through its internal audit team and with the help of outside security professionals.“There is never a good time for something like this to happen,” said university spokesman David Beharry, “but as our students come back to start the new academic year, we want to assure them and the community that our IT systems were not compromised during this incident. Personal and financial information, and all transactions made with the university are secure. We also want to emphasize that we are working to ensure that this incident will not impact our academic or business operations in any way.” "}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "A Zero Day Vulnerability was discovered in AT&T Modems by Researchers", "authur": "Harikrishna Mekala", "date": "September 3, 2017", "body": "These defects seem to have been inadvertently introduced by AT&T, notes safety consulting and software development firm Nomotion, which slams both Arris and AT&T for their collapse to close “gaping security holes” changing probably hundreds of thousands of users.The firm’s full blog post offers significantly further detail.“It is unknown whether these gaping security holes were added by Arris (the OEM) or if these obstacles were added after delivery to the ISP (AT&T U-verse). From checking the firmware, it seems clear that AT&T technicians have the authority and capability to add and customize code working on these devices, which they then present to the consumer as they should,” wrote Nomotion’s Joseph Hutchins.Hard-coded credentials and SSH set on by default allows a remote intruder to access the modem’s shell service, from there providing them access to most device configuration operations. Technically-savvy users can hack their modem to decrease the flaws, but doing so entails making illegal configuration settings to the device AT&T probably won’t approve of.“Some of the obstacles discussed here concern most AT&T U-verse modems despite the OEM, while others appear to be OEM specific. So it is not clear to tell who is accountable for this situation. It could be neither, or more likely, it could be both,” Hutchins wrote. “Regardless of why, when, or even who added these vulnerabilities, it is the ability of the ISP to ensure that their network and equipment are providing a safe atmosphere for their end users. This, sadly, is not currently the case.”AT&T has yet to talk about the report. Arris told Kaspersky Labs’ Threat Post that “until this is finished, we cannot conclude on its details. We can verify Arris is conducting a full investigation in parallel and will immediately take any needed actions to protect the supporters who use our devices.”Take your time to comment on this article."}, {"topics": ["Hacking News"], "title": "Millions of Instagram accounts have been hacked!", "authur": "Eslam Medhat", "date": "September 2, 2017", "body": "A group of unknown hackers used a flaw that exposed users’ private data affected a very higher number of accounts than Instagram originally said. Singer Selena Gomez seemed to be one of the stars whose accounts were hacked through a cyber attack on the picture-sharing app last week.The flaw enabled hackers to scrape email addresses and private data for millions of accounts. While the company first said the hack was limited to owners of verified accounts, it said that non-verified users had been affected as well.According to Instagram:\n“Although we cannot determine which specific accounts may have been impacted, we believe it was a low percentage of Instagram accounts,”The bug affected more than 6 million Instagram accounts, including politicians, actors, famous football players and organizations, who have had their Instagram account information, including emails and private data, available for sale on a website, named Doxagram.Instagram co-founder said:\n“We care deeply about the safety and security of the Instagram community, so we want to let you know that we recently discovered a bug on Instagram that could be used to access some people’s email address and phone number even if they were not public. No passwords or other Instagram activity was revealed.“We quickly fixed the bug, and have been working with law enforcement on the matter. Although we cannot determine which specific accounts may have been impacted, we believe it was a low percentage of Instagram accounts.Users are recommended to enable two-factor authentication to avoid such attacks."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Time Warner Cable got Hacked Millions of customer records got exposed", "authur": "Harikrishna Mekala", "date": "September 2, 2017", "body": "The Archives are more than 600GB in size, were found on August 24 by the Kromtech Security Center while its researchers were reviewing an irrelevant data breach at World Wrestling Entertainment. Two Amazon S3 buckets were finally found and connected to BroadSoft, a global communications company that associates with service providers, including AT&T and TWC.Not all of the TWC archives included information about individual customers. Some included duplicative data, determining the breach finally exposed less than four million customers. Due to the size of the reserve, however, the researchers could not directly say precisely how many were affected. The leaked data included usernames, emails addresses, MAC addresses, device serial numbers, and financial transaction data though it does not seem that any Social Security numbers or credit card information were exposed.Time Warner Cable was acquired by Charter Communications last year and is now called Spectrum, though the leaked documents date back from this year to at least 2010.Other databases published billing addresses, phone numbers, and other communication info for at least hundreds of thousands of TWC subscribers. The servers also included a slew of internal company records, including SQL database dumps, internal emails, and code including the credentials to an unknown number of external systems..A leak of managerial credentials typically heightens the risk of more systems and sensitive elements being compromised. But Kromtech did not try to access or review any of the password protected data, and so the contents of any other servers probably vulnerable remain unknown.CCTV footage, probably of BroadSoft’s workers in Bengaluru, India where the violation is believed to have originated was also discovered on the Amazon bucket.“We see more and more cases of how bad actors use leaked or hacked data for a range of crimes or other immoral purposes,” said Bob Diachenko, Kromtech’s chief communications officer. “In this case engineers inadvertently leaked not only customer and partner data but also private credentials that criminals could easily use to monitor or access company’s network and infrastructure.”"}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Bitcoin Miners are exposed because they didn’t set their TelNet Passwords", "authur": "Harikrishna Mekala", "date": "September 2, 2017", "body": "Gevers told News in a tweet that all miners process Bitcoin sales in the same mining pool and seem to refer to the same organization.“The keeper of these machines is most likely a country sponsored/controlled organization part of the Chinese government, ” Gevers states, basing his allegations on information found in the exposed workers and IP addresses allocated to each device.Miners took offline shortly afterGevers is also the director of the GDI Foundation, a non-profit organization that organizes vulnerability exposures and works to ensure exposed devices. For the past two days, Gevers has been studying the incident and was preparing to reach out to the concerned organization.This will not be needed anymore as it seems that someone from the concerned party saw Gevers’ tweets and tightened the exposed devices shortly after.“Most of the miners are now not available anymore via Telnet,” Gevers told Bleeping Computer. “Just a few are left, and I am keeping an eye out for those.”“At the speed, they were taken offline, it suggests there must be serious money involved,” Gevers figured. “A few miners is not a big deal, but 2,893 functioning in a pool can generate a pretty sum.”According to a Twitter user, the whole network of 2,893 miners Gevers found could generate earnings of just over $1 million per day, if digging Litecoin.The authority is still reviewing to see how long were these devices left exposed online without a Telnet password.“I have proof of other guests on the boxes where they tried to place a backdoor or malware,” Gevers said.According to a different researcher who also took a look over the miners, they also seemed to be participating in a bandwidth distribution scheme run via Chinese service Xunlei.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Miltary vessels got fooled by a GPS Spoofing Attack", "authur": "Harikrishna Mekala", "date": "September 1, 2017", "body": "The US Maritime Administration registered an apparently soothing incident report. The commander of a ship off the Russian port of Novorossiysk had found his GPS put him in the improper spot further than 32 kilometers inward, at Gelendzhik Airport.After reviewing the exploration computer was working properly, the captain reached other nearby ships. Their AIS traces flags from the automatic classification system used to track vessels located them all at the same airport. At least 20 ships were affected.Until now, the greatest worry for GPS has been it can be blocked by hiding the GPS satellite signal with noise. While this can cause anarchy, it is also obvious to detect. GPS radios sound an alarm when they lose the signal due to jamming. Spoofing is more secret: a false signal from an earth station simply involves a satellite receiver. “Jamming just makes the receiver to die, spoofing causes the receiver to lie,” says consultant David Last, former president of the UK’s Royal Institute of Navigation.Todd Humphreys, of the University of Texas at Austin, has been advising of the coming danger of GPS spoofing for many years. In 2013, he told how a superyacht with state-of-the-art travel could be lured off-course by GPS spoofing. “The receiver’s role in the Black Sea event was much like throughout the controlled attacks my team conducted,” says Humphreys.Humphreys thinks this is Russia exploring with a new form of electronic warfare. Over the prior year, GPS spoofing has been creating chaos for the customers on phone apps in central Moscow to trip. The scale of the dilemma did not become clear until people began seeking to play Pokemon Go. The fake signal, which appears to center on the Kremlin, relocates anyone nearby to Vnukovo Airport, 32 km away. This is apparently for defensive reasons; many NATO guided bombs, missiles and drones rely on GPS navigation, and successful spoofing would make it difficult for them to hit their targets.Take your time to comment on this article."}, {"topics": ["Hacking News"], "title": "WikiLeaks website has been hacked!", "authur": "Eslam Medhat", "date": "August 31, 2017", "body": "WikiLeaks website has been hacked by a group named OurMine, whose past hacks have targeted tech CEOs, organizations, and news sites.The attack redirected WikiLeaks users to a page created by OurMine which claimed that the attack was a response to a challenge from the organization to hack them. The WikiLeaks homepage has been defaced and displayed a message that says:\n“Hi, it’s OurMine (Security Group), don’t worry we are just testing your…. blablablab, oh wait, this is not a security test! Wikileaks, remember when you challenged us to hack you?”“Anonymous, remember when you tried to dox us with fake information for attacking wikileaks?”. “There we go! One group beat you all! #WikileaksHack lets get it trending on twitter!”There is no evidence that the WikiLeaks servers and website have been compromised, it appears that the website has been redirected to a hacker-controlled server using DNS poisoning attack.OurMine has earlier hacked the social media accounts of Facebook co-founder Mark Zuckerberg and Spotify co-founder Daniel Ek.Quickly after the hack, the site administrators retrieved access to the DNS server and now the WikiLeaks website is back online.“OurMine offers companies security against hacking, charging up to $5,000 for a “scan” of their social media accounts, site security holes, and other security vulnerabilities, and advertises its commercial services by breaking into famous accounts.”  "}, {"topics": ["Cyber Attack", "Hacking News"], "title": "The second wave of the Locky ransomware has been started!", "authur": "Eslam Medhat", "date": "August 31, 2017", "body": "The wave has been discovered by security researchers from AppRiver, they have seen over 23 million messages (including Locky ransomware) sent in this attack, making it one of the largest malware campaigns that they have seen in the second half of 2017.According to researchers:\n“Each message comes with a ZIP attachment that contains a Visual Basic Script (VBS) file that is nested inside a secondary ZIP file. Once clicked, VBS file initiates a downloader that reaches out to greatesthits[dot]mygoldmusic[dotcom] to pull down the latest Locky Ransomware. Locky goes to work encrypting all the files on the target system and appending [.]lukitus to the users now encrypted files.”The delivery method might seem basic, it’s deserving remembering that only a handful for the millions of messages sent need to successfully deliver the malicious payload to supply the attackers with some profit.The delivery method might seem basic, it’s deserving remembering that only a handful for the millions of messages sent need to successfully deliver the malicious payload to supply the attackers with some profit.After the files have been encrypted, the attackers leave decryption guidance by replacing the desktop background to an image with guidance as well as a HTM file on the desktop named “Lukitus.htm”.“The victim is instructed to install the TOR browser and is provided an .onion(aka Darkweb) site to process payment of .5 Bitcoins, which currently amounts to an eye popping $2,150. Once the ransom payment is made the attackers promise a re-direct to the decryption service. Here’s a look at that page:”"}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "The FBI arrested a person for Not Decrypting the Information on the Hard Drives", "authur": "Harikrishna Mekala", "date": "August 31, 2017", "body": "The argument involves a now-fired Philadelphia Police who has been imprisoned since September 30, 2015, for declining to decrypt two hard drives that officials found at his home as part of a national child-porn investigation. Lawyers for Francis Rawls want him freed pending an appeal to the Supreme Court, which has never further decided on whether taking somebody to decrypt hardware products to a Fifth Amendment violation.“He does not offer to comply with the original law, nor seems he assert that it is difficult for him to do so. Nevertheless, he asks the Court to permit him to go free. The Court should deny the proposals,” federal prosecutor Michael Levy wrote (PDF) the national judge who will lead over a trial on the dispute Thursday.In a note after the term “free” in the earlier quotation from the administration legal brief, assistant US attorney Michael Levy writes:The Yiddish term “chutzpah,” which Leo Rosten described in The Joys of Yiddish 1968 Washington Square Press as “gall, brazen audacity, effrontery, incredible ‘guts’, hypothesis plus nerve such as no other word and no other language can do right to,” absolutely fits this case. Rosten gave as an instance, “that quality cherished by a man who, having killed his mother and father, throws himself on the sympathy of the court because he is an orphan.”, last checked on August 29, 2017.Levy goes on to fight defense attorney Keith Donoghue’s assertion that 18 months is the highest amount Rawls can be defined. He said there was “no temporary limitation on the amount of time” notable can be confined for civil disgrace.”Every session to hear Rawls’ trial has set aside his claim that forcing him to decrypt the drives amounts to forced self-incrimination in breach of the Fifth Amendment.Take your time to comment on this article."}, {"topics": ["Hacking News"], "title": "Two million customer details stolen at Cex online games store", "authur": "Eslam Medhat", "date": "August 30, 2017", "body": "CeX Ltd. is one of the Internet’s biggest second-hand goods chain based in the United Kingdom specialising in technology, computing and video games.The company has suffered a massive data breach and is currently in the process of reaching over two million customers it believes have been affected by the data breach.CeX said in a statement on its website:\n“We have recently been subject to an online security breach. We are taking this extremely seriously and wanted to provide you with details of the situation and how it might affect you. We also wanted to reassure you that we are investigating this as a priority and are taking a number of measures to prevent this from happening again.”The company said that the stolen data contained customers’ names, addresses, emails, phone numbers and some old encrypted credit card information. It has asked users to change their password, especially if they reused their account password on separate websites.CeX has stores all over the world, in countries such as the US, the UK (more than 300 stores), Australia, India, Spain, the Netherlands, and several others.“Although your password has not been stored in plain text, if it is not particularly complex then it is possible that in time, a third party could still determine your original password and could attempt to use it across other, unrelated services. As such, as a precautionary measure, we advise customers to change their password across other services where they may have re-used their WeBuy website password."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Millions of emails and credentials exposed from Spambot", "authur": "Eslam Medhat", "date": "August 30, 2017", "body": "Over 700 million email addresses, as well as a number of passwords, have leaked online thanks to a misconfigured spambot, in one of the massive data breaches ever.A spambot is a machine program created to help in the sending of spam. Spambots regularly create accounts and send spam messages with them.According to Troy Hunt, a security expert who runs the Have I Been Pwned website:\n“The one I’m writing about today is 711m records, which makes it the largest single set of data I’ve ever loaded into HIBP. Just for a sense of scale, that’s almost one address for every single man, woman and child in all of Europe.”The data was leaked because the spammers failed to secure one of their servers (misconfiguration), letting any visitor download many gigabytes of information without needing any authentications. It is difficult to recognize how many others besides the spammer who compiled the database have downloaded their own copies.According to Benkow, the spambot server which is called “Onliner Spambot” has been used to send out spams and spread a trojan called Ursnif to users since 2016.“It’s difficult to know where those lists of credentials came from. I have obviously seen a lot of public leaks (like Linkedin, Baidu or with every passwords in clear text) but credentials can also came from phishing campaigns, credentials stealer malwares like Pony, or they can also be found in a shop.”"}, {"topics": ["Hacking News"], "title": "Selena Gomez’ Instagram has been hacked, posts nude photos of Justin Bieber", "authur": "Eslam Medhat", "date": "August 29, 2017", "body": "Yesterday (August 28), the official Instagram of popular singer Selena Gomez, who is the most followed person on Instagram (over 125 million followers), was hacked and the hackers ended up sharing many nude photos of her ex-boyfriend Justin Bieber. The Instagram account was taken down quickly after the photos surfaced.Variety has confirmed that Gomez’s account was compromised and it’s still unclear how and who hacked the account.The leaked images were the same ones that were published after the pop star’s Bora Bora holiday in 2015. Selena and Justin used to be a couple, but are no longer together.Selena Gomez and Justin Bieber have a long story together, dating back to when rumors first distributed of their romance in 2010. They confirmed their relationship in 2011 after they arrived at the Vanity Fair Oscars party together, but finally broke up. Their relationship had been on-again off-again ever since, though they haven’t publicly dated for at least the past year.Gomez’s Instagram account was restored, but there hasn’t been any official comment from her or Bieber."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Bit Paymer ransomware behind NHS Lanarkshire cyberattack", "authur": "Eslam Medhat", "date": "August 29, 2017", "body": "Many hospitals member of the NHS Lanarkshire board were infected on Friday (August 25) by a variant of the Bit Paymer ransomware.Actually, the ransomware is installed after attackers performed brute-force attacks on exposed RDP endpoints. After getting access to a compromised system, hackers move laterally on the breached network and install Bit Paymer manually on each hacked system. Bit Paymer then encrypts all the files with a combination of RC4 and RSA-1024 encryption algorithms.Security experts detected Bitpaymer ransomware on the computer network on Friday afternoon, which led to some appointments and procedures being cancelled. The health board said that all of the affected systems have now been restored.Chief executive Calum Campbell said: “We have identified the source of the malware and investigations are ongoing as to how this was able to infiltrate our network.\n“Our staff have worked hard to minimise the impact on patients and our contingency plans have ensured we have been able to continue to deliver services while the IT issues were resolved. A small number of systems have been affected and these are in the process of being fixed. “Unfortunately a small number of procedures and appointments have been cancelled as a result of the incident.Sadly, there’s currently no way to recover files locked by the Bit Paymer ransomware."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Intel Management Engine Interface has a hard coded Kill Switch", "authur": "Harikrishna Mekala", "date": "August 29, 2017", "body": "Intel’s ME has a microcontroller that operates with the Platform Controller Hub chip, in combination with combined peripherals. It manages much of the data moving between the processor and external machines and thus has access to a maximum data on the host computer.If jeopardized, it becomes a backdoor, providing an attacker authority over the affected machine.That incident set off alarms in May, with the revealing of a vulnerability in Intel’s Active Management Technology, a firmware App that works on the Intel ME.The announcement prompted calls for a way to incapacitate the poorly read hardware. At the time, the Electronic Frontier Foundation called it a protection hazard. The tech advocacy group needed a way to disable “the undocumented master controller inside our Intel chips” and data about how the technology works.An informal workaround called ME Cleaner can somewhat hinder the technology, but cannot fully eliminate it. “Intel ME is an irremovable condition with an unknown signed proprietary firmware, with full system and memory access, which poses a grave security threat,” the project explains.On Monday, Positive Technologies researchers Dmitry Sklyarov, Mark Ermolov, and Maxim Goryachy said they had discovered a way to turn off the Intel ME by setting the undocumented HAP bit to 1 in a form file.HAP is for high assurance platform. It’s an IT security framework developed by the US National Security Agency, an institution that might want a way to incapacitate a feature on Intel chips that presents a security risk.“In answer to requests from consumers with specific requirements we sometimes search the change or disabling of certain features,” Intel’s spokesperson said. “In this case, the changes were made at the request of machine manufacturers in the maintenance of their customer’s evaluation of the US government’s ‘High Assurance Platform’ program. These changes underwent a limited validation cycle and are not an authorized supported configuration.”Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "A new DDoS Botnet called WireX has been discovered", "authur": "Eslam Medhat", "date": "August 28, 2017", "body": "Security researchers from various security companies have discovered a new botnet that contains thousands of hacked Android devices. The botnet is called WireX, identified as “Click Fraud” the botnet network fundamentally contains infected Android devices running one of the hundreds of malicious apps installed from Google Play Store and is intended to conduct huge DDoS attacks.WireX botnet had already infected thousands of Android devices earlier this month, and on 17th August, security researchers detected a huge DDoS attack (HTTP GET requests) originated from infected mobile devices around the world.Chad Seaman, a senior engineer at Akamai said:\n“I know in the cases where we pulled data out of our platform for the people being targeted we saw 130,000 to 160,000 (unique Internet addresses) involved in the attack”If you suffered a DDoS attack, check for the following pattern of User-Agent series to verify if it was WireX botnet:\nUser-Agent: jigpuzbcomkenhvladtwysqfxr\nUser-Agent: yudjmikcvzoqwsbflghtxpanre\nUser-Agent: mckvhaflwzbderiysoguxnqtpj\nUser-Agent: deogjvtynmcxzwfsbahirukqpl\nUser-Agent: fdmjczoeyarnuqkbgtlivsxhwp\nUser-Agent: yczfxlrenuqtwmavhojpigkdsb\nUser-Agent: dnlseufokcgvmajqzpbtrwyxih“The best thing that organizations can do when under a DDoS attack is to share detailed metrics related to the attack. With this information, those of us who are empowered to dismantle these schemes can learn much more about them than would otherwise be possible.”"}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Cybersecurity advisers say that Trump doesn’t care about cyber threats", "authur": "Harikrishna Mekala", "date": "August 28, 2017", "body": "The resignations began Monday and were noticed by the White House on Tuesday. Nextgov has lately announced the resignation note that the departing councilors presented. According to Roll Call, seven members left from the 27-member Council.Several of those leaving were Obama-era representatives, including retired U.S. Chief Data Scientist DJ Patil and former Office of Science and Technology Policy Chief of Staff Cristin Dorgelo. Not surprisingly, then, the problems outlined in the resignation report were obvious, blaming both Trump’s choice to retreat from the Paris climate agreements and his provocative statements after the Charlottesville strikes, some of which occurred during what was meant to be an infrastructure-focused experience.“The moral foundation of our Nation is the ground on which our physical foundation is built,” reads the letter in part. “The Administration’s operations are ruining that foundation.”But the resigning advisors also told the Administration was not “appropriately alert to the important national security matters inside the NIAC’s purview, or sensitive to sound advice drawn from experts and advisors.” The report also zeroed in on “inadequate attention to the increasing threats to the cyber security of the important systems upon which all Americans depend,” including voting systems.While he has requested better security for state networks, Trump has given little thought or importance when it gets to the broader issues circling, in his words, “the cyber.” Most prominently, he has refused to allow the U.S. intelligence community’s judgment that Russia managed a hacking and propaganda operations meant to subvert the 2016 administrative election and even floated the idea of creating a cybersecurity task force with Russia. The officials also missed a self-imposed deadline for offering a comprehensive cyber security plan.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Game of Thrones Episodes are being used by hackers for Phishing", "authur": "Harikrishna Mekala", "date": "August 27, 2017", "body": "For the past week, the society has forwarded emails to victims with the title of “Wanna see the Game of Thrones in advance?” expecting to attract targets to open the email and download the appended files.These data are booby-trapped with an installed LNK file that executes a Powershell script that runs the 9002 remote access trojan, allowing intruders full access to the infected machine.Behind the attacks is a cyber-espionage society pursued under the codenames of Deputy Dog, Group 27, or APT17.Several protection firms consider the group to be working out of China. APT17 has a deep history of hacking running back for almost a decade.The group grew infamous when it attempted to hack Google’s infrastructure in a range of attacks known as Operation Aurora. Since then, the organization has been busy on several aspects, focusing fresh efforts on hacking government systems in several Southeast Asian countries.Proofpoint, the security company who saw the recent attacks, did not tell who the recent GoT-themed phishing lures targeted, but one of the Proofpoint researchers posted on Twitter that attackers targeted organizations beginning in the technology sector.This month, two Game of Thrones episodes flowed online. Employees from one of HBO’s third-party publishers in India published episode 4, while HBO Spain and HBO Scandinavia unexpectedly aired episode 6 in advance, which then hit torrent sites within hours.In addition, a society of hackers calling themselves Mr. Smith leaked Game of Thrones scripts and several other HBO shows.All of these events produced a lot of online chatter about Game of Thrones news that made it possible for APT17 to operate this special phishing lure with a high level of efficiency.Take your time to comment on this article."}, {"topics": ["Hacking News", "Vulnerabilities"], "title": "How to buy a MacBook for $1? SAP POS vulnerability", "authur": "Eslam Medhat", "date": "August 26, 2017", "body": "A high severity vulnerability in the SAP POS server was found by security researchers from ERPScan, the vulnerability enables attackers to modify configuration files for SAP Point-of-Sale (POS) systems, change prices, and obtain payment card data and send it to one of their servers.“The point of sale (POS) or point of purchase (POP) is the time and place where a retail transaction is completed.”“SAP POS, a client/server point-of-sale (POS) solution, has long defined the standard of excellence in the POS industry. SAP POS meets the needs of a wide variety of retailers. Retail Customers include department, c-store, liquor, gas, specialty, apparel, big box, and a number of other retail verticals.”Researchers said that SAP POS Xpress Server does not implement any authentication checks for significant functionality that needs user identity. For that, administrative and other privileged functions can be reached without any authentication procedure thus enabling anyone who gets into the network to modify prices or set discounts.“It’s no secret that POS systems are plagued by vulnerabilities and numerous incidents occurred because of their security drawbacks came under the spotlight. Unlike the majority of such malware designed to steal customers’ data, this one provides cyber attackers with an unfettered control over the whole POS system. Multiple missing authorization checks on the server side of SAP POS allowed a hacker to use a legitimate software functionality (which must have restricted access), meaning that malicious actions are difficult to detect.”\n—commented Alexander Polyakov, CTO at ERPScan.The vulnerability has been reported to SAP in April 2017, and patched in “SAP Security Note 2476601” and “SAP Security Note 2520064”."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Thousands of Telnet credentials has been published online", "authur": "Eslam Medhat", "date": "August 26, 2017", "body": "Security researchers have discovered a list of thousands of Telnet credentials that enables anyone on the Internet to take control over home routers.“Telnet is a protocol used on the Internet or local area networks to provide a bidirectional interactive text-oriented communication facility using a virtual terminal connection. User data is interspersed in-band with Telnet control information in an 8-bit byte oriented data connection over the Transmission Control Protocol (TCP).”The list has been published on Pastebin since June 11. The list contains user names and passwords in the form of “admin:admin”, “root:root”, and other forms. The Pastebin list contains 143 credential combos, including the 60 admin-password combos from the Mirai Telnet scanner.The list has been published on Pastebin since June 11. The list contains user names and passwords in the form of “admin:admin”, “root:root”, and other forms. The Pastebin list contains 143 credential combos, including the 60 admin-password combos from the Mirai Telnet scanner.The list contained more than 33,000 credentials, probably because it had been updated over time from multiple Internet scans without unnecessary records being removed. Some IPs in the list exposed more than one username-password combination, that means that device had more than one account or because the device had been infected by malware on subsequent scans.Users should enable remote access to IOT devices only when there is a good reason, and then only after changing the default login details to use a different, randomly generated password, preferably of 10 or more characters. Even when remote access is disabled, users should always assure the default password is replaced with a strong one."}, {"topics": ["Hacking News"], "title": "A new malware spreading via Facebook messenger", "authur": "Eslam Medhat", "date": "August 24, 2017", "body": "A new spam campaign has hit Facebook Messenger through the past few days. Users have received a video link that redirects them to a fake malicious website, attracting them to install malicious software.The campaign has been discovered by security researchers from Kaspersky Lab and Avira, but how the malware spreads is still unknown. It may be from stolen credentials, hijacked browsers or clickjacking. The attackers use the classic social engineering to fool the user into clicking the link. The message reads “David Video” and then a bit.ly link.According to Kaspersky:\n“The link points to a Google doc. The document has already taken a picture from the victim’s Facebook page and created a dynamic landing page which looks like a playable movie.When the victim clicks on the fake playable movie, the malware redirects them to a set of websites which enumerate their browser, operating system and other vital information. Depending on their operating system they are directed to other websites.”According to Avira:\n“Suspicious messages with a video link (“t.cn / bit.ly”) are shared within #Facebook messenger. Avira #Antivirus customers are protected!”To be safe, users are recommended to avoid clicking on the malicious links and reporting the suspicious messages to Facebook."}, {"topics": ["Hacking News"], "title": "Security researchers have discovered a malware on Google Play", "authur": "Eslam Medhat", "date": "August 23, 2017", "body": "The Android malware has been discovered by security researchers from Zscaler and Securify, the researchers discovered an app on Google store titled “Earn Real Money Gift Cards.” The application covers a variant of the Android banking Trojan BankBot, whose source code was published online in 2016.The author of the application hiding BankBot also developed another application present on Google store, a game called “Bubble Shooter Wild Life.” This game really works, but it also combines functionality that turns it into a malware downloader.According to zscaler:\n“The name of app is ‘Earn Real Money Gift cards’ (package name: com.moneygift.real.app), and we confirmed it as a variant of a widely known BankBot malware family. As we extended our investigation to the author of this app, we came across a second app uploaded by the same author, entitled ‘Bubble Shooter Wild Life’ (package name: com.bubblesooter.wildlife). The payload, however, was not a BankBot; it turned out to be a downloader Trojan that is abusing the Google Play Accessibility Service.”After analysing the code, which has been protected by the author using the Allatori Obfuscator, shows that the app first requests permission to draw over other applications. It then waits 20 minutes before starting its malicious processes, which is likely how it handled to bypass Google’s Bouncer security system.“We have previously identified numerous instances of malicious apps hiding on Google Play and leveraging techniques like time delays and code obfuscation. However, this app’s abuse of the Google Accessibility service to install additional payloads without user’s permission is unique.”"}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "DreamHost wins the against Department of Justice in a case about giving database of Anti-Trump’s Website", "authur": "Harikrishna Mekala", "date": "August 23, 2017", "body": "US Attorney Channing Phillips drafted in the brief that they held only after a small group of people who organized and engaged in “a planned riot.” He explained that the DOJ announced a lawful warrant, but repeated that the additional facts Dreamhost acted “were strange to the government at the time it petitioned for and obtained the Warrant…” Consequently, “the administration could not eliminate from the range of the Warrant what it did not know endured.”As a result of Dreamhost’s complaint, the DOJ has narrowed down the kinds of information it’s demanding. It’s now only asking for the website’s content and actions from July 1st, 2016 to January 20th, 2017. The owner is also not expected to reveal the contents of undistributed drafts, images, and metadata anymore. It won’t have to expose HTTP requests and error logs, either.In an effort to relieve people’s fears that it will use the information it gets for other ideas, DOJ says any data Dreamhost hands over will be distributed under seal with the court. If you’ll recall, when Dreamhost stated its concerns about the warrant’s unnecessary scope, it said: “That message could be used to know any people who used this site to exercise and show political speech protected under the Constitution’s First Amendment. That should be just to set alarm bells off in anyone’s mind.”EFF senior staff lawyer Mark Rumol told News that he required the agency to narrow down the scope of its license from the start. However, the fact that it’s still investigating for personal and identifying data doesn’t sit well with the lawyer and his business:“Before it was more or less a network and a witch hunt and now it’s just a witch hunt. It’s considerably narrower but they’re still after a large amount of content.”Take your time to comment on this article."}, {"topics": ["Hacking News", "Vulnerabilities"], "title": "ROPEMAKER exploit enables attackers to modify email content—after It’s sent!", "authur": "Eslam Medhat", "date": "August 23, 2017", "body": "A new email exploit, called Ropemaker has been discovered by security researchers at email and cloud security firm Mimecast, the exploit enables an attacker to modify the content in an email—after it’s been sent to the recipient and made it through the necessary filters.According to researchers:\n“The origin of ROPEMAKER lies at the intersection of email and Web technologies, more specifically Cascading Style Sheets (CSS) used with HTML. While the use of these Web technologies has made email more visually attractive and dynamic relative to its purely text-based predecessor, this has also introduced an exploitable attack vector for email.”Ropemaker stands for Remotely Originated Post-delivery Email Manipulation Attacks Keeping Email Risky, the idea of the exploit is that an attacker sends an email in HTML format to a victim, but rather than using inline CSS (cascading style sheets) code to format and color the text, it uses a CSS file loaded from his server.Ropemaker stands for Remotely Originated Post-delivery Email Manipulation Attacks Keeping Email Risky, the idea of the exploit is that an attacker sends an email in HTML format to a victim, but rather than using inline CSS (cascading style sheets) code to format and color the text, it uses a CSS file loaded from his server.Since CSS is stored on a remote server, the attacker can modify the file at a later date by changing the content of the CSS file hosted on his server.“this remote-control-ability could enable bad actors to direct unwitting users to malicious Web sites or cause other harmful consequences using a technique that could bypass common security controls and fool even the most security savvy users. ROPEMAKER could be leveraged in ways that are limited only by the creativity of the threat actors, which experience tells us, is often unlimited.”"}, {"topics": ["Hacking News"], "title": "This device can crack your iPhone Passcode", "authur": "Eslam Medhat", "date": "August 22, 2017", "body": "Yes, there actually is a $500 device for sale online that can crack iPhone 6 and 7 passcode. Apart from being almost cheap, it’s also very easy to use. Simply dial in settings in the desktop application, push them to the device, and then release the attack on a connected iPhone. Easy passcodes can be cracked in a short time. It all seems pretty impressive in action in a YouTube demonstration.The device can recover passcodes of not one or two but three iPhone 7 at the same time. Believe it or not but an American YouTuber has published a video explaining the device.The device attempts to brute force the code, beginning at 0000 and counting up (0001, 0002, …). The process continues until the correct password is recovered. Setting up demo iPhone with Passcodes like 0015 and 0016 guarantees that they’ll be discovered in a minimal amount of time. The phone’s response to the entered passcode works as a sign of passcode’s accuracy. The code is noted from the device and entered into the phone when the lock screen is displayed.The method will only work if the password is short and belongs to the list of easy-to-guess passwords such as 123456, 5883 or 777777. This method works only on some models of iPhone 6 and 6s and it is completely compatible on iPhone 7 and 7 Plus."}, {"topics": ["Hacking News"], "title": "A hacker stole $500,000 in Ethereum from Enigma", "authur": "Eslam Medhat", "date": "August 21, 2017", "body": "On Sunday, an unknown hacker stole about $500,000 in Ethereum from Enigma, a popular cryptocurrency investment platform provider that was planning to raise money through an initial coin offering.According to Enigma:\n“WARNING: ENIGMA SLACK COMPROMISED, DO NOT SEND FUNDSHi Everyone,Our Slack channel and certain email lists have been compromised. We are working diligently to resolve the issues.DO NOT SEND FUNDS TO ANY ADDRESSES.We will provide further updates on the situation shortly.\nDO NOT SEND FUNDS”The hacker was able to take control of Enigma’s website, social accounts and the community email list. The hacker posted Slack messages and spammed their fake address in Enigma’s newsletter and slack accounts for pre-sale coins, fooling users to send their cryptocurrencies to hacker’s address.Etherscan (The BlockExplorer for the Ethereum Blockchain) has already flagged the address as compromised, but victims are still sending ETH to the fake address.In response to the hack, Enigma has taken its websites and Slack group down and it is posting updates via its Telegram group and Twitter account.“At this time, the Enigma team has retaken control of all compromised accounts, including the website. Some pages will remain deactivated for the time being while team works.”"}, {"topics": ["Hacking News"], "title": "Sony PlayStation Twitter account has been hacked by OurMine", "authur": "Eslam Medhat", "date": "August 21, 2017", "body": "PlayStation social media accounts were hacked by a well-known hacking group called “OurMine”, the group took control of the main PlayStation Twitter accounts late on Sunday.“OurMine offers companies security against hacking, charging up to $5,000 for a “scan” of their social media accounts, site security holes, and other security vulnerabilities, and advertises its commercial services by breaking into famous accounts.”The accounts were quickly recovered by Sony, and the tweets from the OurMine group were removed, but a few of Twitter users captured the moment before it was gone.The accounts were quickly recovered by Sony, and the tweets from the OurMine group were removed, but a few of Twitter users captured the moment before it was gone.OurMine claiming to have breached PlayStation Network and taken its database:\n“We got only registration info [usernames, names, emails, etc.]. No, we are not going to release it. We are a security group; we will only send it to Sony to prove it. And no, Sony haven’t contact us yet.”The group also posted similar content on the official Facebook page that has millions of followers.OurMine has earlier hacked the social media accounts of Facebook co-founder Mark Zuckerberg and Spotify co-founder Daniel Ek.It is not known how the group infiltrated the Twitter accounts, but it seems that they found details in the publicly known data breaches of secret information emerging from a hack that occurred in July."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Hackers claim that they will release Game of Thrones Season Finale before HBO", "authur": "Harikrishna Mekala", "date": "August 21, 2017", "body": "The “Mr. Smith group” of hackers told News that they have access to “many HBO Servers” and that HBO should be “waiting” for the leak of episode six, which will be aired on Sunday, and episode seven of its greatest hit quickly before of the show’s finish at the end of the week.The hackers also provided News a record of the usernames and passwords for all of HBO’s social media accounts, including its initial @HBO Twitter account. Last week the OurMine hacking organization took command of HBO’s social media, including the Game of Thrones Twitter account.The TV network has declined to pay a multimillion-dollar ransom order to the hackers, who jeopardized the network’s systems in July and have since leaked a list of ambiguous documents, emails and unaired shows, including Game of Thrones and Curb Your Enthusiasm.Game of Thrones is now one of the countless pirated TV shows of all time. Experts have claimed that due to the pervasiveness of TV show piracy, threats of publishing unaired episodes were not enough to force payment.Alex Heid, chief research director at risk administration firm SecurityScorecard said: “Pirated content shows up on Pirate Bay within 24 hours of airing. Any movie on HBO, any TV Show, the moment it’s published, on the first day, you see it on pirated internet streams.”Analysts recognize that HBO was supported by the fact that the hackers only published a few shows and that an entire season wasn’t published in one go, forcing spectators who required to watch it as quickly as possible to subscribe to the TV network.More likely damaging to HBO could be the announcement of further sensitive information. Previous dumps listing actors’ private details, scripts, shooting plans and a chain of emails. Up to now, the damage induced to HBO by the leaks has blanched in contrast to the chaos created by the hacks on Sony Pictures in 2014.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Tech", "Uncategorized"], "title": "Killer Robots Must be Banned says Elon Musk", "authur": "Harikrishna Mekala", "date": "August 21, 2017", "body": "“Lethal autonomous weapons is an issue that causes the third revolution in warfare. Once finished, they will authorize armed battle to be fought on a scale greater than ever, and at timescales faster than humans can understand,” the scholars warned in an open letter published on Monday.“These can be weapons of horror, weapons that oppressors and terrorists use against innocent populations, and weapons hacked to work in unacceptable ways,” the letter says.Its signatories are of organizations spread across North America, Europe, Africa and Asia, including Mustafa Suleyman, an artificial intelligence expert at Google.“Unlike other possible manifestations of AI, which still reside in the realm of science fiction, autonomous weaponry systems are on the cusp of developing right now and have a very substantial potential to cause notable harm to innocent people along with global volatility,” said Ryan Gariepy, the founder of Clearpath Robotics and the first man to sign the letter.More than 12 countries including the United States, China, Israel, South Korea, Russia, and Britain are currently producing autonomous weapons systems, according to Human Rights Watch.Musk has been urging of the dangers of artificial intelligence for ages, saying it’s “probably more dangerous than nukes.” As pressures spiked over North Korea this period, he weighed in, saying AI poses “largely more risk” than Kim Jong Un’s regime.Besides operating Tesla and SpaceX, Musk also has a startup building tools to connect the human brain to computers in an effort to develop artificial intelligence in a process that will have an obstinate effect on humanity.The open letter to the United Nations was published at an artificial intelligence convention in Melbourne ahead of a U.N. meeting of state specialists on autonomous weapons.Take your time to comment on this article."}, {"topics": ["Hacking News", "Vulnerabilities"], "title": "Hijack mobile devices via replacement smartphone components attack", "authur": "Eslam Medhat", "date": "August 20, 2017", "body": "A new technique has been discovered by a group of researchers from Ben-Gurion University, the technique can give the attackers full control over the targeted devicesSmartphones are usually dropped, shattering their screens. According to a recent study, more than 50% of smartphone owners have damaged their phone screen at least once, and 21% of smartphone owners are currently using a phone with a cracked or shattered screen.According to researchers:\n“Phone touchscreens, and other similar hardware components such as orientation sensors, wireless charging controllers, and NFC readers, are often produced by third-party manufacturers and not by the phone vendors themselves. Third-party driver source code to support these components is integrated into the vendor’s source code. In contrast to “pluggable” drivers, such as USB or network drivers, the component driver’s source code implicitly assumes that the component hardware is authentic and trustworthy. As a result of this trust, very few integrity checks are performed on the communications between the component and the device’s main processor”The team were able to use a malicious touch screen to install arbitrary software and fully hijack a smartphone almost in 65 seconds, other malicious actions such as replacing a URL are instantaneous.“We construct two standalone attacks, based on malicious touchscreen hardware, that function as building blocks toward a full attack: a series of touch injection attacks that allow the touchscreen to impersonate the user and exfiltrate data, and a buffer overflow attack that lets the attacker execute privileged operations.”"}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "The Supplier of US Voting Machines has leaked the Data of 1.8 Million Voters", "authur": "Harikrishna Mekala", "date": "August 19, 2017", "body": "State officials and the Federal Bureau of Investigation were warned this week to a larger data leak revealing the names, addresses, dates of birth, incomplete Social Security numbers, and party connections of over a million Chicago residents. Some driver’s license and state ID numbers were also revealed.Jon Hendren, who works in the cyber resilience firm UpGuard, identified the breach on an Amazon Web Services (AWS) device that was not guarded by a password. The voter data was then downloaded by cyber risk investigator Chris Vickery who decided Election Systems & Software (ES&S) compared the data. ES&S produces voting machines and services in at least 42 states.News spoke quickly with Chicago officials regarding the matter on Saturday. The city did not immediately answer to a question for comment on Thursday after ES&S posted about the leak on its website. A speaker for US Senator Dick Durbin of Illinois also verified on Saturday that the representative had been made aware of the situation.ES&S was notified this week by the FBI and began its own “full search” with UpGuard’s support, “to perform total forensic analyses of the AWS server,” the organization said in a statement, adding that the research is still ongoing.ES&S said the AWS server did not include “any ballot information or vote sums and were not in anyhow connected to Chicago’s choosing or tabulation systems.” The organization stressed that the leak had “no bearing on the results of any election.”An ES&S electronic poll book a kind of machine used to check in voters on Election Day was toyed with by hackers at the Defcon security conference this year in Las Vegas. As News particularly reported, the hackers found loaded on the device the personal records of 654,517 people who established in Shelby County, Tennessee, including names, addresses, birthdates, and political party. The poll book was bought on eBay. ES&S did not respond to questions for comment for this story.Take your time to comment on this article."}, {"topics": ["Hacking News"], "title": "Oops, HBO has been hacked again!", "authur": "Eslam Medhat", "date": "August 17, 2017", "body": "Several of HBO’s social media accounts were hacked by a well-known hacking group dubbed “OurMine”, the group took control of the main HBO Twitter account late on Wednesday, as well as those for TV shows including Game of Thrones.“OurMine offers companies security against hacking, charging up to $5,000 for a “scan” of their social media accounts, site security holes, and other security vulnerabilities, and advertises its commercial services by breaking into famous accounts.”The hackers posted the following message on both HBO’s official Twitter and Facebook accounts:\n“Hi, OurMine are here, we are just testing your security, HBO team please contact us to upgrade the security.”The hackers posted the following message on both HBO’s official Twitter and Facebook accounts:\n“Hi, OurMine are here, we are just testing your security, HBO team please contact us to upgrade the security.”The messages have been removed within an hour of their appearance, HBO said that the TV network was “investigating” the hack.The group has earlier hacked the social media accounts of Facebook co-founder Mark Zuckerberg and Spotify co-founder Daniel Ek.It is not known how the group infiltrated the Twitter accounts, but it seems that they found details in the publicly known data breaches of secret information emerging from a hack that occurred in July.Late last month, the hackers claimed that they stole 1.5 terabytes of data from HBO. A full episode of “Ballers” and “Room 104” have been leaked online as well as a script that’s allegedly for the next episode of Game of Thrones.After that, the criminals published a half-gigabyte sample of its stolen HBO data, including emails, employment contracts, and financial balance sheets, along with the script of the upcoming episode of Game of Thrones, asking for a ransom—about $6 Million to be paid in Bitcoins."}, {"topics": ["Hacking News"], "title": "8 Chrome extensions had been hijacked to hack 4.8 million users", "authur": "Eslam Medhat", "date": "August 16, 2017", "body": "Two weeks ago, attackers managed to hack the developer accounts for two very common Chrome extensions (Copyfish and Web Developer). The hack was very simple, when the developer entered the link, he was redirected to a fake copy of the Google account login page, where the developer entered the login details of the developer account.Kafeine (researchers at Proofpoint) discovered that six more Chrome extensions had been hijacked in the same way. The list includes:\n– Chrometana 1.1.3 [source]\n– Infinity New Tab 3.12.3\n– Web Paint 1.2.1 [source]\n– Social Fixer 20.1.1 [source]\n– TouchVPN\n– Betternet VPNAccording to the researcher:\n“At the end of July and beginning of August, several Chrome Extensions were compromised after their author’s Google Account credentials were stolen via a phishing scheme. This resulted in hijacking of traffic and exposing users to potentially malicious popups and credential theft.”After getting access to the hacked accounts, the attackers will change the extensions to execute malicious tasks, or they add malicious Javascript code to them in a try to hijack traffic and force a malicious update that load ads on top of web pages in order to make income.“Threat actors continue to look for new ways to drive traffic to affiliate programs and effectively surface malicious advertisements to users,” researchers concluded. “In the cases described here, they are leveraging compromised Chrome extensions to hijack traffic and substitute advertisements on victims’ browsers.”"}, {"topics": ["Cyber Attack", "Did you know ?", "Hacking News", "Vulnerabilities"], "title": "Access to Private Networks of Critical Infrastructures Is Available for Purchase on Dark Web", "authur": "Mandee", "date": "August 15, 2017", "body": "Black hat hackers are one group of criminals you do not want to trifle with. Although most of them will stick to the basic cyber crimes like money laundering, hacking websites, and other petty (but still very illegal) things, that doesn’t mean they all will.After bypassing the private computer networks of several government systems, a group of cyber criminals were able to gain access to critical infrastructure targets like hospitals, financial firms, power plants, airlines, and government departments.Of course, the cyber criminals are now offering that access to other cyber criminals via an underground dark web black market called CMarket – or Criminal Market – in exchange for bitcoin.CMarket, formerly known as Babylon APT, is a public black market made up of several key components. First, there is the public market where the basic illegal products are available. Then there is an invite-only sub market.Finally, there is a section dedicated to “hacker for hire” services – where those offering their services claim to hold the capabilities of breaching any private network or public network worldwide.Although the marketplace itself is run by a combination of hackers and cyber crime groups, the main cyber criminal behind the recent breach of private networks and critical infrastructures was found out to be a state hacker working for the Chinese Communist Party.This information was obtained by an undercover agent working for BlackOps Cyber, a globally-based darknet intelligence company that specializes in Intel, threat analysis, and digital weapons.“Reports from BlackOps researchers revealed that the main culprit appears to be a state hacker who also happens to be working for the Chinese Communist Party. He conducts his business for the Chinese regime in his regular work and then sells the data obtained from several companies, governments, and other targets on the darknet market to various buyers.”"}, {"topics": ["Hacking News", "Vulnerabilities"], "title": "Be careful – They can hack you through PowerPoint", "authur": "Eslam Medhat", "date": "August 14, 2017", "body": "A new malware campaign that is leveraging CVE-2017-0199 vulnerability and making its way into businesses through a malicious PowerPoint email attachment.Trend Micro security researchers have discovered the campaign, and this is the first time it has been seen to abuse PowerPoint Slide Show in the wild.The vulnerability allows an attacker to take control of an affected system. An attacker could then install applications, view, change, or delete data; or maybe create new accounts with full user permissions.According to Trend Micro:\n“CVE-2017-0199 was originally a zero-day remote code execution vulnerability that allowed attackers to exploit a flaw that exists in the Windows Object Linking and Embedding (OLE) interface of Microsoft Office to deliver malware. It is commonly exploited via the use of malicious Rich Text File (RTF) documents, a method used by the DRIDEX banking trojan discovered earlier this year.”The attack starts by receiving an email about shipping information that includes a malicious PowerPoint file in the attachments. When the malicious PowerPoint Show file is opened (executed), it will exploit the CVE-2017-0199 vulnerability, which downloads and executes RATMAN.exe (A remote control tool enables attackers to control infected systems.) on the targeted system.“Users should also always patch their systems with the latest security updates. Given that Microsoft already addressed this vulnerability back in April, users with updated patches are safe from these attacks.”"}, {"topics": ["Hacking News"], "title": "Thousands of spyware apps have been discovered on Google play", "authur": "Eslam Medhat", "date": "August 13, 2017", "body": "A group of security researchers from security firm Lookout discovered three Android apps on the Google Play Store that contained a kind of advanced spyware, they think it was built by an Iraqi developer.It seems that the malware creator modified a version of the official Telegram app, injected the spyware code, rebranded it, and uploaded the modified app on the Play Store.The hackers were able to upload the app three times on the Play Store with the names Soniac, Hulk Messenger, and Troy Chat. The first app (Soniac) only was alive on Google’s play store, the other two apps were not active, most likely by the author himself.According to researchers:\n“Lookout researchers have identified over a thousand spyware apps related to a threat actor likely based in Iraq. Belonging to the family “SonicSpy,” these samples have been aggressively deployed since February 2017, with several making their way onto the Google Play Store. Google removed at least one of the apps after Lookout alerted the company.”“While Soniac does provide this functionality through a customized version of the communications app Telegram, it also contains malicious capabilities that provide an attacker with significant control over a target device. “The spyware has the ability to silently record audio, take photos with the camera, perform outbound calls, send text messages to attacker specified numbers, and retrieve information such as call logs, contacts, and information about Wi-Fi access points."}, {"topics": ["Hacking News", "News"], "title": "HBO offered $250,000 to cyber criminals as bounty payment to delay data release", "authur": "Eslam Medhat", "date": "August 12, 2017", "body": "HBO network last month offered $250,000 to hackers who hacked into its computer system, requesting them to extend a deadline for paying a much larger ransom. HBO offered the payment as a “bounty payment” reward in which organizations pay white-hat hackers for identifying cyber security vulnerabilities in their computer networks.Late last month, the hackers claimed that they stole 1.5 terabytes of data from HBO. A full episode of “Ballers” and “Room 104” have been leaked online as well as a script that’s allegedly for the next episode of Game of Thrones.After that, the criminals published a half-gigabyte sample of its stolen HBO data, including emails, employment contracts, and financial balance sheets, along with the script of the upcoming episode of Game of Thrones, asking for a ransom—about $6 Million to be paid in Bitcoins.According to an email received by Variety, HBO had not been able to obtain the amount of Bitcoin the criminals had demanded and asked them to extend the ransom payment deadline by one week.“You have the advantage of having surprised us. In the spirit of professional cooperation, we are asking you to extend your deadline for one week,”“As a show of good faith on our side, we are willing to commit to making a bug bounty payment of $250,000 to you as soon as we can establish the necessary account and acquire Bitcoin, or we can wire the funds as soon as you give us the account information.”But, the email failed to reach that goal. A few days after HBO sent the email, the hackers went to the media with details of the breach. They published an extortion note and some stolen data, including details about an upcoming episode of “Game of Thrones.”"}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Uber Drivers are cheating the company’s algorithm to cause Dynamic pricing", "authur": "Harikrishna Mekala", "date": "August 10, 2017", "body": "According to the research. drivers influence Uber’s algorithm by logging out of the app at the very same time, giving it the reason that there is a lack of cars.Uber increases its Fare rates when there is a huge demand for vehicles and a limited supply of drivers available. Fares are identified to grow during peak periods such as rush hour, during public events and late at evening. Surge pricing can increase the cost of trips to many times the normal rate.The research said drivers have continued organizing forced dynamic pricing, after discussions with drivers in London and New York, and study on online panels such as Uberpeople.net. In a post on the website for drivers, observed by the researchers, one person said: “Guys, stay logged off until surge. Less supply high demand = surge.”Responding to concerns that Uber might find that its drivers are managing its algorithm, the driver said: “They already know because it happens every week.”The researchers told the collusion reveals driver dissatisfaction with Uber’s plans concerning them and exposes the “ethically questionable” nature of its algorithm.“Drivers have improved practices to recover control, even gaming the system,” said Dr. Mareike Möhlmann, from the University of Warwick Business School. “It proves that the algorithmic control that Uber uses may not only be ethically problematic but may also hurt the company itself.”It is not obvious how much influence the trick has had on prices. Uber disputed that the practice is widespread.Uber said: “This action is neither public or permissible on the Uber app, and we have a plenty of technical safeguards in the position to prevent it from happening.”The ride-hailing company has come under fire in the past over its dynamic pricing, which has flown during events including tube strikes but been excluded during taxi strikes.Take your time to comment on this article."}, {"topics": ["Hacking News", "News"], "title": "Researchers were able to trick self-driving cars with stickers on street signs", "authur": "Eslam Medhat", "date": "August 9, 2017", "body": "A group of security researchers have found that by modifying street signs, attackers could confuse self-driving cars and make their image recognition system to misclassify signs and take wrong choices, possibly causing accidentsThe researchers explained various methods to disrupt the way autonomous cars read and classify road signs using just a colour printer and a camera. They found that strategically placed stickers are enough to trick the image recognition system in autonomous cars. An experiment showed that stickers attached to a stop sign caused sensors to misidentify it as a speed-limit sign.According to the research paper “Robust Physical-World Attacks on Machine Learning Models”:\n“Deep neural network-based classifiers are known to be vulnerable to adversarial examples that can fool them into misclassifying their input through the addition of small-magnitude perturbations. However, recent studies have demonstrated that such adversarial examples are not very effective in the physical world–they either completely fail to cause misclassification or only work in restricted cases where a relatively complex image is perturbed and printed on paper.”Most autonomous-driving systems match what the car is “recognizing” through its cameras to saved images, so modifying the appearance of an object can cause the software to make a mistake.“We show that adversarial examples generated by RP2 achieve high success rates under various conditions for real road sign recognition by using an evaluation methodology that captures physical world conditions. We physically realized and evaluated two attacks, one that causes a Stop sign to be misclassified as a Speed Limit sign in 100% of the testing conditions, and one that causes a Right Turn sign to be misclassified as either a Stop or Added Lane sign in 100% of the testing conditions.”"}, {"topics": ["Hacking News"], "title": "Hotspot Shield engages in logging practices and uses third-party tracking libraries", "authur": "Eslam Medhat", "date": "August 8, 2017", "body": "Hotspot Shield is a software application created by AnchorFree, Inc. that enables users to secure Internet connection by connecting them to a virtual private network (VPN). Hotspot Shield was used to bypass government censorship during the Arab Spring protests in Egypt, Tunisia, and Libya. The service is available for free on Google Play Store and Apple Mac App Store with about 500 million users around the world.The company has been accused of violating its own privacy policy of “complete anonymity” promised to its users. The charges have been made by Center for Democracy & Technology (CDT), which is a nonprofit advocacy group for consumer privacy rights.In a 14-page filing, the CDT group has submitted a request for investigation, injunction, and other relief to the Federal Trade Commission to investigate Hotspot for engaging in “unfair and deceptive trade practices” by interfering with web traffic and redirecting it to partner websites like advertising companies.“Contrary to Hotspot Shield’s claims, the VPN has been found to be actively injecting JavaScript codes using iFrames for advertising and tracking purposes”“For example, when a user connects through the VPN to access specific commercial web domains, including major online retailers like www.target.com and www.macys.com,the application can intercept and redirect HTTP requests to partner websites that include online advertising companies,”VPN has been created to provide an encrypted tunnel to secure communication on untrusted network. But VPN providers can see the users’ unencrypted traffic such as HTTP web connections and they will usually intercept that traffic to monetize via advertising."}, {"topics": ["Hacking News"], "title": "Google warning extension developers after many phishing attacks", "authur": "Eslam Medhat", "date": "August 8, 2017", "body": "On August 4, Google sent out the following message to Chrome web store developers, warning them about the growing danger of phishing attacks acting as official Chrome Web Store communications.“Dear Chrome Web Store Developer,\nOur records indicate that you have at least one extension published in the Chrome Web Store.\nWe’re writing to let you know that a number of developers have recently reported receiving phishing emails from email addresses that impersonate the Chrome Web Store policy team.If you recieve any emails that appear to be from the Chrome Web Store but do not belong to the google.com domain (for example, [email protected]), please use your gmail controls to mark the email as spam, and send the original email headers to [email protected]We also encourage you to increase your account security by enabling 2-step verification. You can also consider adding the Password Alert Chrome Extension, which can help identify phishing attacks.”Attackers managed to hack the developer accounts for two very common Chrome extensions (Copyfish and Web Developer). The hack was very simple, when the developer entered the link, he was redirected to a fake copy of the Google account login page, where the developer entered the login details of the developer account.The attackers used the stolen accounts to inject adware code inside the extensions and forced a malicious update that loaded ads on top of web pages."}, {"topics": ["Hacking News"], "title": "Microsoft refused to fix SMB vulnerability", "authur": "Eslam Medhat", "date": "August 5, 2017", "body": "Microsoft won’t fix a vulnerability in the Server Message Block (SMB) file sharing protocol that affects all versions of the Windows operating system.A vulnerability called SMBLoris was revealed late last week at DEF CON (one of the world’s largest hacker conventions) won’t be fixed because Microsoft says that the service should be firewalled off from the internet anyway.“SMBLoris is a remote and uncredentialed denial of service attack against Microsoft® Windows® operating systems, caused by a 20+ year old vulnerability in the Server Message Block (SMB) network protocol implementation.”“The vulnerability is in all modern versions of Windows, at least from Windows 2000 through Windows 10. Systems are still vulnerable even if all versions of SMB (1, 2, and 3) are disabled.”The flaw enables an attacker to open a connection to a remote machine through the SMB protocol and make that computer to allocate RAM to handle the connection.The vulnerability is critical because it enables an attacker to open thousands of connections to the same computer, consuming its RAM and probably crashing the machine.After many reviews, Microsoft said it doesn’t see this issue as a security bug. That’s mean that the company refused to fix the bug in an urgent security update but admitted that it’s a bug and it will patch it in the upcoming future updates."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Facebook wants to fight Fake News using AI", "authur": "Harikrishna Mekala", "date": "August 4, 2017", "body": "It has also just started as a new highlight in four nations that will publish alternative story links below questionable articles.But some experts said the tests did not do go far sufficient.“Presenting readers with the connection is helpful,” said Tom Felle, a senior speaker in digital journalism at City University.“But it does nothing to prevent the spread of this matter, or to stop traffic moving to fake news peddlers who are getting money out of producing this material.”Facebook has remained scrutinized for being one of the main delivery points for fake news, which many think led the 2016 US presidential election.Voters were also overwhelmed with hoax articles during the French presidential election in May.The firm has earlier been hesitant to take down probably fake news stories, arguing that it does not want to be an “arbiter of truth”.Instead, it recognizes potentially false articles through a mixture of artificial intelligence (AI) and user discovery. These are then sent to free fact-checkers who place a flag next to hoax stories to alert readers.On Thursday, although, the company said it would start using “updated machine learning” to improve detection.“If a news has been examined by fact checkers, we may give the fact-checking stories below the original post,” added Sara Su, product manager of News Feed, in a Website.A spokesperson later explained that these articles would not be “direct answers” to fake articles, but factually correct reports that suggested an alternative.On Thursday, the firm worked out a new “Related articles” feature in the US, France, Germany and the Netherlands.The article, which the company has been experimenting since April, places connections to other news coverage beneath highly successful or questionable articles, offering users “more views and additional information”.Brooke Binkowski, the leading editor of fact-checking magazine Snopes, told the BBC: “I praise their efforts to ‘flood out’ fake news, a way of which I have been a protector for a long time.”Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "More than 650,000 Voters Information is for Sale on EBay", "authur": "Harikrishna Mekala", "date": "August 2, 2017", "body": "The power of the US voting order, according to retired FBI director James Comey, is that it’s “clunky” each and every state and usually every area can determine its own structure and whether to use document or electronic machines. And there are above a dozen various manufacturers providing voting machines to elective districts. While that clunkiness helps limit large-scale voter hacking, it presents more possibilities for hackers to obtain polling data.When US administration workers decommission old balloting equipment and sell them off to the public, they’re assumed to wipe voter data from the device’s memory.But hackers provided access to an ExpressPoll-5000 automated poll book the class of device used to control in voters on Election Day has found the personal records of 654,517 people who voted in Shelby County, Tennessee.It’s unclear how much data of the personal information wasn’t yet public. Some of the documents, viewed by Gizmodo at the Voting Village, a compilation of real, used balloting machines that anyone could botch with at the DEF CON hacker convention in Las Vegas, incorporate not just name, address, and birthday, but also political party, whether they voted absentee, and whether they were required to provide identification.Election Systems and Software (ES&S), which does the ExpressPoll-5000, is an example of the most common e-poll book producers in the country, said Barbara Simons, who sits on the committee of Verified Voting, an independent research organization that advocates for voting-machine protection. There’s no regular auditing process for how many of the devices are properly wiped, and thus no way to determine how many devices have been sold that accidentally contain voter records.But the point that only a some of such devices were made open at DEF CON and one of them had records of individuals that were so easily accessible doesn’t inspire faith, said Matt Blaze, a famous security researcher who has authored numerous studies on voting machine protection and who helped build the community.Take your time to comment on this article."}, {"topics": ["Hacking News"], "title": "FireEye security researcher has been hacked!", "authur": "Eslam Medhat", "date": "August 1, 2017", "body": "A group of hackers called “31337 Hackers” has published a zip file including roughly 370 megabytes of compromised personal details and professional files tied to a Mandiant security researcher working for FireEye’s breach investigation unit.FireEye, Inc. is a publicly listed enterprise cybersecurity company that provides products and services to protect against advanced cyber threats, such as advanced persistent threats and spear phishing.FireEye confirmed that the information has been stolen from one its employees, but also said that there is no proof that the companies’ systems are affected.“We are aware of reports that a Mandiant employee’s social media accounts were compromised,” a FireEye spokesperson told Bleeping Computer in an email today. “We immediately began investigating this situation and took steps to limit further exposure. Our investigation continues, but thus far it, we have found no evidence FireEye or Mandiant systems were compromised.”The hackers said that the leak was part of a larger operation called #LeakTheAnalyst.“For a long time we – the 31337 hackers – tried to avoid these fancy [EXPLETIVE] “Analysts” whom trying to trace our attack footprints back to us and prove they are better than us. In the #LeakTheAnalyst operation we say [EXPLETIVE] the consequence let’s track them on Facebook, Linked-in, Tweeter, etc. let’s go after everything they’ve got, let’s go after their countries, let’s trash their reputation in the field. If during your stealth operation you pwned an analyst, target him and leak his personal and professional data, as a side job of course ;).”"}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Metadata of WhatsApp is visible to the Government in-spite of encryption says Sheryl Sandberg", "authur": "Harikrishna Mekala", "date": "August 1, 2017", "body": "The encryption a way of preserving information of WhatsApp communications has been supporting fire from diplomats such as U.K. Home Secretary Amber Rudd. She examined the app after rebel Khalid Masood transferred a WhatsApp message quickly before launching an initiative on London’s Westminster Bridge in March.“It is absolutely unacceptable there should be no room for terrorists to hide. We want to make sure organizations like WhatsApp, and there are lots of others like that, don’t give a secret place for terrorists to talk with each other,” Rudd told the News Andrew Marr show at the time.But talking on the News “Desert Island Discs” radio show Sunday, Sandberg told that the metadata stored by WhatsApp has the potential to notify governments about potential terrorist activity.“The goal for governments is to get as much data as possible. And so when there are communications services like WhatsApp that are encrypted, the information itself is encrypted but the metadata is not, suggesting that you send me a message, we don’t get what that message says but we know you contacted me,” she said.“If people move off those encrypted services to go to encrypted services in nations that won’t share the metadata, the administration actually has less information, not more. And so as technology evolves these are difficult conversations, we are in close communication working into the issues all around the world.”Sandberg recently met Rudd and told “Desert Island Discs” that Facebook and the U.K. administration are “very aligned with our goals”.“We want to make certain all of us do our bit to stop terrorism and so our Facebook plans are very clear. There’s certainly no place for terrorism, hate, calls for violence of any sort. Our goal is to not just pull it off Facebook but to use artificial intelligence and technology to get it before it’s even uploaded to the internet.Take your time to comment on this article."}, {"topics": ["Hacking News", "News"], "title": "HBO has been hacked and some Game of Thrones episodes leaked online", "authur": "Eslam Medhat", "date": "July 31, 2017", "body": "HBO confirmed that hackers were able to breach HBO’s online security systems and have leaked upcoming episodes of multiple series and at least one script.“Home Box Office (HBO) is an American premium cable and satellite television network that is owned by Time Warner through its respective flagship company Home Box Office, Inc. Programming featured on the network consists primarily of theatrically released motion pictures and original television series, along with made-for-cable movies and documentaries, boxing matches, and occasional stand-up comedy and concert specials.”The hackers claimed that they stole 1.5 terabytes of data from HBO. A full episode of “Ballers” and “Room 104” have been leaked online as well as a script that’s allegedly for the next episode of Game of Thrones.The hackers claimed that they stole 1.5 terabytes of data from HBO. A full episode of “Ballers” and “Room 104” have been leaked online as well as a script that’s allegedly for the next episode of Game of Thrones.HBO isn’t the first media organization to be the victim of hackers. In April, a hacker published episodes of Netflix’s Orange is the New Black ahead of their premiere dates.The hack was stated in an anonymous email that was sent to reporters:\n“Hi to all mankind. The greatest leak of cyber space era is happening. What’s its name? Oh, I forget to tell. It’s HBO and Game of Thrones……!!!!!!\nYou are lucky to be the first pioneers to witness and download the leak. Enjoy it & spread the words. Whoever spreads well, we will have an interview with him.”It’s unclear if the hackers managed to get their hands on a full episode of Game of Thrones. and the company is not commenting."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Medical Records of 108,000 clients are up for sale in Dark Web by a Bupa Employee", "authur": "Mandee", "date": "July 31, 2017", "body": "An employee working the Bupa managed to steal the data of 108,000 customers he set the data for sale on the dark web, the breach was identified by DataBreachers since samples of the stolen data were posted on the site of the vendor by the name of Mozeal.The listing of the DataSet Included the number of customers’ insurance details, such as registration IDs, contact information, names and even birthdays.The affected customers spanned 122 countries where the company held operations. The employee was immediately fired by the insurance company, and legal action has been initiated.Although the health insurer had managed to discover the breach soon after the data was stolen from the system, it was unable to prevent the release of the stolen data on the dark web.Sheldon Kenton, Managing director of Bupa stated that information of 108,000 has been stolen and MoZeal has also listed the insurance records around half-a-million to One-Million since the data breach was identified.The breach has had an intense effect primarily on the international health insurance industry as a whole.International healthcare policies cover individuals who frequently travel overseas or cross borders for work.The Company has taken necessary measures to ensure the integrity of the customer data Bupa has noticed each and every customer of this data breach and Still, Bupa believes the stolen information has been provided to outside parties and could have numerous potential threats for customers."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "HackOne and Tor have launched a Bug Bounty Program", "authur": "Mandee", "date": "July 31, 2017", "body": "The Software developers do intensive testing before the app is released to the public as the time passes the technology companies have got the ideas to launch the Bug Bounties.Tor and HackerOne have joined forces to recreate as an unhackable browser the main aim of  Tor system is to erase the trace of the user and make him non-identifiable by chrome, firefox or any kind of browser.This is one idea why Tor is the chosen browser for individuals who enter darknet sites or for internet users in investigative fields. It is known that every month in the last year facebook received 30% for he Traffic through the Tor browser. This is how big the program is and furthermore, HackerOne has had its private set of successes in supporting developers discover bugs and operate these bounty offering campaigns.The organization has previously arranged this already for many other businesses including Twitter, Uber, and numerous others. HackerOne even partners with United States administration department, including the Department of Defense.Records show that this bureau has paid out a tremendous $18.7 million running 852 such bug bounty programs. A number of bugs fixed stand at close to 50,000.This new form of arrangement with Tor comes on similar lines with HackerOne’s early work the organization will lead the bug bounty plan on behalf of Tor.The Tor browser allows its users the facility to conceal his or her location. This is done possibly by routing traffic within a multiplicity of layers.Some of the definite users of this tools offered by Tor include whistleblowers and those who are working to investigate crimes and scandals within government setups."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "hiQ received a cease-and-desist letter warning that scraping LinkedIn is violation of Terms", "authur": "Harikrishna Mekala", "date": "July 31, 2017", "body": "HiQ scrapes web pages nearly thousands of employees of public LinkedIn pages, then packages the information for marketing to employers annoyed about their employees leaving. LinkedIn, which was obtained by Microsoft last year, sent hiQ a cease-and-desist letter threatening that this scraping broke the Computer Fraud and Abuse Act, the contentious 1986 law that makes PC hacking a crime. HiQ sued, asking governments to rule that its actions did not, in fact, break the CFAA.James Grimmelmann, an educator at Cornell Law School, told News that the palings here go well exceeding the fate of one little-known company.“Lots of companies are formed for connecting data from a lot of sources,” Grimmelmann said. He explained that scraping is a key way that businesses bootstrap themselves into “becoming the scale to do something exciting with that data.” If scraping without permission becomes illegal, startups like hiQ will have a difficult time getting off the ground.But the law may be on the side of LinkedIn particularly in Northern California, where the lawsuit is being tried. In a 2016 ruling, the 9th Circle Court of Appeals, which has authority over California, decided that a startup called Power Ventures had infringed the CFAA when it remained to access Facebook’s servers notwithstanding a cease-and-desist letter from Facebook.Some aspects of that situation were different Power Ventures was giving out private messages with the consent and cooperation of Facebook users, while hiQ is scraping data on public web pages. But experts told News that the Power Ventures model is likely to be bad news for hiQ because it implies that proceeding to access a site after implying asked to stop is enough to trigger the anti-hacking law.The CFAA presents it a crime to “access a network without permission or exceed authorized access.” Courts have been struggling to decide what this involves ever since Congress passed it more than 30 years ago.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Hackers at DEF CON took only 12 Minutes to Hack US Voting Machines", "authur": "Harikrishna Mekala", "date": "July 30, 2017", "body": "This time at the DEF CON hacking convention in Las Vegas, 30 ballot boxes running on software used in American elections was set up in a simulated public White House race and hackers got to work actually tearing the gear apart to find out what was hidden inside.In less than 90 minutes, the opening cracks in the systems’ defenses began resembling, revealing an embarrassingly low level of security. Then one was completely hacked wirelessly.“Without issue, US voting systems are vulnerable and susceptible. Thanks to the participation of the hacker association today, we’ve revealed even more concerning exactly how,” said Jake Braun, who sold DEF CON originator Jeff Moss on the plan earlier this year.“The scary point is we also understand that our foreign adversaries including Russia, North Korea, Iran maintain the abilities to hack them too, in the manner undermining systems of democracy and endangering US national security.”The devices from Diebold to Sequoia and Winvote equipment were purchased on eBay or from government disposals, and an examination of them at the DEF CON Voting Village exposed a sorry state of affairs. Some were operating very outdated and exploitable software such as unpatched apps of OpenSSL and Windows XP and CE. Some had real ports open that could be managed to install wicked software to tamper with votes.It’s one person to really nobble a box in presence of you, which isn’t difficult for election administrators to spot and stop. It’s different to do it in the air from a mile. Apparently, some of the boxes included inadequately secured Wi-Fi connectivity. A WinVote method used in former county elections was, it seems, hacked via Wi-Fi and the MS03-026 vulnerability in WinXP, allowing info sec academic Carsten Schurmann to enter the machine from his laptop using RDP. Another method could be possibly cracked remotely via OpenSSL bug CVE-2011-4109, it is claimed.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Vulnerabilities"], "title": "120,000 Cameras on the Internet were Hacked", "authur": "Harikrishna Mekala", "date": "July 29, 2017", "body": "The researcher noticed that two cameras from Chinese gadget producer Shenzhen Neo Electronic own vulnerabilities that enable hackers to remotely enter their video stream, or take full command of the cameras, beginning up to the possibility that someone could gather an Internet of Things botnet of about 150,000 devices. Alex Balan, a researcher at protection firm Bitdefender who discovered the flaw, told Motherboard that he decided to warn the company, but he insists it never got back to him. So the defects have yet to be made, and may never be fixed, he said.“It’s not patched and non-patchable,” Balan told Motherboard in an account at the Def Con hacking convention in Las Vegas.The two types of cameras that have vulnerabilities are the NIP-22 and the I-doorbell. But another camera, from other companies, sway have the same bugs because they apply the same firmware, according to Balan. There’s no tool to automatically refresh or push pieces to the cameras, according to Balan.The two cameras of Shenzhen Neo Electronic are not those first IoT cameras or media obtained to be vulnerable. In the last few times, security researchers and wicked hackers have discovered several flaws in IoT devices such as monitoring cameras, crock pots, stuffed creatures, dishwashers, and even dildos. These machines could be hacked separately, of course, but in special cases, hackers have discovered a way to incorporate hundreds of thousands of unprotected devices in botnets.These botnets have done used to launch issued a denial of service attacks that, in one case, disabled the internet in the east shore of the United States.Balan explained the two cameras and got two different vulnerabilities. The first one is that the cameras have a default username and password values that enable anyone to log into them remotely and view their live stream. As of Friday, there are about 130,000 exposed cameras on Shodan, a search engine for unsafe internet connected devices. Anyone can mangle into the camera’s live data feed by simply logging in with the username and password values “user,” “user,” and “guest,” “guest,” Balan told the News.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "SPY"], "title": "Google removes Lipizzan apps (Spyware) from Google Play Store", "authur": "Eslam Medhat", "date": "July 27, 2017", "body": "Google security researchers have detected a new family of tricky Android spyware called Lipizzan, it is a multi-stage spyware product that can monitor and exfiltrate a user’s email, SMS messages, location, voice calls, and media.The spyware seems to be developed by a startup company called Equus Technologies. Google Play Protect and the Android security team were able to detect the Lipizzan spyware on at least twenty apps in Android Play Store, which affected less than 100 Android smartphones in total.According to Google:\n“Lipizzan is a multi-stage spyware product capable of monitoring and exfiltrating a user’s email, SMS messages, location, voice calls, and media. We have found 20 Lipizzan apps distributed in a targeted fashion to fewer than 100 devices in total and have blocked the developers and apps from the Android ecosystem. Google Play Protect has notified all affected devices and removed the Lipizzan apps.”The spyware “Lipizzan” was a sophisticated two stage spyware tool. The first stage detected by Google Play Protect was spread through various channels, including Google Play, and typically impersonated an innocuous-sounding app such as a “Backup” or “Cleaner” app. After Lipizzan installed, it will download and load a second “license verification” stage, which will survey the infected device and validate certain abort criteria. After that, the second stage will then root the device with known exploits and begin to steal the device data and send it to a Command & Control server.How to protect your self?\n“- Ensure you are opted into Google Play Protect.\n-Exclusively use the Google Play store. The chance you will install a PHA is much lower on Google Play than using other install mechanisms.\n– Keep “unknown sources” disabled while not using it.\n– Keep your phone patched to the latest Android security update.”"}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Over Six Billion Records have been Exposed So Far in 2017", "authur": "Eslam Medhat", "date": "July 26, 2017", "body": "While cyber criminals are becoming more and more sophisticated each day, a cyber attack could lead to slow computer performance, costly data loss, and even potential legal liability. Ultimately, this takes a huge toll on your productivity and profitability.According to mid-year 2017 data breach QuickView report, a Virginia based company who keeps an eye and monitor data breaches, announcing that there have been 2,227 publicly revealed data compromise events through June 30th enabling attackers to steal over 6 billion records. According to riskbasedsecurity:“From fraud and phishing to hacking and unprotected databases – we have it covered in the Mid-Year Data Breach QuickView Report. Risk Based Security is the definitive source for breach intelligence with over 2,200 publicly disclosed breaches cataloged and documented for this report. Download your copy of the free report to read more about:– The 6 billion records exposed year-to-date.\n– Breach activity by economic sector.\n– Leading causes of data loss by record type.\n– Breach severity trends across the first two quarters.”The report says that attackers are increasingly using phishing methods against US citizens to steal employment and tax related data. In 2016 about 160 phishing attacks were responsible for stealing employees information. However, things have gone worse in the first six months of 2017 since there has been a 25% rise in these attacks."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Teen got arrested for Altering Ticket Prices using Chrome Dev Tools, Ticketing System doesn’t have input validation", "authur": "Harikrishna Mekala", "date": "July 26, 2017", "body": "A Teen found a flaw in BKK’s Ticket Booking System just by editing the basic HTML in the Chrome Developer Tools with this flaw he was able to buy $35 worth of Ticket for just .2$. The Transaction got processed because there is no input validation on the server side of the code even noobs will be able to do the transaction.Once he found the flaw, he informed BKK about the Flaw instead of thanking him the have filed a police complaint that he has hacked their systems. The Law Enforcement Agencies went to the home of the boy and arrested him for Cyber Crime.As if they had achieved something absolutely good, BKK held a press meet bragging regarding how they had stopped a “cyber attack” and discovered the hacker. When news got out that the hacker was a white hat and had attempted to inform the group about the flaw, the rage on Twitter held furiously. People vilified, cursed, and sarcastically praised @bkkbudapest. There is also discussion of rallies being organized.Additionally, the group now has a one-star rating on its Facebook page gratitude to thousands of people gathering to it to grant them one-star reviews. Currently, the page has 46,000 one-star numbers. Estimating the total amount of inspections (only 222 five-star ratings), this is a shortage that BKK will never more grow from without creating a new page.“Learn to verify server side, you noobs,” said one review. “What were you guys thinking?”During its presser, BKK declared that it had “secured” its operations. Of course, boiling white hats immediately examined the site and started showing out other flaws. One Twitter user even called the website’s security “a goddamn train wreck.” The BKK site is currently down.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "The Multiple Arcade Machine Emulator community is trying to break DRM", "authur": "Harikrishna Mekala", "date": "July 26, 2017", "body": "While unloading the raw code from several arcade chips is a simplistic method, loads of titles have continued to be un-dumped and unemulated because of the digital-rights-management system that limits the ROM data from being simply copied off of the core integrated circuitry of the chips. For any of those shielded chips, the decapping method can be employed as a DRM workaround by literally lifting the chip’s “cap” with nitric acid and acetone.With the underlying winding paths shown within the chip, there exist a few possible ways to know the raw code. For some chips, a piece of sharp soldering to that barred circuitry can allow for a dropped file that gets throughout any DRM extra down the line. In the event of chips that use a non-rewritable Mask ROM, though, the de-cappers can really look within a microscope (or high-resolution scan) to see the hard zeroes and ones that deliver up the contrarily protected ROM code.Decapping is a time-exhausting and costly process, but the MAME community has shown a compliance to put the work and money. One crowdfunded MAME decapping application from years ago led to the dumping of major chips found in games like Bubble Bobble, Galaga, Arkanoid, Street Fighter EX, and dozens of others. By 2015, though, that work had fallen apart between accusations that a key segment had gone from the Internet and typically run off with dozens of rare chips in his property.Since then, the Caps0ff plan has taken up the MAME decapping screen, raising money to obtain and de-cap hundreds of un-dumped chips in different states of disrepair. The plan has already submitted detailed breakdowns of its decapping works on chips from games like Bad Dudes, Mortal Kombat 4, and some cult traditional shmups from developer Toaplan, amongst others.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Hundreds of Mac Computers have been Infected with Undetectable Malware", "authur": "Eslam Medhat", "date": "July 25, 2017", "body": "Mac OS users think that their computers are immune from things like viruses or malware attacks and think that their computers are somehow essentially protected. It is right that it’s less likely for a Mac OS user to be hit or infected with a malware than a Windows user.The Mac malware is called Fruit-Fly, the malware can remotely take full control of webcams, screen, mouse, keyboards, and install another malicious software. Fruit-Fly runs silently in the background, spies on users through the computer’s camera, capture images of what’s displayed on the screen and logs key strokes.Patrick Wardle (a chief security researcher at security firm Synack) found around 400 Mac machines infected with the newer strain of the FruitFly malware. He said that it is unknown who is behind FruitFly or how the malware gets into Mac machines, Wardle also believes that the nasty malware has been active for around ten years.Wardle said:\n“FruitFly, the first OS X/macOS malware of 2017, is a rather intriguing specimen. Selectively targeting biomedical research institutions, it is thought to have flown under the radar for many years”“The only reason I can think of that this malware has not been spotted before now is that it is being used in very tightly targeted attacks, limiting its exposure”Until now, there is no evidence at this point connecting this malware to a particular group, the fact that it has been seen specifically at biomedical research institutions certainly looks like it could be the result of exactly that kind of espionage."}, {"topics": ["Hacking News", "News", "Tech", "Uncategorized"], "title": "We are going to Launch a ‘Non-hackable’ Internet Interface says China", "authur": "Harikrishna Mekala", "date": "July 25, 2017", "body": "The technology it has applied to is quantum cryptography, a drastic break from the conventional encryption systems around. The Chinese project in the city of Jinan has held lauded as a milestone by country’s media.The pioneering scheme is also the piece of a bigger story: China is getting the lead in a technology in which the West has long remained reluctant to invest.In the Jinan system, any 200 users of the military, government, banking and electricity sectors will be capable of sending messages safe in the information that only they are reading them.China’s potential in quantum communication suggests the nation is catching huge strides improving applications that sway make the increasingly exposed internet more secure. Applications that other nations soon force find themselves buying from China.So, what is this technology into which the country is issuing massive resources?If you transmit any information you need to keep protected from eavesdroppers, common encryption runs by hiding the key required to read the information in a very complex mathematical problem.But what is “hard” in terms of maths? It means you ought to think very fast to figure it out as you try countless organizations of long, numeric keys. In 2017, that suggests you need to use a very powerful computer.Steady increases in processor power mean that the number-based keys have to be increased periodically. Encryption has a shallow life and is rapidly growing more vulnerable.There are also concerns that the growth of quantum computers, which definitely represent a huge step difference in number crunching ability, will render much of modern encryption software vulnerable.Quantum interface works differently:Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Data of 10 Million Voter’s from 9 States is on sale in Dark Web", "authur": "Harikrishna Mekala", "date": "July 25, 2017", "body": "The voter documents being tendered for purchase covers the voter’s full first, last and middle name, voter ID, DOB, citizen status, party association, household address and additional details. The data applies to voters in Arkansas, Colorado, Connecticut, Delaware, Florida, Michigan, Ohio, Oklahoma and Washington State.Over the closing two days, voter databases of at least couple of the states Arkansas and Ohio were traded for a mere $2 each, or a sum of $4 for about 10 million voter records. That implies financial profit is not the main reason for the project, according to Lookingglass.‘Logan,’ the person who has posted the data and is trading it on a site called RaidForums, has indicated at holding voter records for an extra 20 to 25 states, says Jonathan Tomek, director of threat research at Lookingglass Cyber Solutions.Logan seems to have got the voter information by Freedom of Information Act (FOIA) inquiries, website applications, and also through social engineering them from cases where an entity would unless be needed to purchase the information, he says.What makes his actions additionally criminal is his effort to sell the data for plans other than political purposes, he wrote. Many states prevent the republishing of citizen data or the use of it for business purposes. Violators can face fine and penitentiary terms of up to five years.“Logan is not affiliated with any organization to our knowledge,” Tomek says. “We think he is acting alone. I can tell he is over 18, moves a bit internationally, and runs for a cyber security company,” he says.Tomek states Lookingglass does not hold information on whence many people might have bought the voter data or what they sway do with it. “We do understand he is actively selling this knowledge for other stolen things such as credit slips and login credentials,” he says. “The organization of the voter knowledge plus the other data has likely to be very bad since the voter data contains birthday, home location, email, and full name.” Take your time to comment on this article."}, {"topics": ["Hacking News"], "title": "A hacker stole $8.4 million from Veritaseum (Ethereum platform)", "authur": "Eslam Medhat", "date": "July 24, 2017", "body": "Veritaseum has confirmed today that a hacker was able to steal $8.4 million from the Ethereum platform’s ICO (Initial Coin Offerings). The anonymous hacker was able to steal VERI tokens during the ICO. Because the ICO was ongoing and the tokens were in demand, the hacker immediately sold them to other buyers.“ICO (Initial Coin Offerings) is an unregulated means of crowdfunding. Early ICOs were for funding development of new cryptocurrency instruments, but modern ICOs serve any purpose. Generally, tokens are sold to raise money, with token existence and behavior defined by mathematical contract algorithms. Unlike an initial public offering (IPO), acquisition of the tokens is not government regulated, and may or may not grant ownership or other rights in the venture.”Until Now, the attack is unclear. It seems that some “advanced attack” was used, yet the technical team did not disclose details. Unfortunately for the platform, recovering the stolen funds will be nearly impossible. These tokens will be dumped across multiple exchanges in the near future.Until Now, the attack is unclear. It seems that some “advanced attack” was used, yet the technical team did not disclose details. Unfortunately for the platform, recovering the stolen funds will be nearly impossible. These tokens will be dumped across multiple exchanges in the near future.Reggie Middleton (The founder of Veritaseum) said:\n“We were hacked, possibly by a group. The hack seemed to be very sophisticated, but there is at least one corporate partner that may have dropped the ball and be liable. We’ll let the lawyers sort that out, if it goes that far.”“The hacker(s) made away with $8.4M worth of tokens, and dumped all of them within a few hours into a heavy cacophony of demand. This is without the public knowing anything about our last traction.”"}, {"topics": ["Hacking News"], "title": "Stantinko Botnet was undetected for at least 5 years", "authur": "Eslam Medhat", "date": "July 22, 2017", "body": "A huge botnet called Stantinko was discovered by security researchers from ESET, the botnet was undetected for at least 5 years succeeded to infect about half a million devices worldwide and enables operators to “execute anything on the victim machine.The huge botnet is essentially used to install on the infected systems browser extensions that are used to inject advertisements and perform click fraud. According to ESET:\n“To infect a system, they trick users looking for pirated software into downloading executable files sometimes disguised as torrents. FileTour, Stantinko’s initial installation vector, then loudly installs a lot of software to distract the user while it covertly installs Stantinko’s first service in the background.”“Stantinko is a modular backdoor. Its components embed a loader allowing them to execute any Windows executable sent by the C&C server directly in memory. This feature is used as a very flexible plugin system allowing the operators to execute anything on an infected system.”The Safe Surfing and Teddy Protection extensions are installed by the Stantinko malware. Both extensions spread through the Google Chrome Web Store are used to block undesired URLs. The botnet installs its versions of both browser extensions that are able to obtain a configuration to perform click fraud and advertisement injection.“Stantinko installs two browser extensions, The Safe Surfing and Teddy Protection, which inject advertisements or redirect the user. It allows the Stantinko operators to be paid for the traffic they provide to advertisers.”"}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "More than 10 Million Comments were Received by the FCC", "authur": "Harikrishna Mekala", "date": "July 22, 2017", "body": "The Republican-led FCC offered a plan in May to roll back the 2015 laws, and the original public commentary time on the program ended Monday. A return season is now moving to allow for further explanations until August 16.Roughly 2 million of those criticisms were recorded last week, when thousands of activists, people, and tech companies engaged in an online rally to teach people regarding the advantages of net neutrality, according to Battle for the Doom, one of the organizers of the operations.The flood of observations reflects the actual opinion that most Americans have moving the existing rules, which guarantees broadband businesses can’t prevent or slow-down your way to the internet or cost businesses a fee to transfer service faster to clients.But the FCC Chairman Ajit Pai seems dead set on moving forward with the plan. He and Commissioner Michael O’Reilly have continued been denied to the 2015 rules, calling them old-fashioned and suffocating to business investment. They’ve both frequently stated their intention to dismantle them.Big tech firms including Amazon, Google, and Netflix say that working back the laws will give great internet providers to complete authority over the content people enter online. And they worry that outwardly net neutrality rules, it’ll be difficult for smaller businesses to enter the business in the future.Some of these organizations like Mozilla filed judgments in the proceeding while many signed on to a filing from the Internet Association, a lobbying group that includes Facebook, Google, Microsoft, Twitter and Netflix as parts. The letter to the FCC asked for “strong and enforceable net neutrality rules … that ban blocking, throttling, paid prioritization, and other unfair practices.”AT&T, Comcast, Verizon and other internet service providers also recorded remarks asking the FCC to revoke the rules. These organizations say they maintain an open internet but don’t agree with the legal authority the FCC used to form the habits. The FCC reclassified broadband as a utility-like assistance subjecting broadband to the corresponding rules governing the old telephone network. Cable and phone organizations say applying these antiquated regulations on internet service providers hurts property because they fear that the administration may try to regulate rates.Comcast, the nation’s largest cable provider, said in its filing that regardless of whether the FCC changes its rules, it remains “dedicated to the core principles of a free and open Internet.”Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "Vulnerabilities"], "title": "Internet-Connected Toys Could Be the Downfall of Parents Everywhere", "authur": "Mandee", "date": "July 21, 2017", "body": "Just recently, the FBI released a warning to parents everywhere: reconsider giving your kids internet-connected toys. The idea of getting kids into technology is good, but there are devices specifically meant for that.Internet connected toys . . . well, they are not as innocent as they seem.“The FBI encourages consumers to consider cyber security prior to introducing smart, interactive, internet-connected toys into their homes or trusted environments. Smart toys and entertainment devices for children are increasingly incorporating technologies that learn and tailor their behaviors based on user interactions.These toys typically contain sensors, microphones, cameras, data storage components, and other multimedia capabilities – including speech recognition and GPS options. These features could put the privacy and safety of children at risk due to the large amount of personal information that may be unwittingly disclosed.”The last thing this world needs is an epidemic on child identity fraud. Unfortunately, the worst part is that child identity fraud is only one potential threat of thousands when it comes to internet connected toys.For example, last February marked the ban of smart-doll My Friend Cayla in Germany thanks to authorities discovering a weakness in the toy. As it turned out, the doll could be hacked to record conversations conveyed over the Bluetooth feature.In addition to this, February was also home to the massive Cloud Pet leak. The toys allowed owners to record cute messages via a recorder. Apparently, those messages were being stored in an online database.To make matters worse, the database was extremely vulnerable, as over 2 million personal recordings were leaked online after the database was hacked into.These two incidents are merely examples of the capabilities internet connected toys now possess. When put in the wrong hands, the dangers are not only virtual – they’re physical and they endanger children."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "WhatsApp got blocked by the Chinese Government", "authur": "Harikrishna Mekala", "date": "July 20, 2017", "body": "WhatsApp, A messaging app used across the globe, was partially blocked by Chinese filters, leaving many users unable to send Digital Content and some were unable to send texts.The interruption of WhatsApp held the latest in a long line of big digital services going up against China’s “Great Firewall,” the country’s policy of internet filters and controls. Recently, the administration has appeared to improve its grip, an online crackdown fed by a comprehensive storm of politically delicate news, important issues, and a new cyber security law that permitted into effect last month.Sites hosting popular international TV shows have had videos brought down, and tools employed to skirt the judges have faced more common disruptions. In an editorial, the spokesman of the country’s Communist Party criticized the Chinese internet company Tencent over a popular video game, calling it too addictive.The news environment has increased the government’s online investigation. In recent weeks, the Chinese dissident Liu Xiaobo died in custody. A Chinese billionaire in the United States arrested senior leaders of graft, working his platform on Twitter. And Hong Kong celebrated the 20th anniversary of its handover to China.To confuse matters, the 19th Party Congress where top management positions are set is just periods away. The administration puts an expanded importance on security in the run up to the event, which occurs every five years, often pointing to a tightening of internet controls.WhatsApp, which had usually avoided major interruptions in China despite the full block of Facebook and Instagram, seems to have become a victim of those circumstances.The blocks upon WhatsApp originated with the government, according to a person close to the situation who declined to be identified because they were not allowed to speak on the record about the interruption. Security authorities also confirmed that the partial interruption in WhatsApp began with China’s internet filters.“According to the report that a Company ran today on WhatsApp’s foundation, it seems that the Great Firewall is forcing censorship that selectively targets WhatsApp functionalities,” said Nadim Kobeissi, a practiced cryptographer at Symbolic Software, a cryptography research start-up.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "International Hotels Management LLC owned by Trump suffers a Credit Card Data Breach for the 3rd time", "authur": "Harikrishna Mekala", "date": "July 20, 2017", "body": "According to Verizon‘s newest annual Data Breach Investigations Report (DBIR), malware outbreaks on point-of-sale methods used at the front desk and hotel restaurant systems “are completely uncontrolled” in the service sector. The service is a top industry for point-of-sale interventions in this year’s data, with 87% of violations within that pattern.Other hotel chains that revealed this past week taking hit in the Sabre breach aggregate 11 Hard Rock properties different chain hit by various card breach incidents Four Seasons Hotels and Resorts including at least two dozen Loews Hotels in the United States and Canada.Given its poor record of neglecting to protect customer card data, you might consider the accommodation business would be eager to appease guests who may previously be concerned that handing over their card at the resort check-in desk also means consigning that card to cyber crooks.However, consider this year I’ve been hard-pressed to gain any of the major hotel chains that allow more secure chip-based cards, which are intended to make card data secure by point-of-sale malware and skimmers much further difficult to turn into bogus cards.True, chip cards alone aren’t proceeding to solve the whole problem. Hotels and other retailers that achieve the ability to process chip cards still must to ensure the data is encrypted at every step of the sale known as “point-to-point” or “end-to-end” encryption. Investing in technology like tokenization which allows retailers to store a language that describes the customer’s card data rather of the card data itself also can help businesses become less of a target.Maybe it wouldn’t be so disturbing if those of us concerned about security or annoyed just at getting our cards returned three or four times a year due to deception could stay at a major hotel chain in the United States and just pay with cash. But alas, we’re speaking about an industry that typically requires customers to pay by credit card.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking Challenges", "Hacking News"], "title": "Radio & TV Station KQED Is Still Recuperating After Ransomware Attack", "authur": "Mandee", "date": "July 20, 2017", "body": "Nearly a month ago, KQED radio and TV station got to experience the wonderful situation of being infected by a ransomware.“The incident took place on June 15, when an unknown strain of ransomware infected one of KQED’s Internet-connected computers, spreading to other workstations on the same network.”The immediate result: for almost 12 hours, KQED’s radio stream was offline. Although the station’s IT staff was quick to shut off as many connected devices as possible, a great deal of information was still caught in the crossfire.The immediate result: for almost 12 hours, KQED’s radio stream was offline. Although the station’s IT staff was quick to shut off as many connected devices as possible, a great deal of information was still caught in the crossfire.Those behind the ransomware asked for 1.7 BTC per infected PC, but KQED did not cough up the money. Instead, they conveyed the cyber-attack to the FBI.Now that a month has passed, the station is finally getting a handle on some things. Unfortunately, it took them a lot of time to get to this point – and they’re not even done recuperating yet.After the attack, all computers were wiped clean and refurbished with their operating systems. KQED’s wireless network at headquarters was down for days. Even more, the station’s email servers were also down for about two weeks.“For two weeks, KQED TV broadcasts were moved and recorded at a studio at the University of California, Hastings. Even now, the team uses a stopwatch to time TV segments, a task previously automated by special software. Furthermore, new hires weren’t able to start work because KQED couldn’t issue new access cards.”“We’ve basically been putting everything together with duct tape for a month. From an outside point of view, we really made it work. But what our listeners don’t know is that people have been doing really crazy things to make sure no one notices that anything is wrong.”"}, {"topics": ["Hacking Challenges", "Hacking News", "News"], "title": "It’s Kind of Terrifying That Your Segway Could Be Hacked", "authur": "Mandee", "date": "July 20, 2017", "body": "In a lighthearted sense, watching someone randomly get thrown off their Segway hover board is kind of hilarious . . . if they don’t get hurt. On the other hand, if the Segway has to be hacked in order for that to happen – well, it’s not worth it.Recent research and experiments have proven that Segways (the Segway Ninebot MiniPRO to be exact) can, in fact, be hacked. The hack is via two key omissions of the Segway designers: all Ninebot MiniPROs have the same PIN codes and none of them bother to check the legitimacy of their firmware.“Even though the rider could set a PIN, the hover board did not actually change its default pin … This allowed me to connect over Bluetooth while bypassing the security controls. I could also document the communications between the app and the hover board, since they were not encrypted.”An example tutorial showed the official Ninebot smartphone app being used to control certain functions of the hover board and other “interesting” things. For example, the user was able to find the location of nearby riders.Since discovering the flaw in the official app, the feature has been removed. However, that doesn’t mean the danger is gone.The terrifying part is that anyone with the ability to manipulate hover boards like this is a threat to the community. Provided they use it for harmful purposes, a person being thrown from a hover board is funny until they break a bone – or worse.People do stupid things. It’s in our human nature to test the limits of our existence. Unfortunately, that might also be the downfall of us."}, {"topics": ["Hacking News", "Vulnerabilities"], "title": "A hacker was able to steal $30 million from parity ethereum wallet", "authur": "Eslam Medhat", "date": "July 19, 2017", "body": "An anonymous hacker was able to use a vulnerability in parity ethereum wallet client to steal over 153,000 Ether, worth over $30 million dollars.The unknown hacker used a vulnerability in the Parity Ethereum client, which enabled the hacker to withdraw funds from multi-sig wallets created with Parity clients 1.5 and later. Parity 1.5 was released on January 19, 2017.Multi-sig wallets are Ethereum accounts over which multiple users have control with their own keys. Multi-sig accounts enable owners to transfer funds only when a majority of owners sign a transaction with their key.The problem is the result of a flaw in a particular multi-sig contract known as “wallet.sol”. Data suggests the issue was mitigated, however, as 377,000 ethers that were probably vulnerable to the issue were recovered by white hackers.According to Etherscan:\n“The White Hat Group were made aware of a vulnerability in a specific version of a commonly used multisig contract. This vulnerability was trivial to execute, so they took the necessary action to drain every vulnerable multisig they could find as quickly as possible. Thank you to the greater Ethereum Community that helped finding these vulnerable contracts.”“The White Hat account currently holding the rescued funds is https://etherscan.io/address/0x1dba1131000664b884a1ba238464159892252d3a.If you hold a multisig contract that was drained, please be patient. They will be creating another multisig for you that has the same settings as your old multisig but with the vulnerability removed and will return your funds to you there.”"}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Banking Trojan NukeBot Is Exposed – Source Code Released", "authur": "Mandee", "date": "July 19, 2017", "body": "Earlier this month, the creator behind the banking trojan NukeBot released the source code to the virus in an apparent effort at “winning back the cybercrime community.”The story behind the creator, Gosya, is one of the sketchiest legitimate viruses seen on the dark web in a while. In the beginning, Gosya would lurk on dark web forums trying to sell his trojan.According to various users on the forums, the virus itself can be verified by the forum hosting the vendor (which it wasn’t) – and to make matters worse, Gosya also raised suspicions by acting “defensive and nervous”.Gosya took a further dive down the hole of crazy after his first failed attempt at selling NukeBot. The trojan was reposted to the same forums . . . but under different names.Criminals are devious. Some are considered “stupid”, but most are smart enough to know half of what they’re doing. After Gosya started vending under different names, the criminal community grew even more suspicious that he was trying to sell a product he didn’t have.This led to the eventual release of the trojan’s source code at the end of 2016. Since then, Gosya has at least gotten some credibility back.“NukeBot, also known as Nuclear Bot, first surfaced on underground marketplaces back in December. Researchers with Arbor Networks were among the first to dissect the Trojan and claimed it was replete with commands, a man-in-the-browser functionality, and the ability to download webinjects from its command and control server.When X-Force analyzed NukeBot, also in December, researchers said the malware could be considered an “HTTP bot” that can steal login data on the fly.”Although cyber security experts can’t be sure that NukeBot is a colossal threat, they do confirm that the source code has caused a bit of rift raft in the banking world."}, {"topics": ["Hacking News"], "title": "A hacker was able to steal $7 million from CoinDash Platform", "authur": "Eslam Medhat", "date": "July 18, 2017", "body": "An anonymous hacker was able to hack the official website of the CoinDash (blockchain company) platform and steal more than $7 Million worth of Ethereum by fooling CoinDash’s investors into sending “43438.455” Ether to the wrong address owned by the hacker.According to CoinDash:\n“It is unfortunate for us to announce that we have suffered a hacking attack during our Token Sale event. During the attack $7 Million were stolen by a currently unknown perpetrator. The CoinDash Token Sale secured $6.4 Million from our early contributors and whitelist participants and we are grateful for your support and contribution.”The company said that it’s responsible to all of its contributors and will send CDTs reflective of each contribution. It also said that transactions sent to any fraudulent address after the website was shut down will not be compensated.The company said that it’s responsible to all of its contributors and will send CDTs reflective of each contribution. It also said that transactions sent to any fraudulent address after the website was shut down will not be compensated.“CoinDash will credit investors who sent ETH to the fraudulent address with the CDT amount they would have received by sending their ETH to the correct smart contract address. We are currently gathering information regarding each of the attack victims and will release the complete list for our contributors and community review shortly. CoinDash will further compensate its contributors using the resources at its disposal. More details will be released as soon as we have a complete list of all the people who were affected by this attack.”There are no additional details available about the breach and the worst thing is that the company is still under attack."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "IBM wants to Encrypt Every Bit of Customer’s Data to prevent it from Hackers", "authur": "Harikrishna Mekala", "date": "July 18, 2017", "body": "IBM Inc said on Monday that it has accomplished a breakthrough in cryptography technology that will allow all companies to encrypt their consumer data on a huge scale using maximum if not all of their digital data into jargon that is unintelligible to Hackers with its new mainframe.“The last production of mainframes did encryption remarkably well and really fast, but not in a lot,” Ross Mauri, general administrator of IBM’s mainframe industry, said in an interview. Mauri predicts that only 4% of data taken since 2013 was ever encrypted.As a number of data breaches hitting U.S. entities regularly grow to result in the leakage every time of millions of people’s private information IBM claims that universal encryption could be the solution to the epidemic of hacking.The key, according to IBM executives, is an update to the processor chips driving the robust mainframe servers that house corporate or institutional data and concoct millions of transactions a day worldwide, such as ATM withdrawals and credit card installments and flight tickets.Cryptography, the art of converting readable information into coded cipher, is now commonly applied by several email providers and storage companies. But because of the huge computational capability required to quickly encrypt and decrypt data as it moves from one object to another, many companies use encryption simply selectively if at all. A December statement by the security firm Sophos discovered that while three out of four companies routinely encrypt customer data or invoicing information, far further do not encrypt their intellectual property or HR reports. Sixty percent of companies also leave work files generated by employees unencrypted, the research found.All of these represent events for digital criminals, said Austin Carson, managing director of the technology think tank TechFreedom.“Way too much data is collected in clear text,” he said. But common or pervasive encryption, he continued, could help secure that even if hackers broke into a business network, any data they found would be difficult to decode. “That would be a tremendous step forward simply in terms of defending a much greater body of information,” Carson said.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "Vulnerabilities"], "title": "GhostCtrl: The Android Backdoor That Could Ruin Everything", "authur": "Mandee", "date": "July 18, 2017", "body": "While a large variety of mobile threats exist, especially for Android users, the GhostCtrl backdoor is capable of damage at an alarming rate. The possibilities are dangerous . . . but what’s even more is that they’re more likely to infect us than not.Trend Micro researchers have deduced that the backdoor has “cycled through three iterations” and the latest is “especially capable, as it can steal all kinds of information, is ‘hauntingly persistent’, and can take complete control of the device”.The terrifying part is that the GhostCtrl backdoor is only one of thousands of possibilities, as it’s based on the multiplatform OmniRAT – popular on darknet black markets. It can cost anywhere from $25 to $75.“It’s C&C communication is encrypted, and the commands it receives contain action code and Object DATA, which, according to the researchers, ‘enables attackers to specify the target and content, making this a very flexible malware for cybercriminals.’”The most common form of GhostCtrl is a phony app. The backdoor can be disguised as WhatsApp – Pokemon Go – literally anything. After it’s installed, the malware can hide from the victims by hiding its icon.The easiest way to avoid downloading malware like GhostCtrl is to use your commonsense. Don’t install apps from third parties. Read the reviews. Do your research. And if nothing else: make sure you have a back-up of your mobile data “just in case”."}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Those Affected by Ashley Madison Scandal Are Offered Settlements", "authur": "Mandee", "date": "July 17, 2017", "body": "Do you remember the Ashley Madison scandal that plagued the online community in 2015? You should, as it spent a decent amount of time getting headlined in the media.Literally millions of users that signed up for the online affair website were left compromised after one of the larger data breaches in web history.“The group [behind Ashley Madison data leak] has claimed two motivations: First, they’ve criticized Ashley Madison’s core mission of arranging affairs between married individuals.Second, they’ve attacked Ashley Madison’s business practices, in particular its requirement that users pay $19 for the privilege of deleting all their data from the site (but, as it turns out, not all data was scrubbed).”Ashley Madison’s parent company, Ruby Corp. & Ruby Life, has been battling a very large amount of lawsuits since the data breach.In fact just recently a proposed settlement was finally reached. This solved a good amount of relevant lawsuits in the process.The ordeal left more than 37 million users exposed – so it’s not necessarily a surprise that the class action lawsuits won out in the end. The real surprise is the amount of money being offered to the settlement fund.“If the proposed settlement agreement is approved by the Court, ruby will contribute a total of $11.2 million USD to a settlement fund, which will provide, among other things, payments to settlement class members who submit valid claims for alleged losses resulting from the data breach and alleged misrepresentations as described further in the proposed settlement agreement.”Individual victims of the data breach can also claim up to $3,500 if they submit proof of their loss. In conclusion, let’s just hope this settlement doesn’t glorify affairs (as Ashley Madison has done that enough on its own)."}, {"topics": ["Hacking News"], "title": "Be careful – Don’t Use This “Fake TOR Browser”", "authur": "Eslam Medhat", "date": "July 13, 2017", "body": "A fake TOR browser dubbed “Rodeo” that simulates Tor browser has been found attracting users to create their accounts on the website which is actually present in the dark web. The fake website is a marketplace for all kinds of illegal products stealing money from users.The malicious Tor Browser was found by Lawrence Abrams (security researcher from Bleeping Computer). The researcher said that the browser is spread using YouTube tutorials that educate non-technical users how to purchase products from a Dark Web marketplace named The Rodeo.According to the researcher:\n“The Rodeo Browser is coded in .NET and none of its buttons work. When users try to click on anything, an error like the one below is displayed.”“The only thing that works is the Settings drop-down menu, which provides users with the option to load The Rodeo marketplace. When users press this option, the fake Tor Browser pretends to connect to a fake onion site called th3rod3o3301jtxy.onion.”Rodeo enables the users to obtain illegal products from the dark web and pay using Bitcoins. But in fact, the website seems to be a scam to steal people’s money.“Bleeping Computer believes the site’s operator allows users to place orders to various vendors, but all messages reach the same person, who then provides victim’s with Bitcoin addresses where they can make payments before receiving their products. Based on the three Bitcoin addresses we found, at least three users sent Bitcoin to the site’s operator(s).”"}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Rodeo Browser Marketplace Scams Novice Dark Web Users", "authur": "Mandee", "date": "July 13, 2017", "body": "Dark web scams are usually easy to spot, especially when they come in the form of YouTube video tutorials. For experienced users – or novice users with commonsense – the Rodeo Browser scam is nothing to worry about. Unfortunately, that’s not the case for everyone.Basically, novice dark web users that don’t know any better are downloading a malicious app masked as a modified version of Tor Browser thanks to a YouTube tutorial video.The video claims to provide dark web users with the means of purchasing illegal items from a dark web marketplace called The Rodeo.After installing Rodeo Browser, nothing can be accessed except the settings drop-down menu that leads to the marketplace. This is due to the browser being coded in .NET.Discovered by Bleeping Computer’s Lawrence Abrams, The Rodeo’s true objective was discovered – connect to a remote FTP server and recover content to show on the website.Although Abrams and the rest of Bleeping Computer’s staff couldn’t prove 100% that Rodeo Browser and marketplace was/is a scam, everything about the website screams malicious.“[The Rodeo Marketplace] does appear that it was built to scam users and to perfectly mimic the classic model of any Dark Web marketplace.Users need to register, log in, explore the merchandise, view vendor profiles, and place orders. The site says that all orders are encrypted via PGP keys, but we found no evidence of such behavior.In reality, this supposed Dark Web marketplace appears to con non-technical users into placing orders and paying via Bitcoin for products they’ll never receive.”The solution is clear: users need to steer clear of Rodeo Browser. The fact that the marketplace is stealing information from other black markets should be warning enough.With all of the AlphaBay drama going on right now, users are better staying away from black markets in general – even for “harmless” browsing. (Because truthfully, nothing is harmless anymore.)"}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "6 Million Customers Data got Leaked from Verizon Servers", "authur": "Harikrishna Mekala", "date": "July 13, 2017", "body": "The security concern, revealed by research from cyber security firm UpGuard, was made by a misconfigured security setting on a cloud server because to “human error.”The error made consumer phone numbers, names, and some PIN codes openly available online. PIN ciphers are used to confirm the status of people who call for customer service.No loss or theft of consumer information occurred, Verizon told CNN Tech.UpGuard, the same company that found leaked voter data in June initially said the failure could impact up to 14 million accounts.Chris Vickery, a Cyber Security researcher at UpGuard, found the Verizon data was exposed by NICE Systems, an Israel-based company Verizon was operating to facilitate customer service calls. The data was gathered over the last six months.Vickery alerted Verizon to the flaw on June 13. The safety hole was closed on June 22.The incident arose from NICE security areas that were not set up properly. The group made a security setting public, rather than private, on an Amazon S3 storage server a simple technology used by companies to keep data in the cloud. This suggests Verizon data stored in the cloud was momentarily visible to anyone who had the public link.The security firm examined a sample of the data and obtained some PIN codes were protected but others were visible next to phone numbers.UpGuard refused to reveal how the leaked data was discovered.Dan O’Sullivan, a Cyber Security Analyst with UpGuard, said public PIN codes is a matter because it allows scammers to obtain someone’s phone service if they convince a customer help agent they’re the account holder.“A scammer could get a two-factor authentication message and potentially modify it or alter the authentication to his liking,” O’Sullivan said. “Or they could cut off way to the real account holder.”Verizon consumers should update their PIN codes also not use the same one twice, O’Sullivan advises.Take your time to comment on this article."}, {"topics": ["Hacking News"], "title": "Verizon Database Exposed Online with the details of 14 Million Customers!", "authur": "Eslam Medhat", "date": "July 12, 2017", "body": "Verizon is an American multinational telecommunications conglomerate and the largest U.S. wireless communications service provider as of September 2014, and a corporate component of the Dow Jones Industrial Average.Chris Vickery, director of cyber risk research at security firm UpGuard, found an unprotected database on Amazon S3 that was completely downloadable and configured to provide public access. The database and its multiple terabytes of contents could thus be accessed simply by entering the S3 URL.According to UpGuard:\n“The repository’s subdomain, “verizon-sftp,” is an indication of the files’ corporate origins. Viewing the repository, there are six folders titled “Jan-2017” through “June-2017,” as well as a number of files formatted with .zip, among them “VoiceSessionFiltered.zip” and “WebMobileContainment.zip.” These files, inaccessible via .zip extraction, could be decompressed once the format was changed to .gzip, another file compression program.”The data included sensitive information of millions of customers, including their names, phone numbers, and account PINs (personal identification numbers). The database was sitting on an Amazon Web Services S3 server without any type of authentication.“This is not all, however. A great many Verizon account details are also included in the logs, such as customer names, addresses, and phone numbers, as well as information fields indicating customer satisfaction tracking, such as “FrustrationLevel,” and service purchases, such as “HasFiosPendingOrders.” Values including number ratings, “True,” “False,” “Y,” and “N” are assigned to each field. For a large amount of these logged calls, however, the most sensitive data—such as “PIN” and “CustCode”—is masked.”The researcher reported the exposure to Verizon team in late June, and the database was then secured in a week."}, {"topics": ["Hacking News"], "title": "UK radio station keeps getting hijacked to Play Obscene Song", "authur": "Eslam Medhat", "date": "July 12, 2017", "body": "A crazy hacker has hijacked the airwaves of a UK radio station to play a dirty song eight times during the past month. The radio station’s manager confirmed and reported the hacks in a conversation with BBC Radio 4.The station’s managing director Tony Delahunty said that Radio listeners in Mansfield were shocked by a sudden rendition of the 1970s rude comedy track The Winker’s Song on Sunday afternoon, when an unknown hacker has hijacked the radio frequency of a UK radio station.“We have had calls from people who have found it hilarious, while some have raised their concerns, including our competitors, and a lot of people in the industry are aghast at how difficult it is to stop these people.”“For listeners under the age of 11 travelling to school, it can be a very offensive thing for them to hear, so I just want it to stop… but I would also love to see who it is and have them caught.”“The first time we reported it to the police, but they said they would have to catch him in the act. Our transmitter people can’t do anything because the person is using a mobile transmitter.”Delahunty said that the communications regulator Ofcom (the government-approved regulatory and competition authority for the broadcasting, telecommunications and postal industries of the United Kingdom. ) has sent a truck with advanced equipment on three times to try and catch the hacker, but have so far been unsuccessful because they can only track him when he is broadcasting."}, {"topics": ["Hacking News"], "title": "Hacker used PHP shell to take over dark web hosting service", "authur": "Eslam Medhat", "date": "July 11, 2017", "body": "A hacker called “Dhostpwned” was able to register a shared hosting account on the dark web hosting service and managed it to upload two shells on the web servers, the first one is written in PHP and the other one is written in Perl.The company investigated the hack and said that the attacker was not able to execute the Perl shell, but the PHP shell has been executed and worked just fine.“An attacker subscribes to a shared hosting. It uploads two files that are a PHP shell and a Perl shell. The Perl shell can not be executed on the server, but the PHP shell can be executed on the server. A large part of the PHP shell is unusable since a certain number of functions are blocked on the shared servers but one function was not blocked. The attacker was able to access the server and execute a commands with limited rights.”it took an entire day from the hosting company to recognize what really occurred, identify the point of the hack, and change FTP and database password for all clients.“Dhostpwned has not dumped any data from Deep Hosting or its clients, and said he doesn’t plan to.”"}, {"topics": ["Hacking Challenges", "Hacking News", "Vulnerabilities"], "title": "Medicare to Be Reviewed After Recent Data Breach", "authur": "Mandee", "date": "July 10, 2017", "body": "Just recently, Medicare got to experience the beauty that is a security breach. For a quick refresher, hackers obtained Medicare details and sold them on the dark web under the guise “The Medicare Machine”.The breach was acknowledged after several victims purchased their own Medicare card numbers off the dark web, in hopes of evading trouble.“It follow revelations a Guardian Australia journalist was able to buy their own Medicare details from a darknet trader who is illegally selling the information by “exploiting a vulnerability” in a government system.”Since then, an official statement has been released describing the upcoming activities in the Medicare world: the government is demanding a review be done.“The Turnbull government has commissioned a review of the accessibility by health providers of Medicare card numbers. The system, which has not been significantly altered since being brought in 8 years ago, has to be both convenient and utterly secure.”Leading the review will be the former head of the department of Prime Minister and Cabinet, Professor Peter Shergold.Since the public acknowledgement of the breach, “The Medicare Machine” is still up and active. On the other hand, the information is much less sensitive now that the card numbers can no longer be used.Medicare users exposed in the breach are also receiving new card numbers. In addition to the review on the Medicare system, users are also promised an updated system with unmatchable security features.“The review will also investigate the online connection between external medical software providers and the online database, as well as the security checks used to prevent people from accessing numbers illegally.”In today’s cyber generation, we no longer have the opportunity to avoid cyber threats. One way or another, they will hit us . . . and we need to be prepared. If every company is actively strengthening their online wards, then ultimately a colossal breach can be avoided."}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Avanti, a Self-Service Food Kiosk Vendor, Is Hacked", "authur": "Mandee", "date": "July 10, 2017", "body": "If you work in a big-fish corporation, you might be familiar with the self-service payment kiosks that are a godsend for antisocial yet hungry employees. Avanti Markets is a company that offers these self-service kiosks – literally shelves filled with the snacks and drinks of your hungriest dreams.Much to the chagrin of hungry workers everywhere, Avanti was recently hacked. The breach consisted of vulnerabilities in the company’s internal networks, where hackers were able to execute malicious software to the self-service payment kiosks.“On July 4, 2017, we discovered a sophisticated malware attack which affected kiosks at some Avanti Markets. Based on our investigation thus far, and although we have not yet confirmed the root cause of the intrusion, it appears the attackers utilized the malware to gain unauthorized access to customer personal information from some kiosks.Because not all of our kiosks are configured or used the same way, personal information on some kiosks may have been adversely affected, while other kiosks may not have been affected.”For those that are unfamiliar, Avanti’s self-service kiosks allow workers to pay for their snacks and drinks with credit cards, cash, or fingerprint scans.Although biometric data might be jeopardized, it seems the hacker’s main goal was to gain access to card related payment information – including the cardholder’s first and last name, the card number, and the expiration date.Due to the discovery of the malware’s intention, Avanti has temporarily disabled their kiosks credit card payment option. After further investigation into the matter, it was found that the kiosks were infected with a family of point-of-sale malware – otherwise known as PoSeidon (or FindPOS).There is no doubt in the convenience of self-serving kiosks or similar things. The doubt lies in the vulnerabilities that come with such advancement of technology. If we don’t want to give up these types of things, manufacturers have got to start finding new ways of implementing security features."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "A new malware called “Dok” targets Swiss banking users", "authur": "Eslam Medhat", "date": "July 10, 2017", "body": "The “Dok” malware has been detected by Trend Micro as “OSX_DOK. C” presents advanced features such as certificate abuse and security software evasion that affects machines using Apple’s OSX operating system.Dok is a piece of malware that has been typically delivered via email, is created to spy on victims by installing a new root certificate and changing the infected device’s network settings in order to redirect traffic through Tor.According to Trend Micro:\n“OSX_DOK.C first arrives via a phishing email that contains certain files labeled as either .zip or .docx files. The sample we analyzed was a purported message from a police inspector in Zurich allegedly claiming to unsuccessfully contact the recipient. The email also comes with two files attached claiming to contain questions for the user: one is a .zip file, which is a fake OSX app, while the other is a .docx file used to target Windows operating systems using WERDLOD.”This malware, which is created specifically to target Swiss banking users, uses a phishing attack to release its payload, which finally results in the hijacking of a user’s network traffic using a Man-in-the-Middle (MitM) attack.“The first (port 5555) proxy first finds the IP parameter. If it is not in Switzerland, the traffic will proceed as normal. If it detects an IP located in Switzerland, the malware will run an obfuscated JavaScript code and find its visiting domain. If the domain is in the target, the malware will perform a MitM attack and redirect the traffic to the second proxy (port 5588), which routes the traffic to the Tor network. The purpose of these steps is to target users in Switzerland and hijack their traffic”"}, {"topics": ["Hacking News", "News", "Tech"], "title": "Don’t Worry – Jayden K. Smith Is NOT Going to Hack Your Facebook", "authur": "Mandee", "date": "July 10, 2017", "body": "Facebook hoaxes are nothing new. We receive dozens of Facebook chain-mail hoaxes on a monthly basis – whether it’s a message warning us of being hacked by strangers or a message warning us of poisonous perfume circulating mailboxes across the world.It’s also easy to say that 90% of these hoaxes hold no truth to them at all. Recently, an old Facebook hoax is travelling the online community with a different name. This hoax warns Facebook users of a hacker called “Jayden K. Smith” that apparently can hack any Facebook account they’re connected to.“Please tell all the contacts in your Messenger list, not to accept Jayden K. Smith friendship request. He is a hacker and has the system connected to your Facebook account. If one of your contacts accepts it, you will also be hacked, so make sure that all your friends know it. Thanks. Forwarded as received.”Another variation of the name is “Anwar Jitou/Fitou”, although “Jayden” seems to be the more popular choice. Now, while this Facebook chain-message is just a hoax, it does hold a very important reminder: adding strangers on Facebook is dangerous.Hackers are out there, and they can gain access to your account easily if given the opportunity. Unless your Facebook account is the epitome of security, adding strangers can result in a multitude of hacking attempts – from doxing to brute force attacks.In today’s cyber generation, you are better safe than sorry. That’s not to say that making online friends is a bad thing and that you shouldn’t do it. Rather, try to be smart when extending your virtual hand for friendship.Don’t put important information on your social media accounts, use strong passwords, and update your security measures on a regular basis.Also remember – you can control how much information is public on your Facebook profile. Whether Jayden K. Smith is real or not doesn’t matter because the threat will always be there."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "Trump and Putin are going to form a Cyber Security Unit to Prevent the Elections from being Hacked", "authur": "Harikrishna Mekala", "date": "July 10, 2017", "body": "Tweeting later his first conference with Putin on Friday, Trump announced that it is the time to operate constructively with Moscow, guiding to a ceasefire deal in southwestern Syria that came into force on Sunday.“Putin & I talked forming an inscrutable Cyber Security unit so that poll hacking, & many other negative things, will be secured and safe,” he said regarding their talks at the G20 summit in Hamburg, Germany.Trump said he had proposed declarations of Russian intervention in the 2016 U.S. presidential election with Putin.“I strongly urged President Putin twice about Russian interference in our election. He vehemently denied it. I’ve already given my opinion…..”He added: “We arranged a ceasefire in parts of Syria which will save lives. Now it is time to go forward in working constructively with Russia!”Republican Senator Marco Rubio of Florida promptly criticized the move on Twitter, saying Putin was not a trusted ally.Associating with Putin on a “Cyber Security Unit” is similar to partnering with Syrian President Bashar al-Assad on a “Chemical Weapons Unit,” he wrote.Investigations by a distinctive counsel, Robert Mueller, and several U.S. congressional committees are seeing into whether Russia intervened in the election and intrigued with Trump’s campaign. Those inquiries are focused most exclusively on Moscow’s actions, lawmakers and intelligence officials say, and no proof has surfaced publicly associating other countries.Moscow has denied any meddling, and Trump says his campaign did not cooperate with Russia."}, {"topics": ["Hacking News"], "title": "WWE Database Exposed Online with the details of 3 Million Customers!", "authur": "Eslam Medhat", "date": "July 8, 2017", "body": "WWE (World Wrestling Entertainment) has published that it’s investigating a vulnerability in which an unsecure database of more than 3 million customers exposed on AWS was discovered by a security researcher (Bob Dyachenko) from Kromtech (cyber security firm).WWE said:\n“Although no credit card or password information was included, and therefore not at risk, WWE is investigating a vulnerability of a database housed on Amazon Web Services (AWS), which has now been secured. WWE utilizes leading cybersecurity firms Smartronix and Praetorian to manage data infrastructure and cybersecurity and to conduct regular security audits on AWS. We are currently working with Amazon Web Services, Smartronix and Praetorian to ensure the ongoing security of our customer information.”According to Forbes, The data included home and email addresses, birthdates, as well as customers’ children’s age ranges and genders. The database was sitting on an Amazon Web Services S3 server without any type of authentication.According to Forbes, The data included home and email addresses, birthdates, as well as customers’ children’s age ranges and genders. The database was sitting on an Amazon Web Services S3 server without any type of authentication.Bob Dyachenko said:\n“It’s likely the database was misconfigured by WWE or an IT partner as in other recent leaks on Amazon-hosted infrastructure.”The researcher also told Forbes that anyone knows the URL can access the database and download it without any authentication.Actually, this has happened before, it’s not the first time that an unprotected database was found hosted on Amazon with no authentication."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Reports Indicate up to 12 US Nuclear power plants were breached by Hackers", "authur": "Harikrishna Mekala", "date": "July 8, 2017", "body": "An important Department of Homeland Security (DHS) statement indicated a foreign power, possibly Russia, was held responsible, the New York Times said.The DHS report carried the second-highest warning rating, the Times said.Wolf Creek Nuclear Operating Corp refused to say if the plant was hacked but told there had been “no operational impact” at the plant.“The reason that is reliable is that the operational network systems are completely separate from the corporate network,” spokeswoman Jenny Hageman told Reuters.In a joint report with the FBI, a spokesman for the Department of Homeland Security told there was “no indication of a threat to public safety”.The hackers seemed to be attempting to plan out computer networks for future attacks, according to the DHS report seen by the Times.They sent highly marked emails to senior engineers at operating firms after the nuclear plants, mimicking job applications but laced with malicious code, the newspaper said.Officials told the Times that the techniques match those used by Russian specialists linked to earlier attacks on energy facilities.US investigators involved Russia-based hackers of being behind a 2015 attack that produced blackouts across Ukraine.Hacking is a tool frequently deployed by nation countries to infiltrate foreign manufacturing networks. The US and Israel reportedly used the now-infamous Stuxnet infection in an attempt to damage an Iranian nuclear facility.The worm struck the facility’s nuclear centrifuges by overriding the system and developing them to spin much faster than intended, reportedly causing severe physical damage."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Chinese researchers have discovered a way to Decrypt Satellite Phone Calls in Real Time", "authur": "Harikrishna Mekala", "date": "July 8, 2017", "body": "Published in News this week, expands on earlier research by German academics in 2012 by quickly speeding up the attack and determining that the encryption used in popular Inmarsat satellite phones can be tracked in “real time.”Satellite phones are adopted by those in desolate surroundings, including high elevations and at sea, where regular cell service isn’t available. Modern satellite telephones encrypt voice traffic to prevent eavesdropping. It’s that new GMR-2 algorithm that was the center of the research, given that it’s used in maximum satellite phones today.The researchers tried “to turn the encryption method to understand the encryption key from the output keystream directly,” rather than practicing the German researchers’ method of recovering an encryption key using an obvious-plaintext attack.Using their proposed conversion attack thousands of time on a 3.3GHz satellite stream, the researchers were ready to reduce the search space for the 64-bit encryption key, effectively making the decryption key natural to find.The end outcome was that encrypted data could be solved in a fraction of a second.“This again shows that there exist serious security flaws in the GMR-2 cipher, and it is important for service providers to upgrade the cryptographic modules of the way in order to provide confidential communication,” said the researchers.An Inmarsat spokesperson said Thursday that the group “immediately took action to discuss the potential security issue and this was fully discussed” in 2012. “We are entirely confident that the issue… has been completely fixed and that our satellite phones are secure,” the spokesperson said.Matthew Green, a cryptography professor at Johns Hopkins University, blogged about the German read-collision lowered technique in 2012. “Satellite telephone security matters,” he said at the time. “In many weak rural areas, it’s the primary means of interacting with the outside world. Satphone coverage is also essential in war zones, where signal privacy is of more than academic interest,” he added.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Cyber Security Expert Scams an International Scam Artist", "authur": "Mandee", "date": "July 8, 2017", "body": "Telephone scams are the new trend of the century for criminals with nothing better to do. It’s not unheard of to be on the other end of a telephone scam. The creativity behind some of the scams is impressive – although some of that “creativity” is more obvious than others.Cyber security expert and Oklahoma citizen, Patrick Allmond, recently had the opportunity to experience one of those super “creative” telephone scams firsthand. However, instead of falling for the scam (or simply hanging up), he decided to play the scammer at his own game.In the initial conversation, the caller claimed to be a customer support representative from Microsoft. Trying to gain remote access to Allmond’s computer, the cyber security expert chose to play along with the man’s games.Throughout Allmond’s video, he continues to play dumb; getting “lost” as the scammer tries to give him step-by-step instructions. It is clear that the man is growing frustrated towards the end, much to Allmond’s satisfaction.For nearly twenty minutes, the scammer stayed on the line while Allmond stalled with different ridiculous things. The funniest part about the entire scam attempt: the caller was offering “help” for a Microsoft bug – Allmond was using a Mac!Oklahoma Attorney General Consumer Fraud Division Deputy, Taylor Henderson, found amusement in the scam attempt but still warned of the dangers.“While the video is funny, the scam is not funny and it’s harming people. If you get an urgent phone call from someone saying, ‘Get on your computer, I think you have a problem.’ That should be your first clue. The reality is it’s happened to me.It’s happened to everyone. We all get these phone calls. It’s not based on anything other than they’ve got your phone number and they know whoever answers this phone call probably has a computer.”"}, {"topics": ["Cyber Attack", "Hacking News", "Vulnerabilities"], "title": "Medicare Card Numbers Are Being Sold on the Dark Web", "authur": "Mandee", "date": "July 5, 2017", "body": "After a recent vulnerability in government systems was exploited, black market vendors gained access to a large variety of personal Medicare details.Dubbing the illegal business “The Medicare Machine”, authorities just recently made the breach public earlier today (July 4th, 2017) after several victims came forward; admitting to purchasing their own Medicare details off the dark web in hopes of avoiding long-term consequence.“It follow revelations a Guardian Australia journalist was able to buy their own Medicare details from a darknet trader who is illegally selling the information by “exploiting a vulnerability” in a government system.”The Medicare details are being divided by customer name and sold for $3 a pop. Although the leak doesn’t contain personal health records, it does include Medicare card numbers – which is just as concerning.With just the card number, an attacker can easily create a fake card and commit identity fraud. In addition to that, the cards could also be used as identification to buy products or drugs.“This is not a new problem for the Government. In 2015, Senate estimates heard details of 369 cases of Medicare identity theft over two years, prompting the creation of a police strike force to investigate sham payments.”In response to the data breach, officials are urged to tighten the security around government servers to prevent a similar attack from happening. Although: something else will most likely still happen. We live in a world of cyber security threats and hacktivities.Officials claim they are monitoring the dark web heavily for sensitive data breaches like this one, but several online users question their security’s authenticity. If the dark web really is being heavily monitored, some speculate on why so many cyber-attacks are still being executed as a result of dark web services."}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Man Charged After Hacking into Ex-Employer’s Security Systems", "authur": "Mandee", "date": "July 5, 2017", "body": "After quitting his job at Navarro Security Group, 29-year-old Jonathan Lee Eubanks decided to skip flaming his old employers on social media and hopped straight to hacking their security systems instead.Although, Eubanks did have his crimes planned for quite some time. Before quitting, he installed software on an ex-co-worker’s system that allowed him remote access.Utilizing the software to log into Navarro Security Group’s mainframe, Eubanks proceeded to delete all of the files on one of the company servers – including client and employee databases, important files and forms related to scheduling and tracking, and various other documents.In addition, Eubanks also got petty by redirecting the company’s website URL to another competing security firm. Emails were also sent to Navarro Security Group employees and clients – accusing the company of illegal practices.“Weeks later, [Eubanks] placed a series of online orders for rifle scopes, survivalist gear, and electronics, using credit cards and names belonging to three people whose identities he had stolen.”During the beginning of his court process, Eubanks lied to the jury; claiming to know nothing about the crimes. Despite his pleas, jurors still found him guilty of all charges.“[This] does not punish the defendant for simply exercising his constitutional right to proceed to trial or even for exercising his right to testify. The Supreme Court has repeatedly held that a defendant’s right to testify does not include a right to commit perjury.”Eubanks wrote in letters after his sentencing that he’d been under heavy influence of marijuana and alcohol during the trial. He also claimed an addiction to oxycodone. Despite his post-trial remorse, Eubanks is still forced to serve the 7 years he was sentenced.In the future, ex-employees should really consider finding other means of closure after quitting/getting fired from a job – especially if your previous employer is a security firm."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Bithumb: one of the largest bitcoin and ether exchange has been hacked!", "authur": "Eslam Medhat", "date": "July 4, 2017", "body": "Bithumb, one of the biggest bitcoin and ether exchange in South Korea was lately hacked. It’s the fourth biggest bitcoin exchange platform (share 75.7% of the South Korean bitcoin market volume) in the world after U.S, China, and Japan and is the biggest exchange platform for the ether market globally.Billions of won have been lost with a number of user accounts hacked with information such as users’ phone numbers, email addresses, etc.“Hackers succeeded in grabbing the personal information of 31,800 Bithumb website users, including their names, mobile phone numbers and email addresses. The exchange claims that this number represents approximately three percent of customers.”The hack was detected by Bithumb on June 29 and has been reported to the authorities. More than 100 users have since filed a complaint with the National Police Agency’s cybercrime report center.The hackers were able to do a social engineering attack by calling the users (victims) and saying that they are from Bithumb and suspect a breach has taken place. The hackers then ask the victims for the identification number which is nothing but the one-time password provided to them by the platform.Once the hackers obtain the passwords of the victims, the hackers can simply access the user’s account and steal funds."}, {"topics": ["Hacking News"], "title": "Security researchers were able to crack 1024-bit RSA encryption", "authur": "Eslam Medhat", "date": "July 4, 2017", "body": "Security researchers have discovered a critical flaw (labeled CVE-2017-7526) in the GnuPG cryptographic library that enabled the researchers to completely crack 1024-bit RSA encryption and successfully obtain the secret RSA key to decrypt data.GnuPG is a hybrid-encryption software program because it uses a combination of conventional symmetric-key cryptography for speed, and public-key cryptography for ease of secure key exchange, typically by using the recipient’s public key to encrypt a session key which is only used once. This mode of operation is part of the OpenPGP standard and has been part of PGP from its first version.GnuPG software has been used by NSA (National Security Agency) to keep the communications secure (encrypted).Researchers said:\n“In this paper, we demonstrate a complete break of RSA-1024 as implemented in Libgcrypt. Our attack makes essential use of the fact that Libgcrypt uses the left-to-right method for computing the sliding-window expansion,”“Note that this side-channel attack requires that the attacker can run arbitrary software on the hardware where the private RSA key is used. Allowing execute access to a box with private keys should be considered as a game over condition, anyway. Thus in practice there are easier ways to access the private keys than to mount this side-channel attack. However, on boxes with virtual machines this attack may be used by one VM to steal private keys from another VM.”A patch has been released for the Libgcrypt library, Debian users can update the library here and Ubuntu can update the library here."}, {"topics": ["Hacking News", "SPY"], "title": "Wikileaks: OutlawCountry Tool Used to Target Linux Systems", "authur": "Eslam Medhat", "date": "July 3, 2017", "body": "OutlawCountry is one of the tools used by the U.S. Central Intelligence Agency (CIA) to target computers running the Linux operating system. OutlawCountry allows for the redirection of all outbound network traffic on the target computer to CIA controlled machines for ex- and infiltration purposes.The malware consists of a kernel module that generates a hidden netfilter table on a Linux target; with knowledge of the table name, an operator can create rules that take priority over existing netfilter/iptables rules and are hidden from an user or even system administrator.According to Wikileaks:\n“The installation and persistence method of the malware is not described in detail in the document; an operator will have to rely on the available CIA exploits and backdoors to inject the kernel module into a target operating system. Outlaw-Country v1.0 contains one kernel module for 64-bit CentOS/RHEL 6.x; this module will only work with default kernels. Also, Outlaw-Country v1.0 only supports adding covert DNAT rules to the PREROUTING chain.”The new malware details have been leaked and published in the form of a user manual, which describes that OutlawCountry tool consists of a kernel module for Linux 2.6.OutlawCountry is just another leak of the several CIA leaks that WikiLeaks has published out as part of its Vault 7 series of data dumps."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "NATO wants to respond to the Petya Ransomware Attack", "authur": "Harikrishna Mekala", "date": "July 3, 2017", "body": "“As major government operations have been targeted,  in fact, the operation is assigned to a state this could include as a violation of sovereignty,” wrote Tomáš Minárik, a researcher at the CCD COE law office, in the release. “Consequently, this could be an internationally wrongful act, which might provide the targeted nations several options to return with countermeasures.”The bill puts the CCD COE, a NATO-sponsored cybersecurity research center based near Estonia, in understanding with researchers opening over the details of the attack. The Petya virus was apparently aimed at central Ukrainian organizations instead of a broad array of Ransom targets, and Ukraine bore the brunt of the attack. That fact, near with the basic errors that make ransom seem like a weak reason for a campaign of this order and complexity, makes it looks like cyber criminals implied not the culprits.“The development was not too complex, but still complicated and high enough to have been equipped and executed by unaffiliated hackers for the sake of habit,” the Centre wrote in the release. “Cyber crooks are not behind this unless, as the method for getting the ransom was so poorly planned that the ransom would apparently not even cover the cost of the operation.”Take your time to comment on this article."}]