[{"title": "Notorious KillDisk Malware Turns Into Ransomware", "authur": "William Fieldhouse", "body": "A recently discovered variant of the KillDisk malware encrypts files and holds them for ransom instead of deleting them. Since KillDisk has been used in attacks aimed at industrial control systems (ICS), experts are concerned that threat actors may be bringing ransomware into the industrial domain.Previous versions of KillDisk wiped hard drives in an effort to make systems inoperable, but a new variant observed by industrial cyber security firm CyberX encrypts files using a combination of RSA and AES algorithms. Specifically, each file is encrypted with an individual AES key and these keys are encrypted using an RSA 1028 key stored in the body of the malware.CyberX VP of research David Atch told SecurityWeek that the KillDisk variant they have analyzed is a well-written piece of ransomware. The code is similar to earlier samples and its functionality is nearly the same.The ransomware is designed to encrypt various types of files, including documents, databases, source code, disk images, emails and media files. Both local partitions and network folders are targeted.Victims are instructed to pay 222 bitcoins ($210,000) to recover their files, which experts believe suggests that the attackers are targeting “organizations with deep pockets.” The contact email address provided to affected users is associated with Lelantos, a privacy-focused email provider only accessible through the Tor network. The Bitcoin address to which victims are told to send the ransom has so far not made any transactions.Atch pointed out that the same RSA public key is used for all samples, which means that a user who receives a decryptor will likely be able to decrypt files for all victims.According to CyberX, the malware requires elevated privileges and registers itself as a service. The threat terminates various processes, but it avoids critical system processes and ones associated with anti-malware applications, likely to avoid disrupting the system and triggering detection by security products. ", "date": "December 29, 2016", "topics": ["Hacking News"]}, {"title": "“Switcher” Android Trojan Hacks Routers, Hijacks Traffic", "authur": "William Fieldhouse", "body": "Researchers at Kaspersky Lab have come across a new Android Trojan that hacks routers and changes their DNS settings in an effort to redirect traffic to malicious websites.Dubbed “Switcher,” the malware has been disguised as an Android client for the Chinese search engine Baidu, and a Chinese app for sharing Wi-Fi network details. Once users install one of these apps, the malware attempts to guess the username and password of the Wi-Fi router the infected Android device is connected to.Switcher includes a list of more than two dozen username and password combinations that could allow it to access the router’s web administration interface, such as admin:admin, admin:123456, or admin:00000000.“With the help of JavaScript it tries to login using different combinations of logins and passwords. Judging by the hardcoded names of input fields and the structures of the HTML documents that the trojan tries to access, the JavaScript code used will work only on web interfaces of TP-LINK Wi-Fi routers,” Nikita Buchka, mobile security expert at Kaspersky Lab, said in a blog post.If the web administration interface can be accessed, the Trojan replaces the device’s primary and secondary DNS servers with IP addresses pointing to rogue DNS servers. These addresses are 101.200.147.153, 112.33.13.11 and 120.76.249.59 – one is the default option, while the other two are set for specific ISPs.“The code that performs these actions is a complete mess, because it was designed to work on a wide range of routers and works in asynchronous mode,” Buchka noted.With the router’s DNS settings pointing to a machine controlled by the attackers, traffic gets redirected to malicious websites instead of the legitimate site the victim is trying to access. According to Kaspersky, the cybercriminals claim to have compromised nearly 1,300 websites, mainly in China.“The Trojan targets the entire network, exposing all its users, whether individuals or businesses, to a wide range of attacks – from phishing to secondary infection,” said Buchka. “A successful attack can be hard to detect and even harder to shift: the new settings can survive a router reboot, and even if the rogue DNS is disabled, the secondary DNS server is on hand to carry on.”source: securityweek", "date": "December 28, 2016", "topics": ["Hacking News"]}, {"title": "3 Chinese Traders Charged With Hacking Law Firms", "authur": "William Fieldhouse", "body": "Three Chinese citizens accused of hacking into computers of American law firms advising on company mergers have been charged with multi-million dollar cyber fraud in New York.They made more than $4 million (S$5.8 million) in illicit profits after breaking into the servers of top corporate law firms in New York, the United States said in announcing charges and the arrest of one of the men.The three targeted at least seven major law firms, retained by companies to advise on deals, and got into the e-mail accounts of senior lawyers at two of the firms, according to the indictment on Tuesday.They profited from deals and speculation involving the drug-maker Intermune, chipmaker Intel and business services company Pitney Bowes, the US said.The case places law firms among the widening group of targets of cybercriminals seeking to profit from insider information.Beginning in April 2014, the trio hacked two US law firms and the email accounts of partners at the firms who worked on high-profile mergers and acquisitions, prosecutors said.They then used the information they gained to buy shares of at least five publicly traded companies before the details were published.When the acquisitions were announced, they sold off their stocks and made huge profits, according to the indictment.In early 2015, they managed to exfiltrate 2.8 gigabytes of confidential data which included details about tech giant Intel’s plans to acquire Altera, an integrated circuit maker.They used the details and bought more than 210,000 shares of Altera before the merger was publicized on March 27, the prosecutors said, adding they then sold that stock after Altera’s share prices went up by about 26 percent as a result of the deal.“This case of cyber meets securities fraud should serve as a wake-up call for law firms around the world: You are and will be targets of cyber hacking, because you have information valuable to would-be criminals,” US Attorney Preet Bharara said in a statement.The three men were also charged by the Securities and Exchange Commission this week with fraudulently trading on hacked data.", "date": "December 28, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Security Experts: Hackers Can Easily Crack The Code And Re-book The Flight", "authur": "William Fieldhouse", "body": "According to German media report shows that there are security breaches in the on-line system used to book airline tickets, and that leaves the door open to hackers. The “Süddeutsche Zeitung,” WDR, and NDR quote security experts as saying that tickets booked on-line are not password-protected, so it’s fairly easy for hackers to break the code and re-book flights, either for themselves or others.Once the hackers gain access to the code, they can re-book the ticket which has already been paid for on a different day, and use it themselves.Passengers who travel within the Schengen Area of 26 European states don’t have to show identification at airports, so the on-line booking fraud has gone undetected by the authorities for some time.The German Aviation Association, which includes airlines such as Lufthansa and Air Berlin, says that members’ IT systems are “regularly checked for security breaches.” For example, a disproportionately large number of inquiries that are found to come from one computer are then blocked.These reports are based on information compiled by Security Research Labs – a Berlin-based firm. SRL found the security breaches in the Amadeus Central Reservations System, which is used by a number of airlines. Amadeus says 747.3-million passengers used its system last year.", "date": "December 28, 2016", "topics": ["Hacking News"]}, {"title": "Airports In Kerala Deny That Their Websites Have Been Hacked", "authur": "William Fieldhouse", "body": "India: Officials of two airports in Kerala have dismissed reports that their websites have been hacked. According to the Thiruvananthapuram airport authorities, the website that was hacked was one developed by some regular passengers and was in no way connected to the airport.According to George G Tharakan, director of the Trivandrum International Airport said that, “There is no separate website for the airport. The website which was hacked was being run by a private agency. The official details of the airport are posted on the website of the Airports Authority of India.”A website trivandrumairport.com was hacked by anonymous hackers on Tuesday. The home page showed the message that the website was hacked by ‘Kashmiri Cheettah‘ which allegedly belongs to the group Pak Cyber Attackers. The page also displayed a danger symbol. However, it was restored by Wednesday morning.A website trivandrumairport.com was hacked by anonymous hackers on Tuesday. The home page showed the message that the website was hacked by ‘Kashmiri Cheettah‘ which allegedly belongs to the group Pak Cyber Attackers. The page also displayed a danger symbol. However, it was restored by Wednesday morning.According to communique from Cochin International Airport also denied the report. “A national TV channel this morning carried the news that Pakistani hackers has hacked our website. Please be informed that Cochin International Airport Ltd’s website is not hacked.  www.cial.aero is our official website, which is intact. The one which is hacked (with name cochiairport.com) doesn’t belong to CIAL.”", "date": "December 28, 2016", "topics": ["Hacking News"]}, {"title": "Cops To Investigate The Hackers Linked With False Bomb Alarm", "authur": "William Fieldhouse", "body": "Cops will conduct an “in-depth investigation” to see if hackers campaigning against the harsh new computer crime law had anything to do with Tuesday’s false bomb report that activated Facebook’s safety check feature. They will also investigate if anyone intended to cause panic by creating or spreading the fake news report of an explosion in Bangkok, Pol Col Kritsana Pattanacharoen, the deputy spokesman, told a press briefing on Wednesday.He also said that Section 14 of the Computer Crime Act criminalises importing false data into a computer system, and anyone found guilty would be liable to a maximum penalty of five years in prison and/or a fine of 100,000 baht.“People should not panic and should check information [on social media] for clarity every time,” Pol Col Kritsana said.Thousands of Thai internet users clicked on the Facebook safety check window “The Explosion in Bangkok, Thailand” to show they were safe. It was initially reported to have been triggered by a false news report that appeared on the website Bangkok Informer, that there had been an explosion somewhere in the city on Tuesday night.Facebook Thailand defended the triggering of the false alarm in a statement released on Wednesday afternoon. It claimed the activation was prompted by a one-man protest involving the throwing of “giant firecrackers” into the Government House compound on Tuesday morning, and that a “third-party entity” enabled its safety check feature in the capital.Source: bangkokpost.com", "date": "December 28, 2016", "topics": ["Hacking News"]}, {"title": "There is significant rise in number of attacks aimed at industrial control systems-IBM reports", "authur": "William Fieldhouse", "body": "The number of attacks aimed at industrial control systems (ICS) increased by 110 percent in 2016 compared to the previous year, according to data from IBM Managed Security Services.The company has attributed this significant increase to brute force attacks on supervisory control and data acquisition (SCADA) systems.Attackers apparently used a penetration testing framework made available on GitHub in January 2016. The tool, named smod, can be used to conduct a security assessment of the Modbus serial communications protocol and it includes brute-force capabilities.“The public release and subsequent use of this tool by various unknown factors likely led to the rise in malicious activity against ICS in the past 12 months,” explained Dave McMillen, senior threat researcher at IBM Managed Security Services.The United States was both the top source and top destination of ICS attacks observed by IBM since the beginning of the year until the end of November. Experts pointed out that this is due to the U.S. having the largest number of Internet-connected ICS systems.IBM said 60% of the attacks it had spotted came from the U.S., followed by Pakistan (20%), China (12%), the Netherlands (5%) and India (4%). Nearly 90% of ICS attacks were aimed at the United States, with China, Israel, Pakistan and Canada also on the list of targets.SAVE THE DATE: ICS Cyber Security Conference | Singapore – April 25-27, 2017IBM has described three recent ICS attacks that made headlines. One of them is the 2013 New York dam attack disclosed by the U.S. Justice Department in March. Authorities said Iranian hackers managed to compromise the system used to control the dam.Another high-profile attack was the one that targeted the Ukrainian energy sector in December 2015. The attacks, attributed to the Russian government, caused severe power outages. Similar outages occurred this year, but Ukraine has yet to confirm that they have been caused by cyber attacks.IBM also described the SFG malware attacks documented in July. Initial reports said the malware, which appeared to be the work of a state-sponsored actor, targeted at least one European energy company. However, experts later determined that the malware did not seem to have any special interest in ICS systems and was more likely developed and used by cyber criminals.", "date": "December 27, 2016", "topics": ["Hacking News"]}, {"title": "FBI Looks Into Chinese Hack Targeting Federal Insurance", "authur": "William Fieldhouse", "body": "The US’ Federal Deposit Insurance Corporation hasn’t had an easy time of things in recent years: it’s been the subject of numerous hacks in recent years, starting in 2010. And now, the FBI wants answers. Reuters sources understand that the law enforcement agency is investigating how the intruders got in, and that the FDIC believes the Chinese military sponsored the attacks. While the full details of the initial hack aren’t available, it took a while to recover. The FDIC took until “at least” 2012 to make sure that its systems were clean, according to an internal probe.The FBI isn’t commenting, and the Chinese government tells Reuters that it’s “very hard” to determine where an attack came from without evidence. You’re not about to get firm answers about those hacks, we’re afraid. However, there’s no doubt that online security is still an ongoing problem. Official disclosures show that there were 159 instances of unauthorized access in the FDIC’s fiscal 2015, 20 of which were data breaches.The corporation is fixing at least some of the underlying problems. It should be conducting vulnerability scans in a sensitive part of its network, and (like other departments) it’s preventing staff from simply walking away with sensitive info on thumb drives. There’s also a question of whether or not the threat is as large as it was in 2010 given a recent US-China agreement that theoretically limits hacking campaigns. Still, it’s entirely possible that the FBI investigation will not only reveal the nature and scope of the FDIC hack, but lead to important changes in government security.Source: engadget.com", "date": "December 27, 2016", "topics": ["Hacking News"]}, {"title": "Sony Apologises After Falsely Reports About Britney Spear’s Death", "authur": "William Fieldhouse", "body": "Sony Music Entertainment has issued an apology after a hack on its Twitter account led to the company falsely reporting the death of Britney Spears.The tweets, which have since been deleted, read “RIP @britneyspears #RIPBritney 1981-2016,” according to USA Today. Sony said the issue has now been resolved and in a statement offered an apology to the singer.“Sony Music apologizes to Britney Spears and her fans for any confusion. This has been rectified.”The hack on the account comes two years after a major attack on Sony Pictures, which initially led the Hollywood studio to cancel the release of The Interview, a comedy involving a plot to assassinate North Korean leader Kim Jong-un.Personal details and emails about some of the world’s biggest film starts were exposed during the hack.", "date": "December 27, 2016", "topics": ["Hacking News"]}, {"title": "Our Mine Posted that Britney Spears is Dead on Bobdylan’s Twitter", "authur": "William Fieldhouse", "body": "Britney Spears is an American Singer, Actress and dancer. It’s understandable if you believed rumors that Britney Spears has died, but nope: She’s alive and well. In fact, the fake news story seems to have been spread by a truly bizarre Twitter hack that involved Bob Dylan.It all started when Sony Music Global sent out a tweet saying “RIP @britneyspears,” then followed it up with another tweet saying “britney spears is dead by accident! we will tell you more soon.” According to The Hollywood Reporter noted, the hack appears to be from hacker group OurMine, which has been hacking various high-profile accounts over the last year. They also appear to have targeted Bob Dylan’s Twitter account.Now, the real question here is: Why would a group spend all that time hacking an extremely massive, powerful corporation and a Nobel Prize winner to spread weird lies about Britney Spears? Jury’s still out on that one.", "date": "December 26, 2016", "topics": ["Hacking News"]}, {"title": "Thailand Detained Nine People On Suspicion Of Hacking", "authur": "William Fieldhouse", "body": "Thai authorities have detained at least nine people on suspicion of hacking, a senior junta official said Monday, following days of disruption to government websites sparked by the passing of a controversial cyber censorship law.Earlier this month Thailand’s rubber-stamp parliament unanimously approved a new security law that will make it much easier for the junta to scrub the web of content it dislikes.The broadly-worded bill bans people from uploading anything deemed “in breach of good morality” and empowers a new committee to take down websites. Since the bill’s passing, hactivists have targeted Thai government websites.Some have been temporarily disabled by so-called denial of service attacks — a type of assault that overwhelms a website using networks of computers — while some hackers claim to have breached government databases and made off with sensitive material.Rumours had swirled for days that the military had made some arrests. But official confirmation only came on Monday.“We have arrested some hackers, there were about nine people and we will continue arresting them,” deputy prime minister Prawit Wongsuwan, the junta’s number two, told reporters.Since the generals seized power in 2014 national security offences are primarily handled by the military, with confirmation of detentions often only coming days after someone disappears.On Monday police in Bangkok paraded a 19-year-old hacking suspect who had been handed to them by the military after undergoing interrogation for an unspecified number of days.“The suspect confessed that he faked an identity and accessed the system (of) the royal police office,” Supaset Chokchai, commander of the national police’s computer crimes unit, told reporters.Rights groups and cyber activists have vowed to challenge the new law in the courts.Thailand already has a string of laws that opponents say curbs debate, including a draconian, lese majeste offence outlawing criticism of the monarchy and sweeping legislation on criminal defamation.The new cyber law is itself an update of the 2007 Computer Crimes Act which was initially drawn up to target criminals using the web for scams, but later morphed into a tool to pursue critics.Many of those charged with royal defamation in recent years have found themselves simultaneously hit with computer crime charges.", "date": "December 26, 2016", "topics": ["Hacking News"]}, {"title": "Christmas Present From Linus Torvalds is The First RC of Linux Kernel 4.10", "authur": "William Fieldhouse", "body": "If Santa didn’t come by last night, we’d like to inform you that Linus Torvalds announced the availability of the first Release Candidate (RC) build of the upcoming Linux 4.10 kernel as a Christmas present to Linux geeks around the world.If you’re watching the Linux kernel scene, you would know that there have been two weeks since the launch of the Linux 4.9 kernel, which appeared to be the biggest kernel version ever released. This means that the merge window for Linux kernel 4.10, which is not as big as Linux kernel 4.9 was, is now officially closed and it’s time for us to test drive the RC1 milestone.“It’s Christmas Day, and it’s two weeks since the merge window opened. Thus, the merge window is now closed,” said Linus Torvalds. “On the whole, this wasn’t all that big a release – nothing like 4.9. Although it wasn’t tiny either. I think 4.7 was smaller. 4.8 might have been too. It’s X-mas day, and right now I can’t be arsed to actually do the statistics I’d normally do.”According to Linus Torvalds, half of the Linux kernel, 4.10 Release Candidate 1 patch are updated drivers for various devices. The rest is just the usual noise with documentation, perf tooling updates, and architecture improvements standing out from the crowd. Of course, Linux gamers would be happy to learn that there’s better support for AMD Radeon graphics cards, too.If you have nothing else better to do on Christmas Day and want to take this first RC of Linux kernel 4.10 for a test drive on your hardware, we invite you to download the source archive right now from kernel.org or via our web portal and compile it yourself. Just please try to keep in mind that this is a very early development build that should not be deployed on production environments.source: softpedia", "date": "December 26, 2016", "topics": ["Hacking News"]}, {"title": "Switzerland Cracked DGA and Blocked 500 Domains Used by Botnet", "authur": "William Fieldhouse", "body": "Following a successful analysis of the domain generation algorithm used by the Tofsee botnet, the Swiss domain registry (SWITCH) has temporarily suspended around 520 possible .ch domain names — seriously weakening if not neutralizing the botnet.GovCERT.ch obtained a Tofsee sample. Among the hundreds of samples it analyzes every day, this one stood out because about half of the domains it queried were Switzerland’s top level domain (.ch). The other half are .biz domains. Since they all appeared to be algorithmically generated, the CERT set about analyzing the malware and its domain generation algorithm (DGA).The algorithm was described in detail in a blog post yesterday. It ultimately generates 20 domain names on each day it is run: for example, dqgdqga (a to j) .ch and .biz. However, having cracked the algorithm, GovCERT was now able to predict which domains would be malicious, and when.GovCERT contacted SWITCH, and SWITCH used its own processes to temporarily suspend the domains. In a separate post, SWITCH explained, “This week the Swiss Governmental Computer Emergency Response Team (GovCERT) informed us about the malware Tofsee using .ch as one of the TLDs in its DGA. Together with GovCERT and RoLR (Registry of Last Resort) we used our plan[n]ed process and added around 520 names to a list of .ch domain names that cannot be registered while they are actively used by the malware.”Discussing Tofsee, PandaLabs CTO Luis Corrons told SecurityWeek, “At the end of the day we are talking about a bot installed in a number of victims’ computers. It will be used to send out spam and/or malware, and the content has to be downloaded from some place. It those addresses were hardcoded into the bot, it would be easy to discover them and take them down. Using a DGA algorithm is much better for the bad guys as it generates different URLs depending on a number of variables. The creators of the bot have created the DGA, so they always know what domains the bot will try to access at a particular given moment.“For example,” he continued, “they will know that tomorrow at 10am all bots will try to connect to xxxxxx.ch; so they just need to register that domain a few minutes before 10am and put there all the malicious content they want to be distributed by the botnet. Security companies will see at 10am that the bot is connecting to xxxxxx.ch and they will add it to their black lists, and will try to get that domain shut down — but it will be too late because all of the bots have already connected and downloaded the malicious content.” And they won’t ever be coming back again.", "date": "December 25, 2016", "topics": ["Hacking News"]}, {"title": "Will Russian Hackers Dump The Hacked Data?", "authur": "William Fieldhouse", "body": "Russian hacking has torn through the American political scene. We know the Democratic National Committee was hacked. And the CIA says the Republican National Committee was compromised, too.But U.S. officials believe only some of the documents and data collected by those hackers has actually been released to the public. And experts in Russian espionage say that’s a classic KGB strategy.“Any financial fallout, any unethical behavior, if Russian security gets to know about it, they can use it either implicitly or explicitly to get things from you,” said Ilya Zaslavskiy, a senior fellow at the Legatum Institute.But not everyone agrees the Republican committee was hacked. Among them, retired U.S. Army Lt. Col. Anthony Shaffer. He’s briefed Trump’s national security adviser Michael Flynn and is considering an offer for a senior defense intelligence role in the new administration. Newsy met with Shaffer at his Washington, D.C., office near the Capitol.“Do you believe the RNC was hacked?” Newsy asked.“No, I do not,” Shaffer said.“And how can you say that definitively?” Newsy asked.“Well the RNC said they weren’t hacked,” he replied. “I’m aware of the fact the FBI tried to warn them they would be hacked. So those two things tell me that probably it was prevented.“John Brennan’s acts, according to my information, are purely partisan,” Shaffer said. “For John Brennan to have said what he had said, you’d have to have the approval of President Obama; you’d have to. So when you look at what has been said, how it’s been said, it’s without evidence.”But the concern over Russian hacking meant to benefit Trump isn’t just a partisan issue. A group of Republican senators are also calling for an investigation in Congress.“The Russians and others — the Chinese to a lesser degree — have been able to interfere with our electoral process,” Sen. John McCain told CNN.With Russia growing more aggressive with cyberspying, the question remains: What dirt do the Russians have, and who do they have it on?Russian President Vladimir Putin is an old KGB agent, and experts familiar with Soviet spy games, like Zaslaviskiy, worry about the use of an old-school tactic called kompromat to compromise hacking targets in the U.S. government.“Kompramat literally means compromising material,” Zaslavskiy said. “So anything that can persuade people to act in the interest of the asking party. In this case, it could be the FSB or Kremlin or something that enables the Kremlin to enforce the divide and rule principle. Only now, Western society is slowly waking up to this problem, but they are lagging behind maybe 10, 15 years.”Source: newsy.com", "date": "December 25, 2016", "topics": ["Hacking News"]}, {"title": "Smart Facebook Hack Reveals Email Address of Any User", "authur": "William Fieldhouse", "body": "Christmas came early for Facebook bug bounty hunter Tommy DeVoss who was paid $5,000 this week for discovering a security vulnerability that allowed him to view the private email addresses of any Facebook user.“The hack allowed me to harvest as many email addresses as I wanted from anybody on Facebook,” DeVoss said. “It didn’t matter how private you thought your email address was – I could of grabbed it.”DeVoss said on Thanksgiving Day he discovered the vulnerability and reported it to Facebook via its bug bounty program. After weeks of going back and forth verifying what the exact bug was and how it was exploited, Facebook said it would award him $5,000 for the discovery. And on Tuesday it did.The bug was tied to the user-generated Facebook Groups feature that allows any member to create an affinity group on the social network’s platform. DeVoss discovered as an administrator of a Facebook Group he could invite any Facebook member to have Admin Roles via Facebook’s system to do things such as edit post or add new members.Those invitations were handled by Facebook and sent to the invited recipient’s Facebook Messages inbox, but also to the Facebook user’s email address associated with their account. In many cases users choose to keep their email addresses private. DeVoss discovered, despite privacy settings set by Facebook members, he was able to gain access to any Facebook user’s email address whether he was Friends with them or not.DeVoss found when he cancelled pending invitations to those invited to be Facebook Group Administrators there was a glitch. “While Facebook waits for the confirmation, the user is forwarded to a Page Roles tab that includes a button to cancel the request,” he said.Next, he switched to Facebook’s mobile view of the Page Roles tab. Here DeVoss was able to view the full email addresses of anyone he wanted to cancel from becoming a Facebook Group Administrator.“I noticed that when you clicked to cancel the administrator invitation on the mobile page, you were redirected to a page with the email address in the URL,” he said. “Now all you have to do is pluck the plaintext version of the confidential email address straight from the URL.”The impact of this vulnerability could be diverse, he wrote in a blog post outlining his discovery. “Harvesting email addresses this way contradicts Facebook’s privacy policy and could lead to targeted phishing attempts or other malicious purposes.”Facebook confirmed the hack and said it has no evidence the vulnerability was ever misused. Facebook said it has implemented a fix to prevent the issue from being exploited.DeVoss, a software developer in Virginia, said this is the largest bug bounty payment he has ever earned. He told Threatpost he participates in a number of bug bounty programs including Yahoo’s and the Hack the Pentagon program.For its part, in October Facebook announced it has paid out more than $5 million to 900 researchers in the five years since it implemented its bug bounty program. The company said it paid out $611,741 to 149 researchers in the first half of 2016 alone.source: threartpost", "date": "December 25, 2016", "topics": ["Hacking News"]}, {"title": "Reserve Bank Of India Is Paying Hackers To Hack Into The Central Bank’s System", "authur": "William Fieldhouse", "body": "Saket Modi’s job is to break into the IT systems of India’s central bank. Because Saket Modi is a white hat, an ethical hacker, more and more companies, including top commercial lenders such as HDFC Bank and ICICI Bank, want him to do the same for them, too.The 26-year-old is the co-founder and CEO of Lucideus, a four-year-old startup he launched as a student of Jaipur’s LNM Institute of Information Technology. Lucideus scans the IT systems of its clients for possible hacking or malware attacks and suggests remedies and services if the systems are found to be vulnerable. Some of these scans are automated, others manual.The firm, whose other co-founders are Vidit Baxi and Rahul Tyagi, was set up in 2012 and later incubated at SINE, the Indian Institute of Technology, Bombay’s startup incubator.Today, New Delhi-based Lucideus is more relevant than ever.It has grabbed illustrious clients, such as the country’s digital payments regulator, the National Payments Council of India and food chains such as Pizza Hut and KFC. And unlike most other startups in India, it is already making profits – Rs1.3 crore in fiscal 2016. The company has access to some of the most sensitive data in the country but their services are needed now more than ever.The year 2016 was particularly notable for hacking incidents in India. First, millions of debit cards came under attack, indicating a broader risk to the banking sector in Asia’s third-largest economy. Then, a group of anonymous hackers, which calls itself Legion, took over the Twitter handles of prominent Indians.Now, with Prime Minister Narendra Modi encouraging citizens to go cashless, cyber security has become increasingly important. The industry is estimated to reach $38 billion in India by 2025, according to Nasscom, a software lobby group.Source: Scroll.in", "date": "December 25, 2016", "topics": ["Hacking News", "News"]}, {"title": "Using Android Malware Russian Hackers Tracked Ukrainian Artillery Unites", "authur": "William Fieldhouse", "body": "After FBI and CIA confirms that Russian hackers were responsible for leak during the US election which helped Donald Trump to win the US elections.Now  CrowdStrike, a cyber security firm based in Irvine, California released a report which outlined another hack which targeted the Android devices of Ukrainian separatists fighting in Eastern Ukraine in 2014, giving the Russian military essential location information about artillery units which was used to target strikes and coordinate military action.According to Dmitri Alperovitch, co-founder of CrowdStrike, the software used in the DNC hack was a variant of that used to target the Ukrainian separatists, and is most likely being used by a Russian hacking group known as Fancy Bear, aka APT 28, which is believed to work primarily for Russia’s military intelligence agency.The malware implant in Ukraine leveraged a legitimate Android application, developed by a Ukrainian artillery officer to process targeting data more quickly, CrowdStrike said, with co-founder Dmitri Alperovitch adding;“This cannot be a hands-off group or a bunch of criminals, they need to be in close communication with the Russian military”\nThe deployment “extends Russian cyber capabilities to the front lines of the battlefield” and “could have facilitated anticipatory awareness of Ukrainian artillery force troop movement, thus providing Russian forces with useful strategic planning information”, the report said.According to CrowdStrike, the Ukrainian malware implant would be the first time malicious software from Fancy Bear has been found on the Android platform, though downloads of the affected app were promoted on a Russian social media website and downloaded directly, with no evidence that the application was made available on the Google Play Store, limiting its distribution.The prospect of malware on Android being used by Russian intelligence in both front-line conflict and within the political spectrum will reinforce the ever-evolving view that modern day warfare, as well as espionage, is going to be fought on the digital front as much as the physical front. The news will also reinforce the message from companies like BlackBerry and Boeing that device security will be absolutely paramount for government and military organisations in the future.Source: Reuters.com", "date": "December 25, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "FBI To Investigate FDIC Hack Linked To China’s Military", "authur": "William Fieldhouse", "body": "Russia isn’t the only source of cyber attacks the US is facing recently. The FBI has opened an investigation into the breaches of Federal Deposit Insurance Corporation (FDIC) computer systems by Chinese hackers for several years starting in 2010. According to Reuters, it’s believed that these attacks were sponsored by China’s military, and resulted in the compromise of dozens of computers.Sources indicated that these attacks took place in 2010, 2011, and 2013, and among the systems of high-level employees that were breached include former FDIC Chairwoman Sheila Bair. It seems these Chinese attacks are only a portion of recent hacks aimed at the agency, and have resulted in a congressional committee probe into the FDIC as well.A report from the House Science Committee notes that the FDIC is showing a pattern of intentionally evading congressional oversight and a lack of transparency. Since 2015 the FDIC has faced seven cybersecurity incidents that have been identified as major.As a US agency that contributes to the regulation of commercial banks, the FDIC has access to confidential plans on how banking institutions would deal with bankruptcy, in addition to the records on millions of individual deposits in the country.Source: Reuters.com", "date": "December 25, 2016", "topics": ["Hacking News"]}, {"title": "Five Hackers Arrested For Being Involved In Hacking Of Government Websites", "authur": "William Fieldhouse", "body": "At least five hackers have been detained for allegedly being involved in the latest hacking of government and security agency websites, some of which were knocked out of service temporarily due to cyber attacks, the National Council for Peace and Order (NCPO) sources said.The crackdown is expected to lead to the round-up of about 100 people believed responsible for the attacks after changes to the new computer crime bill were approved last week by the National Legislative Assembly.An online netizen group against the single internet gateway (#opsinglegateway) announced its opposition to the new computer crime law on its Facebook page and vowed to attack state websites if the legislation was not stopped. — The Nation/Asia News Network", "date": "December 25, 2016", "topics": ["Hacking News"]}, {"title": "We Will Take Down PSN and Xbox Live on Christmas – Hackers Threaten", "authur": "William Fieldhouse", "body": "Hacking group R.I.U. Star Patrol managed to take down Tumblr earlier this week and keep it offline for almost two hours, and now it’s planning on launching another large-scale DDoS attack that’s likely to impact many more users.R.I.U. Star Patrol announced in a video interview published on YouTube that they are considering taking down PSN and Xbox Live on Christmas Day using coordinated DDoS attacks similar to those launched against Tumblr.DDoS attacks aimed at PSN and Xbox Live happen on every Christmas, and both Sony and Microsoft previously promised to enhance their protection systems and block these attacks, but latency and short outages happened almost every time. It goes without saying that the companies are once again prepared to see DDoS attacks targeting their servers, but we’ll see how they cope with that this Christmas.Neither Microsoft nor Sony responded to emails for comments by the time this article was published, but we’ll update the article if statements are provided.In case you’re wondering why these hackers are trying to take down gaming networks on such a busy day for gamers across the world, their answer is as simple as it could be.“We do it because we can. We have not been paid a single dollar for what we do,” they said. Previously, when taking down Tumblr, hackers said they did it “just for fun.”Christmas is one of the busiest days for gaming networks, especially on consoles, as PlayStation and Xbox consoles and games continue to be among the most popular gifts across the world. Gamers activate their consoles and download games on Christmas, and it goes without saying that taking networks down would impact all of these people.It remains to be seen if DDoS attacks will indeed be launched on PSN and Xbox, and if they are, to find out how Sony and Microsoft could reduce the impact on network performance.source: softpedia", "date": "December 24, 2016", "topics": ["Hacking News"]}, {"title": "Phishers Are Adopting Tactics Followed By Malware Distributions", "authur": "William Fieldhouse", "body": "A recently detected phishing campaign designed to steal credit card information employed a series of attack tactics previously associated with malware distribution, Proofpoint security researchers reveal.The technique involves the distribution of a malicious document inside a .zip archive that is password-protected. The archive is attached to an email and the password to open it is included in the email body. Most recently, the method was used to distribute the Gerber ransomware (the campaign also dropped the Ursnif banking Trojan).Recently, phishers decided to adopt the technique and adapt it to their needs in an attempt to steal banking data. However, instead of an Office document, this attack uses an HTML attachment that has been password-protected.As expected, the email message is personalised with the recipient’s name, as well as with what supposedly represents the first digits of their credit card account number. However, since these digits are standardised, this apparent personalization is only meant to create a sense of legitimacy for the carefully crafted emails without requiring actual knowledge of a potential victim’s actual card number.Furthermore, the spam emails use stolen branding and social engineering tactics to create a sense of urgency and trick the user into giving away their credit card information: recipients are told they need to update their security information for their “new chip card.”The HTML attachment used in this campaign was found to be XOR-encoded to make dynamic analysis more difficult. According to Proofpoint, the password protection is implemented with the help of JavaScript. A script named pah.js is used to decrypt the XOR-encoded HTML when the user enters the password.As soon as the user enters the password provided in the email body and the HTML attachment is decrypted, a fairly typical credit card phishing template complete with stolen branding is displayed. The same as in credential phishing attacks performed via HTTP POST, users are required to enter their credentials in the form.The use of a password-protected attachment is meant not only to make detection and analysis more difficult but also to convince users that the email is legitimate. The fact that the password is included in the email body also adds to this sense of legitimacy, in addition to making it easy for the recipients to open the attachment.source: security week", "date": "December 24, 2016", "topics": ["Hacking News"]}, {"title": "Steam Down After Hackers Phantom Squad Initiated DDoS Attack", "authur": "William Fieldhouse", "body": "Steam is used by more than 123million gamers, is suffering from a “major DDoS attack” by a group of hackers named Phanton Squad, who previously have claimed responsibility for taking down PSN and Xbox Live, claimed repsonsibility for the attack on Twitter.They said they had initiated a “major DDoS attack” on the platform – but shortly afterwards the Twitter account was deactivated.Last month Phantom Squad also claimed responsibility for an attack which caused it to go offline for several minutes.It raises fears that hacking groups could try to launch major DDoS attacks on other gaming services over the Christmas weekend.Currently steam is running as of writing this article.", "date": "December 23, 2016", "topics": ["Hacking News"]}, {"title": "Marvel and Captain America Twitter Accounts Hacked by OurMine", "authur": "William Fieldhouse", "body": "​After hacking the official Twitter account of NetFlix, OurMine managed to breach some other accounts as well, including those belonging to Marvel and the NFL.While it’s not exactly clear how the hacking group managed to break into so many accounts at a time, OurMine did no harm and only laughed at the weak security systems of the impacted companies.“Hey, It’s OurMine, don’t worry, we are just testing your security, contact us to tell you more about your security,” one such tweet posted from the NFL account read. Similar messages were tweeted from the other compromised accounts as well, and no malicious links were submitted to the several million followers that Marvel and NFL have.In addition to the main Marvel account, OurMine also hacked some other associated accounts, such as The Avengers, Captain America, Ant-Man, and Tony Stark. Full control of the accounts was obtained shortly after hackers tweeted the first messages.Although OurMine has remained completely tight-lipped on how exactly it managed to get access to so many accounts in just one day, it would be interesting to find out if the hacking group actually found the password to these accounts. It’s highly unlikely that they are using the same password, although there’s a slight chance to see Marvel setting up similar passwords for its associated accounts.OurMine has an interesting track on hacked Twitter accounts, as the group previously managed to get control of and post from accounts belonging to Wikipedia co-founder Jimmy Wales, Facebook co-founder Mark Zuckerberg, and Google chief executive Sundar Pichai.In all their hacks, OurMine only tried to highlight the weak security systems of the impacted companies or individuals, and never tweeted links to malicious content that could compromise the computers of followers. This is exactly what happened in this case as well, so they kind of reached their purpose of making the headlines with so many hacked accounts.", "date": "December 23, 2016", "topics": ["Hacking News"]}, {"title": "Hackers Breached 400,000 User Details Of Community Health Plan Of Washington", "authur": "William Fieldhouse", "body": "Hackers had access to protected health information and other information of nearly 400,000 members of Community Health Plan of Washington over a 10-month period, the organization says.The information was held by a server operated by a technology services provider, which was not identified by Community Health Plan. The breach was discovered on November 7 and the server was disabled; members of the plan and the media were notified of the breach on December 20.FINRA faulted Lincoln Financial Securities for failing to protect client data. Benjamin Howell An internal investigation, assisted by a digital forensics firm, determined that the initial access to records dated back to January 16.In a letter to members, Community Health Plan said it disabled access to the hacked server as soon as the breach was discovered. “We also notified the Washington State Health Care Authority and Washington State Office of the Insurance Commissioner, and we reported the matter to the Federal Bureau of Investigation (FBI).”A plan spokesman said its investigation determined that hackers were able to access names, address, dates of birth, Social Security numbers and some coding information related to healthcare claims.In addition to continuing to work with authorities on the breach, Community Health Plan is offering credit and identity monitoring services for 12 months at no cost to members, as well as providing them with additional information to protect identity information.‘We are also working with our technology services provider to increase the security of all CHPW member information to prevent similar incidents in the future.”Identity monitoring services being offered to members include credit monitoring, identity consultation and identity restoration. The service also will monitor internet sites at which “criminals buy, sell and trade personal information; you’ll be promptly notified if evidence of your identity information being traded or sold is discovered.”The not-for-profit health plan is the only entity in the state founded by local community health centers; the breach appears to involve the information of almost all of Community Health Plan’s members. Source: information-management.com", "date": "December 23, 2016", "topics": ["Hacking News"]}, {"title": "Lucky Hale Message To Hackers: “Kiss My Ass”", "authur": "William Fieldhouse", "body": "Pretty Little Liars star Lucy Hale was victim of another nude photo leak at the hands of hackers.  Posting on Twitter to confirm the leak, Lucy wrote: “Once again, a woman in the public eye was violated, stolen from and her private life and body were exposed for anyone to see.“I will not apologize for living my life and having a personal life that is all mine. It’s truly unfortunate that being exposed in this way is allowed.” pic.twitter.com/FKL7PXw6pc pic.twitter.com/FKL7PXw6pc— Lucy Hale (@lucyhale) December 23, 2016Thanking her fans for the “sweet and supportive” messages she’s received in response to the hack, Hale had one final note to those responsible.“And to whoever did this… kiss my ass.”Recently, Game of Thrones’ Maisie Williams was among a growing number of celebrities whose personal photos have been leaked into the public domain.Although Maisie’s reps confirmed the images in question weren’t “explicit in nature”, the photos of her and her close friends were stolen from her private social media page.Earlier this year, the man responsible for 2014’s infamous hacking scandal, which included the leaking of personal photos of stars such as Jennifer Lawrence, Kate Upton and Kaley Cuoco, was sentenced for 18 months in prison.", "date": "December 23, 2016", "topics": ["Hacking News"]}, {"title": "Tumblr Was Down Due To The Result Of DDoS Attack By Hackers", "authur": "William Fieldhouse", "body": "Tumblr appears to the target of a distributed denial of service attack (ddos attack), with users unable to access the blogging site.The outage reportedly began just before 3:30pm ET, according to Down Detector. If the site manages to load anything, users receive a “service is temporarily unavailable” message.”About a half hour later, Tumblr went back online, but users still struggled to load web pages, and it then went down a second time.And some users weren’t happy with Tumblr’s Twitter page, which deleted tweets about the hack once it had been fixed.Okay! Everything’s fixed, and Tumblr is back to its usual self. Apologies for the interruption, and thanks again for all your patience.— Tumblr (@tumblr) December 21, 2016Tumblr said on Twitter: “Some users are experiencing latency affecting the dashboard. We’ll get it fixed ASAP.”Tumblr was one of more than 80 popular websites that were hit by three separate DDoS attacks on Dyn DNS, the internet traffic management company, on October 21.As of this writing this article, Tumblr appears to finally be back online for everyone. ", "date": "December 23, 2016", "topics": ["Hacking News"]}, {"title": "Russia Used Android Malware to Track Ukrainian Troops: Report", "authur": "William Fieldhouse", "body": "The Russia-linked cyberespionage group known as Fancy Bear has tracked Ukrainian artillery forces by planting a piece of Android malware in a legitimate military application, threat intelligence firm CrowdStrike reported on Thursday.Fancy Bear is also known as APT28, Pawn Storm, Sofacy, Tsar Team, Strontium and Sednit. The group is believed to be responsible for many high-profile attacks, including recent operations aimed at the U.S. Democratic Party, government organisations in Turkey and Germany, and the World Anti-Doping Agency (WADA).CrowdStrike believes Fancy Bear is likely tied to GRU, the foreign military intelligence agency of Russia’s Armed Forces, and the company’s recent findings reinforce this theory.This summer, the company’s analysts came across an Android application package (APK) file named “Попр-Д30.apk.” The file contained Russian-language artefacts and its name referenced the D-30, a Russian-made 122 mm towed howitzer that first entered service in the 1960s.The D-30 is still used by the Ukrainian military and, in 2013, artillery officer Yaroslav Sherstuk created an Android app designed to help personnel reduce the time to fire the gun from minutes to under 15 seconds. According to its developer, the application has roughly 9,000 users.According to CrowdStrike, Fancy Bear took the legitimate Android app and bundled it with an Android variant of X-Agent, a piece of malware that has been used by the threat actor in attacks aimed at high-value targets, including the Democratic National Committee (DNC).The malicious version of the app was distributed on Ukrainian military forums from late 2014 through 2016. Experts believe the legitimate program had been mainly distributed through social media, not via the Google Play store.The Android variant of the X-Agent malware appears to be designed for strategic purposes as it does not cause any damage to the infected device and it does not interfere with the operation of the original app. X-Agent is capable of accessing contact information, SMS messages, call logs and Internet data.“CrowdStrike Intelligence assesses a tool such as this has the potential ability to map out a unit’s composition and hierarchy, determine their plans, and even triangulate their approximate location. This type of strategic analysis can enable the identification of zones in which troops are operating and help prioritise assets within those zones for future targeting,” CrowdStrike wrote in its report.“Additionally, a study provided by the International Institute of Strategic Studies determined that the weapons platform bearing the highest losses between 2013 and 2016 was the D-30 towed howitzer. It is possible that the deployment of this malware infected application may have contributed to the high-loss nature of this platform,” the report adds.The threat intelligence firm pointed out that the purpose of the malicious D-30 app further strengthens its belief that Fancy Bear is likely affiliated with Russia’s GRU agency.", "date": "December 22, 2016", "topics": ["Hacking News"]}, {"title": "India – Beware Of Password Hacking! Advise From Security Expters", "authur": "William Fieldhouse", "body": "Beware of password hacking! As the digital payment increased, the Income Tax Department has asked people to exercise caution against sharing their user ID and password with any unauthorised person as it may lead to stealing of money and other sensitive information.It has also warned against storing passwords in one’s email or in any other form on the computer. “If the email or computer account is hacked, then the perpetrator could misuse the passwords, steal money from your bank accounts, misuse your email account or credit/debit card to access sensitive information from your machine,” the centralised processing cell of the tax department said in an advisory.The department also cautioned against writing the password on notepads. Using the same password for different accounts is also not advisable, it said.The department also cautioned against writing the password on notepads. Using the same password for different accounts is also not advisable, it said.“Using the same password for more than one account is similar to carrying one key that unlocks your house, car, office and safety deposit box. One lost key could let a mischievous unauthorised user unlock all doors,” it added.“You are requested to similarly treat the Digital Signature Certificate with utmost security,” it said. The tax department asked users to secure their password with at least eight characters in length and a combination of lower and upper case, numeric and special characters.Separately, the department has identified an additional 67+ lakh potential non-filers who carried out high value transactions between 2014 – 2015, but did not file returns.", "date": "December 22, 2016", "topics": ["Hacking News"]}, {"title": "Attackers Exploited Flaws in Cisco CloudCenter Orchestrator", "authur": "William Fieldhouse", "body": "Cisco has warned customers about a critical privilege escalation vulnerability that has been exploited against Cisco CloudCenter Orchestrator (CCO) systems.Cisco CloudCenter is a hybrid cloud management platform with two primary components: CloudCenter Manager, the interface utilised by users and administrators, and CloudCenter Orchestrator, which automates application deployment and infrastructure provisioning and configuration. CCO was previously a product of CliQr Technologies, which Cisco acquired earlier this year.According to Cisco, an unauthenticated attacker can remotely install malicious Docker containers with high privileges by exploiting a flaw (CVE-2016-9223) in the Docker Engine configuration.The security hole, discovered during the resolution of support cases, exists due to a misconfiguration that makes the Docker Engine management port reachable from the outside. An attacker can exploit this weakness to load Docker containers with arbitrary privileges, including root, on the affected CCO system.A CCO installation is vulnerable if TCP port 2375 is open and bound to the 0.0.0.0 local IP address, which is the default configuration. Users can check if they are affected by using the netstat -ant | grep 2375 command.Cisco’s Product Security Incident Response Team (PSIRT) said it was aware of a limited number of cases where this vulnerability had been exploited publicly. Organisations can check if their installations have been compromised by using the docker images command and checking the list of containers for anything suspicious.“Because this vulnerability may allow access to the Cisco CCO software with root privileges, an additional indicator of compromise may be present depending on the goal of the malicious actor,” Cisco said.The vulnerability has been addressed with the release of CCO 4.6.2. As a workaround, users can restrict the Docker Engine port to the localhost IP address 127.0.0.1. Cisco has provided detailed instructions for this operation in its advisory.While a majority of the severe vulnerabilities found in Cisco products have apparently not been exploited in attacks, exploits targeting the networking giant’s software can be highly useful to threat actors. The company recently learned that the NSA-linked actor known as the Equation Group had several exploits targeting its products, including ones relying on previously unknown vulnerabilities.", "date": "December 22, 2016", "topics": ["Hacking News"]}, {"title": "Cyber Security Firm Has Found A Strong Evidence Against Russian Hack", "authur": "William Fieldhouse", "body": "Cyber security firm CrowdStrike has found a strong evidence of Russia’s military intelligence arm links with the group that was behind the Democratic National Committee (DNC) hack.DNC had hired CrowdStrike to investigate the hack and the firm linked malware used to hack and track an Android phone app used by the Ukrainian army in its battle against pro-Russia separatists in eastern Ukraine from late 2014 through 2016 with the malware used in the DNC intrusion.The firm had always suspected Russia’s military intelligence agency, GRU, to be one of the two hacker groups that struck the DNC.According to The Washington Post quoted CrowdStrike co-founder Dmitri Alperovitch as saying, “Now we have high confidence, it was a unit of the GRU.”The FBI has privately concluded the same which CrowdStrike found but has not publicly drawn the link to the GRU.CrowdStrike’s evidence pointing out GRU for the hack has revealed the how different arms of the Russian government are carrying out such types of cyber acts in the United States.The Russian government was accused of interfering in the U.S. election by the director of national intelligence and the homeland security secretary in October.The CIA and other intelligence agencies had revealed after the elections that Russia wanted President-elect Donald Trump to win the elections by influencing the 2016 elections through hacking and dumping of emails onto public websites.“The GRU is used for both tactical intelligence collection in the battlefield in support of Russian military operations and also strategic active measures or psychological warfare overseas,” said Alperovitch, who is an expert on Russia and a senior fellow at the Atlantic Council.The other group that hacked the  DNC also works for  Russian intelligence, CrowdStrike reported earlier this year. But the firm is not sure if it is the more internally focused FSB, or the foreign intelligence arm, the SVR. Both grew out of the KGB.That group, which CrowdStrike has called Cozy Bear, has not apparently been deployed in the influence operation, Alperovitch said. Rather, it is focused on traditional espionage. It is the group that is believed to have hacked unclassified networks of the State Department, White House and the Joint Chiefs of Staff.Source: aninews.in", "date": "December 22, 2016", "topics": ["Hacking News"]}, {"title": "“Angelina Jolie has committed suicide” Don’t Click On That Ad or Story Link", "authur": "William Fieldhouse", "body": "According to Cyber experts said Thursday that people shouldn’t click on online news stories and advertising banners claiming actress Angelina Jolie has committed suicide.The assertion is false, and some of those stories and ads contain ransomware.Ransomware is distributed by hackers who try to pressure victims into paying them a ransom in exchange for having their computers returned to normal operations.Analysts also said some of the false Jolie stories are linking people to tech-support centers trying to extort money from people.“A user will see an alert pop up that says their computer has been infected and that information has been stolen,” said Stephen Cobb, a senior research at the San Diego office of ESET, a digital security company.“If you hear about a salacious story, go to Google and check on it, or go to CNN to see what they’re saying.”", "date": "December 22, 2016", "topics": ["Hacking News"]}, {"title": "Groupon Accounts Hacked! Millions Of Users Are At Risk", "authur": "William Fieldhouse", "body": "Groupon users have been hacked and they have been told to check their account details to make sure they have not been victim. Hackers are buying iPads and iPhones worth hundreds using hacked Groupon accounts.The scammers used hacked Groupon users’ accounts and make expensive orders, one of which amounted to over £2,420. Customers of the online voucher service complained that high-end items such as a holiday, PlayStation 4 and iPhone 6 had been bought from their compromised accounts. One person said: “Someone hacked my Groupon account and bought a $3,000 European vacation.”Security experts said large companies such as Groupon should have advanced fraud detection systems that can spot high-value purchases being sent to addresses that aren’t the billing or home one registered to the customer.“I can confirm there has been no security breach to our website or mobile app,” a Groupon spokesperson told MailOnline.“What we are seeing however is a very small number of customers who have had their account taken over by fraudsters.”“Fraudsters have a number of ways in which they can obtain your login details to a website including phishing e-mails, trojan attacks, spyware and malware.”“By using these methods, it’s possible for fraudsters to get customer account information, log in and make purchases.”The users are advised to use strong passwords and regularly check their email for unauthorised purchases.\n", "date": "December 22, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Exploiting Mobile Apps Can Increase Business Risks", "authur": "William Fieldhouse", "body": "The increased adoption of enterprise mobility solutions by a growing number of businesses is opening up new avenues for cybercriminals to launch attacks with devastating impact on a brand’s reputation and stock prices, an industry expert said.According to Rajat Mohanty, CEO & Co-Founder, Paladion, a leading security solutions provider in the region, says that,”As businesses capitalise on new opportunities by providing mobility services, they continuously face security breaches.”“A recent study discovered that 90% of mobile banking applications for instance, have serious security problems that could potentially compromise user data. On the same lines, following a breach to one of their mobile applications, a financial institution turned to Paladion to ensure that all future applications were tested, compliant and above all secure for their customers.”According to Mohanty, the bank identified that its mobile banking application had suffered a major security breach, which put many of their customers at risk of exposing or losing their banking data. After a lot of research, the bank chose to work with Paladion because of its experience in cyber security and risk management.According to market research firm IDC, ICT spending in the MEA region has exceeded $270 billion in 2015, making it the second-fastest growing market worldwide. The adoption of smart devices in the Middle East and Africa is set to grow from 133 million in 2014 to 598 million devices in 2018. As far as the enterprise mobility and bring-your-own-device (BYOD) market is concerned, research firm MarketsandMarkets predicts that it will surpass the $284 billion mark by 2019 worldwide.“However, while these devices might be empowering businesses and organisations, the many benefits that come with increased mobility, BYOD, has become a focus for cybercriminals to launch attacks,” explained Mohanty.“The increase in mobile penetration and the massive growth of an unregulated app market in Android-based devices have enabled cybercriminals to introduce infected applications,” he added.In order to put an end to such security issues, securing remote access through mobile devices and protecting the data and applications on those devices becomes critical for organizations in the region.“Mobility initiatives should be a collaborative effort between management and the CISO to map out policies and objectives and ensure they are aligned with operational imperatives, digital strategy, and IT architecture developments. Third-party expertise can be massively beneficial in this rapidly evolving area, so organizations should not hesitate to engage their trusted security partners in determining requirements and planning deployments,” added Mohanty.Paladion’s Mobile Application Security Testing Program includes code review, mobile application penetration testing, web application penetration testing, and security configuration audit among other features. It makes sure that the client creates more durable mobile apps based on improved threat elimination approach that can identify potential risks.“Awareness sessions are also conducted and continuous communication is provided with development teams to help eradicate security issues with quick turnaround time and remediation validation. Thus, we build the trust and resilience needed to seize opportunities, reduce risks, and deploy new security models with minimal downtime,” concluded Mohanty.Source: tradearabia.com", "date": "December 21, 2016", "topics": ["Hacking News", "Tech"]}, {"title": "Hackers Breached Twitter Accounts Of Netflix, Marvel", "authur": "William Fieldhouse", "body": "The hacker group OurMine has targeted Netflix Twitter account.The group compromised the streaming service’s Twitter feed on Wednesday, sending a string of tweets saying it was testing security.Initially, it appeared Netflix had resolved the issue, but tweets from OurMine appeared to continue streaming onto their Twitter account. As of publishing, the tweets have been removed.The group also targeted several Twitter accounts tied to Marvel Entertainment, including official accounts for The Avengers, Thor and Guardians of the Galaxy.“Hey, it’s OurMine,” reads the message. “Don’t worry we are just testing your security, contact us to help you with your security.”This isn’t the first account targeted by OurMine, which often posts notes about testing security and promoting its services. Among its other targets: Facebook CEO Mark Zuckerberg, Uber CEO Travis Kalanick, and Spotify CEO Daniel Ek.Source: khou.com", "date": "December 21, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Google Website Hijacked by Pakistan Hackers", "authur": "William Fieldhouse", "body": "The Bangladesh domain belonging to Google is the latest to become the victim of hackers, as a group of attackers apparently coming from Pakistan managed to deface the search engine page and post their own message on the site.Hackers who are part of a group called Team Pak Cyber Attackers hijacked the Google Bangladesh search engine domain and posted a message that taunts the security systems put in place by Google.As HackRead notes, the breach was mostly possible with DNS hijacking, which was the same method that other hackers turned to in the past to disrupt other Google websites, including the Vietnamese homepage.In this latest hack, the attackers posted a message on the Google Bangladesh page that included the Pakistan Zindabad slogan, which translates to Long Live Pakistan.“Struck by Faisal 1337. Google Bangladesh Stamped by Team Pak Cyber Attackers. Security is an illusion. Pakistan Zindabad,” the full message posted on the Google website read.Google has obviously moved very fast to restore access to its website, so everything’s back to normal now. It’s not clear, however, how long the defaced website remained available for visitors.This isn’t the first time when Bangladesh hackers are targeting high-profile websites and similar cases happened last year as well when websites belonging to Google and Microsoft were compromised through DNS hijacking. Google and MSN domains based in the Pitcairn Islands were defaced by a different group of hackers who posted a message similar to the one published today.“Google Pitcairn Island hacked by Tiger [email protected] & Surg4bij4k. Bangladesh to Indonesia, we own it all,” hackers who defaced the Pitcairn Islands domains said on the compromised pages.At this point, it’s not known if the Pakistani hackers targeting Google’s Bangladesh domain had any other purpose than to highlight the weak security of the website, but given the fact that it all happened through DNS hijacking, no information was put at risk.source: softpedia", "date": "December 21, 2016", "topics": ["Hacking News"]}, {"title": "Rakos Malware Takes Full Control Over Embedded Linux Devices", "authur": "William Fieldhouse", "body": "A recently observed piece of malware targeting embedded Linux systems can provide attackers with full control over the infected devices, ESET security researchers warn.Dubbed Rakos, the newly discovered malware is attacking vulnerable devices via brute force SSH login attempts, a method already observed in various other Linux threats. The new malicious program is looking to infect both embedded devices and servers that have an open SSH port by preying on their weak credentials, with the purpose of building a large botnet.The attack method is similar to that observed with Mirai, the Internet of Things botnet that became famous recently after infecting devices in 164 countries: the Trojan searches for poorly-secured devices, infects them, then uses them to spread further. According to ESET, the new threat starts the scan from a small list of IPs, but then incrementally expands the search to more targets.Rakos is written in the Go language and has a binary compressed with the standard UPX tool.The Trojan was observed loading its configuration via standard input (stdin) in YAML format. This configuration file includes various information, including a list of command and control (C&C) servers, the credentials that are used to brute-force devices, and internal parameters.Next, the malware starts a local HTTP server, which allows future versions to kill running instances regardless of their name, and which also attempts to parse a URL query for various parameters. Additionally, the malware creates a web server listening on all interfaces, which is listening to a randomly chosen TCP port (ranging from 20,000 to 60,000).When a remote request is sent to the device via this port, a response containing the IP address is received, researchers say. The malware also sends an initial HTTP request containing important information about the victim device to the C&C server.Interestingly, the researchers noticed that a previous version of the Trojan also scanned for the SMTP service, but that the feature was disabled in the current build, most likely because it is still under development.While analyzing the backdoor’s capabilities, the security researchers discovered that it is also capable of updating the configuration file from a specific C&C location, as well as upgrading itself. Moreover, because it sends information such as the device’s IP address, username, and password, it basically provides the attacker with complete control over the infected device.The botnet wasn’t observed being yet capable of distributed denial of service (DDoS) attacks or spam spreading, but researchers believe that it might receive such functionality, considering the level of control over the infected device it provides the attackers with. source: securityweek", "date": "December 21, 2016", "topics": ["Hacking News"]}, {"title": "This New Malware Drains All The Cash From ATMs", "authur": "William Fieldhouse", "body": "A newly discovered family of malware targeting ATMs (automated teller machines) has been designed with the sole purpose of emptying cash from the safes of the self-serve machines, Trend Micro security researchers warn.Dubbed Alice, the malware is the most stripped down ATM threat seen to date. The malware has no information stealing capabilities and can’t even be controlled via the ATM’s numeric keypad. Initially discovered in November 2016, Alice is believed to have been around since 2014, and Trend Micro says that it is only the eighth ATM malware family seen to date, although such threats have been around for over nine years.Use of the malware requires physical access to an ATM, and Trend Micro suggests that it has been designed for money mules to steal all the money available in an attacked cash machine, something that malware such as GreenDispenser was seen doing last year.Unlike that piece of malware, however, the new threat doesn’t connect to the ATM’s PIN pad and can also be used via Remote Desktop Protocol (RDP), although Trend Micro says that there’s no evidence of such use as of now.Malware analysis revealed that Alice (the name was included in the version information of the binary) was packed with a commercial, off-the-shelf packer/obfuscator called VMProtect, which prevents execution inside debuggers. Further, the malware checks its environment before execution and terminates itself if it determines it isn’t running on an ATM (it checks for a couple of registry keys and also requires specific DLLs to be installed on the system).When running on a machine, Alice writes two files in the root directory, namely an empty 5 MB+ sized file called xfs_supp.sys and an error logfile called TRCERR.LOG. Next, it connects to the CurrencyDispenser1 peripheral, which is the dispenser device in the XFS environment and, if a correct PIN is provided, it displays information on the various cassettes with money loaded inside the machine.Because the malware only connects to the CurrencyDispenser1 peripheral and doesn’t attempt to use the machine’s PIN pad, the researchers believe that the attackers physically open the ATM and infect it via USB or CD-ROM. Moreover, they suggest that the actors connect a keyboard to the machine’s mainboard and operate the malware through it.The security researchers discovered that Alice supports three commands, each issued via specific PINs: one to drop a file for uninstallation, another to exit the program and run the uninstallation/cleanup routine, and a third to open the “operator panel.” This panel is where information on the cash available inside the ATM is displayed.source: securityweek", "date": "December 21, 2016", "topics": ["Hacking News"]}, {"title": "Google Released an Open Source Pentesting Tool Called Project Wycheproof", "authur": "William Fieldhouse", "body": "Google this week announced the availability of Project Wycheproof, an open source tool designed for finding known vulnerabilities in popular cryptographic software libraries.Developed in Java due to its common cryptographic interface, Project Wycheproof includes tests for the most popular crypto algorithms, including AES-EAX, AES-GCM, DH, DHIES, DSA, ECDH, ECDSA, ECIES and RSA. The more than 80 test cases developed by Google experts have led to the discovery of over 40 bugs in RSA, DSA, ECDH and DH.Google has pointed out that Project Wycheproof is not complete as crypto experts regularly discover new weaknesses in protocols. However, the search giant believes the tool can be useful for developers and users considering that the secure implementation of cryptographic algorithms is not an easy task.“The main motivation for the project is to have an achievable goal. That’s why we’ve named it after the Mount Wycheproof, the smallest mountain in the world. The smaller the mountain the easier it is to climb it!” Daniel Bleichenbacher and Thai Duong, Google security engineers and Project Wycheproof maintainers, said in a blog post.While the tool is developed and maintained by members of the Google Security Team, Project Wycheproof is not an official Google product. Contributions are welcome, but those who want to take part in the project have been advised to report the vulnerabilities they find directly to the maintainers of the affected libraries and submit the tests only after the bug has been fixed or acknowledged.Some of the flaws discovered by Google have yet to be made public as they are still being patched by vendors.Google also pointed out that some open-source products are covered by its bug bounty program and vulnerabilities found with Project Wycheproof tests could qualify for a reward.Project Wycheproof is not the only security tool released this year by Google. The company also made available the OSS-Fuzz open source fuzzing service, a Vendor Security Assessment Questionnaire framework, the binary comparison tool BinDiff, and the XSS prevention toolsCSP Evaluator and CSP Mitigator.", "date": "December 21, 2016", "topics": ["Hacking News"]}, {"title": "Pakistani Hackers Hacked Bangladesh Google Domain", "authur": "William Fieldhouse", "body": "Earlier today, Pakistani hackers from Pak Cyber Attackers have targeted Google Bangladesh domain and shown the deface page on www.google.co.bd domain .A hacker called Faisal Leet have hacked into the domain registry of Bangladesh Telecommunications Company Ltd (BTCL), from where Google country domain was also registered. Hackers have modified the DNS records of Google Bangladesh and redirects all users to deface page. This technique is also know as DNS poisoning.HackRead reports that the hacking group behind this takeover is generally known for breaching high profile Indian government and law enforcement websites. This is the first time the group has targeted a Bangladesh domain.The Internet users in Bangladesh were shocked when they witnessed their search engine giant’s domain displaying “Pakistan Zindabad” (Long live Pakistan) slogan. Confused with the situation, users took it to Twitter to get the clear picture of what’s going on.OMG! https://t.co/E8gmKTnYuQ (#Google #Bangladesh) has been hacked. :O #Googlehacked pic.twitter.com/wcjvYcabhX— Hasibul Kabir (@hkhasib) December 20, 2016On this issue Google had quickly redirects its users to its main international .com domain i.e. www.google.com.This is not the first time that hackers have targeted Google domain. Earlier also Pakistani hacker called LEET have hacked numbers of Google countries domain. Not only Google, he had also targeted other high profiled sites including Microsoft, Yahoo, Bing, AOL, and many Indian NIC servers.", "date": "December 21, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Thailand Government Websites Down After Controversy Over Cyber Law", "authur": "William Fieldhouse", "body": "Government websites were down yesterday in Thailand after hackers launched a campaign of attacks following controversial changes to the Computer Crime Law. The sites hit included Government House, Office of the PM, and the Royal Gazette website. It was not confirmed if the failure of these sites, which were offline yesterday, was the result of attacks or a defensive measure by the government.Earlier, Major-General Ritthi Intarawut, director of the Army’s cyber centre, warned state agencies to prepare for cyber attacks by hackers angry over changes to the Computer Crime Act, advising them to step up security or even shut down systems temporarily.Government agencies, previously targeted by hackers upset by changes to the law, were also advised to keep a close watch on system gateways, and place tight restrictions on firewalls in preparation for possible attacks.The warning came after a group of Internet users known as “Opponents of the Single Gateway” threatened to attack government websites and wipe out all data today if the government did not respond to its demand for the amendment to be scrapped.The law sparked major controversy, with nearly 400,000 Internet users signing an online petition at Change.org calling for the National Legislative Assembly (NLA) to withhold approval of the changes over fears they would hit online freedom and privacy.After the NLA passed amend ments last Friday, netizens staged protests online and offline. — The Nation/Asian News NetworkSource: thestar.com", "date": "December 21, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Hackers Make $5M A Day ” Biggest Ad Fraud Ever”", "authur": "William Fieldhouse", "body": "A group of Russian criminals are making between $4 million and $5 million every day in a brazen attack on the advertising market. Amid headlines of “fake news” and censorship, Forbes exposes Methbot – the “biggest digital ad fraud ever” uncovered and perpetrated by faking clicks on video ads.According to a security firm WhiteOps  who discovered the fraud says that,“Controlled by a single group based in Russia and operating out of data centers in the US and Netherlands, this “bot farm” generates $3 to $5 million in fraudulent revenue per day by targeting the premium video advertising ecosystem.”As Forbes’ Thomas Fox-Brewster explains, the crew, which White Ops dubbed Ad Fraud Komanda or “AFK13”, planned their machinations in meticulous detail.First, they created more than 6,000 domains and 250,267 distinct URLs within those that appeared to belong to real big-name publishers, from ESPN to Vogue. But all that could be hosted on the page was a video ad.With faked domain registrations, they were able to trick algorithms that decided where the most profitable ads would go into buying their fraudulent web space. Those algorithms typically make bids for ad space most suitable for the advertisement’s intended audience, with the auction complete in milliseconds. But AFK13 were able to game the system so their space was purchased over big-name brands.AFK13 then invested heavily in a bot farm, taking up space in data centers so they could fire faked traffic from more than 570,000 bots at those ads, thereby driving revenue thanks to the pay per click system they exploited.As part of what White Ops called the Methbot campaign, those bots “watched” as many as 300 million video ads a day, with an average payout of $13.04 per thousand faked views. And the fraudsters had their bot army replicate the actions of real people, with faked clicks, mouse movements and social network login information.It’s unclear where the Russian link comes from. Eddie Schwartz, chief operating officer at White Ops, told me the company found links between the data centers and the “unique signals” used by the hackers. He couldn’t provide more details for fear of revealing too much about White Ops’ methods. Nevertheless, he claimed to have “direct attribution” for those behind the crime.“We have zero doubt this is a group based in Russia, it’s a single group. We’ve actually been working with federal law enforcement for weeks now,” Schwartz added.Finally Fox-Brewster concludes worryingly, the fraud could be even bigger than reported today.“Because White Ops is only able to analyze data directly observed by White Ops, the total ongoing monetary losses within the greater advertising ecosystem may be exponentially greater,” the company wrote in its white paper.“At this point the Methbot operation has become so embedded in the layers of the advertising ecosystem, the only way to shut it down is to make the details public to help affected parties take action.”", "date": "December 20, 2016", "topics": ["Hacking News"]}, {"title": "Mirai Malware Switches to Tor Domains and Becomes Invencible", "authur": "William Fieldhouse", "body": "Mirai malware which attacks the Internet of things devices to perform Distributed Denial of Service attacks is now improving itself by switching to .Onion domains, after it made a few tweaks to its Domain Generation Algorithm(DGA).According to the security researchers, Mirai started using the DGA  recently for a very short period of time. This feature was added to Mirai Botnet #14 which has infected morethan 3 million devices by the end of November.In late November, a Mirai variant managed to hijack 900,000 routers from German ISP Deutsche Telekom using port 7547. Soon after, the same malware attack was confirmed to have also hit around 100,000 UK TalkTalk and Post Office ISP users. The attacks were revealed to leverage the TR-064 vulnerability, which can be used to steal WiFi network keys in addition to recruiting the router into a botnet.Researchers with the China-based Network Security Research Lab at Qihoo 360, who managed to crack the Mirai DGA, said last week that multiple Mirai samples were using the functionality and that they were leveraging three different top-level domains (TLDs) for that.In a new post, the security researchers reveal that newly observed Mirai samples dropped the initial seed series and adopted a new one. Thus, new domains that matched the Mirai DGA algorithm but no longer featured the previous seed series were detected.The new domains were said to belong to new Mirai variants because layer 2 (L2) domain had the same 12-character length, a-y only, and because all TLDs for these domains were fixed to .online, one of the TLDs observed in the previous samples. What’s more, the botnet operators exercised a strict time control over the creation of the domain, to ensure that the overlapping window was very short.The researchers managed to brute-force the new DGA as well, and they even provided a list of the domains the Mirai samples will supposedly use before the end of the year. However, they also noted that at least one of the already generated domains wasn’t registered.According to a report from BleepingComputer, however, there’s a clear explanation of why that happened: Mirai is moving to Tor (The Onion Router) domains because they are far more difficult to shut down. The information reportedly comes from the individual who manages Mirai Botnet #14, and who goes by the online handle of BestBuy. ", "date": "December 19, 2016", "topics": ["Hacking News"]}, {"title": "Macbooks Found to Leak Disk Encryption Passwords", "authur": "William Fieldhouse", "body": "Apple recently addressed a vulnerability in its MacOS operating system that can be exploited by an attacker to obtain a MacBook’s FileVault password using a $300 device.The issue was discovered by Sweden-based researcher Ulf Frisk at the end of July. Apple was notified about the flaw in mid-August and patched it earlier this month with the release of MacOS 10.12.2.FileVault 2 is a full-disk encryption program that uses XTS-AES-128 encryption with a 256-bit key to preventing unauthorised access to the information on the startup disk. Frisk has demonstrated that an attacker with physical access to a locked or sleeping MacBook can retrieve the FileVault 2 password in clear text by connecting a special device to the targeted system’s Thunderbolt port.According to the expert, these attacks are possible due to two vulnerabilities. One of them is related to the fact that while direct memory access (DMA) attack protections are enabled by default once MacOS has started, these protections are not active before the operating system has booted. This allows an attacker to read and write memory from a MacBook by connecting a Thunderbolt device.Since the FileVault 2 password is stored in cleartext in memory at predictable locations, software running on the Thunderbolt device can retrieve the password from memory before it is overwritten. The attacker must gain access to a locked or sleeping MacBook, connect the Thunderbolt device and reboot the computer. The attack does not work if the targeted MacBook has been shut down as the password is no longer available in memory. The device that can be used to carry out such an attack has been dubbed PCILeech, and its source code and hardware requirements have been made available by Frisk. The expert said he tested the attack on multiple MacBook and MacBook Air computers with Thunderbolt 2 ports. The attack has not been verified on devices with USB-C.source: securityweek", "date": "December 19, 2016", "topics": ["Hacking News"]}, {"title": "Yahoo’s Failure Move Towards Security Fix Leads To Massive Risk", "authur": "William Fieldhouse", "body": "In the summer of 2013, Yahoo launched a project to better secure the passwords of its customers, abandoning the use of a discredited technology for encrypting data known as MD5. It was too late. In August of that year, hackers got hold of more than a billion Yahoo accounts, stealing the poorly encrypted passwords and other information in the biggest data breach on record. Yahoo only recently uncovered the hack and disclosed it last week.The timing of the attack might seem like bad luck, but the weakness of MD5 had been known by hackers and security experts for more than a decade. MD5 can be cracked more easily than other so-called “hashing” algorithms, which are mathematical functions that convert data into seemingly random character strings.In 2008, five years before Yahoo took action, Carnegie Mellon University’s Software Engineering Institute issued a public warning to security professionals through a US government-funded vulnerability alert system: MD5 “should be considered cryptographically broken and unsuitable for further use.”Yahoo’s failure to move away from MD5 in a timely fashion was an example of problems in Yahoo’s security operations as it grappled with business challenges, according to five former employees and some outside security experts. Stronger hashing technology would have made it more difficult for the hackers to get into customer accounts after breaching Yahoo’s network, making the attack far less damaging, they said.“MD5 was considered dead long before 2013,” said David Kennedy, chief executive of cyber firm TrustedSec LLC. “Most companies were using more secure hashing algorithms by then.” He did not name specific firms.Yahoo, which has confirmed it was still using MD5 at the time of the attack, disputed the notion that the company had skimped on security.“Over the course of our more than 20-year history, Yahoo has focused on and invested in security programs and talent to protect our users,” Yahoo said in a statement to Reuters. “We have invested more than $US250 million ($A342 million) in security initiatives across the company since 2012.”The former Yahoo security staffers, however, told Reuters the security team was at times turned down when it requested new tools and features such as strengthened cryptography protections, on the grounds that the requests would cost too much money, were too complicated, or were simply too low a priority. Partly, that reflected the internet pioneer’s long-running financial struggles: Yahoo’s revenues and profits have fallen steadily since their 2008 peak while Alphabet Inc’s Google , Facebook and others have come to dominate the consumer internet business.“When business is good, it’s easy to do things like security,” said Jeremiah Grossman, who worked on Yahoo’s security team from 1999 to 2001. “When business is bad, you expect to see security get cut.”", "date": "December 19, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "India – More than 80,000 Cyber Attacks Between Dec 9 -12", "authur": "William Fieldhouse", "body": "Between December 9 and 12 at least 80,000 cyber attacks targeted Indian networks, showing why the government’s attempt to switch over to a digital economy may be fraught with risk. India’s information security architecture has not fully awakened to challenges of malicious warfare that could take down the financial systems.According to top intelligence sources say that till November 28, they had observed an average 2 lakh threats and vulnerabilities per day. This increased to 5 lakh after the note ban and it further went up to 6 lakh threats by the first week of December. Although a majority of threats were neutralised before they could inflict any substantial damage, Legion, the group that compromised Twitter account of Rahul Gandhi and Vijay Mallya, claimed the banking networks were flawed and vulnerable to hacking.Legion’s threat to bring the Indian banking system to its knees has worried the government, which recently ordered a 360 degree security audit of information infrastructure including financial networks.“Between November 22 and 26, we observed 3,35,000 attacks on Indian networks by cyber hackers from China, Pakistan, Singapore, US, Russia, Romania, Ukraine, Dubai and Sweden. In August we had held a meeting with nodal officers and acknowledged the fact that a lot needs to be done,” official sources said.Sources in the intelligence establishment said that apart from Legion, lesser-known groups like Suckfly, Lazarus, Odinaff and Danti were also launching cyber attacks on Indian targets after demonetisation forced people to switch to digital transactions.“Between November 22 and 26 we observed 3,35,000 attacks on Indian networks by hackers from China, Pakistan, Singapore, US, Russia, Romania, Ukraine, Dubai and Sweden,” a source said.The most lethal threat for the government is, however, from Legion, which claims to have accessed over 40,000 servers in India, clearly indicating that it can take down a vast number of websites and financial service.“Cyber threats are becoming more organised and targeted resulting in high-value data breaches, which attract media attention. Individual organisations need to identify the weaknesses in encryption operations to protect their data from adversaries,” the source said.In October 32 lakh debit cards issued by SBI, HDFC Bank, ICICI Bank, Axis Bank and Yes Bank were compromised in the largest-yet cyber attack on the Indian banking system.An intelligence note reviewed by Express warns against the vulnerability of mobile phones.“These are equally vulnerable to malware attacks and data leakages as ordinary computers. Android- and IOS platform-based smartphones are known to have multiple vulnerabilities which are being widely exploited by the attackers and adversaries,” said the note.According to the cyber security firm Kaspersky Lab, India is ranked seventh among the top 10 countries attacked by mobile malware. It said mobile banking Trojans like ZeuS are the most common malware used by the hackers to steal money from user accounts.Source: newindianexpress.com", "date": "December 19, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "More Than 8,800 WordPress Plugins Have Flaws", "authur": "William Fieldhouse", "body": "Web application security firm RIPS Technologies researchers have recently analysed 44,70 WordPress Plugins out of the 48,000 Plugins present in the official WordPress plugins directory. They found that 8,800 of these Plugins have at least one vulnerability in them.First, the researchers downloaded all the plugins and then used a static code analyser to find the ones that have at least one PHP file. An analysis of the size of these plugins showed that roughly 14,000 of them have only 2-5 files and only 10,500 of them have more than 500 lines of code.Researchers determined that of the plugins with more than 500 lines of code, which have been classified as “larger plugins,” 4,559, or 43 percent of the total, contain at least one medium severity issue (e.g. cross-site scripting).RIPS’s analysis showed that nearly 36,000 of the plugins did not have any vulnerabilities and 1,426 had only low severity flaws. Medium severity bugs have been identified in more than 4,600 plugins, while high and critical security holes have been found in 2,799 and 41 plugins, respectively.A total of 67,486 vulnerabilities has been discovered in the plugins, which indicates that the applications that do have flaws have a lot of them. Experts noted that a majority of plugins don’t have weaknesses due to their small size (i.e. have fewer lines of code).As for the types of vulnerabilities affecting these plugins, unsurprisingly, more than 68% are cross-site scripting (XSS) issues and just over 20% are SQL injections. XSS flaws can pose a serious risk in the case of WordPress websites, but exploiting them requires administrator interaction. SQL injections, on the other hand, can be exploited without user interaction and attacks can be automated.Between January and December 2016, a honeypot operated by RIPS captured more than 200 attacks targeting WordPress plugins, including 69 against Revolution Slider, 46 against Beauty & Clean Theme, 41 against MiwoFTP and 33 against Simple Backup. These attacks involved easy-to-exploit vulnerabilities that were known and well documented.RIPS pointed out that they may not have found all the vulnerabilities affecting the plugins they analysed, and it’s uncertain if the flaws they identified are exploitable.", "date": "December 18, 2016", "topics": ["Hacking News"]}, {"title": "Users in Singapore, India and Malaysia are About to Face TrickBot Trojan", "authur": "William Fieldhouse", "body": "The trojan from Dyre named Trickbot emerged back in October 2016. This Trickbot is also quoted as the next big threat in the industry and it is now targeting the users in Singapore, India and Malaysia according to the warning given by the IBM X-Force security researchers.After analysing the code in the malware, researchers came to a conclusion that this was made by the same team which developed and distributed the Dyre Trojan. It was targeting the users of Australia, the U.K., New Zealand and Germany. Since it was first discovered, this malware is found to be capable of launching redirection attacks.In the countries which the malware is already operating, the activity is increased. Also the operations of the malware are expanded to Asian countries also. This malware won’t be the last one to reach Singapore, Dyre, Dridex, Neverquest and Tinba malware will follow the TrickBot and attack the users.The main reason for which Singapore attracts cybercriminals is because organisations there also communicate in English, even if this is primarily a Chinese-speaking country. Thus, the cybercriminals don’t need to invest too much when it comes to adapting their spam and tools to the new location.TrickBot was designed to focus on business accounts, corporate and commercial banking, and wealth management across all targeted banks. The malware was also configured to target commercial banks in India and Malaysia, and IBM security researchers suggest that the cybercriminals are looking to create cash-out options in those countries.The malware’s authors are focused on creating new redirection attacks, and the security researchers noticed that the most recent configuration has a ratio of redirection attack adapted to 58% of the targeted URLs. Previously, the malware featured redirections for only 35% of the target URLs.Unlike TrickBot, other Trojans are reducing their redirection attacks or completely removing them, IBM says. Dridex was previously observed doing this, the same as GozNym, which has reduced its redirection attack ratio to 12% or lower in some geographies.In these attacks, the cybercriminals are creating convincing replicas of the banks’ websites, and trick users into giving up their login credentials and even two-factor authentication data. Some even use the bank’s URL and secure sockets layer (SSL) certificate, which makes them appear even more convincing. ", "date": "December 18, 2016", "topics": ["Hacking News"]}, {"title": "FBI Agrees With CIA That Russia Hacked USA Election To Win Trump", "authur": "William Fieldhouse", "body": "Recently CIA released a report saying that it concluded Russia helped cyber attacks in an effort to disrupt the US’s presidential election and to win Donald Trump.Citing an internal CIA memo, the Washington Post reports that FBI director James Comey has endorsed the CIA’s assessment, along with Director of National Intelligence James Clapper, meaning the US’s three main intelligence agencies are now in agreement. The memo, from CIA Director John Brennan, read as follows:Earlier this week, I met separately with (Director) FBI James Comey and DNI Jim Clapper, and there is strong consensus among us on the scope, nature, and intent of Russian interference in our presidential election.The three of us also agree that our organizations, along with others, need to focus on completing the thorough review of this issue that has been directed by President Obama and which is being led by the DNI.The CIA’s investigation found that Russian government hackers had a clear goal of helping Trump win the election. These cyber attacks weren’t attempts to tamper with election results, but rather the hackers stole data from both the Republican National Committee and Democratic National Committee, but only the latter’s was made public.The full details of the CIA’s report are of course classified, but when it first made news, some Republican lawmakers tried to argue that the FBI wouldn’t necessarily agree with the assessment. Trump, meanwhile, continues to spout that his election had nothing to do with Russian involvement.Source: Washington ", "date": "December 18, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Los Angeles County Email Accounts Compromised", "authur": "William Fieldhouse", "body": "In 2016 May, an phishing attack, targeting Los Angeles county employees. The Los Angeles County District Attorney’s Cyber Investigation Response Team (CIRT) launched a investigation into the email phishing attack.The District Attorney’s office announced on Friday that of the 1,000 county email users that received the phishing message, 108 were actually affected.According to the Los Angeles Daily News says that,”confidential client/patient information” were hacked through the phishing email. Forensic investigation revealed up to potentially 756,000.Austin Kelvin Onaghinor, 37, is charged with nine counts in connection with the intrusion. Those charges include unauthorized computer access and identity theft in a felony complaint. If convicted he could face a sentence of up to 13 years in state prison.According to District Attorney Jackie Lacey said that,”My office has devoted significant resources to developing cutting edge expertise and relationships that allow us to hold transnational cybercriminals accountable.”“My office will work aggressively to bring this criminal hacker and others to Los Angeles County where they will be prosecuted to the fullest extent of the law,” he added.Still there is no evidence but they are indicating that confidential information was released, on Thursday officials began notifying those whose personal information may have been compromised. Deputy District Attorney Donn Hoffman remarked on the “time-consuming process” of investigating these types of cases. ", "date": "December 18, 2016", "topics": ["Hacking News"]}, {"title": "Researcher Found Zero-Day in Linux That Impacts Ubuntu and Fedora", "authur": "William Fieldhouse", "body": "Researcher Reveals 0-Day Linux Exploit Leveraging SNESSecurity researcher Chris Evans this week made public a full 0-day drive-by download exploit impacting Ubuntu and Fedora and possibly other current Linux distributions as well.The full 0-day drive-by exploit was tested to work on Fedora 25 + Google Chrome and Ubuntu 16.04 LTS and relies on breaking out of Super Nintendo Entertainment System (SNES) emulation via subtle cascading side effects from an emulation error.The issue, Evans says, lies within the Sony SPC700 emulated processor and abuses cascading subtle side effects of an emulation misstep. This is possible because the Linux GStreamer media playback framework offers support for the playback of SNES music files by emulating the SNES CPU and audio processor.The library that makes all this possible is Game_Music_Emu, which works in C and C++ and is very easy to use.The core emulation logic of the faulty Sony SPC700 processor contains at least two vulnerabilities: a missing X register value clamp for the MOV (X)+,An instruction; and a missing SP register value clamp for the RET1 instruction. By cascading the first vulnerability, the Evans managed to achieve reliable exploitation, with all of the technical details published on his blog.For the exploit to work and the drive-by to be successful, the user has to visit a malicious webpage, where audio files encoded in the SPC music format but saved with the .flac and .mp3 extensions are located.The files can be used to load and run the attacker’s code with the same privileges as those of the current user. Depending on the privileges the user has, the exploit could result in the theft of personal data, including photos, videos, or documents, as well as data stored in the browser.To offer a glimpse of the exploit, the security researcher also published two videos, showing the vulnerability being leveraged in both Fedora 25 and Ubuntu 16.04 LTS. Evans also made available the files needed to test the exploit and decided to offer a glimpse at different exploitation contexts in the second clip, although the same exploit file is used for all of them.“The strong reliability of this exploit makes it work inside Fedora’s tracker-extract process, which has highly variable heap state,” the researcher says.The impact on Linux distributions is mixed, with Ubuntu being impacted the most, as the faulty code is installed and present on the attack surface by default, though the user needs to select the ‘mp3’ option during install. On Fedora, the attack surface is limited, because gstreamer1-plugins-bad is split into multiple packages, and only gstreamer1-plugins-bad-freeis installed by default.However, the general lack of sandboxing contributes to the severity of the issue. “I think we inhabit the world where media parsing sandboxes should be mandatory these days. There’s hope: some of my other recent disclosures appear to have motivated a sandbox for Gnome’s tracker,” the researcher explains.A few weeks ago, Evans detailed another Linux exploit leveraging Nintendo Entertainment System, one that leveraged a vulnerability and a separate logic error in the gstreamer 0.10.x player. The two issues would result in the bypass of 64-bit ASLR, DEP, but the exploit would work only on very old Linux distributions.", "date": "December 17, 2016", "topics": ["Hacking News"]}, {"title": "Russian Hackers Seized Control of Pentagon Email System", "authur": "William Fieldhouse", "body": "An unclassified email system used by the Pentagon was compromised by Russian hackers in 2015, forcing security teams to take the entire network down in order to fix the breach.Martin Dempsey, who was at that time Chairman of the Joint Chiefs, told CBS that he was informed of the breach by the Director of the National Security Agency, Admiral Mike Rogers, revealing that in approximately one hour, hackers seized control of the entire email system.However, Dempsey explains that the email service was used by staff of the Pentagon’s Joint Chiefs staff, which involves some 3,500 military officers and civilians who work for the chairman, and included only unclassified emails that “had no real intelligence value.”According to Dempsey, hackers managed to obtain passwords and electronic signatures that he personally used to access the network, so taking the entire system offline was the only way to deal with the problem.As for the identity of the hackers, the United States officials believed they were Russians who were trying to fight back at the Pentagon after the US issued economic sanctions against their country for the conflict in Ukraine and the annexation of Crimea.The attack was launched with compromised severs from a West Coast university, which were used to send a total of 30,000 emails. Four of them were eventually forwarded to Joint Chiefs of Staff employees and included malicious files that infected computers when executed. At least one of them was opened by an employee and eventually compromised the system before spreading across the entire network.The Pentagon had to replace both hardware and software following the attack and this required approximately two weeks, Dempsey revealed in the interview.Obviously, the Pentagon hasn’t provided any statement on this, but given the fact that the information comes from the former Chairman of the Joint Chiefs of Staff, there’s a good chance that everything is accurate. As for Russia’s involvement in the attack, you can be sure that the country would deny it.", "date": "December 17, 2016", "topics": ["Hacking News"]}, {"title": "PayAsUGym Data Breached! More Than 300,000 Accounts Exposed", "authur": "William Fieldhouse", "body": "Famous fitness website PayAsUGym around the UK has acknowledged that 300,000 email address and passwords of its members were accessed on Thursday. Good thing is that they did not hold any credit card details of its users on the server that got hacked.On Friday, PayAsUGym alerted its users about the data breach in an email which said,”one of the company’s IT servers was accessed by an unauthorised person”.“Although we do not hold any financial or credit card information, the unauthorised person could have accessed the e-mail address and password of our customers,” the email continued.“Passwords are encrypted when saved in the database, nevertheless I would encourage you to change your password.”Users were advised to change their passwords and the company has  also moved to a new server with the help of cyber security professionals. The website uses a “tokenised system” for customer payments which, it says, means card details are stored at the payment gateway – not on its servers.“We take the security of customer information very seriously. Unfortunately cyber attacks are becoming more frequent which is why, as a policy, we do not (and will never) hold financial or credit card details and we insist that all passwords are encrypted when stored.” Source: bbc.com", "date": "December 17, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "1 Billion Yahoo users are being sold for 300000$ on the internet", "authur": "Harikrishna Mekala", "body": "Recently Yahoo was hit by the Hackers and lead to the leakage of 1 Billion accounts which is said to be the largest database breach that was ever made in the history of Hacking of any company ever.There is a new development in the Breach that the hacker sold the info in the dark web for 300,000$ according to the Andrew Komarov, CIO at Security firm InfoArmor.It came to light that 3 different buyers, including two most known spammers, believed to be in this deal.It is known that a company based in eastern Europe does not know whether the database is sold or being used for their own cause.We can see that the database is still up for sale, but the price has fallen down significantly because Yahoo became public to the News.The database consists of Full Names, Passwords, DOB and Phone Numbers of the user’s interested buyers may buy the database for 20000$ dollars as of now in the Dark Web.Komarov also said his company obtained a copy of the Yahoo database earlier this year and got in touch with the law enforcement authorities in the United States and other countries in the European Union, Canada, and Australia.He also stated the following“Personal information and contacts, e-mail messages, objects of interest, calendars and travel plans are key elements for intelligence-gathering in the right hands,” Komarov was quoted as saying.“The difference of Yahoo hack between any other hack is in that it may really destroy your privacy, and potentially have already destroyed it several years ago without your knowledge.”Yahoo users are strongly recommended to reset their passwords and invalidate and remove the security questions from all the websites if they have been used anywhere.If you are using the same password and email anywhere please change them immediately.Take your time to comment on this article.", "date": "December 17, 2016", "topics": ["Cyber Attack", "Hacking News", "News"]}, {"title": "Backdoor Sends Call Logs and Details of 700 Million Android Phones to China", "authur": "William Fieldhouse", "body": "Back in November, it was discovered that a backdoor injected in a custom firmware powering nearly 700 million phones was being used to collect user information, and now a security firm that inspected the infection discovered that data such as IMEI, IMSI, MAC address, version number, and the operator is collected.\nSpecifically, a report that came out last month revealed that a huge number of Android phones running custom firmware developed by Chinese firm ADUPS Technology was infected with a backdoor that collected user information and submitted it to a server based in China.The list of phone manufacturers includes 43 names, according to Trustlook, and you can check it out in the box after the jump, with famous names such as Mediatek, BLU, ZTE, and Lenovo also there.Furthermore, Trustlook says that it discovered that SMS messages and call logs were also collected from the infected systems and transmitted to China, all without user’s consent and running in the background.The company analyzed just a simple package called “com.adups.fota” and found that the information is uploaded to a domain called bigdata.adups.com every 72 hours. This app is pre-installed on all devices that come with the custom firmware and its role is specifically to collect device and user activity information and upload it to the said domain at regular intervals.Data collection from infected devices started in July 2016, the firm found, and continued for more than six months until it was discovered.“People like to think their brand new phone is clean and free of malware, but that is not always the case. Some smartphone manufacturers choose to use a third party FOTA (Firmware Over-The-Air) service instead of Google’s, which can pose serious security risks. This is what happened in the case of Shanghai based ADUPS Technology Co,” the security firm explains.Some companies that were running the ADUPS firmware have already given up on it, including BLU, who decided to go for Google’s solution in search for better security.Although they are mostly Chinese manufacturers, some of these companies were also selling Android-powered devices infected with the backdoor in other big markets, including the United States. BLU alone was sold some 120,000 phones in the United States.source: softpedia", "date": "December 16, 2016", "topics": ["Hacking News"]}, {"title": "Hackers To Launch Cyber Attacks Against Ukrainian Banks", "authur": "William Fieldhouse", "body": "“Security company ESET reveals that it discovered a new group called TeleBots whose modus operandi is very similar to the one of BlackEnergy. TeleBots are primarily targeting Ukrainian banks, the firm says, and use spear-phishing emails that include malicious Excel documents to infect computers,” according to Softpedia reports.Systems are infected with malwares which is very similar to the Trojan used by BlackEnergy in its previous attacks against Ukraine.Attackers also deploy KillDisk, which is a destructive malware that renders the operating system unbootable and which is once again similar to the one used against power grid companies in Ukraine.Once it infects a system, KillDisk deletes all system files and registers itself as a service, changing the boot screen with a picture from Mr. Robot TV show.Currently it’s not sure how many of these attacks were successful, but Russian hackers are again believed to be behind the group, just like it happened before when the Ukrainian power grid was taken offline. ", "date": "December 16, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "A New Tordow Malware on Android can Root your devices", "authur": "Harikrishna Mekala", "body": "The devices which are running android Operating System are affected by a modified version of the Tordow Malware, The original malware was released at the start of the Q1.The base version of the Malware tries to access the Root user privileges to steal your passwords.It is trojan horse where it attempts to get full control and then perform tasks such as controlling phone calls, SMS and it will even try to install apps and rename the core files of the android.The malware spreads through the apps which are downloaded from the Third Party Sources, to So we suggest staying away from those stores and download apps from the sources that your trust, which reduces the probability your begin affected by the malware.Comodo says attackers download these apps, reverse-engineer them to inject the malware, and then reupload the apps in the stores. Titles such as Pokemon Go, Telegram, and Subway Surfers have already been infected, so you better stick to the official Play Store to remain secure.Since they are delivered as APK files, these applications can also spread via social media or other sites, so it’s important to always download from sources that you can trust.Once the App got installed in the victim’s phone it tries to gain root privileges and establishes a connection to the command center to await the further instructions.So that attackers can execute any command they want on your phone, The malware has mostly targeted the bank apps in your mobile and financial information.Removing Tordow from an infected device is particularly difficult since it gets root access, so flashing a new firmware might be the best way to do it, as deleting the source app that led to the infection does virtually nothing.Take your time to comment on this article. ", "date": "December 16, 2016", "topics": ["Cyber Attack", "Hacking News", "News", "SPY"]}, {"title": "KFC’s Loyalty Program Hacked! More than 1.2 Million Customers At Risk", "authur": "William Fieldhouse", "body": "KFC otherwise known as Kentucky Fried Chicken is a fast food restaurant chain that specializes in fried chicken and is headquartered in Louisville, Kentucky, United States.KFC has confirmed that data belonging to members of its Colonel’s Club card loyalty scheme may have been compromised after its website was targeted by hackers.The hackers were able to steal personally identifiable information of the members of the loyalty program. Only about 30 of the 1.2 million members had been targeted following the hack but KFC decided to inform all members to be on the safe side.KFC sent out emails to its 1.2 million users to change their passwords and are also reminding anyone who has reused a password and email address combination to change those as well. According to KFC UK said in a report that, “We take the online security of our fans very seriously, so we’ve advised all Colonel’s Club members to change their passwords as a precaution, despite only a small number of accounts being directly affected.”KFC is said to have implemented changes to both their back end and front end systems, including adding reCAPTCHA on the website to avoid automated login attempts. ", "date": "December 15, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Time To Delete Your Yahoo Account And Set It On Fire", "authur": "William Fieldhouse", "body": "Time to delete your Yahoo account and set it on fire, as Yahoo has reveled that “more than one billion user accounts” may have been hit in a hacking attack dating back to August 2013.Yahoo says “this incident is likely distinct from the incident we disclosed on September 22, 2016,” and said that while it’s been working with law enforcement and a third-party cybersecurity firm to trace its origin, it doesn’t yet know who the perpetrator was.“As we previously disclosed in November, law enforcement provided us with data files that a third party claimed was Yahoo user data,” Yahoo’s chief information security officer Bob Lord said in a statement.“The stolen user account information may have included names, email addresses, telephone numbers, dates of birth, hashed passwords (using MD5) and, in some cases, encrypted or unencrypted security questions and answers,” he added.Yahoo says payment card data and bank account information were not stored in the system believed to be affected and the hackers did not obtain passwords in clear text. However, we’d advise completely deleting your Yahoo account instead. ", "date": "December 15, 2016", "topics": ["Hacking News"]}, {"title": "12 security Updates for Windows Six of them are critical", "authur": "Harikrishna Mekala", "body": "On Tuesday Microsoft has released 12 security updates to its core operating system which is mostly rated critical the update provides protection from the remote code execution on the affected computers.The security updates also address in core OS , Internet explorer, Edge.The first update is MS16-144 patches a total of 8 security veulerabilities in internet explorer , 3 of them are publicly stated and they have also stated that they are not exploited.The 3 publicly disclosed vulnerabilities state are of Microsoft Browser Security(CVE-2016-7282) which is a bypass bug(CVE-2016-7281) and there is a engine memory curruption vulenrability (CVE-2016-7202) which allows remote code execution.Moving on to the EDGE browser there are 11 Flaws MS16-145 there are 11 flaws listed 3 of them are publicly disclosedHere are some of the critical updated that are listedMS16-149 resolves two holes in Windows, specifically a Windows crypto information disclosure flaw and a Windows installer elevation of privilege vulnerability.MS16-150 addresses an elevation of privilege bug in Windows secure kernel mode due to mishandling objects in memory.MS16-151 is to fix for two elevation of privilege vulnerabilities in Windows kernel mode drivers. One of the Win32k EoP flaws is due to Windows kernel mode driver failing to properly handle objects in memory; the other is due to Windows graphics component mangling objects in memory.MS16-152 is a security update for Windows kernel as it improperly handles page fault system calls and could lead to information disclosure.MS16-153 resolves an information disclosure bug in Windows by updating the common log file system driver.MS16-155 is the fix for .NET framework; Microsoft noted that the information disclosure vulnerability has been publicly disclosed but is not being exploited.MS16-143 was missing in action, considering the patches for November ended with MS16-142 and December began with MS16-144Take your time to comment on this article.", "date": "December 15, 2016", "topics": ["Cyber Attack", "Hacking News", "News"]}, {"title": "Ashley Madison Site has been fined with 1.6 Million Dollars", "authur": "Harikrishna Mekala", "body": "The Americas most successful dating website that helps to cheat on your life partner with your alter ego was fined with 1.6 Million Dollars for not protecting the user information of 36 Million users.The company has accepted to pay the fine by extracting the fund from the parent company Ruby Corp.The settlement charges are charged by the Federal Trade Commission(FTC) and The customers in 13 States are accusing that the company misleads about its privacy practices.The company has even failed to delete the account information after the users who are regretted has paid 20$ for their complete removal of the accounts.The website was also accused of creating fake accounts of female users which is one of devious effort to attract the new users.But Ruby Corp which was called Avid Life denied the claim, which was renamed as RubyCorp, Some of the insights admitted that the Female users of Ashley Madison website are just some lines of code.A group of hackers released Gigabytes of data which is critical to the internal operations of the website, The data also consists of Black Mail emails which even led to suicides.Ruby Corp. was intended to pay a total of $17.5 Million fine — $8.75 million fine to the FTC and another $8.75 million to 13 states that also filed complaints — but the company can afford to pay just $1.6 Million fine.“Today’s settlement closes an important chapter on the company’s past and reinforces our commitment to operating with integrity and to building a new future for our members, our team and our company,” Rob Segal, Ruby’s newly-appointed CEO, wrote in a blog post.The website was hacked in 2015 which resulted in leaked of First and Last names , passwords, credit card info’s transaction logs and email address.Take your time to comment on this article.", "date": "December 15, 2016", "topics": ["Cyber Attack", "Hacking News", "News"]}, {"title": "1 Billion Accounts are leaked from yahoo’s database", "authur": "Harikrishna Mekala", "body": "This is what we call the largest database breach in history. Yahoo’s database got hacked and the user password credentials of One Billion users are leaked into the public internet.The following breach is bigger than the previous breach of 500 million users which occurred in late 2014.The main problem is that A third party user has been able to steal the data associated more than one billion users.There was a previous breach disclosed which is similar event occurred in 2013 and followed by the again a similar event on 2014.The Cheif of IT security has stated this“The stolen user account information may have included names, email addresses, telephone numbers, dates of birth, hashed passwords (using MD5) and, in some cases, encrypted or unencrypted security questions and answers.”The MD5 Hashing is one of the ancient algorithms to store the user’s passwords which can be easily cracked in seconds and they even say that some of the security questions and answers are not even encrypted.We suggest that you change your account password immediately and change the password everywhere if you use the same password for any other websites.Yahoo is notifying its users to change their password, The data breach only occurred after the Yahoo’s deal with Verizon.Bob Verettoni a Verizon Spokesman stated this“As we’ve said all along, we will evaluate the situation as Yahoo continues its investigation. We will review the impact of this new development before reaching any final conclusions.”A previous data breach has already magnified the company’s problems and before it could recover another data breach hit the company will Yahoo was able to survive this.we can also say that both the data breaches at Yahoo! came after the company negotiated a deal to sell its core internet business to Verizon Communication Inc for $4.8 Billion.Take your time to comment on this article.    ", "date": "December 15, 2016", "topics": ["Cyber Attack", "Hacking News", "News"]}, {"title": "BEWARE !! Affordable Android Devices Comes With Preloaded Malware", "authur": "William Fieldhouse", "body": "Russian security company Dr. Web, which also makes a PC antivirus solutionbearing the same name, warns that it discovered a total of 26 smartphone models running Android and infected with malware that’s injected in the stock firmware they are shipped with.Most of the models on the list, which you find in full at the end of the article, are smartphones sold on the Russian market and based on the MTK platform, which is a chipset developed by Taiwan-based MediaTek. The list includes phones sold by Prestigio, Irbis, MegaFon, and SUPRA.The security firm says all these models are shipped with a Trojan called Android.DownLoader.473.origin, which is a downloader that automatically starts when the device is powered on.Once an Internet connection is detected, the Trojan connects to a C&C server and waits for instructions, while at the same time downloading and installing an application called H5GameCenter. In its turn, this application comes with an aggressive form of adware, which the security company flags as Adware.AdBox.1.origin.“Once installed, it displays a small box image on top of running applications. The image cannot be removed from the screen. It is a shortcut clicking on which opens a catalog integrated into Adware.AdBox.1.origin. In addition, the Trojan shows advertisements,” the security firm said.If users attempt to remove the H5GameCenter app from their smartphones, the Trojan automatically downloads and installs it again at a later time, without notifying users.Dr. Web says it also discovered a Trojan on Lenovo A319 and Lenovo A6000, which is part of an application called Rambla and which deploys a software catalog on affected devices.The Trojan is flagged as Android.Sprovider.7 and makes it possible for attackers to download APK files and install them on target smartphones, make phone calls to specific numbers, show ads, upload infected files, and open malicious links in browsers.“It is known that cybercriminals generate their income by increasing application download statistics and by distributing advertising software. Therefore, Android.DownLoader.473.origin and Android.Sprovider.7 were incorporated into Android firmware because dishonest outsourcers who took part in creation of Android system images decided to make money on users,” the security firm said.Android vendors whose devices come with Trojans have already been contacted by the firm and users who purchased one of the smartphones confirmed to come with malware are recommended to contact the manufacturer for support.", "date": "December 14, 2016", "topics": ["Hacking News"]}, {"title": "72 Vulnerabilities found in macOS Sierra and Apple patches them all", "authur": "William Fieldhouse", "body": "Apple announced on Tuesday the availability of macOS Sierra 10.12.2, which patches a total of 72 vulnerabilities affecting various components of the operating system.The latest version addresses flaws related to components such as Apache, Audio, Bluetooth, the kernel, IOKit, IOSurface, IOAcceleratorFamily, IOHIDFamily, Disk Images, graphics components, media services, security, and several third-party libraries.macOS Sierra 10.12.2 also addresses the cURL vulnerabilities discovered recently during an audit sponsored by the Mozilla Secure Open Source (SOS) program.The security holes patched with this macOS update can be exploited to cause an application to enter a denial-of-service (DoS) condition, execute arbitrary code (including with elevated privileges), obtain sensitive information, escalate privileges, leak memory data, and overwrite existing files. RC4 and 3DES have been removed as default ciphers to prevent attackers from exploiting their weaknesses.Independent researchers and representatives of Tencent, Synopsys Software Integrity Group, Google Project Zero, Huawei, Alipay, Qihoo 360, Topsec, the UK’s National Cyber Security Centre (NCSC), INRIA Paris and CXSECURITY have been credited for reporting the flaws. Ian Beer of Google Project Zero and the researcher known online as “[email protected]” have found many of the flaws.This is the second security update released by Apple for macOS Sierra since its launch in September. The first update fixed only 16 vulnerabilities.Apple also announced on Tuesday security updates for iCloud for Windows, iTunes for Windows and the Safari web browser. Safari 10.0.2 resolves two dozen vulnerabilities, a large majority of which affect the WebKit engine. The same WebKit flaws have also been fixed in the Windows versions of iCloud and iTunes.On Monday, Apple released iOS 10.2, tvOS 10.1 and watchOS 3.1.1, but the Apple Watch update was quickly pulled after users reported that it bricked their devices.source:  security week", "date": "December 14, 2016", "topics": ["Hacking News"]}, {"title": "This Malware Variant Has A Built-in Domain Generation Algorithm", "authur": "William Fieldhouse", "body": "Newly observed variants of the Mirai botnet pack domain generation algorithm (DGA) features that haven’t been associated with previous Mirai samples, security researchers warn.Mirai emerged several months ago as just another Internet of Things (IoT) botnet, but managed to make a name for itself fast, after it was used in large distributed denial of service (DDoS) attacks against the websites of security blogger Brian Krebs and hosting provider OVH in late September. However, it was only after the malware’s source code was made public in early October that interest in Mirai spiked.By the end of October, researchers found that Mirai infected devices in 164 countries around the world, preying on their weak security credentials. Also in October, Mirai was said to have been used in a massive DDoS attack against DNS provider Dyn, which resulted in many popular websites becoming inaccessible for some of their users.As expected, the public availability of Mirai’s source code resulted in numerous new malware variants being created, including a Mirai-based worm that used the TR-064 protocol for sending commands to infected devices. According to researchers with Network Security Research Lab at 360, at least 53 unique Mirai samples exist, given that they have been captured by their honeypots from 6 hosting servers.What’s more, the researchers reveal that newly spotted Mirai samples that spread through TCP ports 7547 and 5555. Moreover, the researchers discovered that the malware author who uses the email address dlinchkravitz[at]gmail[dot]com has already registered some of the generated domains.According to the security researchers, the analysed malware samples use 3 top-level domains (TLDs), namely .online, .tech, and .support, with each layer 2 (L2) domain having a fixed length of 12-bytes, with each character randomly chosen from ‘a’ to ’z’. The security researchers also note that the generated domain is only determined by month, day and hardcoded seed string.source: http://securityweek.comsecurityweek", "date": "December 13, 2016", "topics": ["Hacking News"]}, {"title": "Remote Code Execution Flaws Found in Linux – Provides Root Access to Attackers", "authur": "William Fieldhouse", "body": "Remote code execution flaws found in McAfee VirusScan Enterprise for Linux could allow an attacker to obtain root privileges, and a security researcher says that it’s all possible by simply tricking the app to use malicious update servers.Andrew Fasano from MIT Lincoln Laboratory said in a post that he first discovered the vulnerabilities in McAfee’s solution nearly six months ago, but the security company patched them only earlier this month.“At a first glance, Intel’s McAfee VirusScan Enterprise for Linux has all the best characteristics that vulnerability researchers love: it runs as root, it claims to make your machine more secure, it’s not particularly popular, and it looks like it hasn’t been updated in a long time,” he explained.In his post, Fasano explains that once the app connects to the compromised update servers, McAfee VirusScan Enterprise for Linux allows the deployment of a script that can be launched on the target machine with root privileges.There are 10 different vulnerabilities in McAfee’s Linux security solution, but the researcher says that only 4 of them are required to successfully breach a Linux system.The first two flaws, which are known as CVE-2016-8016 and CVE-2016-8017 (Remote Unauthenticated File Existence Test and Remote Unauthenticated File Read with Constraints) make it possible for hackers to compromise the authentication token used by McAfee’s VirusScan Enterprise and run malicious update servers on Linux machines.The script that would eventually help obtain root privileges is deployed with the help of CVE-2016-8021 (Web Interface Allows Arbitrary File Write to Known Location). When combined with CVE-2016-8020 (Authenticated Remote Code Execution & Privilege Escalation), an attacker can obtain a privilege escalation flaw, the researcher notes.“Using CSRF or XSS, it would be possible to use these vulnerabilities to remotely privesc to root,” he explains.All these vulnerabilities have already been confirmed in version 1.9.2 to 2.0.2, so all Linux systems are recommended to update to the latest release that McAfee shipped this month.", "date": "December 13, 2016", "topics": ["Hacking News"]}, {"title": "Dozens of Teens Arrested Over DDoS Attacks", "authur": "William Fieldhouse", "body": "This Monday, Europol announced that they have arrested 34 members as part of the operation that targets the users of DDoS cyber attacks tools.This operation was conducted with the help received from cooperation from enforcement agencies on 5th and 9th of December. Agencies all around the world, including Australia, France, Belgium, Lithuania, Hungary, the Netherlands, Portugal, Norway, Spain, Romania, the United Kingdom,Sweden and the United States. In addition to the 34 arrests, 101 suspects were interviewed and cautioned, Europol says.The agency suspects that these individuals are paying for stressers and booters services to deploy and launch DDoD attacks maliciously. The attacks flooded web servers with massive amounts of data, thus rendering them inaccessible to users.According to Europol, the tools used in these attacks are part of the criminal ‘DDoS for hire’ facilities that hackers can pay to use and which can be aimed at whichever target these hackers choose. However, none of the tools used by the suspects was named in Europol’s announcement.In September this year, an investigation conducted by the U.S. Federal Bureau of Investigation (FBI) led to the arrest of two individuals believed to be operating a DDoS for hire service. Last year, the U.K. National Crime Agency (NCA) arrested six males aged between 15 and 18, suspected of using the DDoS tool called LizardStresser, which was used to disrupt gaming platforms earlier this year.The LizardStresser botnet is fueled by Internet of Things devices, and security researchers recently discovered other powerful DDoS tools that use the power of these connected devices, with the Mirai botnet being the most popular of them at the moment.The available DDoS-for-hire services, the same as the Ransomware-as-a-Service (RaaS) business model, attract many young and adult cybercriminals who lack advanced computer skills but are looking for fast and easy money.", "date": "December 12, 2016", "topics": ["Hacking News"]}, {"title": "This Ransomware Gives Decryption Key For Free If You Infect Others", "authur": "William Fieldhouse", "body": "Researchers say they have uncovered ransomware still under development that comes with a novel and nasty twist.Infected victims of the ransomware known as Popcorn Time, have the option to either pay up, or they can opt to infect two others using a referral link. If the two new ransomware targets pay the ransom, the original target receives a free key to unlock files on their PC.“I have never seen anything like this in ransomware. This is definitely a first,” said Lawrence Abrams who runs BleepingComputer.com and who was first to report on the Popcorn Time ransomware.Abrams examined the code Thursday after malware forensic experts at MalwareHunterTeam tweeted they had found the code on the Dark Web. The name Popcorn Time is not to be confused with the video content app that goes by the same name.In Abrams’ analysis of the ransomware, he said it’s unclear how far along the ransomware is being deployed, if at all. “The code is incomplete, some of the C2 servers are not working and there are important components not yet in place.”More than 500 file types are targeted by the malware, which is configured to use AES-256 encryption to lock files with the .filock extension. According to screenshots obtained by MalwareHunterTeam and BleepingComputer.com, victims are given a week to pay the ransom or find new victims. The ransom note offers two options. There is the “fast and easy way” and “the nasty way.”“We are sorry to say that your computer and your files have been encrypted, but wait, don’t worry. There is a way you can restore your computer and all of your files… Send the link below to other people, if two or more people will install the file and pay, we will decrypt your files for free.”According to screenshots, the ransomware developers claim to be “a group of computer science students from Syria.” The note alleges that ransomware proceeds will go to food, medicine and shelter of Syrians impacted by war. “We are extremely sorry that we are forcing you to pay,” the message reads.The note demands 1 bitcoin (approximately $800). Victims are limited in the number of times they can input a decryption key. “There is unfinished code in the ransomware that may indicate that if a user enters the wrong decryption key four times, the ransomware will start deleting files,” Abrams wrote in a technical analysis.", "date": "December 11, 2016", "topics": ["Hacking News"]}, {"title": "Linux Kernel 4.8.14 is Official Now. Here is Everything You Need to Know", "authur": "William Fieldhouse", "body": "A few moments ago, Linux kernel maintainer Greg Kroah-Hartman announced the release of Linux kernel 4.8.14, the fourteenth maintenance update to the most advanced kernel series.Believe it or not, Linux kernel 4.8.14 is here only two days after the December 8 release of Linux kernel 4.8.13, which wasn’t a big patch. However, it looks like today’s update brings some more improvements, and according to the appended short leg and the diff since the previous version, it changes a total of 56 files, with 388 insertions and 164 deletions.“Turns out I’m going to be on a very long flight early tomorrow morning, so I figured it would be good to get this kernel out now, instead of delaying it by an extra day. So, I’m announcing the release of the 4.8.14 kernel,” said Greg Kroah-Hartman in today’s mailing list announcement. “All users of the 4.8 kernel series must upgrade.”Linux kernel 4.8.14 is all about networking improvements, as it updates the networking stack with a bunch of changes and fixes to the Datagram Congestion Control Protocol (DCCP), Distributed Switch Architecture (DSA), IPv4, IPv6, Layer 2 Tunneling Protocol (L2TP), Netlink, packet scheduler, and Transparent Interprocess Communication (TIPC) implementations.Additionally, there are various enhancements to the Broadcom, Cadence, Marvell, and Renesas Ethernet network controller drivers, as well as to the Broadcom support for the Distributed Switch Architecture (DSA) subsystem. Last but not least, Linux kernel 4.8.14 fixes a couple of issues with the SPARC hardware architecture. As usual, you are urged to update your kernel packages as soon as possible.Linux kernel 4.8.14 is now available for download from kernel.org or via our web portal. Also today, Greg Kroah-Hartman released the thirty-eighth maintenance update to the long-term supported Linux 4.4 kernel series, so if you’re using a GNU/Linux distribution powered by that kernel, you are urged to update as soon as possible to Linux kernel 4.4.38 LTS.", "date": "December 11, 2016", "topics": ["Hacking News"]}, {"title": "Russia is Trying to Wage a Cyber War Against Germany", "authur": "William Fieldhouse", "body": "Germany accuses Russia for waging its own cyberwar against Germany trying to influence the upcoming elections. In particular  accusations are on the APT28 (Fancy Bear) hacking group which is thought to be linked to the Russian government.Some cyber experts in Germany suggest that, even the recent attack on Deutsche Telekom routers is also a part of Russia’s plan, but there is no proof to show the same. Last year’s attack against the German parliament, and attacks against German politicians in August, are also blamed on Russia. Speaking earlier this week, Chancellor Angela Merkel commented, “Such cyber-attacks, or hybrid conflicts as they are known in Russian doctrine, are now part of daily life and we must learn to cope with them.”Now both the heads of the German foreign intelligence agency (BND), Bruno Kahl, and the domestic intelligence agency (BfV), Hans-Georg Maassen, have warned about increasing Russian cyber activity in Germany.Last week Kahl told the Süddeutsche Zeitung, “There are findings that cyber-attacks take place which have no other meaning than to create political uncertainty. There is a kind of pressure on public discourse and on democracy, which is unacceptable.” He added that there are indications of Russian involvement. “Attribution to a state actor is technically difficult, but there is some evidence that it is at least tolerated or desired by the state.”Yesterday, however, a statement issued by the BfV was more forthright. “Since the start of the Ukraine crisis,” it started, “we have seen a significant increase in Russian propaganda and disinformation campaigns in Germany.” It warns of a broad spectrum of instruments and “an enormous use of financial resources on Russia’s part” designed to strengthen extremist groups in order to shape political discourse in Germany.The statement names APT28 as using a campaign that is often executed as ‘false flags’. “This approach represents a previously unseen methodology in campaigns that are controlled by Russia.” Note however, that many experts believe that the attack against French television company TV5  was also a ‘false flag’: in reality APT28 pretending to be ISIS.The statement goes on to say, “Spear-phishing against political parties and parliamentary groups have increased dramatically. They are attributed to the APT28 campaign, which was also responsible for the DNC hack. APT28 successfully exfiltrated data from the German Bundestag in 2015.”Maassen describes the method and motivation behind the APT28 campaign. “Propaganda, disinformation, cyber-attacks, cyber espionage and cyber sabotage are part of hybrid threats against western democracies.” He points to social networks as the new way for people to share and consume information, adding that it provides the perfect entry point for disinformation and campaigns designed to reshape public opinion.He also warns of an “increase in cyber espionage within the political arena”. Government officials, members of the Bundestag, and party workers all face a potential threat. “Stolen information could be used in the election campaign to discredit German politicians.”The political theory is that Russia will benefit from a weakened European Union — already wounded by Brexit. By playing to European concerns over uncontrolled immigration and refugee support, and by fostering nationalism within individual member states — in this instance Germany — Russia will be able to weaken the existing European sanctions.Russia denies involvement in hacking.", "date": "December 10, 2016", "topics": ["Hacking News"]}, {"title": "India – Senior Journalist Barkha Dutt’s Twitter Account Hacked", "authur": "William Fieldhouse", "body": "After the hacking of Rahul Gandhi’s Twitter account, followed by a breach of the Congress’s account, its website and server. Now senior Journalist and consulting editor of NDTV Barkha Dutt’s has become the latest victim of a cyber hack.A group named “Legion”, claimed to be the responsibility for the incident. The group posted her email address and its password on the micro-blogging site, while blowing their own trumpet saying, “Long live the legion”.Except for the above screen shot of one of the tweets, the others that had offensive language were removed.", "date": "December 10, 2016", "topics": ["Hacking News"]}, {"title": "Hackers Attempts To Breach The Firewall That Protected The Georgia Voter’s Registration Database", "authur": "William Fieldhouse", "body": "According to Georgia’s Secretary of State Brian Kemp, “Foul play was discovered when a hacker failed at attempting to breach the firewall that protected the Georgia voter’s registration database. The IP address in question was discovered to originate from the Department of Homeland Security itself.”On a Facebook post on Thursday, Kemp said he has “sent a letter to DHS Secretary Jeh Johnson demanding to know why.”In an interview with WSB-TV in Atlanta, Kemp said to Channel 2’s investigative reporter Aaron Diamant that he was “mad as hell.”“It’s outrageous to think about our own federal government is doing this to us,” Kemp said.“We’re demanding answers to some of these questions, you know? Are they doing this to other states? Was it authorized or not? Who ordered this? Why is it being done and why weren’t we notified?” he added.Aaron Diamant contacted former FBI and Department of Defense Cyber Security analyst Willis McDonald to ask if this was possible, and McDonald seemed to believe that a DHS hacking attempt on a state is too far out of the realm of possibility.“It would actually be inconceivable to think that the federal government would start attempting to break into a state agency without any coordination,” said McDonald.Instead, McDonald suggested that the hacker was not at all associated with the DHS, and used their identity as a virtual mask stating “it’s fairly common to see something like that happening.”According to the DHS, they have received Kemp’s letter and are looking into the matter. When they find a solution, they will contact Kemp directly.Source: wsbtv.com", "date": "December 10, 2016", "topics": ["Hacking News"]}, {"title": "Yahoo Just Paid $10,000 to A Researcher For Finding Critical Mail Flaw", "authur": "William Fieldhouse", "body": "A researcher has earned $10,000 for finding a critical Yahoo! Mail vulnerability that could have been exploited simply by getting the targeted user to open a specially crafted email.Nearly one year ago, Jouko Pynnönen of Finland-based software company Klikki Oy discovered a stored cross-site scripting (XSS) vulnerability in the web version of the Yahoo! Mail service that could have allowed an attacker to execute malicious JavaScript code hidden in emails.The researcher said the flaw could have been used to forward the victim’s emails, change their account settings and even create an email worm that attached itself to all outgoing emails.The vulnerability, which earned Pynnönen $10,000, existed due to Yahoo’s failure to properly sanitise code in HTML emails.The expert recently decided to take another look at Yahoo’s Mail service and discovered a similar flaw, but this time it was related to code inserted when a certain type of content is attached to an email.The “Share files from cloud providers” attachment option allows users to attach files from their cloud storage accounts, such as Dropbox or Google Drive. While analysing the code inserted into an email when this option was used, Pynnonen noticed some HTML attributes named data-* (e.g. data-URL, data-category, data-embed-URL). Further analysis showed that these attributes are also used when a YouTube video is added to an email.The researcher found a way to abuse these attributes in YouTube video attachments to get arbitrary JavaScript code executed. There was no need for the user to click on a link or open an attachment – the code would get executed as soon as the email was opened.Similar to the flaw discovered one year ago, this security hole could have been exploited to steal a user’s emails and create a worm that spreads by attaching itself to outgoing emails, the expert said.Pynnönen told SecurityWeek that he did not get a chance to test the attack method using the Google Drive and Dropbox attachment options. Yahoo was informed about the vulnerability on November 12 and fixed it by the end of November.Yahoo awarded the expert a $10,000 bounty for the flaw. The company reported in May that it had paid out more than $1.6 million since the launch of its public bug bounty program in 2013.", "date": "December 9, 2016", "topics": ["Hacking News"]}, {"title": "This New Malware Uses Powershell to Perform Fileless Infection", "authur": "William Fieldhouse", "body": "Proofpoint security researchers warn about A new information-stealing malware named “August”. This uses Word documents that contain malicious macros and it is abusing PowerShell for a fileless infection.This malware is being distributed by TA530, who is an actor already known to be involved in very highly personalised campaigns. The August distribution campaign, researchers say, was targeting customer service and managerial staff at retailers in an attempt to steal sensitive documents and credentials from the compromised machines.To ensure successful infection, the actor used subject lines for the emails to reference to issues pertaining to alleged purchases from the targeted company’s website. These emails were targeted at employees who could supposedly help resolve the problems, which made it likely that they would open the attached documents, which supposedly contained detailed information about the issue.However, as soon as the recipient opened the document, they would be prompted to enable the macros, which in turn would launch a PowerShell command to download and install the August stealer on the machine. The malicious payload is downloaded from a remote site as a PowerShell byte array, along with a few lines of code to deobfuscate the array through a XOR operation.The security researchers noticed that the macros used in this campaign are similar to those used in a campaign delivering the Ursnif banking Trojan. They are meant to add sandbox evasion capabilities to the distribution attempt by performing checks such as Maxmind, task counts, task names, and recent file counts.The August stealer was written in .NET and its authors used Confuser to obfuscate it. By looking at the source code from a particular sample, Proofpoint researchers determined that the threat can steal and upload files with specified extensions to a command and control (C&C) server, can steal .rdp and wallet.dat files, and can also steal cryptocurrency wallets including Electrum and Bither, in addition to being able to determine whether security tools such as Wireshark and Fiddler are installed on the machine.Additionally, the malware can grab credentials from FTP applications (such as SmartFTP, FileZilla, TotalCommander, WinSCP, and CoreFTP) and messenger apps (Pidgin, PSI, LiveMessenger, and others); can collect cookies and passwords from Firefox, Chrome, Thunderbird, and Outlook; can communicate the hardware ID, OS name, and victim’s username to the C&C server; and can encrypt network data via base64 encoding, character replacement, adding a random key (passed to server encoded in the User-Agent field), and reversing the strings.“August could be used to steal credentials and files in a wide range of scenarios. The malware itself is obfuscated while the macro used in these distribution campaigns employs a number of evasion techniques and a fileless approach to load the malware via PowerShell. All of these factors increase the difficulty of detection, both at the gateway and the endpoint,” Proofpoint researchers say.Because cybercriminals are using increasingly sophisticated and personalised email lures, organisations are advised to use email gateways that can detect macros with sandbox evasion built-in. They should also consider educating their employees on emails that do not initially look suspicious, but which could carry malware.", "date": "December 8, 2016", "topics": ["Hacking News"]}, {"title": "Microsoft Officially Announced the Minimum PC Specs Required to Run Windows 10 VR", "authur": "William Fieldhouse", "body": "Microsoft is betting big on virtual reality with Windows 10, and the company is trying to bring this experience to all users of its latest operating system, so the firm is working with partners to launch VR headsets on the market at very affordable prices.At WinHEC today, Redmond finally confirmed the minimum PC requirements for Windows 10 VR, after all, these details got leaked a few weeks back.And what’s important is that the majority of computers running Windows 10 should be able to cope with VR requirements as well because what they need is an Intel Core i5 processor, integrated Intel HD graphics card, 8 GB of RAM, and 100 GB of storage (you can see all specifications at the end of the article).The specs aren’t overwhelming and are exactly the same with the ones we’ve seen before, and it’s very clear that Microsoft is trying to make the VR experience to as many users as possible.Also at WinHEC, Microsoft announced that starting February next year, developers would get access to Windows 10 VR headsets, as the company is pushing hard for this new effort to be ready when the Creators Update goes live.The new Windows 10 OS update is expected in March, and The Verge writes that Microsoft’s goal is to make these VR headsets available for developers at the Game Developers Conference in Francisco before they debut publicly. Companies such as Acer, Dell, HP, Lenovo, and Asus have already confirmed that they are working on VR headsets.New improvements and features that would bring Windows 10 closer to the VR world would debut in insider builds in 2017, so expect more information on this to arrive shortly.source: softpedia", "date": "December 8, 2016", "topics": ["Hacking News"]}, {"title": "OpenVPN to Undergo Security Audit By Cryptography Expert", "authur": "William Fieldhouse", "body": "The next version of the open-source OpenVPN software will be audited by a well-known cryptographer. It was announced Wednesday that Matthew D. Green, PhD, a cryptographer, computer science professor, and researcher at Johns Hopkins University will carry out an audit of the code currently available on Github.Private Internet Access, one of the more popular mainstream VPN services, announced the news, confirming that it had contracted Green’s services to complete the audit as soon as OpenVPN 2.4 exits beta mode.OpenVPN 2.4_rc1, released last Friday, is a candidate for the next stable version of the software.“The OpenVPN 2.4 audit is important for the entire community because OpenVPN is available on almost every platform and is used in many applications from consumer products such as Private Internet Access VPN to business software such as Cisco AnyConnect,” Caleb Chen, a Private Internet Access spokesperson said.As part of the audit, the company claims it will work with OpenVPN to address any vulnerabilities found in the software and share the report with the project’s community before making the results public.Green, who sits on the Open Crypto Audit Project’s Board of Directors, has experience carrying out intensive cryptographic audits. The OCAP helped organise an audit three years ago of the now-defunct TrueCrypt. The second phase of that audit, completed last year, revealed no backdoors and that TrueCrypt was a “well-designed piece of crypto software,” said Green. Auditors from NCC Group’s Cryptography Services arm found four vulnerabilities during the first phase of the audit in 2015 but none of them led to a bypass of confidentiality.Private Internet Access, which is owned by Los Angeles-based London Trust Media, said Wednesday that it would fund the effort entirely. The move somewhat steals the thunder from smaller VPN services that had been working to fund an independent audit.OSTIF is beginning it's fundraiser to audit @OpenVPN !Support free software and strong encryption! Donate today!https://t.co/2xo3LH0D07— OSTIF Official (@OSTIFofficial) November 22, 2016", "date": "December 8, 2016", "topics": ["Hacking News"]}, {"title": "Iran – Cops arrest hackers who robbed gold shops", "authur": "William Fieldhouse", "body": "Iranian cyber police have arrested the hackers who are suspected of breaching the computers of 90 gold and jewelry shops in the capital Tehran and stealing over $10,000.According to the police, the hackers had accessed the data on the banking transactions of the gold shops.Colonel Mohammad Mehdi Kakvan, the commander of Tehran cyber police, has said that,”The suspects used USB flash drives to break into the computer systems of the gold shops and used the keylogger malicious software, IRNA news agency reported.”“The affected gold shops had failed to install and upgrade proper security software on the computers, which helped the hackers,” he added.He described installing proper anti-virus software and keeping them upgraded as a major method to confront hackers from breaking into computers.", "date": "December 8, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "India – Hackers From 5 Countries Operated Rahul Gandhi Congress Twitter Account", "authur": "William Fieldhouse", "body": "Rahul Gandhi and the Congress twitter accounts which were recently hacked were operated from five countries including the US, Delhi Police said.The Economic Offences Wing (EOW), which is probing the matter, received a reply around three-four days ago from Twitter headquarters on the Internet Protocol (IP) addresses used by the hackers to send derogatory tweets from these accounts, a senior police officer said.“We have got to know that the IP addresses from where the accounts were accessed don’t fall under our jurisdiction. The Twitter handle logs show both the accounts were operated from five countries – Sweden, Romania, the US, Canada and Thailand,” the officer said.We will write to the Internet service providers of these countries to share details of users with us and that is how the investigation will proceed,” the officer added.According to analysis of the data shows that the accounts were accessed from these countries on November 30 from 9.15 PM to 9.30 PM and from 10:30 AM on December 1, the officer added. In case, police do not get the necessary details, they might have to initiate the process of sending Letters Rogatory to competent courts in these countries for assistance, sources said.According to the officer, police are yet to get log details of the Congress website from the party’s server.Police had lodged two FIRs in connection with the hacking of the two Twitter accounts, the party website and the email accounts of Congress and Rahul on December 1 following two complaints from Congress chief spokesperson Randeep Surjewala to the EOW.Rahul’s Twitter account was hacked on November 30 and some remarks full of expletives were posted. On December 1, his email account was also hacked, the party had claimed. Two cases under section 66 of IT Act were registered, police had said.", "date": "December 8, 2016", "topics": ["Hacking News"]}, {"title": "Hackers Hacked An Israeli News Channel and Broadcast The Muslim Call To Prayer", "authur": "William Fieldhouse", "body": "Hackers took control of an Israeli news channel and broadcast the Muslim call to prayer. Israel’s Channel 2’s transmission was disrupted after hackers gained access to TV satellites on Tuesday night.The hack allegedly took place in protest of a controversial bill that limits the volume of the ‘Adhan’ from mosques in Israel. The transmission also had messages written in Hebrew warning of “punishment from God” and said that “the fire burned hearts”.According to Tribune reports “Residents in northern Israel viewing Channel 2 via satellite TV reported that during the evening broadcast someone took over central control of the broadcast and played the voice of the muezzin.”Previously an Arab politician had staged a Muslim call to prayer in Israel’s parliament in protest against the bill to quieten mosques. Ahmad Tibi, a member of the Israeli government, performed the ‘Azan’ during a speech in which he argued the proposed bill. Another Arab-Israeli politician, Taleb Abu Arar, joined Mr Tibi in performing the call. Mr Netanyahu told a cabinet meeting that,”I cannot count the times – they are simply too numerous that citizens have turned to me from all parts of Israeli society, from all religions, with complaints about the noise and suffering caused them by the excessive noise coming to them from the public address systems of houses of prayer.”האקרים השתלטו על שידורי מהדורת חדשות 2, ובמקום – שידרו קריאת מואזין pic.twitter.com/lCmDajZXh4— חדשות 2 (@Channel2News) November 29, 2016", "date": "December 8, 2016", "topics": ["Hacking News"]}, {"title": "Dailymotion Hacked and Details of 85 Million Users Exposed", "authur": "William Fieldhouse", "body": "Popular video sharing website Dailymotion which is the second largest in the world after the giant Youtube has recently got hacked and according to the reports, due to this nearly 85.3 million accounts were exposed.Although the breach wasn’t publicly acknowledged by Dailymotion officials, ZDNet reports that it received evidence of a hack that possibly took place on October 20 when a hacker managed to extract more than 85 million usernames and email addresses.Approximately 18.3 million accounts included in the leaks also had passwords, but they were hashed with Bcrypt, LeakedSource, who obtained the leaked data, reveals.Details regarding the hacker behind the attack are not available just yet, but users are strongly recommended to change their passwords as soon as possible. Dailymotion is not yet notifying customers about the data breach, so without an official notification, millions of accounts could remain exposed.The IP cameras that come with these backdoors are primarily aimed at businesses, and Sony urges everyone to deploy the new firmware updates to remain secure.“SEC Consult recommends Sony and Sony customers to conduct a thorough security review of the affected products. It is essential to restrict access to IP cameras using VLANs, firewalls etc. Otherwise, the risk of being a botnet victim (e.g. Mirai) is high,” the security report states.According to the original advisory, a hacker could take advantage of the backdoors using either a local network or a web connection, as long as these cameras can be accessed online.You can refer to the box below to see the Sony IP cameras that were confirmed to come with a backdoor, and use this link to download the new firmware versions.Sony has already acknowledged the security vulnerability and said that “we are grateful to SEC Consult for their assistance in enhancing network security for our network cameras.”source: softpedia", "date": "December 7, 2016", "topics": ["Hacking News"]}, {"title": "Hackers Can Exploit Sony’s IP Cameras Using A Backdoor", "authur": "William Fieldhouse", "body": "A security council reported that they have consulted Sony to report the issue they have found and looks like the company already released a new firmware update which patches this vulnerability.It is really interesting to note that according to the researchers, the company added this backdoor on purpose.  “maybe as a way to debug the device during development or factory functional testing,” and they are pretty sure that this backdoor is not the result of an infection.The researchers have found two vulnerabilities, one affects the web and allows the hacker to connect to the camera with the help of a Telnet service.The second flaw makes it possible to compromise the root account, which means that an attacker to carries out a successful exploit would gain full control over a camera and can spy on users, disrupt functionality, add the device to a Mirai botnet, or send different photos and videos.\nThe IP cameras that come with these backdoors are primarily aimed at businesses, and Sony urges everyone to deploy the new firmware updates to remain secure.“SEC Consult recommends Sony and Sony customers to conduct a thorough security review of the affected products. It is essential to restrict access to IP cameras using VLANs, firewalls etc. Otherwise, the risk of being a botnet victim (e.g. Mirai) is high,” the security report states.According to the original advisory, a hacker could take advantage of the backdoors using either a local network or a web connection, as long as these cameras can be accessed online.You can refer to the box below to see the Sony IP cameras that were confirmed to come with a backdoor, and use this link to download the new firmware versions.Sony has already acknowledged the security vulnerability and said that “we are grateful to SEC Consult for their assistance in enhancing network security for our network cameras.”Here is the list of the cameras models that are vulnerable:SNC-CH115, SNC-CH120, SNC-CH160, SNC-CH220, SNC-CH260, SNC-DH120, SNC-DH120T, SNC-DH160, SNC-DH220, SNC-DH220T, SNC-DH260, SNC-EB520, SNC-EM520, SNC-EM521, SNC-ZB550, SNC-ZM550, SNC-ZM551 SNC-EP550, SNC-EP580, SNC-ER550, SNC-ER550C, SNC-ER580, SNC-ER585, SNC-ER585H, SNC-ZP550, SNC-ZR550 SNC-EP520, SNC-EP521, SNC-ER520, SNC-ER521, SNC-ER521C SNC-CX600, SNC-CX600W, SNC-EB600, SNC-EB600B, SNC-EB602R, SNC-EB630, SNC-EB630B, SNC-EB632R, SNC-EM600, SNC-EM601, SNC-EM602R, SNC-EM602RC, SNC-EM630, SNC-EM631, SNC-EM632R, SNC-EM632RC, SNC-VB600, SNC-VB600B, SNC-VB600B5, SNC-VB630, SNC-VB6305, SNC-VB6307, SNC-VB632D, SNC-VB635, SNC-VM600, SNC-VM600B, SNC-VM600B5, SNC-VM601, SNC-VM601B, SNC-VM602R, SNC-VM630, SNC-VM6305, SNC-VM6307, SNC-VM631, SNC-VM632R, SNC-WR600, SNC-WR602, SNC-WR602C, SNC-WR630, SNC-WR632, SNC-WR632C, SNC-XM631, SNC-XM632, SNC-XM636, SNC-XM637, SNC-VB600L, SNC-VM600L, SNC-XM631L, SNC-WR602CL", "date": "December 7, 2016", "topics": ["Hacking News"]}, {"title": "Teen Pleads Guilty To Led A Group Of Hackers Who Made Fake Threats", "authur": "William Fieldhouse", "body": "A 17-year-old teenager from Andover who led a group of hackers who made fake threats nationwide, has pleaded guilty and been sentenced to juvenile detention, and was ordered into the custody of the Department of Youth Services until he is 21 years old, according to a statement said by Police.The teenager made multiple “swatting” phone calls, using the Internet to anonymously make hoax threats, including bomb threats. The investigation began in April after multiple “swatting” calls were received in Massachusetts and several other states.Authorities searched the teenager’s home using a dog specially trained to detect hidden electronic devices, State Police said. In the teenager’s bedroom, investigators found a special router that allows someone to anonymously connect to the internet.State Police said that they also found online messages between the group of hackers the teenager led about bomb threats they had made. The teenager also admitted to destroying evidence just before police searched his home, State Police said.The boy had made hoax 911 calls to Florida, New York, and Rhode Island, State Police said. He also made calls to residents in Wilmington and Woburn and to IMAX Theaters inside Jordan’s Furniture stores in Natick and Reading.The teenager was “familiar with” bomb threats in more than a dozen locations in Massachusetts and aware of bomb threats in Little Falls, N.Y., and Spring Valley, N.Y, state police said.The teenager pleaded guilty last month to conspiracy and bomb threat charges. Prosecutors asked for a 3- to 5-year state prison sentence. Source: bostonglobe.com", "date": "December 7, 2016", "topics": ["Hacking News"]}, {"title": "Game Of Thrones Star Maisie Williams Nude Photos Leaked Online", "authur": "William Fieldhouse", "body": "Internet hackers have leaked semi-naked pictures of “Game of Thrones” star Maisie Williams on online. Leaked images contained topless photos and were been shared on sites over the weekend. The naked pictures were taken during her recent trip to Japan.The images show Maisie posing on a rock, while another is taken in stages with two other female friends removing their clothes. The reason why Maisie has been on the trip to Japan has been to raise awareness around marine animal shows, in which dolphins are captured in order to perform.According to Maisie said to FoxNews that, “It was something that just struck a chord in my heart.”“And I’m a firm believer that, if there is something that you really want to stand up and fight for, then you should,” she said.“And with everyone doing their own little bit for what they believe in, hopefully together we can make the world a better place,” she added. Your support has been overwhelming. I thank you all for your help. By working together we can end this. @dolphin_project #dontbuyaticket #takethepledgeA video posted by Maisie Williams (@maisie_williams) on Dec 4, 2016 at 4:50pm PSTCelebrities are consistently deprived of privacy due to their public-facing careers, but this invasion is absolutely nauseating. Hope Williams can get these photos removed from the internet, change her password, and find the hackers who did this.", "date": "December 7, 2016", "topics": ["Hacking News"]}, {"title": "North Korea Managed to Hack South Korean Military Network", "authur": "William Fieldhouse", "body": "South Korea’s military network was compromised by what are believed to be North Korean hackers, who managed to access the intranet and steal several military secrets.The country’s Defense Ministry revealed today that the attack took place on September 23 and specifically targeted systems that are being used to deliver updates.Although South Koreans aren’t entirely sure that North Korean hackers are behind the attacks, the ministry says that they discovered evidence, including code, that show some similarities with other hacks launch by their neighbours.“The military formed a cyber investigative team to look into this matter and found that some military data — including confidential information — has been leaked. It appears to be a North Korean act,” the ministry was quoted as saying by Korea Herald.It appears that the attack was launched from Chinese servers, but South Korea says that no military data regarding the country’s partnerships with other states were accessed.The ministry, however, admitted that state secrets were stolen, including military information, but he refused to provide any specifics as an investigation is still under way.“We cannot give out details on what information was leaked because it might give (North Korea) an advantage in the ongoing cyber warfare,” he said.It appears that the malware used for the attack was installed on the affected systems in August, but it’s not yet clear why exactly North Korean hackers waited until September 23 to break into these computers.According to the ministry, the compromised computers weren’t supposed to be connected to the Internet, but due to “administrative carelessness and violation of regulation,” hackers managed to infiltrate into the intranet and get full remote control over the systems.South Korea requires employees using military systems to only connect them to the Internet if no classified information is stored, and to remove all data when they complete their work. Hackers, however, found confidential data after infecting multiple servers, even though these weren’t supposed to have an active Internet connection or store military secret information.", "date": "December 6, 2016", "topics": ["Hacking News"]}, {"title": "100,000 Routers in UK are Affected by Mirai like Malware", "authur": "William Fieldhouse", "body": "Approximately 100,000 UK TalkTalk and Post Office ISP users were affected by the recent Mirai attack that severely affected nearly a million Deutsche Telekom customers in Germany in late November. It was assumed that the UK victims were the outer ripples of the primary attack; and this was confirmed by a subsequent report that quoted the Mirai developer as apologizing for the effect on the Post Office. The UK disruption was apparently an accident and not done intentionally.This version of events is now questioned by the findings of Pen Test Partners. Senior consultant Andrew Tierney reported Friday that the effect on TalkTalk routers was different to the effect on Deutsche Telekom routers. “We can’t see what is causing the claimed ISP outages for TalkTalk and the Post Office reported in the press. It shouldn’t stop the router routing, and as of yet, the bots haven’t taken part in any attacks.”Pen Test Partners concluded, “Whilst the spread and purpose of the bot net is similar to Mirai, there are enough differences with this variant that it should really get a new name.”In a subsequent post on Saturday, Tierney seems to have named the second worm ‘Annie’.“The TR-064 security hole that was reported this week is really nasty,” he reported. “The worm that exploits this is being referred to as ‘Annie’. Attackers appear to have cottoned on to the fact that the TR-064 vulnerability can be used for more than just recruiting the router into a botnet.” The additional purpose, he suggested, is to steal the router’s WiFi network key. Worryingly, he also claims that the fix pushed out by TalkTalk will most likely not solve the problem.Following the incident, TalkTalk published its solution: customers should switch off affected routers and leave them for 20 minutes while they update with new software. “After 20 minutes try and access the internet again, if you’ve changed your wireless details then you’ll need to use the wireless network name and password on the back of the router.”But Tierney sees a problem with this: it won’t work as a fix. “Nearly all customers never change their Wi-Fi key from that written on the router. Why would they? I’ll bet many don’t even realize they can.” So what happens is that Annie steals the key, and “the TalkTalk fix simply resets the router, to the exact same keys that have already been stolen!!”Having acquired the WiFi key, a hacker can listen in to communications and infect the network with additional malware. He would need to be in close physical proximity to the router (outside, perhaps in a closely parked vehicle); but, added Tierney, “if you know the SSID (also stolen using the Annie worm) you can use databases such as https://wigle.net to find your victim’s house.” His solution is that TalkTalk “should be REPLACING all customers routers urgently;” possibly as many as 55,000.TalkTalk itself is not currently keen to do so. A spokeswoman told the BBC that the number of infected routers had been “nothing in that order of magnitude”. She added, “Our security team does not believe there is any greater risk that a customer’s wi-fi can be used or accessed without their permission as a result of this.”Dr. Steven Murdoch from University College London suggested something in between the two positions. “It’s possible [the perpetrators of Annie] are just security researchers, but also reasonably possible that they are actually criminals that intend to exploit this information.” He doesn’t believe that TalkTalk needs necessarily recall all the routers: “The hardware is fine, what needs to be replaced is the wi-fi password.”He does, however, admit that this is difficult. “If TalkTalk does this online or over the phone, that leaves the customers open to phishing attacks, where a scammer says: ‘As you heard on the news you need to change your password, please do these things…'”TalkTalk remains adamant that even the password change is unnecessary. Given its recent hefty fine by the UK’s Information Commissioner following last year’s breach, it must be very confident.", "date": "December 6, 2016", "topics": ["Hacking News"]}, {"title": "Hackers May Have Hacked South Korea’s Military Cyber Command", "authur": "William Fieldhouse", "body": "South Korea’s military cyber command, established to counter external hacking attempts on the country’s military, may have been hacked, according to South Korea’s Yonhap news agency reports.“It seems the server of the cyber command has been hacked,” an official at the South Korean military said on condition of anonymity. “We have to go through additional checkups to confirm the cyberattack and to find out who launched the cyberattack and what data have been leaked.”The latest allegation comes out after Rep Kim Jin-pyo, a lawmaker of the main opposition Democratic Party of Korea, claimed that the cyber command was hacked in September.The latest allegation comes out after Rep Kim Jin-pyo, a lawmaker of the main opposition Democratic Party of Korea, claimed that the cyber command was hacked in September.He told Yonhap News Agency two months ago that the hacking targeted the “vaccine routing server” installed at the cyber command.Kim, who is a member of the parliament’s national defense committee, then said that a malicious code was found and it appears to have taken advantage of the vulnerability of the routing server.The server is examined with security on computers that the military has for internet-connection purposes.Kim said in October that chances are “very low” that the hacking led to a leak of confidential information, given that the military’s intranet is not connected to the server.The defense ministry later announced that malicious code has be identified and removed as a cautious measure, it separated the server from the network.According to the source, there is a possibility that the military’s intranet may have been compromised due to the hacking which could force South Korea to rewrite its military operation plans.", "date": "December 6, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Dailymotion Hacked! More Than 87 Million User Accounts Detail Exposed", "authur": "William Fieldhouse", "body": "Dailymotion launched in 2005, is famous to find and watch videos is currently the 113rd most visited website in the world, according to Alexa rankings.More than 87 millions of accounts related to video sharing website name Dailymotion have been leaked online. The website has been hacked on October by a hacker, whose identity isn’t known according to LeakedSource.The leaked information contained 85.2 million unique email addresses and usernames from the company’s systems, but about one-in-five accounts(18.3 million) had associated passwords, which were scrambled with the b-crypt hashing function, making the passwords difficult to crack.To be in safer side, its good to change your passwords in Dailymotion website.", "date": "December 5, 2016", "topics": ["Hacking News"]}, {"title": "Chinese Attackers Spying On Taiwan government Using Flaw in IE", "authur": "William Fieldhouse", "body": "A cyber espionage group linked to China has been spotted targeting government organisations in Taiwan using an Internet Explorer vulnerability patched by Microsoft earlier this year.Researchers have been monitoring a campaign they’ve dubbed “CNACOM,” in which attackers have used compromised websites to deliver a piece of malware. One of the compromised sites, known as a watering hole, belonged to a major public service organisation in Taiwan.When users accessed this website’s registration page, an iframe injected into the footer loaded an exploit landing page. The Internet Explorer vulnerability leveraged by this exploit, tracked as CVE-2016-0189, was fixed by Microsoft in May, but it had been seen in targeted attacks against users in South Korea before a patch was made available.A few weeks after Microsoft resolved the flaw, researchers published a proof-of-concept (PoC) exploit. The PoC code was used by cybercriminals to integrate the security hole into several exploit kits.The same PoC code has been used in the CNACOM campaign, but the payload has been invoked through an Internet Explorer sandbox escape flaw tracked as CVE-2015-0016.In the CNACOM attacks, the exploit code collects information from the device, including its IP address. If the victim uses Internet Explorer and the IP address is known to belong to the Taiwanese government, the exploit delivers a variant of the malware dubbed Ixeshe.Ixeshe has been around since at least 2009 and it has been observed in attacks aimed at East Asian governments and electronics manufacturers, including in Taiwan. The malware was also linked to the attacks launched in 2012 against The New York Times.The group behind Ixeshe, also known as APT12, Numbered Panda and DynCalc, is believed to be operating out of China.According to Zscaler, the Ixeshe variant spotted in the recent Taiwan attacks is different from older versions as the campaign codes it uses are embedded into the malware, which could indicate that the threat relies on a more centralised tracking system.Zscaler is not the only security firm to monitor China-linked attacks aimed at Taiwan’s government. Palo Alto Networks and FireEye also reported seeing such attacks in the past few months.", "date": "December 5, 2016", "topics": ["Hacking News"]}, {"title": "Liam Payne’s Official Facebook Page Hacked And Pornographic Images Shared", "authur": "William Fieldhouse", "body": "Liam Payne’s Official Facebook Page has been hacked by hackers and shared sexual story articles, “10 best positions you don’t know”, also had a caption, “Try it…” with the hacker pretending to be Liam.After few minutes the posts have been deleted, but not before his fans noticed the images. LIAM PAYNE’S FACEBOOK WAS HACKED TODAY— 1D Updates ? (@OTRADaily) December 5, 2016 Hey @LiamPayne I think your Facebook account is being hacked… pic.twitter.com/g2GWdtDjo8— liam payne’s vocals (@bestvocalsofljp) December 5, 2016  This hack happens after a week Cheryl’s Instagram account hacked by unknown hackers, which has 2.7m followers, and posted “F*** LIAM PAYNE” and redirect her fans to follow another account on Twitter. ", "date": "December 5, 2016", "topics": ["Hacking News"]}, {"title": "Hackers Comprised Over 35,000 Medical Records, Including that of HIV Patients", "authur": "William Fieldhouse", "body": "The website of a diagnostic lab in Maharashtra was hacked and medical records, including that of patients with HIV, were leaked online.The data comprised over 35,000 patients’ medical records with details such as patients’ names, their age, gender, blood test report, lipid profile and other medical parametersThe Mumbai-based laboratory, Health Solutions, has close to 250 centres across the city and over 10,000 collection points in various states in India. Apart from the patients’ records, the website also had 5000 other files including administrative documents. The lab erased all its records from the website on Friday evening.“We have erased the entire data from our website to protect patients’ details,” said website developer Sunil Mourya.The data had remained available for several hours on the website and on search engines, before it was erased.Officials at Health Solutions have claimed that they were able to prevent photographs and contact details of patients from going public. Reports suggested that the lab’s website was hacked several times in the past as well.The lab said that they will update their security system to prevent security breach in future.", "date": "December 5, 2016", "topics": ["Cyber Attack", "Hacking News"]}, {"title": "Hackers Exposed 412 Million Adult FriendFinder Accounts", "authur": "William Fieldhouse", "body": "According to LeakedSource, a breach notification website, disclosed the incident fully on Sunday and said the six compromised databases exposed 412 million accounts, with the bulk of them coming from AdultFriendFinder.com.The hack includes data from more than 339 million accounts on AdultFriendFinder.com, which advertises itself as the “world’s largest sex & swinger community,” and millions of accounts on sex sites Penthouse.com and Cams.com, Leaked Source reported.Passwords were encrypted, but insecurely, and LeakedSource says it has managed to crack 99 percent of them. It’s not clear who was behind the attack, though Leaked Source says it occurred in October 2016.“Over the past several weeks, FriendFinder has received a number of reports regarding potential security vulnerabilities from a variety of sources,” FriendFinder Networks Vice President and Senior Counsel Diana Ballou told ZDNet.", "date": "December 5, 2016", "topics": ["Cyber Attack", "Hacking News", "Vulnerabilities"]}, {"title": "Cardiac Instruments Used in Hospitals Can be Easily Hacked", "authur": "William Fieldhouse", "body": "The communication protocol used by some of the latest generation of Implantable Cardioverter Defibrillators (ICDs) is weak enough to allow even attackers without advanced knowledge to reverse-engineer it and exploit vulnerabilities such as denial of service (DoS), security researchers have discovered.In a paper (PDF) titled On the (in)security of the Latest Generation Implantable Cardiac Defibrillators and How to Secure Them, a group of six researchers from Leuven, Belgium, and Birmingham, UK, explain that Implantable Medical Devices (IMDs) use proprietary protocols for communication, and that limited or no security features are employed for wireless communication.Because the protocols are used to carry out critical functions such as changing the IMD’s therapy or collecting telemetry data, an attacker capable of tapping into these communication protocols can perform privacy and Denial-of-Service (DoS) attacks. What’s more, the researchers explain that reverse-engineering the protocols is highly feasible even for attackers with limited knowledge and resources and without physical access to devices.The research was conducted on the latest generation of a widely used ICD, which uses a long-range RF channel (from two to five meters) for communication, using a black-box approach and inexpensive Commercial Off-The-Shelf (COTS) equipment. While analyzing the protocols, the security researchers discovered weaknesses in them and in their implementations, and they also managed to conduct several attacks against the vulnerable devices.These attacks, which include replay and spoofing, can put patients’ safety at risk, especially since they can be performed without being in close proximity to the patient. The security researchers suggest that the discovered issues affect at least 10 types of ICDs currently on the market and say that manufacturers have been contacted before the publication of the paper.The researchers started their analysis with an attempt to intercept the wireless transmissions between the device programmer and the ICD, and focused on reverse-engineering the proprietary protocol used to communicate over the long-range channel. Next, they looked into ways to activate the ICD before carrying out attacks and discovered several ways to bypass the current activation procedure.After fully reverse-engineering the proprietary protocol, the researchers focused on discovering vulnerabilities that an attacker could exploit, and revealed that active and passive software radio-based attacks such as privacy, DoS, and spoofing and replay attacks are possible. They also say that adversaries might not even need to be in the proximity of the vulnerable devices because sophisticated equipment and directional antennas could allow them to extend the attack distance by several orders of magnitude.", "date": "December 4, 2016", "topics": ["Hacking News"]}, {"title": "India – 22 Year Old Indian Hacks PM Narendra Modi’s App", "authur": "William Fieldhouse", "body": "According to a report by Your Story, a 22 year-old hacker Javed Khatri claimed that he was able to hack PM Narendra Modi app which is separate from the official app and is available on Android, iOS and Windows.Javed Khatri in an email to Your Story, said, “I am able to access private data of any user on the app. The data includes phone number, email, name, location, interests, last seen etc.”“I successfully managed to extract the personal phone numbers and email ids of ministers like Smriti Irani. Not only that, I can make any user on the platform follow any other user on the platform,” he added.“This is just the summary of this huge security loophole which I want to report. The privacy of more than seven million users is at stake if this gets ignored.” he saidThe 22 year old has no intention to misuse the data and just wanted to demonstrate how poor the security of the app is as it was easy for him to hack the app, he told the site.He has also shared a couple of screenshots to prove the legitimacy of his hack. The screenshots show personal data of Dr Jitendra Singh, Minister of State for the Ministry of Development of North Eastern Region, the data was accessed via Narendra Modi app.", "date": "December 4, 2016", "topics": ["Hacking News", "Vulnerabilities"]}, {"title": "Hackers Stole $31 Million From Russia’s Central Bank", "authur": "William Fieldhouse", "body": "Russia’s central bank suffered a major cyberattack that made it possible for hackers to steal no less than 2 billion rubles, which is approximately $31 million, according to reports.The Bank of Russia has already confirmed the attack and said that it’s investigating, but no other details as to who might be behind the hack were provided.Central bank official Artyom Sychyov said in a public briefing that hackers previously wanted to steal approximately 5 million rubles, but the bank’s security team managed to partly block the attack and reduce damages to 2 million rubles.“We were lucky to return some of the money,” a central bank spokesperson was quoted as saying by CNN, adding that some of the funds were quickly redirected after hackers launched the attack.It appears that cybercriminals targeted not only the central bank, but also private banks and customers, attempting to transfer funds, but it’s not yet clear if these attacks were successful or not.Since very little is known about the hack against Russia’s central bank, experts believe that the attack can be linked to similar attempts launched in the last couple of years and targeting other banks across the world.Only this year, a group of hackers managed to steal no less than $101 million from the central bank in Bangladesh after they managed to break into SWIFT, which is the worldwide interbank communication network that controls transactions. Just like it happened in Russia’s case, hackers attempted to steal more money – $951 million, but they were blocked before the transactions completed.Russia’s Federal Security Service (also known as FSB), has already warned of attacks that might be aimed at local banks, revealing that it discovered computer servers in the Netherlands that were set up to compromise the country’s financial system and help steal money.Russian authorities, however, haven’t provided details regarding the hacking group behind the attack or the date when it occurred.", "date": "December 3, 2016", "topics": ["Hacking News"]}, {"title": "Donald Trump Advised to Train 100,000 Hackers to Protect the US", "authur": "William Fieldhouse", "body": "The president of US Donald Trump better train and hire around 100,000 hackers whose main purpose is protecting the country from cyberattacks. This was suggested by a commission which includes top security experts, like former NSA director Keith Alexander and MasterCard CEO Ajay Banga, said in a report.This security experts panel also suggested that cybersecurity should be given high priority during the tenure of Donald Trump. They also recommended Trump not only to train hackers and be prepared for any cyber threat but also to propose international norms for hacking that would guarantee better protection.“From the past few years, trained security researchers are leaving for the Private sector and this has been a huge problem. We should train more security experts that will work for the country.” Pointed by the Commission on Enhancing National Cybersecurity.The salaries offered by private companies are higher than that offered by the United States so they expect Donald Trump to address this problem in his first year as the president of US.Furthermore, Trump must closely control all training programs because this could lead to lower skills and quality, and the President is also recommended to create a so-called “national cybersecurity workforce program” to prevent such issues.", "date": "December 3, 2016", "topics": ["Hacking News"]}, {"title": "This Bank Denies Losing $31 Million In A Hacking Attack", "authur": "William Fieldhouse", "body": "The Bank of Russia (Russia’s central bank) denied media reports it had lost over $31 million in a hacking attack, saying the money was stolen from Russian commercial banks throughout this year.According to a press officer with the regulator told RIA Novosti “Information about the theft of 2 billion rubles by hackers from the Bank of Russia’s correspondent accounts is not true. This is the estimate of losses that commercial banks and their clients lost over 2016, as estimated in the Financial Stability Review, released overnight.”The bank’s security executive, Artyom Sychev, told to journalists on Friday that hackers had stolen millions worth of funds from accounts of banks kept by the Bank of Russia. He said this estimate was a year’s total and a relatively small sum for the entire country.The bank’s security executive, Artyom Sychev, told to journalists on Friday that hackers had stolen millions worth of funds from accounts of banks kept by the Bank of Russia. He said this estimate was a year’s total and a relatively small sum for the entire country.", "date": "December 3, 2016", "topics": ["Cyber Attack", "Hacking News", "Vulnerabilities"]}, {"title": "OSS-Fuzz An Open Source Fuzzing Service By Google", "authur": "William Fieldhouse", "body": "It’s just been a couple of months since Microsoft announced its Project Springfield code fuzzing service and now Google has launched the beta version of its own OSS-Fuzz. The purpose of both of these is to help developers to locate the bugs in their code which might eventually lead to breaches. Even though the purpose of both of these organisations works for the same cause, one is a paid service while the other is free; one is proprietary while the other is open source.Google has described the OSS-Fuzz as ‘continuous fuzzing for open source software’. According to the development team in Google’s Testing Blog, “OSS-Fuzz’s goal, is to make common software infrastructure more secure and stable by combining modern fuzzing techniques with scalable distributed execution. OSS-Fuzz combines various fuzzing engines (initially, libFuzzer) with Sanitizers (initially, AddressSanitizer) and provides a massively distributed execution environment powered by ClusterFuzz.”It fills a gap left by Project Springfield. Since the fuzzing field offered by the Microsoft is a commercial product, it can only be used by the customers willing to pay and afford it. This does not exclude open source developers as they love open source software, but it is noticeable that it is specifically marketed to business customers: suitable for testing in-house software, software acquired through M&A, and even third-party software being considered for purchase.Google notes that “Open source software is the backbone of the many apps, sites, services, and networked things that make up ‘the internet’…  An example is the FreeType library, which is used on over a billion devices to display text (and which might even be rendering the characters you are reading now).” It is important that such software is bug-free and secure. “Recently the FreeType fuzzier found a new heap buffer overflow only a few hours after the source change.”The ‘continuous’ nature of the service solves another problem: open source software may have multiple maintainers applying software changes almost on an ongoing basis. “OSS-Fuzz automatically notified the maintainer, who fixed the bug” announced Google; “then OSS-Fuzz automatically confirmed the fix. All in one day!”There is no suggestion that either Google’s or Microsoft’s service is better than the other — they are different methods serving different purposes. “The OSS-Fuzz effort,” said HD Moore, the Metasploit founder now with Special Circumstances LLC, “can be compared to the Coverity program for open source projects; a way to apply commercial-level resources to improving the security of critical open source programs and libraries.“Project Springfield seems a bit different,” he continued, “in that it focuses on providing a for-pay service for all developers, not just open source projects. Google as a company has already made significant contributions to this space through their employee work on open source tools (AFL, etc) and this effort seems very much in that vein.” ", "date": "December 2, 2016", "topics": ["Hacking News", "News"]}, {"title": "Vulnerability in AirDroid Impacts Over 50 Million Android Devices", "authur": "William Fieldhouse", "body": "Android  remote management tool AirDroid  has Vulnerability that can potentially impact over 50 million devices  as warned by the security researchers at Zimperium zLabs.AirDroid has between 10 million and 50 million downloads from the official Google Play software portal, and also the security firm says that its device base is larger than that. According to Zimperium, vulnerabilities in AirDroid allows an attacker to exploit the built-in features and use them against the app users.The main issue that the security researchers pointed is that AirDroid uses insecure communication channels. This means that the app’s millions of users are exposed to a MitM attack and other kinds of attacks.There is also a high risk of information leak along with remote hijacking of update APKs which could result in remote code execution.While analysing AirDroid, the security researchers discovered that the communication channels employed to send authentication data to the statistics server are insecure. While the requests are encrypted with the Data Encryption Standard (DES) symmetric-key block cipher in Electronic Codebook (ECB) mode, the encryption key is hardcoded inside the application, meaning that the attacker knows it.Armed with these details, an actor on the same network with the target device could execute MitM attacks to grab authentication credentials from the very first HTTP request the application performs, and can then impersonate the user for further requests, Zimperium’s Simone Margaritelli explains.“This HTTP request can be decrypted at runtime using the 890jklms key hardcoded inside the application and the authentication fields parsed from the resulting JSON. Having this information, the attacker can now impersonate the victim’s device and perform various HTTP or HTTPS requests on its behalf to the AirDroid API endpoints,” the researcher notes.An attacker could craft a payload encrypted in DES with the same exact key to trick the server into spewing user information, which will result in the email and password hash being exposed. ", "date": "December 2, 2016", "topics": ["Hacking News"]}, {"title": "More Than 380,000 User Accounts Leaked from Adult Website", "authur": "William Fieldhouse", "body": "Over 380,000 user accounts of adult video website named xHamster have recently been leaked online.  The data breach includes customers username, email addresses and passwords. The leak contains 40 email addresses belonging to the US Army and 30 that are from government bodies in the US, UK and other countries.According to LeakBase, the accounts were being traded at the same time that a hacker found a vulnerability on the website earlier this year, but it is not exactly clear how the database was obtained.According to xHamster spokeperson says that,”he passwords of all xHamster users are properly encrypted, so it is almost impossible to hack them. Thus, all the passwords are safe and the users data secured.”But the hashed passwords can be cracked easily, since they have used an old encryption algorithm, which was also used in website Ashley Madison which was also hacked a year ago.“The fact they think the hashes are secure is a blatant example of the faulty security placed in companies even to this day,” stated a LeakBase representative.Make sure next time when you signup to porn websites, use useless emails and passwords, and you can check Have I Been Pwned? and see if your details are included in the leak.", "date": "December 1, 2016", "topics": ["Hacking News"]}, {"title": "Hackers Attacked Carleton University and Demanding $28,500 to Unlock Files", "authur": "William Fieldhouse", "body": "Some hackers have managed to infect the systems of a Canadian university with their ransomware and they are now demanding 39 Bitcoin (which is about $28,500) to unlock the files.The Carleton University has already confirmed the attack. They asked the students to turn off their computers until the issue is resolved, thus advising everyone to avoid connecting to the university wireless network for the time being.In an update a few hours ago, the University said the following “Carleton University is open, classes are continuing and all employees are expected at work.  Business operations at the university are continuing.  Progress continues to be made on the network interruption issues.”The slightly relieving thing is that the university has a back-up for their data. The IT department is working hard to get the data back.Earlier today in an update they made it clear that no personal information has been accessed by the attackers, so students and staff are all secure. The only target of the attackers is to deploy the malware ], encrypt the data and demand for the ransom.“Access to email has returned and is functioning.  Repairs to enterprise systems are progressing. With the return of email, all future updates will be emailed to faculty and staff. If users are able to use their computer to conduct business, they are encouraged to do so.  If they cannot, they are asked to refrain from turning their computers on and encouraged to call CCS Service Desk,” the university added.At this point, no other details are known about the ransomware infection or the hacker or hackers who managed to break into the university’s systems.By the looks of things, the university has no intention to pay the attackers to remove the infection, but restoring the backups could take a little longer. Students are strongly recommended to paying attackers, as the IT department warns that popups could show up on more computers connected to the local Wi-Fi network.\n", "date": "December 1, 2016", "topics": ["Hacking News"]}, {"title": "India – Congress Suspends 200 Twitter Accounts", "authur": "William Fieldhouse", "body": "After the hacking of Rahul Gandhi’s Twitter account, followed by a breach of the Congress’s account, its website and server, the party deactivated the accounts of 200 leaders because of “suspicious activity” on Thursday evening.Sources say Congress leaders have been asked to change their passwords and “a full review” is being carried out after the hacking.According to a Congress spokesperson Randeep Surjewala told NDTV that “Mr Gandhi’s Twitter handle @OfficeOfRG, his email account, the Congress Twitter account, the party’s website and internal server were all hacked between 9.30 pm on Wednesday and 10 am today.”This evening, sources say, leaders on the Congress server were asked to close their accounts or not use them until there is a detailed security assessment over the next few days. The government has started an investigation and asked for details of users who have logged on to the accounts in the past week.“As soon as I heard it last night, I spoke to the IT person in charge,” Minister Ravi Shankar Prasad told reporters.The Congress has alleged that the attack was by “licensed trolls” and reflected “disturbing insecurities of prevalent fascist culture”. The party, however, was asked not to “make a big issue” of the hacking in parliament by Mr Gandhi.", "date": "December 1, 2016", "topics": ["Cyber Attack", "Hacking News", "SPY"]}]