[{"title": "TaskRabbit CEO posted a statement regarding the company’s security breach", "date": "April 19, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "TaskRabbit website and its app are back online after a cyber security breach. Stacy Brown-Philpot, CEO of TaskRabbit posted a detailed statement about the event saying:“While our investigation is ongoing, preliminary evidence shows that an unauthorized user gained access to our systems. As a result, certain personally identifiable information may have been compromised,”.The company also said that a third party forensics team is currently working to identify the compromised information to inform the affected users. The CEO also said that all the activity is monitored by the company so if there is a malicious event we can track it easily.The company also said that a third party forensics team is currently working to identify the compromised information to inform the affected users. The CEO also said that all the activity is monitored by the company so if there is a malicious event we can track it easily.The company also that it is going to add new security measures to make their login process more secure and also to reduce the amount of the data retained on their customers.The CEO of the company also listed some important points on how the company is going to take new security measures seriously.She also said,Our Taskers and Clients are the lifeblood of our business. We care deeply about our community and are committed to being a better neighbor. With our website and apps back online, we hope you will give us the opportunity to regain your trust.There is also a mention that this incident is not going to be dropped and they will update the outcomes of the event as we move on.Take your time to comment on this article.Source: TechCrunch, TaskRabbit"}, {"title": "LocalBlox Rumbled After Scraping 48 Million Users Data and Accidently Leaving it Open to the Public", "date": "April 19, 2018", "topics": ["Hacking News", "News", "SPY"], "authur": "Harikrishna Mekala", "body": "LocalBlox, A small data firm has scraped the data of 48 Million personal profiles from Facebook, Twitter, LinkedIn and Zillow without user’s consent. The firm said that their spider automatically crawls discovers, extracts, indexes, maps and augments the data in various formats from the web and exchange.The firm were rumbled after the data collected was stored in an S3 Bucket without a password allowing users to simply browse to the S3 URL. The bucket named lbdumps contained a file that was 1.2 TB in size which listed the files of 1.2 million user records from public profiles.The data was found by Chris Vickery, director of security firm UpGuard. He immediately disclosed the leak to the CTO of the LocalBlox and hours later the bucket’s data was secured.These data controversies are sparking uproars in the congressional and parliamentary meetings, The data collection by Localblox can be just as invasive and include highly sensitive and personally identifiable information on a person, without their consent.Vickery saidThe data was found in a human-readable, newline-delimited JSON file. The data collected includes names and physical addresses, and employment information and job histories data, and more, scraped from Facebook, LinkedIn, and Twitter profiles.UpGuard published their own report of the breach which contained search queries that Localblox would use to cycle through the data that it has collected using Facebook’s search engine to retrieve the photos of the user, current job title employer information and additional family information.Although Facebook has shut down its search feature earlier this month due to scammers using the automated searches to harvest data from the platform.It’s also assumed that the company extends its collected data from non-public sources, like purchased marketing data. The data is then gathered, organized and blended into existing individual profiles.The report said that collection operation is an effort to build a 3D picture on every individual and use it for advertising and political campaigning.Take your time to comment on this article.Source: ZDNet"}, {"title": "Australia Caught Up In Russia’s Cyber-Attack", "date": "April 17, 2018", "topics": ["Cyber Attack", "Hacking News", "News"], "authur": "Arslan Butt", "body": "The latest cyber-attack carried out by Russia worldwide has caught up with Australia as well. Hundreds of Australian business were affected by Russian cyber attacks which led to a reproach from the Turnbull government based on actions of the Kremlin.Marise Payne, Defense Minister has claimed that up to 400 Australian companies were targeted in this attack. She claimed on Thursday that, “The Australian Cyber Security Centre … believes that potentially 400 Australian companies were targeted but don’t believe that there’s been any exploitation of significance.”Marise Payne believes that the businesses came under attack since last August. United States and the United Kingdom believe they’ve identified the perpetrators of the attacks as being Russian state sponsored state actors who were working across a number of countries.Angus Taylor- Cyber-Security Minister says that there has been “no indication” that the Australian Government was compromised or hacked. He also claims that these incidents are unacceptable and has joined with United States and Britain in expressing concern over the cyber-activities of Russia.Mr. Taylor says that, “Commercially available routers were used as a point of entry, demonstrating that every connected device is vulnerable to malicious activity.”He further adds, “This attempt by Russia is a sharp reminder that Australian businesses and individuals are constantly targeted by malicious state and non-state actors, and we must maintain rigorous cyber security practices.”The companies which were affected via this cyber-attack have been provided with help and advice through the Australian Cyber Security Centre. Mr. Taylor who is currently in the US with government officials discussing the right response to the cyber threats says that it is crucial that Canberra works with Washington to help build strong defenses against cyber-attacks.He says, “The Turnbull government, through its 2016 Cyber Security Strategy and the establishment of the Home Affairs portfolio, is committed to ensuring the Australian public sector, businesses and the community are safe from malicious cyber activity.”Bill Shorten has labeled this hacking of Australian companies as “very serious” and claims that there is “no doubt” that Russians and its allies are behind this cyber-threat; he claims that Russians are trying to gain information out of Australia.The opposition leader, Bill Shorten claims that, “Can I just make clear to Australian businesses, that just because we’re an island, doesn’t mean that we’re immune from cyber espionage and hacking, which we see all around the world. I have no doubt that along with a number of other countries, there will be cyber hacking operations in Russia and its satellite countries which are trying to compromise information in Australia.”He further declares that companies may take cyber-security for granted  and he adds saying, “We need to see redoubled efforts to make sure that we’re looking, not just after government institutions, but we’re also assisting business, both big and small, strengthening their protections against the modern day scourge of cyber hacking.”Source: The Australian"}, {"title": "Russia Has Been Hacking Routers Worldwide; As UK Prepares For Cyber Strike", "date": "April 17, 2018", "topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "As tensions between the UK and Russia continue to rise, the UK are getting ready for a potential cyber-attack of large scale which may lead to the release of confidential government information. British Officials issued a statement about an attack on British infrastructure by the Russian government.The nations Cyber Intelligence Agency and the Ministry of Defence said a complete retaliation for this attack is going to severely affect the relations between Russia and UK.The UK Cyber intelligence agency NCSC, the FBI and the DHS have accused the Russian based attackers saying that the country is trying to sabotage the routers, switches and firewalls to hijack the internet infrastructure of the country.In this effort, millions of the machines connected to the internet have been targeted to spy on organizations and government agencies. The main strategy of the attack is peer data passing through compromised computers on the network furthermore this these kinds of attacks also cripple the firewalls of the internal networks of the organizations.The main target is ISP firms running critical infrastructure, government departments and big financial companies. The alert outlined that an erratic behaviour from the device should indicate that device on the network may have been compromised.In a detailed technical alert published after the call, the joint warning said that Russian hackers took advantage of outdated devices, as well as routers with weak defences. That combined routers with default passwords, as well as devices no longer carried by security patches.“The purpose of these attacks could be espionage, it could be theft of intellectual property, it could be prepositioning for use in times of tension,” NCSC Director Ciaran Martin said.“The attribution of this malicious activity sends a clear message to Russia — we know what you are doing and you will not succeed,” said a spokesperson for the UK government.Take your time to comment on this article.Source: Engadget"}, {"title": "Casino Database Hacked Using Fish Tank Thermometer as Leverage", "date": "April 16, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "The CEO of Darktrace said that Hackers have been targeting unprotected IoT devices to gain access to corporate networks. An incident has taken place in a casino where the hackers managed to steal the database of high rolling customers by taking advantage of a vulnerable fish tank thermometer in the network!.The CEO of Darktrace said:“The attackers used that to get a foothold in the network. They then found the high-roller database and then pulled that back across the network, out the thermostat, and up to the cloud,” she said.The fish tank had the sensors connected to a Personal Computer that regulated the temperature, food and cleaninees of the tank.The report from the Darktrace said that 10GB of data was transferred to Finland.“Somebody got into the fish tank and used it to move around into other areas (of the network) and sent out data,” said Justin Fier, Darktrace’s director of cyber intelligence.“This one is the most entertaining and clever thinking by hackers I’ve seen,” said Hemu Nigam, a former federal prosecutor for computer crimes and current chief executive of SSP Blue, a cybersecurity company.As more and more IoT products are released into the market opportunities for hackers to access data through unusual ways has risen. An Internet-connected toy can learn the name, location and other personal information of your child easily, The FBI believe that IoT devices must be regulated.“Everything has to go through FTC approval, I’d be curious to see if that happens on the cyber front,” he said. “That you have to do the bare minimum to protect these products. But that’s just for the U.S. How do you do this globally?”The customers should educate themselves of about IoT Products and take advantage of the security updates provided by the manufacturers by updating their software with latest security patches.Take your time to comment on this article.Source: BusinessInsider"}, {"title": "Britain Threaten Russia With Cyber-Attack", "date": "April 16, 2018", "topics": ["Cyber Attack", "Hacking News", "News"], "authur": "Arslan Butt", "body": "Relationships are pretty icy between Russia and Britain; Britain has threatened Russia with Cyber-attack in retaliation if Russia targets Britain’s Infrastructure.This is a low blow to their relationship after Britain blamed Russia for a nerve agent attack on a Russian spy and his daughter in England that led to a mass explosion killing diplomats. Russia denied any such involvement.On Thursday a British spy chief from GCHQ said that they would “continue to expose Russia’s unacceptable cyber behavior”. They also added that the demand for cyber-expertise will increase drastically.The Sunday Times also claims that British spy officials are prepared to release information that would embarrass the Russian politicians and other high-profile people since the attack on the Russian Spy.Meanwhile the Russian foreign minister Sergei Lavrov claims that the nerve agent used to attack the Russian Spy could have been a BZ substance. He goes on to say that these substances are never produced in Soviet Union or Russia proving that Russia was not behind the attack in England.After the attack on April 12, the first public statement issued by the Russian Spy, Sergei Skripal’s daughter was about her ex-spy father and how she had returned to a “totally different life” from the life she was living.She said that, “I was treated there with obvious clinical expertise and with such kindness”She goes on to say: “I have left my father in their care, and he is still seriously ill. I too am still suffering with the effects of the nerve agent used against us.”UK has held Russia responsible for this attack however the Russian Foreign Minister claims that, “Experts from a laboratory based in the Swiss town of Spiez had analyzed a sample of the substance used in the poisoning.,” and citing a report from the lab. The lab report dated March 27; according to Mr. Lavrov proves that the nerve agent could be within resources of the United States and Britain.The global chemical weapons watchdog claims on Thursday that the nerve agent or poison used on the Russian Spy is a pure type of Novichok nerve agent. The British Prime Minister, Theresa May says that, it is highly likely that Moscow was behind this poisoning.Source: NewsHub  "}, {"title": "National Cyber Security Centre Reveals New Cyber Attack Classification System", "date": "April 14, 2018", "topics": ["Did you know ?", "Hacking News", "News"], "authur": "Arslan Butt", "body": "United Kingdom’s national cyber security firm has announced and unveiled a new system to categorize cyber-attack and help law enforcement and intelligence operatives to formalize their response to hacks. As part of the inauguration CYBERUK security conference, National Cyber Security Center, NCSC, launched a new framework yesterday which comprises of 6 levels.The levels start from a minor individual attack and led all the way up to a huge catastrophic attack on the infrastructure of United Kingdom. Once the attack is identified, the NCSC’s team will use the new framework to not only classify the attack but will also use the appropriate resources and deal with the attack based on its strength.The NCSC director of operations, Paul Chichester says that, “This new joint approach, developed in partnership with UK law enforcement, will strengthen the UK’s ability to respond to the significant, growing and diverse cyber threats we face. The new system will offer an improved framework for dealing with incidents, especially as GDPR and the NIS Directive come into force shortly.”The categories of the attack range from one to six and are based upon the impact and the strength.During an attack such as level 6, NCSC will lead the response directly and will not only provide on-site support but will also provide remote analysis of the attack, The highest level of attack is level 1 and is a “National cyber emergency”- this type of attack will disrupt infrastructures such as the power grid, hospitals, utilities and according to NCSC head Ciaran Martin- UK will face such an attack sooner or later.Ciaran Martin claims that the consequences of a category one attack will include “severe economic or social consequences or to loss of life.”The framework made by the NCSC is as follows:Defined as: A cyber-attack which causes sustained disruption of UK essential services or affects UK national security, leading to severe economic or social consequences or to loss of life.Who Responds? : Immediate, rapid and coordinated cross-government response. Strategic leadership from Ministers / Cabinet Office (COBR), tactical cross-government coordination by NCSC, working closely with Law EnforcementWhat Do They Do: Coordinated on-site presence for evidence gathering, forensic acquisition and support. Collocation of NCSC, Law Enforcement, Lead Government Departments and others where possible for enhanced response.Defined as: A cyber-attack which has a serious impact on central government, UK essential services, a large proportion of the UK population, or the UK economy.Who Responds? : Response typically led by NCSC (escalated to COBR if necessary), working closely with Law Enforcement (typically NCA) as required. Cross-government response coordinated by NCSC.What Do They Do: NCSC will often provide on-site response, investigation and analysis, aligned with Law Enforcement criminal investigation activities.Defines as: A cyber-attack which has a serious impact on a large organization or on wider / local government, or which poses a considerable risk to central government or UK essential services.Who Responds? : Response typically led by NCSC, working with Law Enforcement (typically NCA) as required.What Do They Do: NCSC will provide remote support and analysis, standard guidance; on-site NCSC or NCA support may be provided.Defines as: A cyber-attack which has a serious impact on a medium-sized organization, or which poses a considerable risk to a large organization or wider / local government.Who Responds? :Response led either by NCSC or by Law Enforcement (NCA or ROCU), dependent on the incident.What Do They Do: NCSC or Law Enforcement will provide remote support and standard guidance, or on-site support by exception.Defined as: A cyber-attack on a small organization, or which poses a considerable risk to a medium-sized organization, or preliminary indications of cyber activity against a large organization or the government.Who Responds? : Response led by Law Enforcement (likely ROCU or local Police Force), with NCA input as required.What Do They Do: Law Enforcement will provide remote support and standard guidance, with on-site response by exception.Defines as: A cyber-attack on an individual, or preliminary indications of cyber activity against a small or medium-sized organizationWho Responds? : Automated Protect advice or local response led by Law Enforcement (likely local Police Force).What Do They Do:Remote support and provision of standard advice. On-site response by exception.The top law enforcements have welcomed this announcement and National Police Chief’s constable Peter Goodman, who is a part of a council that leads cyber-crime claims that, “”This is a hugely important step forward in joint working between law enforcement and the intelligence agencies.”He further added saying, “Sharing a common lexicon enables a collaborative understanding of risk and severity that will ensure that we provide an effective, joined-up response. This is good news for the safety of our communities, business and individuals.”This framework will go into effect immediately.Source: The Register"}, {"title": "Over 65K Routers Abusing UPnP to Proxy Bad Traffic for Botnets", "date": "April 13, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "A report published by Akamai detected those threat actors were abusing at least 65,000 routers to create proxy networks for various illegal activities. According to the company’s report, the attackers are using UPnP to create proxy networks for various illegal activities.Despite UPnP being crucial for every modern router, the protocol has proven to be  insecure with most malware authors having used UPnP flaws. The Hackers are using misconfigured UPnP services to inject malicious routes inside the network address translation tables, NAT is a set of rules that control how IP’s and ports from the router’s internal networks are mapped to the external networks.Custom NAT if not configured properly provides easy access to the network using the router’s public IP on a specific port, this flaw allows attackers to use routers with misconfigured UPnP services as proxy servers for their operations. It was named UPnProxy by the AkamaiThe UPnProxy attack can access the login panel of the user’s router which enables the hackers to interconnect the local-WiFi enabled devices and forward ports and services to the Internet. In laymans terms, the hackers are using these affected routers as  proxy servers.In a separate report, Symantec described seeing a nation-state-backed actor codenamed “Inception Framework” utilizing the UPnProxy system to hide their real location behind a cloud of proxies. Akamai said more than 4.8 Million routers are exposed to various UPnP bugs like WAN glitches interface. Identifying endangered or vulnerable routers is not a trivial process unless the device owner can find and audit the router’s NAT tables, a task that’s out of the reach of almost 99.99% of all SOHO router owners.Take your time to comment on this article.Source: Bleepingcomputer"}, {"title": "DCMS Sets Up A £13.5M Cyber-Security Center", "date": "April 12, 2018", "topics": ["Hacking News", "News"], "authur": "Arslan Butt", "body": "The Department for Digital, Culture, Media and Sports (DCMS) is planning to setting up a £13.5m cyber security center in East London. This center will bring together industry, researchers and investors to help them identify new security problems and to develop innovative strategies to help solve and address them.This London Cyber Innovation Centre will be based in Stratford at the Queen Elizabeth Olympic Park. This park is already a hub to a growing bundle of technology businesses. This center will be inspected by the innovative community Plexal.This center will create up to 2,000 new jobs in the UK’s cyber-security sector as claimed by the government. Digital Minister Margot James states that, “London is the undisputed leader of European tech, with billions of investment flowing in every year and world-leading firms developing ground-breaking innovations.”She further added saying that, “This new center in the Olympic Park will build on the site’s legacy of excellence and spark a wave of creativity to develop the cyber security technology of the future and help protect the nation’s industry.”The investment made for this cyber-security center is taken for a five year, £1.9bn investment program that was announced by former chancellor George Osborne in 2015. Establishments working through this scheme will receive a lot of support from some leading security authorities; they will work with larger tech firms to help identify some crucial threats and challenges regarding cyber-security.The government anticipates that at least 72 companies will be taking advantage of the state-of-the-art center during its three-year lifespan.The companies will also get access to international support through the Global Ecosystems Partnership in Innovation & Cyber Security. Start-ups that are not accepted in the program will be able to access the center’s support and facilities up to a limit.Plexel founder and CEO, Claire Cokerton says that, “The UK has a strong heritage in tech innovation and a fertile business environment for start-ups to grow. But our future international standing as a world-leading digitally-enabled economy depends on a robust and forward-thinking cyber security sector.”She further added, “The center will help this to develop by delivering bespoke business development programs, engineering resource, professional services, access to corporate buyers and ambitious investors. Our mission is to bring the whole industry together to accelerate innovation, entrepreneurship and business growth for UK plc.”Plexel focuses on specializing new business with artificial intelligence, augmented reality and the internet of things. They even launched a development program for women-led cooperation which was called Plexiglass.Robert Hannigan, former GCQH director says that, “The London Cyber Innovation Centre will be the launch pad for a whole generation of new cyber security companies, benefiting both the UK’s economy and its security. By combining academic excellence, expertise in innovation and access to investment, the Centre is uniquely placed to secure this country’s preeminent position in cyber security.”Source: Computer Weekly"}, {"title": "Vevo Youtube Hacked And The Most Viewed Video Of All time Removed", "date": "April 12, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Michael Wight", "body": "Vevo suffered a shocking and devastating blow as their official Youtube account got hacked last night. Vevo is one of the most well known and popular video hosting companies and hosts a number of popular music videos on its YouTube channel as will.The hackers didn’t just hack the account and let it be but started removing popular music videos including the most viewed video of all time, Despacito, which had over more than 5 billion views. There were many other videos too that were defaced.Who Are The Hackers?The group behind the hack calls itself as Prosox and Kuroi’sh. They changed the official Vevo’s image with a gang of masked individuals carrying guns (an image from Casa De Papel, a Netflix show).Reports say that the account was pretty easy to hack as there was no proper security on this account, including a lack of two-factor authorization. This is because most corporate accounts do not use such security as it can make it difficult to run a page.Which Other Music Videos Were Compromised?Following the removal of Despacito, there was a chain of defacing music videos which included a few of Shakira’s music videos, and videos from other singers including Drake, Selena Gomez, Key Perry and even Taylor Swift. The hackers didn’t just change the images but also added a call to Palestine message as the title.What Steps Were Taken By Vevo?When they monitored suspicious activity, Vevo disabled access to the users and started working on the problem. According to the officials, the affected videos will soon be reinstalled on the servers but it is not sure if the lost views would be added again.The hackers only deleted video and changed the image and did not take any other step, such as redirect the page to any other link or steal money from it.The BottomlineThe security breach is being looked into but there’s no sign of the hackers being apprehended as of yet. Vevo Youtube hacked is definitely a big news, but are there more such hacks coming?Source:https://www.wired.com/story/despacito-hack-vevo-youtube/"}, {"title": "SAS Cyber Attack Training For The Over 60’s: What Is Scam Avoidance School?", "date": "April 11, 2018", "topics": ["Did you know ?", "Hacking News", "News", "Uncategorized"], "authur": "Arslan Butt", "body": "It doesn’t matter if you are an individual or if you run your own business, everyone and everything is susceptible to scams and cyber-hacking.  People over the age of 60 are increasingly vulnerable to online scams according to Santander and so they decided to take the over 60s back to school and launched a SAS, Scam Avoidance School to help older people avoid scams and handle this cyber terror.Santander carried out a research amongst people in this age group to figure out what scares them the most when it comes to fraud attacks and scams. They even took help from the expert Dr. Paul Seager who is a Psychology Professor at Lancashire University.This Scam Avoidance School has been designed especially for people over 60s and was rolled out across all of the Santander’s 806 branches last month and asked their staff to deliver which led to ‘tens of thousands’ of people over the age of 60 to book for this course.The lessons SAS School give require interactive studies and even a handout that the people can take away. The handout covers the tricks that scammers use to attract people towards them and the handout even tells them how to spot an email or a text that might be a con. These lessons even cover cashpoint fraud and contactless fraud that the research proved was the main concern for people over 60s.Former Strictly Come Dancing Head Judge, Len Goodman age 73 was the first graduate of Santanders SAS. He not only wanted to do all that he can for people over the age of 60 but he also wanted them to recognize the tricks scammers use. Len Goodman was the first to sign up to this School and had a personal experience of fraud as well, when his daughter-in-law lost £16,000 to these scammers.Santanders research revealed that 64% of people over the age of 60 are worried about the threat of fraud and 53% of people above the age of 60 have been targeted by these scammers. What makes these older people highly susceptible is that they were vulnerable due to a disability or illness (74%), some are financially unaware (54%) and some are left on their own (37%).Those who had fallen into the scam admitted to being ill at the time and Age UK figures shows that those who got defrauded are 2.5 times more likely to either go into residential care or die within a year.The head of fraud strategy at Santander UK, Chris Ainsley commented saying that, ““Our SAS has been developed to address the fact that more needs to be done to help older people who may be vulnerable to falling victim to fraudsters and scammers. Our research has given us important insight into what really worries them, and of course our own data provides a picture of the kind of scams that they are falling for.”Source: MFG"}, {"title": "Great Western Railway – Target Of Cyber-Attack", "date": "April 11, 2018", "topics": ["Cyber Attack", "Hacking News", "News"], "authur": "Arslan Butt", "body": "Great Western Railway (GWR) is urging their customers to reset their passwords immediately after confirming that it was a target of a cyber-attack. The train operator confirmed this by saying that they have identified a series of automated attempts to access “a small percentage” of customer accounts on their website.GWR claims that around 1000 accounts were accessed and they have started notifying their customers. They further added saying that no financial information has been compromised in this cyber-attack.A Great Western Spokesman said that, “We have identified unauthorized automated attempts to access a small number of GWR.com accounts over the past week.” He further added saying, “While we were able to shut this activity down quickly and contact those affected, a small proportion of accounts were successfully accessed.”The security staff believes that the attacker “harvested” the private details “elsewhere” instead of hacking in to the systems to collect customer data. The company says that the cyber-criminals got ahold of the account details from other parts of the web and tried to catch and attack customers who have poor password habits.GWR has been assuring their customers that their bank card details are not compromised as they stored no usable bank information on their servers; saying that, “Our security systems mean that financial information is encrypted to the high standards customers would expect, and no unencrypted bank card information is stored in GWR.com accounts. We are contacting other GWR.com account holders to let them know what’s happened and encourage them to check, and change their passwords.”The firm believes that the information that the hackers received for the automated attack has come from details in the other recent cyber-attacks and has started to urge their customers to strengthen their password security. The company believes that this kind of an attack is experienced on a daily basis all around the globe and it reminds people of how important a good password practice is.GWR further claims saying that they have acted quickly and decisively by taking help from their partners to protect their customer’s data and stop such an attack from happening again.Rashmi Knowles, a cyber-security expert was impressed with Great Western Railways response and added saying that consumers should use the incident as a motivation to focus on improving their own security. She added saying that, “It is good to see Great Western Railway taking a proactive approach to helping customers stay safe online by flagging that some accounts have been accessed, even though GWR itself has not been hacked.”She even assessed this cyber-attack by saying that, “In the wake of large data breaches, we often see large caches of credentials go on sale on the dark web. Hackers know that consumers use the same passwords for multiple accounts, and that these credentials will open doors into emails, banks, or in this case railway accounts – I would suspect that is what is happening here, and that GWR accounts have been accessed by people trying their luck with stolen credentials.”Knowles claims that it is important to practice good cyber hygiene an if your account has been attacked or compromised that you must update your accounts immediately.Source: Sky News"}, {"title": "Latest Hacking News Podcast #9", "date": "April 11, 2018", "topics": ["Hacking News", "News", "Podcasts"], "authur": "William Fieldhouse", "body": "Here we have episode 9 of our daily podcast. Remember to subscribe or find our daily news app on Alexa if you would like to hear them daily.Podcast: Play in new windowSubscribe: Apple Podcasts | Android | Email | Stitcher | TuneIn | RSS"}, {"title": "YouTube Hack Caused a Number of High-Profile Music Videos to be Defaced", "date": "April 10, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Hackers have gained access to a number of high profile YouTube music channels today. The most viewed video of all time Despacito was defaced by Hackers. The thumbnail of the video was replaced with a gang holding guns, which is a scene from a Netflix TV show named Casa De Papel. The Hackers called themselves Prosox and Kuroi’sh.Apart from Despacito a lot of other music videos also got hacked. Videos from Chris Brown, Shakira, DJ Snake, Selena Gomez, Drake, Katy Perry, and Taylor Swift. While some of the videos are still available with defaced titles and thumbnail images. It is not clear whether the hackers have gained access to only individual artists Vevo accounts or if it is an entire company-wide exploit. The hackers are claiming that they used a script to change the name of the YouTube video titles. At the time of the hack it was unknown whether the hackers have gained access to the individual YouTubers VEVO accounts or have written a malicious program that actually affects the video titles of YouTube. A few hours after, the videos were changed back to their original state.All the artists targeted by the hacker run their YouTube account via Vevo, a multinational video-hosting service established in 2009. We cannot confirm that if YouTube was hacked as of now but the company is still yet to issue a statement about this event.Take your time to comment on this article.Source: The Verge"}, {"title": "Iran Under Cyber Attack With U.S Flag On Screens", "date": "April 10, 2018", "topics": ["Cyber Attack", "Hacking News", "News"], "authur": "Arslan Butt", "body": "Hackers have attacked networks in multiple countries including the data centers of Iran where the hackers left an image of United States flag on their screens along with a message warning them. The message read, “Don’t mess with our elections” as claimed by the Iranian IT ministry on Saturday.The Communication and Information Technology Ministry pronounced in a statement carried by Iran’s officials news agency, IRNA, that, ““The attack apparently affected 200,000 router switches across the world in a widespread attack, including 3,500 switches in our country.”The statement said that the attack which hit the internet service providers (ISPs) was knocked offline for the subscribers allowing no web access made possible due to vulnerability in the routers from Cisco.Cisco had issues a warning earlier regarding this weakness in their routers and even provided a patch that some firms had failed to install during the Iranian New Year holiday. A threat researcher Nick Biasini who works at Cisco’s Talos Security Intelligence and Research Group said in a blog published on Tuesday that “There have been several incidents in multiple countries which includes some specifically targeting critical infrastructure and have involved the misuse of the Smart Install Protocol.”He further added saying that as a result of this hacking they are now taking an active stance and are urging customers once again about the “elevated risk and available remediation paths” on the Cisco router.On Saturday evening, Cisco claimed that those postings were a tool to help their clients identify the vulnerabilities and learn how to repel a cyber-attack. Minister Mohammad Javad Azari-Jahromi, Iran’s IT Minister posted a picture on twitters which contained the US Flag and the hacker messages and added saying that it is still not clear who carried out the attack.Azari-Jahromi claims that the attack mainly affected India, Europe and the United States as reported by the state. Asari-Jahromi was quoted saying that, “Some 55,000 devices were affected in the United States and 14,000 in China and Iran’s share of affected devices was 2 percent.”In another tweet, Iran’s IT Minister was seen mentioning that the computer emergency response body MAHER had demonstrated “weaknesses in providing information to the companies that were affected” after the cyber-attack which was disclosed on Friday and was late in being detected.The Deputy Head of the state-run Information Technology Organization of Iran, Hadi Sajadi said that the attack was neutralized with hours and there was no loss of data.This attack on the servers in Iran comes as Iran itself is producing smart and skilled hackers that are getting busted by the United States. In one of the Department of Justice’s (DOJ) major state-sponsored cyber-theft cases the Federal prosecutors’ unsealed cyber-criminal charges that involved 9 Iranians. These Iranians allegedly burglarized data from some US organization as well as overseas in late March. At that time 31 terabytes of data was stolen by these hackers as claimed by the Prosecutors.This 31 terabytes hack included 144 U.S universities,  5 U.S government agencies to get financial aid and 36 U.S Businesses.\nSource: ITProPortal"}, {"title": "Latest Hacking News Podcast #8", "date": "April 10, 2018", "topics": ["Hacking News", "News"], "authur": "William Fieldhouse", "body": "Here we have episode 8 of our daily podcast. Remember to subscribe if you would like to hear them daily.Podcast: Play in new windowSubscribe: Apple Podcasts | Android | Email | Stitcher | TuneIn | RSS"}, {"title": "Atlanta SamSam Cyber Attack Continues: City Held To Ransom", "date": "April 10, 2018", "topics": ["Cyber Attack", "Hacking News", "News"], "authur": "Arslan Butt", "body": "As Amanda Noble, Atlanta City Auditor logged onto her work computer on March 22nd, she immediately knew something was wrong. The icons on her desktop were changed and some were even replaced with black rectangles. She even noticed that many of the files on her desktop had been renamed with “imsorry” and “weapologize” extensions.Amanda immediately called the citys chief information security officer to report this unusual problem and left a message. The next call she made was to the help desk and they left her on hold for a while. Amanda soon realized that she wasn’t the only one in the office with this computer problem.These computer problems were all part of a very sophisticated “ransomware” cyber-attack on the City of Atlanta. This cyber-attack lasted for two weeks and has yet to be resolved completely. During that time of 2 weeks the metropolis struggled to recover the encrypted data from the employees computers and to restore the services on the municipal Web site.The cyber-criminals at first gave the city only a week to pay a fine of $51,000 in crypto-currency bitcoin to get the key for decrypting their data. This deadline came and went last week however several services still remain offline. Since the website are still knocked off this suggests that the city did not pay the required ransom and when the City Officials were contacted by Scientific American, they refuse to comment.The Department of Watershed Management is still not able to accept online payments for water or sewage bills or any calls; neither can the Department of Finance issue any business licenses through their web page. Even the Atlanta Municipal Court is not able to process any ticket payments online as well as in person due to this outage and they had to reschedule their hearings.According to Anne Torres, Atlanta’s director of communications, Atlanta city took down two of their online services voluntarily for security measures and these services are the Hartsfield-Jackson Atlanta International Airport’ Wi-Fi network and also the took down the ability to process service requests through the citys 311 Web page portal. Both have been restored on Tuesday Morning with the Wi-Fi back on.The ransomeware that attacked Atlanta is called SamSam and like all other malicious virus it enters the computer networks through a software that has not been updated. As soon as the hackers find any vulnerability in a certain network they use the malware to encrypt files and then demand money to unlock the encrypted files.Jake Williams the founder of computer security firm, Rendition Infose says that, “The SamSam ransomware used to attack Atlanta is interesting because it gets into a network and spreads to multiple computers before locking them up.” He further added saying that the victim then has a greater incentive to pay a large amount of money as ransom to gain back the control of their network and locked computers.SamSam has been the most successful ransomware up till now and has managed to pull $850,000 in ransom money.Source: GIZMODO"}, {"title": "Third Largest Data Breach In Finland", "date": "April 10, 2018", "topics": ["Hacking News", "News"], "authur": "Michael Wight", "body": "More than 130,000 of Finland residents login and passwords got compromised by hackers recently. This hack was performed on a website looked after by The New Business Center located in Helsinki. This website manages business plans and provides advice to entrepreneurs . This is being called the third largest data breach in the country and has set off several alarms.Which Website Was Hacked And How Were The Accounts Compromised?The website that held login credentials of many Finland residents was liiketoimintasuunnitelma.com. It is believed that it was very easy to hack the website because usernames and passwords were stored in plain-text without any security measure. This made it easy for hackers to not only hack the site but also get access to the login details.What Steps Were Taken?The website was taken down soon after the hack and all the users were advised to change their credentials. The homepage showed this message to the visitors:The company also ensure that no sensitive information was leaked because detailed information of users is stored on a different server, which did not fall victim to the attack.The BottomlineThe hackers are still at large and concerned authorities are looking into the matter and searching for the hackers responsible for this act. "}, {"title": "Were Russians Behind The Olympics Hack Of 2018?", "date": "April 9, 2018", "topics": ["Cyber Attack", "Hacking News"], "authur": "Arslan Butt", "body": "At the Winter Olympics of 2018, Russian military spies are believed to have hacked 100’s of computers and attempted to put the blame on North Korea. US intelligence officials spoke to the Washington Post anonymously and claimed that the Russian agents attacked around 300 computers that were being used by the Olympics Authorities.These Russian agents managed to hack routers and even distributed a new malicious virus leading up to and during the Olympics opening ceremony which was held in Pyeongchang, South Korea.Earlier in the month of February, Olympic officials confirmed that the Games were attacked by cyber-criminals during the opening of the ceremony on February 9th. This cyber-attack resulted in the official Pyeongchang site to go offline and the Wi-Fi networks in the stadium were also disrupted which led to Internet Protocol Televisions (IPTVs) to not work at the Main Press Center.The officials refused to let the public know who was behind this cyber-attack. The cyber security researchers at Cisco’s Talos, CrowdStrike and FireEye have identified this malware as the Olympic Destroyer and they believe that its main aim was to destroy targeted systems and wipe any file on the shared network drives. It also caused the website to shut down for over 2 hours which left many attendees unable to get a ticket for the ceremony.Security experts believe that this attack was carried out to embarrass the organizers and ruin their event instead of stealing data. When speaking to The Post, two US officials claim that Russia’s military intelligence agency, the GRU, is behind this attack and that the Russians infiltrated 300 computers which had data regarding the Olympics. They also added saying that the GRU made the attack seem like it was carried out by North Korea and their hackers by using North Korean IP address. They said that this tactic is known as the ‘false-flag operation’.It is still not clear whether the Russians wanted to disrupt the opening ceremony or steal the data. The hackers who did this dirty work are believed to be working for GRU and are the same experts who carried out the NoyPetya cyber-attack. The NoyPetya attack of 2017, took down a large number of computers in Ukraine.Officials believe that this Olympic attack was carried out in retaliation due to the decision made by the International Olympic Committee to ban Russia from the games. This decision was made over the alleged state-sponsored doping scandal. Some Russian athletes did compete in this game but were under a neutral flag as the “Olympic Athletes from Russia”US officials were worried about the closing ceremony of the winter Olympic back then and claimed that they were watching it closely and will help the Koreans as they request it.Prior to the Games, Russia has denied any hand in the Cyber-attacks that targeted the event and tried to disrupt it. The Russian ministry told Reuters at that time, “We know that Western media are planning pseudo-investigations on the theme of ‘Russian fingerprints’ in hacking attacks on information resources related to the hosting of the Winter Olympic Games in the Republic of Korea. Of course, no evidence will be presented to the world.”Source: The Verge"}, {"title": "Your Headphones Can Spy On You!", "date": "April 8, 2018", "topics": ["Cyber Attack", "Did you know ?", "Hacking News"], "authur": "Arslan Butt", "body": "Guarded computer users tend to put a piece of tape over their webcam. The truly paranoid ones freak out about their microphones, some even try to open up their computers and cell phones to try and disable the audio component from their devices so that their device cannot be hijacked and taken over by hacker.A group of Israeli researchers took control of the ‘spy-versus-spy delusions’ dilemma and introduced a malware that may be able to convert your headphones into a makeshift microphone that will start to record your conversations.\nThe group of Israelis belonging to Israels Ben Gurion University produced a concept code as a piece of proof called “Speake(a)r” and this was designed to exhibit how hackers will find a way to stealthily hijack your device to record audio and the worst part is that these hackers will be able to record your conversations even when you remove or disable your microphones.This preliminary malware changes the speakers in the ear buds of the headphones and uses it as a microphone. This further leads to converting the vibrations into electromagnetic signals. This allows the cyber-criminals to capture the audio very clearly even from across the room.The research leader of the group from Ben Gurions, Mordechai Guri says that, “People don’t think about the vulnerability in privacy. Even if your microphones are removed from your computer- your headphones can help record conversations.”It comes as no surprise that ear buds can be used as a microphone as well and you can watch many YouTube videos that demonstrate this procedure. The malware which still has no name; used the RealTek audio codec chips and using this chip the Ben Gurion researchers silently repurposed the computers output channel to an input channel. This altering of the channels allowed the malware to record audio even with the headphones plugged into an output only jack.The headphones can be hacked in such a way that they will allow you to record the conversations even without the presence of a microphone channel. The researchers further said that the RealTek chips are incredibly common due to which the attack can work on any desktop computer whether it is based on an iOS or Windows.These eavesdropping attack mostly matter to those who have been cyber-robbed before and have fallen down the hole of obsessive security measures. But in this modern age there are many techniques that can help you get rid of the laptops microphone by putting a tape over it as demonstrated by Mark Zuckerburg and you can even remove the internal mic from your phone. However, Guri claims that none of these techniques can defeat the malware.Until then, paranoiacs must take note and know that if a determined hacker is out to hear your conversations then removal surgery will not work; you will have to unplug the cheap headphones and throw them away.Sources: Independent "}, {"title": "LAPD Twitter Account Was Hacked", "date": "April 5, 2018", "topics": ["Did you know ?", "Hacking News", "News", "Tech"], "authur": "Arslan Butt", "body": "The hacker gained access in to their twitter account to proclaim that the members of the LAPD police force are “white supremacists”. The twitter account contains 93,601 followers and at 1:53PM local time a tweet was posted that said, “Lapd WHITESUPREMACISTS”However, the Police department was quick to act and the tweet was taken down in 5 minutes but some eagle-eyed social media followers were quick to take a screenshot of the insulting post and let the department know. The twitter followers even wrote out their own tweets asking LAPD if they were okay and told the LAPD HQ to get it together.The LAPD’s public information director Josh Rubenstein confirmed that the twitter account was in fact hacked and claimed to the Los Angeles Times that they are now working to lock it down. It is still not known who the hacker was and how the hack was carried out, no individual has come forward to claim responsibility for the insulting tweets. Furthermore, officials do confirm that this tweet was not posted by anyone from the LAPD staff.The LAPD later tweeted out that “We are aware that out # LAPD account was compromise and we are not taking proper steps to solve this issue.” In a separate tweet LAPD even wrote that, “Earlier today LAPDS Headquarters Twitter account was compromised and it proved that the cause was vulnerability in a third-party social media application”They further continued saying “ We have and will continue to work with Twitter to increase protection on our social media account” This intrusion is not something new since police departments, schools and government organizations have been targeted by these hackers and pranksters for a while now.Just last week the Colorado Department of Transportation was attacked by the SamSam ransomware and this virus forced them to shut down 200 of their computers. Furthermore, the computer systems in Allentown, Pennsylvania was also hit with an expensive virus which involved the Emotet Trojan and it also forced them to turn off multiple systems making the situation very critical. The hacker-attack on Allentown will cause the city an estimated $1 million to help them recover as it caused a lot of damage.Anyhow, Twitter hacks are becoming increasingly common with various celebrity profiles, accounts of government officials being hacked and being taken over. In January the accounts of top Indian diplomats Syed Akbaruddin and the World Economic Forum’s president Borge Brende also had their accounts hijacked.In 2016 and 2017 the hacking OurMine hacked the accounts of many high-profiled personalities and let a similar message that was later called their signature message that said “testing your security” and even asked the account owners to contact them directly.Sources: Daily News"}, {"title": "Uber Got Hacked!", "date": "April 4, 2018", "topics": ["Did you know ?", "Hacking News", "News"], "authur": "Arslan Butt", "body": "The private details of almost 57 million Uber clienteles were stolen in a data breach of 2016. Uber somehow managed to cover up the loss of their information for over a year but here is what we know about this hacking up till now.The ride-hailing company was hacked in such a way that the customer and drivers information was stolen from its system in this security breach. Uber confirmed that they have paid their hackers $100,000 to delete the stolen data and to keep this mess away from public eyes as reported by Bloomberg.Uber’s Chief Executive, Dara Khosrowshahi claimed in a statement “None of this should have happened, and I will not make excuses for it,” while acknowledging the breach and trying to cover it up. He also said that “While I can’t erase the past, I can commit on behalf of every Uber employee that we will learn from our mistakes.”These hackers only stole personal data which included their names, email addresses, phone addresses and the name and license number of over 600,000 drivers in the United States. However, highly sensitive information such as credit card numbers, bank account number, birth dates, social security numbers and data location were not compromised and are still secure with the company.Khoswrowshahi also exclaimed that the downloaded and stolen data has been destroyed to provide assurance to their customers and their company has increased their security as well. The company’s failure to notify the affected individuals and regulators has made Uber take some serious steps which included the firing of their two employees that were responsible for the response in 2016.Joe Sullivan Uber’s Chief security officer was one of the employees who left the company as reported by Bloomberg. Chris Hoofnagle from Berkeley Center of Law and Technology agrees that the company’s refusal to unveiling the hacking was an unprofessional move and he says that “To have direct liability under security breach notification status is to not give notice.”According to the Californian State Law, companies are required to notify the resident of the states regarding any breach of their encrypted information and the company must also inform the attorney general if over 500 residents have been affected in any breach or chaos of such kind.An Uber driver from Pittsburgh, Robert Hudge says that “The hack and the cover-up is typical Uber only caring about themselves” and he said this because he has still not heard from the company and he found out about this breach through the media. He also claims that Uber keeps everything that goes with them behind their walls.Uber offered their affected drivers free credit observation and identity theft protection.  The hacking and concealment of this chaos is the latest scandal and Uber’s civil liability is complicated on United States federal court and how to treat these data breached lawsuits.However, in February, a former employee, Susan Fowler blamed the company for gender discrimination and sexual harassment. The CEO again gave out a statement claiming “On behalf of everyone at Uber globally, I apologize for the mistakes we’ve made.”Sources: Wired.com"}, {"title": "WannaCry Is Back!", "date": "April 3, 2018", "topics": ["Cyber Attack", "Did you know ?", "Hacking News", "News", "SPY"], "authur": "Arslan Butt", "body": "WannaCry virus is back and is now attacking Australian traffic cameras and even caused a Honda Plant in Japan to shut down. Honda Motor Company had to halt their vehicle production after they found WannaCry ransom ware in their computer network.The Sayama Plant of Honda in northwest Tokyo produces an output of 1000 vehicles on average and their models range from Accord to Odyssey. However, this plan was forced to close down on June 19 Monday due to the ransom ware that was discovered on Sunday, June 18.  The production has continued up to today but the data breach left a lasting effect.A spokesperson from Reuters that the virus not only attacked networks in Japan but also in North America, China, Europe and other regions. These regions tried very hard to secure their systems in Mid-May when it was on its peak but still these efforts weren’t enough to stop it.The WannaCry virus found a weak spot in the Sayama plants operational system. The plant was using Microsoft’s Windows 10 operating system and the virus used a backdoor to enter the systems and seize it. At first it looked as if the Sayama Plant was the only Honda production facility that was affected but Renault and Nissan were affected in a similar way by WannaCry last month.This caused their production to be stopped forcefully in Britain, India, France and other countries.  Securities have warned these companies that after this attack other iterations of viruses could come in as well. However these plants were not the only thing affected by WannaCry; this virus even affected the traffic camera’s in Australia.The Victoria Police confirmed that the virus wreaked 55 traffic cameras as well as speed cameras that were operated by a third-party, Redflex. The police claimed in a statement that the virus has been detected however the camera system was affected. The police decided to look into the incidents identified by speed and red light camera throughout the time in question. The integrity of the camera system was not affected.The security officials from UK claim that WannaCry ransom ware has ties with a hacking group in North Korea. According to BBC’s report they believe that this attack was launched by a group called Lazarus. This group is strongly connected to North Korea and this is not the first time Lazarus has been connected with ransom ware.Symantex says that it is sure that WannaCry ransom ware is connected to Lazarus. Lazarus is also the cybercrime organization that is responsible for the hack in Sony Pictures and that stole millions of dollars from the Central Bank in Bangladesh. When Symantec’s Security Response Team, carried out an analysis of the WannaCry attacks they unraveled that the ample commonalities in techniques, the tools use and infrastructures were similar to the previous Lazarus attack making it very unlikely that Lazarus is behind this attack by WannaCry. Sources:     Forbes  , Wired"}, {"title": "Aadhaar Information Hacked For Just $5", "date": "April 3, 2018", "topics": ["Did you know ?", "Hacking News", "News", "SPY"], "authur": "Arslan Butt", "body": "Aadhaar is the world’s largest Biometric ID system and it keeps getting hacked making the personal data of many India’s citizens only and up for grabs. The critics of India’s Aadhaar system have been very vocal about the flaws of this Biometric system however the world refused to listen to them.However with the latest list of security breaches it is very obvious that Aadhaar is no longer protected. The Tribune newspaper was able to buy the data through Paytm in just 10 minutes and only for $5. The agent running this group gave access to a gateway and gave them a login ID and password to enter into any Aadhaar number in the portal. Not only were they able to buy the data but they could even buy the software that will help them print fake Aadhaar cards as well.Aadhaar’s data includes fingerprints, names, addresses, retina scans and phone numbers, through which you can purchase SIM cards, open a bank account and even use it for important government services. The information that was exposed did not include any biometric data but contained personal information regarding name, emails, photographs and phone numbers.The UIDAI (Unique Identification Authority Of India) claims that over 1.20 billion people have registered in the system since the early 2009. The cofounder of Internet Freedom Foundation, Kiran Jonnalagadda told the Motherboard that, “I’m not very surprised with this breach but I am surprised at how widespread the access was”Even before this WhatsApp hacking took place Aadhaar’s was having a bad security record for some time. In July, almost 200 government agencies posted sensitive Aadhaar data online furthermore this news came after 600,000 children had their data disclosed by another government website again leaking information that was very personal.This was not enough; right away the revelation of this, an online researcher hacked in to Aadhaar’s official Android app to prove that it was poorly secured. This online researcher, going by the name of Elliot Alderson showed that the app has very poor security and further claimed that it is super easy to get the password of the database of the app.He claimed that Aadhaar saves your biometric settings in a local database and you can enter in it using a password that you can guess. Aadhaar is in actual fact becoming de facto essential with more and more people trying to link it with banks and phone accounts. The UIDAI officials in Chandigarh were very shocked on this data being accessed and immediately took up the matter with technical consultants.So in short, everyone’s personal information is at a great risk and the only way to stop this from happening is to cause more precautionary measures and better hacking protection.Sources: IndiaTimes."}, {"title": "150 Million MyFitnessPal Users have been hacked", "date": "March 31, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "According to Under Armour Inc’s statement on Thursday, data of 150 Million users have been hacked. As the name suggests MyFitnessPal is a fitness app helps its users to regulate their diet. The app allows customers to monitor their calorie intake and measure it against the amount of exercise they are doing using a database of more than 2 million foods. It was founded in 2005 by brothers Mike and Albert Lee.The stolen data includes account usernames, email addresses and hashed passwords, social security numbers, drivers licence numbers and payment card information.It is one the largest breaches this year according to security scorecard. The Biggest hack includes the compromise of the three billion Yahoo accounts followed by an adult website named FriendFinder networks in 2016.Under Amour published a statement that it is working with various data security firms and law enforcement agencies but it didn’t provide the details of how hackers got into the network and accessed the data without being noticed.Under Armor said in an alert on its website that it will require MyFitnessPal users to change their passwords, and it urged users to do so immediately.“We continue to monitor for suspicious activity and to coordinate with law enforcement authorities,” the company said, adding that it was bolstering systems that detect and prevent unauthorized access to user information.Under Armour started notifying its customers about the breach after four days of the event. While the company Under Armour bought MyFitnessPal in 2015 for $475 Million and it is part of the company’s fitness division whose revenue accounted for 1.8 percent of Under Armour’s $5 Billion in total sales.Take your time to comment on this articleSource: The Guardian, Reuters"}, {"title": "Boeing was hit by WannaCry Ransomware", "date": "March 29, 2018", "topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "On Wednesday WannaCry Ransomware has attacked Boeing, The company’s chief engineer published a memo saying that the ransomware may have encrypted the aeroplane production tools. He reportedly expressed concern that the virus could reach the equipment used in practical tests of aeroplanes before they’re put in service, and eventually into the aeroplane software itself.We are on a call with just about every VP in Boeing,” VanderWel wrote, according to the newspaper.Following the report, Linda Mills, the vice president of Boeing’s commercial airlines communications, released a statement clarifying what happened.“A number of reported articles on a malware disruption are overstated and inaccurate,” Mills said. “Our cybersecurity operations center detected a limited intrusion of malware that affected a small number of systems. Remediations were applied and this is not a production or delivery issue.”VanderWel’s said the attack claimed “a batterylike response,” a reference to the 787 in-flight battery fires in 2013 that grounded the world’s fleet of Dreamliners and led to an extraordinary three months long planning effort to find a fix.It took until late Wednesday evening before Boeing issued a report dialling back the fears.“It took some time for us to go to our South Carolina operations, bring in our entire IT team and make sure we had the facts,” Mills said.The Ransomware exploits a flaw in Windows Operating System Design to gain access to a network, attacks computer using “Ransomware”. It was designed to lock users out of their data by encrypting files until they pay the Ransom. Ransomware attacks have increased in recent years. The city of Atlanta experienced a five-day ransomware attack that was mostly fixed by Tuesday. The WannaCry virus first seen in a May 2017 worldwide cyberattack. Once a single machine is infected, it can spread to all Windows computers on a network. Microsoft declined to comment on the Boeing cyber­attack.Take your time to comment on this article.Source: The Seattle Times, The Hill"}, {"title": "Denmark Is Amongst The Countries That Suffer From Lowest Numbers Of Cyber Attacks, According To A Report.", "date": "March 24, 2018", "topics": ["Hacking News", "News"], "authur": "Arslan Butt", "body": "Based on the study of data from 400 billion emails and 18 million websites, Microsoft’s Security Intelligence Report declares Denmark as a country that falls victim to the fewest cyber attacks.Microsoft Denmark director said that consumers, vocational and communal institutions in the Scandinavian country must continue to emphasize heavily on cyber security, despite the positive perspective of the report from a Danish point of view, given the country’s distinction as a highly digitized society.He further explained that establishment of strong security procedures, a good security culture; use of modern technological solutions along with a look for insights into the threat picture is momentous for companies.Microsoft Denmark’s director of security and technology “Ole Kjeldsen” told Ritzau that it is also paramount for the organizations that they put together a policy for how they not only safeguard themselves against attacks but also how they encounter a cyber criminal getting in behind the walls.Ole Kjeldsen declared that no ransomware-type outbreak was traced to Danish computers but still it is not for sure that none actually had taken place.Kjeldsen declared the last few years to have come along with some serious headlines about large, universal organizations being hit by malware affecting the bottom line. He painted a picture of more barbaric hackers with more refined equipment at their disposal and advised the organizations to always stay conscious of current cyber security threats and plan strategies to cope cyber attacks they meet.400 billion emails, 450 billion logins and 18 million websites are scanned by Microsoft every month for security breaches.The information from data ranging the period between February 2017 and January 2018 is the basis of the Microsoft Security Intelligence Report.Source: Thelocal"}, {"title": "Public-Private Cybersecurity Center Opens for Business in Sydney", "date": "March 23, 2018", "topics": ["Hacking News", "News"], "authur": "Arslan Butt", "body": "The 4th Joint Cyber-Security Center is now officially opened in Sydney, almost a year after the 1st was launched in Brisbane.\nThe government of Australia has now officially opened the Sydney Joint Cyber Security Centre (JCSC).Angus Taylor, the Minister for Law Enforcement and Cyber-Security was of the view that this centre is a hub which provides a platform to businesses and government so that they can improve cyber-security practices and safely exchange information. He further stated that cyber-security risks are an evolving process, so we need to make sure that we have a variety of strategies to protect our digital borders from any cyber-attack in a very proficient manner.The five JCSCs are aimed to boost the cyber-security resilience in the country.The first JCSC that was opened in Brisbane in the month of February 2017, was originally slated to open late in 2016. The Brisbane centre has several representatives from the government agencies and law enforcement departments of Australia and Queensland.The Sydney JCSC was actually started in the month of December alongside the Perth centre, located in the city’s CBD on William.CERT reports that the Perth JCSC has collaborated with oil and gas, academia, mining, state government, and many other major groups of the industry since its launch.The Melbourne centre which is located on Bourke Street, has been working actively since October 2017; and the staff of the Adelaide center is presently working in a location which is temporary. (until a permanent place is found for the JCSC).Prime Minister Malcolm Turnbull has launched the country’s cyber-security strategy in the month of April 2016. Its primary motive is to protect the country’s cyber-networks from cyber criminals and sponsored attackers and sits right beside the AU$400 million that is provided in the Defense White Paper for such cyber activities.Source: ZDNet"}, {"title": "Are Russian Hackers In Control Of US?", "date": "March 18, 2018", "topics": ["Hacking News", "News", "Tech"], "authur": "Arslan Butt", "body": "A joint report released on Thursday by the FBI and the Department of Homeland Security claims that US has now accused Russia of breaching cyber-security and have now allowed Kremlin access to not only water facilities and other infrastructure but also access to American nuclear power plant.The report further affirms that the Russian hackers installed a virus into the important energy systems and conducted a phishing operation which allowed them to acquire entry into not only the Nuclear power plant of US but also computer system network which manages other commercial facilities.Eric Chien, who is a cyber-security expert at a digital security firm, Symantec told the New York Times that US now has evidence the Russians are sitting n their machine and can sabotage their industrial infrastructure, control it and also turn it on or off. He further says that they were there and all they require is a political encouragement.Symantec and other firms focusing on cyber security fear these group of hackers as they are intentionally avoided any damage but are in fact gaining access in the computer systems of US to gather information and plan out further attacks using this gathered information.Symantec even picked out a group called ‘Dragonfly’ last October and believes that this group is behind these attacks on the US energy sector.  The chief intelligence officer Jeff Bardin, of a cyber-intelligence firm Threadstone 71 says that Russians are lingering around for an economical emergency so that they can then launch a cyber-attack on a massive scale.The United States can have its own cyber-attack on Russia’s energy sector and make it even but this might lead to exposing of USA’s cyber potential says Bardin an a more intelligent approach to this attack according to Bardin would be by making the Russian’s leader look weak as Russian hate weak leadership.Sources: BusinessInsider"}, {"title": "Hackers Have Bombs To Kill!", "date": "March 17, 2018", "topics": ["Hacking News", "News", "SPY"], "authur": "Arslan Butt", "body": "Today’s advanced Cyber-Attackers have now reached a point where they tried to trigger a deadly explosion. This explosion was supposed to be in a petrochemical plant present in Saudi Arabia in August as reported by the New York Times.The investigators on this news refuse to identify who the culprit attacker was but individuals interviewed concordantly claimed that this blast would have brought about a huge catastrophe.These cyber-attackers planned on triggering a blast but ended up bringing down the system instead, causing it to shut down.  This cyber-attack could easily bring about other similar attacks around the globe and was said to have been backed up by a government, according to the report from insiders.The hackers were not only refined but had assets and a lot of time, indicating that they had great and strong supporters. More than a dozen people involved in this investigation together with the cyber-security experts have asked to remain anonymous for keeping this event under wraps and confidential.The New Your Times Said that the sources objected to naming not only the company managing the plant but also the suspected country behind the hackers. However, security experts did not remain quiet and told the newspaper that Iran, China, Israel, the United States and Russia have the audacity to launch such an attack.This is another cyber-security attack on Saudi Arabia after ‘Shamoon’ which was the disc-wiping virus, and still, Saudi Arabia has not commented on this event yet. The US intelligence claimed ‘Shamoon’ to be the work of Saudi Arab’s rival Iran.Shamoon attacked Saudi Aramco which is the biggest oil company in the world, and this was believed to be the most horrifying cyber-attack yet. However, August Attack was much more dangerous and could be aimed to send a political message.Saudi Arabia was also attacked by a Malware in November that targeted Government computers breaching their cyber-security.Source: TahawulTech"}, {"title": "Georgia Anti-Hacking Legislation a Serious Threat to Cyber-Security Industry", "date": "March 14, 2018", "topics": ["Did you know ?", "Hacking News", "News"], "authur": "Arslan Butt", "body": "Security researchers are extremely worried by The Senate Bill 315 which is also known as the Computer Intrusion Bill has gotten the security researchers extremely worried as it threatens to criminalize them.The bill is expected to expand Georgia’s present computer law to make what it calls a “new” crime of illegal or unauthorized computer access. It has penalties included in it which will be held against the ones who try to breach into a computer system even if no information is damaged or stolen. This could be a threat to Georgia’s cyber-security industry as the bill, if accepted and passed, could lead to the security researchers being penalized for tasks which are necessary to uncover the system bugs.The bill was proposed up by Georgia’s senator Bruce Thompson and was accepted by its Senate. However, progress on the bill was put to an end and was very effectively made dead in its present form on Monday but has after then been revived because there was no substitute bill that could be offered. Craig Young who is a computer security researcher for an organization (Tripwire’s Vulnerability and Exposures Research Team) was of the view that security researchers form the first line of defense against information breaches and other such malicious activities in the cyber world. Ethical hackers find the loopholes in the system and expose them to their vendors/clients so that they can be fixed before they are exploited by unfair means. Serving this purpose is not at all a bad task as it is done with the intent of preventing a crime to occur.He opined that criminalizing “ethical hacking” is indeed a very bad idea as it will help expose consumers to more threats and will consequently harm Georgia’s cyber-security industry. Therefore, only those actions should be penalized which are illegal and have malicious impacts.Source: InformationSecurityBuzz"}, {"title": "Malware dubbed Slingshot targets its Victims through Routers", "date": "March 12, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Researchers have discovered malware that has existed within Routers for the past six years without detection. It has infected at least 100 computers worldwide. The malware goes by the name of “Slingshot”. The name of the malware was found in recovered code samples. Kaspersky Labs published a report saying that the malware can perform advanced attacks.The complexity of the malware shows a similar pattern that affected Belgian Telecom systems. Kaspersky Said:“The discovery of Slingshot reveals another complex ecosystem where multiple components work together in order to provide a very flexible and well-oiled cyber-espionage platform,” Kaspersky Lab researchers wrote in a 25-page report published Friday. “The malware is highly advanced, solving all sorts of problems from a technical perspective and often in a very elegant way, combining older and newer components in a thoroughly thought-through, long-term operation, something to expect from a top-notch well-resourced actor.”The Researchers said that SlingShot is using various methods including zero-day vulnerabilities to spread and has been active since 2012 at least. The Malware also remained operational throughout a 6 year period. The malware hides itself using an encrypted virtual filesystem which is located in unused parts for the hard drive thus isolating from the file system.When an administrator logs in to configure the router, the router’s management software downloads and runs the malicious module on the administrator’s computer. The method used to hack the routers in the first place remains unknown, according to Kaspersky’s statement on Slingshot.After infecting the router, Slingshot downloads an array of additional malware modules onto the device including two particularly sophisticated ones called Cahnadr and GollumApp that are linked and can support each other in gathering information.Kaspersky has published an infographic showing the attack geography of the malware:Take your time to comment on this article.Source: ThreatPost, ArsTechnica"}, {"title": "UK Cyber-Security Pilot Launched", "date": "March 9, 2018", "topics": ["Cyber Attack", "Did you know ?", "Hacking News", "News"], "authur": "Arslan Butt", "body": "The London Digital Security Centre (LDSC) has established a pilot of the UK’s first ever police-backed cyber-security certification plan.This national scheme is being launched in collaboration with the police crime prevention initiative and Secured by Design (SBD), and is also supported by The Mayor’s Office for Policing and Crime, alongside The Metropolitan and City of London Police.\nGuy Ferguson who is the chief executive officer at Secured by Design opined that Police crime prevention initiatives have always given a creative and innovative response to developing and emerging crime patterns. He expressed feelings of delight in working with LDSC to help eradicate the cyber-security from the society.Chris Diogenous who is the chief commercial officer at the LDSC stated that almost 50% of the small corporation in the UK have been the victims of cyber-crime in the last one year and this can now be kept from happening by simple measures that this initiative has to offer. He said that it is for the first time that UK corporations can proudly demonstrate that they have taken all the essential measures to protect their and reduce their overall susceptibility to cyber-crime.John Abbott who is the director of business growth at Yoti was of the view that by joining this new initiative of cyber-security, people can be ensured of their online privacy and security.\nThe London Digital Security Centre is a not-for-profit organization which was founded by Mopac in collaboration with the Metropolitan Police Service and the City of London Police.\nIt works in collaboration with the National Fraud and Cyber Crime Reporting Centre to help prevent corporations falling victim to cyber-crimes.\nThe LDSC gives free, un-biased advice and support to corporations to help them improve their cyber-security and enable them to work in an online environment that is safe and secure.Source: http://www.computerweekly.com/news/252436442/UK-cyber-security-certification-pilot-launched"}, {"title": "Singapore to Start First Cyber-Security Start-Up Hub", "date": "March 8, 2018", "topics": ["Hacking News", "News", "Tech"], "authur": "Arslan Butt", "body": "Singapore is about to set up its first-ever cyber-security start-up hub, with the funds to be provided for new inventions and innovations, as the nation struggles to find a role for itself in the advanced digital economy.\nDubbed Innovation Cybersecurity Ecosystem @Block 71 (ICE71), the hub is expected to open itself up to the cyber-security entrepreneurs next month.\nIt will be situated in a cluster of industrial buildings in the Ayer Rajah Crescent known commonly as the Block 71. This area is presently home to around 700 technology start-ups.\nThe aim is to hand-hold talented entrepreneurs to make sure that their business ideas are sound, and to ensure that they have the basic and essential financial and business knowledge to take their ideas to the next level.\nThe Infocomm Media Development Authority (IMDA) and Singapore’s Cyber Security Agency (CSA) are working in collaboration with Singtel and the National University of Singapore (NUS) to establish and launch ICE71.\nCSA will also start a new funding scheme, separately to initiate developments that can fulfill national security needs, having a belief that innovation is the key to stay ahead of the cyber-criminals and hackers. The areas of focus will include: authentication, forensics, and cyber-security services.\nThe basic motive of this is to develop home-grown companies that have the ability to own a slice of the cyber-security market.\nTo prepare a workforce to serve this purpose, the IMDA will invest an additional amount of $145 million in the development of its tech skills and job placement initiative.\nDr. Yaacob added was of the view that as parliament has just appointed the Select Committee on Deliberate Online Falsehoods to investigate and examine this issue, it would be advisable to study the Select Committee’s recommendations before making any further moves.Source: straitstimes"}, {"title": "NSW Government Agency’s 49-Day Hack Shows Need for Cyber Security Improvement", "date": "March 5, 2018", "topics": ["Hacking News", "News", "Tech"], "authur": "Arslan Butt", "body": "A recent report on cyber-security in the public service has stated that it took one NSW Government around 49 days to shut down a hack!\nThis attempted financial fraud that took place in the year 2017 involved the IT systems provider of a government agency and was attempting to spread it around before it was tracked, stopped and finally shut down. This case study is actually a part of a recent report by the state’s auditor, General Margaret Crawford.\nShe called for quick and immediate improvements in the ability of public sectors to combat problems of this nature. She was of the view that presently, there is a risk that these frauds and cyber-security crimes will go on for a longer period than they actually should. These cyber-security crimes threaten the government and may even cause harm to government service delivery resulting in the hacking of personal information, confidential data, and denial of access to technology.\nIn this particular incident, the hacked account sent out around 450 bogus emails.\nThis case study basically started with a compromised email ID and led to a shut-down of this agency’s financial payment system.\nSix days later, the hacked account sent bogus emails which were meant to deceive the recipient in a bid to get the credentials of the finance staff.\nTwo weeks later, the agency’s IT provider found a bogus invoice and raised the particular incident to major status.\nAll the email account users of the agency were strictly advised to change their passwords but even after this measure, by the 20th day, the hacked account had sent 450 bogus messages and almost 300 staff members had clicked on the link that the email carried.\nCutting the long story short, the agency’s payments gateway was finally re-opened after a lot of effort on the 49th day!\nThis incident indicated the loopholes that the agency had in its IT security system and highlighted the fact that it needed to be upgraded immediately to avoid any such unpleasant incidents in the future.Source: http://www.abc.net.au/news/2018-03-02/cyber-security-in-nsw-public-sector-needs-improvement/9503250"}, {"title": "US spy chiefs seek UK’s guidance in the battle of cyber-security", "date": "March 3, 2018", "topics": ["Hacking News", "News", "SPY"], "authur": "Arslan Butt", "body": "American spymasters are now very much concerned over the susceptibility of US-based companies to cyber-attack and are seeking help and guidance from the UK to enhance protection in the face of growing danger and threat of the hostile state hackers.\nAn intelligence official from the US told the Financial Times that US intelligence is braced for the cyber-security threat to “get worse,” making the US resemble a city at the bottom of a dam that is developing cracks at a rapid pace.Rick Ledgett (former deputy director of NSA) was of the opinion that Us must follow the UK model and he considered the problem so big and unattended that he feared that something horrible might have to happen to draw attention to the issue and have it solved.One of the solutions being considered by US intelligence officials is to imitate the UK’s National Cyber Security Centre which is the public-facing division of UK’s digital eavesdropping agency GCHQ.\nMichael Rogers, who heads the NSA and US Cyber Command, that tackles all issues under the cyber defense and offense, paid a visit to the NCSC’s London headquarters this year, as a gesture of the close links between the services of US and UK.\nThe official stated that some countries like the UK  had a general practice of interference in the private sector that most probably “wouldn’t be tolerated as much” in the United States.Mr. Ledgett opined that the problem is the US is much bigger and complex and concerned authorities lack unity of focus.Established in 2016, the NCSC works in collaboration with other companies to manage various incidents, safeguard important services from cyber-threats and provide guidance to cope with this matter.Responsibility for protecting the US private sector and keeping it from falling prey to any sort of cyber-attack rests on NSA, the FBI, the National Guard and the CIA.Source: https://www.ft.com/content/e40ee0f2-1cce-11e8-aaca-4574d7dabfb6 "}, {"title": "23000 HTTPS Private Keys were compromised by Trustico", "date": "March 2, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "The Customers of Trustico have been informed about a major security issue when the CEO of the company has sent 23,000 private HTTPS keys in an Email to a partner of the company. Those private keys are meant to be kept secret and should never be archived by the resellers but when the Company’s Chief was able to attach more than 20K is raising concerns among the customers.Although some critics are implying that Trustico emailed the keys in an attempt to lure customers with Comodo issued certificates moving from the Symantec issued certificates, In a statement, Trustico officials said that keys were recovered from the “Cold Storage”(Offline Storage) systems.“Trustico allows customers to generate a Certificate Signing Request and Private Key during the ordering process,” the statement read. “These Private Keys are stored in cold storage, for the purpose of revocation.”Under the requirements of Issuance and Management of Publicly-Trusted Certificates, resellers aren’t permitted to archive the private keys of the customers although Symantec is the company that needs to make sure these kinds of violations doesn’t occur. In a real-world scenario, there is no possible way for Symantec to detect this violation.According to DigiCert’s Chief Product Officer Jeremy Rowley, all the 23,000 Keys must be revoked and the customers needed to be supplied with the new keys. As a standard security practice for a Certificate Authority, the company cannot have the keys in their possession. There are additional certificates the reseller requested to have revoked, but DigiCert has decided to disregard that request until we receive proof of compromise or more information about the cause of this incident.Finally, Trustico website has gone down after a Security Researcher posted a critical flaw that could allow customers to validate certificates to check if their private keys are properly installed on their websites which allowed the attackers to run malicious code on Trustico servers with ROOT Privileges.Take your time to comment on this article.Sources:Register, ArsTechnica, ZDNet"}, {"title": "Cybersecurity Recruitment Needs Improvement – (ISC)2 Report!", "date": "March 1, 2018", "topics": ["Cyber Attack", "Hacking News", "News"], "authur": "Arslan Butt", "body": "Security professionals were made to go through a global survey which was conducted by (ISC)2. The said survey was able to reveal that only 14% of the total people that apply for cybersecurity jobs are actually looking for a job.Furthermore, 84% are in a struggle to move to new positions in a year or two. And 46% are of the view that recruiters contact them on a weekly basis and around 18% claim to get calls from the concerned departments even though they have not applied anywhere and are not looking for an employment opportunity. Nearly 40% of the people who are genuinely on a job hunt get regular pings from the recruiters.On an average, one in every five pros gets a minimum of one call or an email by a recruiter each day, and as found by this survey, most of these workers have 3 – 10 years of experience. The (ISC)2 survey found that most of these workers have three- to 10 years’ experience. Also, C-level executives make up nearly one-fourth of those who get multiple recruiter contacts per day.Meanwhile, the salary was not found to be the top-ranked requirement reason for taking up a job. About 68% were of the view that they would prefer a position where their opinion is valued; 54% claimed that their present jobs fit that bill.Around 62% said they are passionate about getting a job where they can serve to protect people and their data. Furthermore, 58% said that their current jobs provide them with such an opportunity. The rankings also talked about working at a place with a “code of ethics.” The result showed 54% share that their organization satisfied that requirement.Nearly 50% when on to say they wanted the “best salary,” and 39% said they’re satisfied with what they are currently being paid.There seems, according to the results, to be a lack of consistency among companies’ descriptions, criterion, and names of various job designations in cybersecurity because as a professional, one must be a little more standardized towards these positions. Source: DarkReading"}, {"title": "Olympics were hacked by Russian Spies said by U.S Officials", "date": "February 25, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "According to U.S. intelligence, while trying to make it seem as though the attack was conducted by North Korea, what is perceived as a “false-flag” operation, said two U.S. executives who spoke on the situation of anonymity to discuss a delicate matter.Officials in PyeongChang thanked that the Games were hit by a cyber attack through the Feb. 9 Opening Celebrations but had refused to confirm whether Russia was subject. That evening there was interruptions to the Internet, broadcast systems, and the Olympics website. Many attendees were inadequate to print their tickets for the ceremony, following in empty seats.Analysts surmise the confusion was retaliation against the International Olympic Committee for preventing the Russian team from the Winter Games due to doping invasions. No officials from Russia’s Olympic federation were supported to attend, and while some athletes were allowed to compete under the designation “Olympic Athletes from Russia,” they were powerless to display the Russian flag on their clothes and, if they won medals, their country’s song was not played.As of early February, the Russian military agency GRU had entrance to as many as 300 Olympic-related computers, according to an intelligence report this month.The Office of the Director of National Intelligence refused to comment.The intelligence, which has not been plainly affirmed, is consistent with reports from private-sector analysts who have stated they saw signs Russia had targeted the 2018 Olympics. It also would continue a pattern of such attempts, including during the 2016 Summer Games in Rio de Janeiro.Some U.S. officials are concerned the Russians may try to disrupt the Closing Ceremonies on Sunday. “We’re following it pretty closely,” said one. “It’s essentially a Korean problem,” the official added. “We will help the Koreans as requested.”Apart from entering the computers, GRU cyber-operators also cut routers in South Korea last month and deployed new malware on the day the Olympics began, according to Western intelligence agencies. Such access could enable statistics collection or network attacks, officials said.Take your time to comment on this article."}, {"title": "Google Wallet and Android Pay are being replaced with Google Pay", "date": "February 21, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Google’s new combined payments service, which connects Google Wallet and Android Pay are finally working out today with a new app for Android devices.The app is sorted into two shares: a “Home” tab, which shows original payment activity, nearby local offers and stores, and other data using Google’s card-style interface, and a “Cards” tab, which is where all your personal credit, debit, reward, and gift cards live.Google has big ideas for Google Pay, with the organization promising that service will be moving its way to all Google products, including Chrome and Assistant. And like Android Pay before it, you’ll be able to use tickets and payment data stored in Google Pay across a wide variety of apps and websites when using an Android device or Chrome, too. Google Pay will also work for transportation in cities including Kiev, London, and Portland, although that depends a lot on wherever you live and what your city’s public transit looks like. Looking at you, MTA.Google is also going on integrating its Venmo-like service from Google Wallet straight into the Google Pay app for the US and UK markets. But for now, the organization has rebranded the Google Wallet app as Google Pay Send and refreshed the design to match the rest of Google Pay.Take your time to comment on this article."}, {"title": "Google Security Team has uncovered a new security Flaw in Microsoft’s Edge", "date": "February 20, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Google also presented Microsoft with an extra 14-day grace period to have a fix ready for its monthly Patch Tuesday release in February, but Microsoft blew this goal because “the fix is more complex than originally anticipated.” It’s not clear when Microsoft will have a fix ready, and the Google engineer accountable for reporting the security flaw says because of the complexity of the fix Microsoft “does not yet have a fixed date set as of yet.”The public exposure will likely anger Microsoft, once again. The software giant hit back at Google’s advance to security patches last October, after seeing a Chrome flaw and “responsibly” disclosed it to Google so the organization had enough time to patch. At the core of the issue is whether Google’s policy to publish after 90 days without a patch is reasonable. Google makes limitations to this hard rule, with grace periods, and can even reveal much sooner if the vulnerability is being actively exploited. Google unveiled a major Windows bug back in 2016 just 10 days after reporting it to Microsoft, and the company has published zero-day bugs in Windows in the past before patches are available.Two big and obvious reservations to Google’s security disclosure rules were the recent Meltdown and Spectre bugs. Google technicians discovered the CPU flaws and Intel, AMD, and others had around six months to fix the difficulties before the flaws were publicly revealed earlier this year. Chrome OS and Android devices were also affected by the processor flaws, along with Windows, Linux, macOS, and iOS.Google needs the industry to adopt its aggressive admission policies, but Microsoft has so far resisted rather publicly.Take your time to comment on this article. "}, {"title": "Unknown hackers stole $6 Million from a Russian bank using the SWIFT international payments", "date": "February 18, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "The acknowledgment, buried at the bottom of a central bank report on digital thefts in the Russian banking division, is the latest in a string of tried and successful cyber heists using fraudulent wire-transfer requests.The central bank said it had been sent data about “one successful attack on the workplace of a SWIFT system operative.”“The volume of unsanctioned procedures as a result of this attack amounted to 339.5 million roubles,” the bank said.After the report’s statement, a central bank spokesman said hackers had taken control of a machine at a Russian bank and used the SWIFT system to transfer the business to their own accounts.The spokesman faded to name the bank or provide further details. He quoted Artem Sychev, deputy head of the central bank’s security department, as stating this was “a common scheme”.A spokeswoman for SWIFT, whose messaging system is used to give trillions of dollars each day, said the organization does not comment on specific entities.“When a case of possible fraud is reported to us, we offer our support to the affected user to help secure its situation,” said the spokeswoman, Natasha de Teran.SWIFT says its own systems have never been settled by hackers.Brussels-based SWIFT said late last year digital heists were growing increasingly prominent as hackers use more advanced tools and techniques to launch new attacks.In December, hackers tried to steal 55 million roubles from Russian state bank Globex utilizing the SWIFT system, and digital thieves made off with $81 million from Bangladesh Bank in February 2016.Take your time to comment on this article."}, {"title": "Facebook’s two-factor authentication ended up being used as a way to pester its users with notifications", "date": "February 18, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "As News earlier this week, users who gave Facebook their phone number in order to get two-factor codes via text communications also ended up taking hit with a blast of notifications. Users’ responses to these information texts ended up being posted on their Facebook walls, or as explanations on their friends’ posts.Security experts analyzed the notification texts, debating that they would discourage users from performing an important security feature.Facebook’s chief security officer Alex Stamos now says that the information texts were a bug, and the business will roll out a fix in the next few days.“The last thing we want is for users to avoid helpful security traits because they fear they will receive separate notifications,” Stamos wrote in a blog post. “We are running to ensure that people who sign up for two-factor authentication won’t receive non-security-similar notifications from us unless they explicitly choose to receive them, and the same will be true for those who hired up in the past.”Facebook never thought to send SMS notifications to two-factor authentication users, Stamos said. He also confessed to any inconvenience caused by the security messages.Stamos also wrote the fact that responding to the notification texts produced in unexpected posts on Facebook. “For years, before the pervasiveness of smartphones, we supported posting to Facebook via text message, but this point is less useful these days. As a result, we are working to oppose this functionality soon,” he said.Take your time to comment on this article."}, {"title": "The United States is “vulnerable” to cybersecurity attacks said by the co-founder of the computer security firm CrowdStrike", "date": "February 18, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Recent cyber attacks, including NotPetya last June, have been destructive to American organizations, causing them hundreds of millions of dollars in losses. Other crimes, such as the cybersecurity breach at the Office of Personnel Management (OPM) in 2015, have reportedly supplied key information to states like China’s that can be used to blackmail American citizens operating with sensitive intelligence.As a result, it is imperative that U.S. governments become better at defending their networks, Dmitri Alperovitch, co-founder and chief technology officer at CrowdStrike told News at the Munich Security Conference.“The U.S. administration is actually exceptionally vulnerable,” he said.Despite the “very good” intellect operations in the U.S., “their acquisition process is so archaic that they are not really able to buy the technologies they need to protect themselves fast enough,” Alperovitch said.However, it is not just the systems in the U.S. that are vulnerable to cyber attacks and need to be changed. NotPetya and WannaCry were two of the newest attacks and they affected companies worldwide.“The U.S. is not great at defense but in my trips overseas I realized that everyone else is even worse. So this is not an area where anyone, including their adversaries, is good,” Alperovitch added.He suggested that association networks should be able to do three things: Detect there’s an enemy in about a minute; study that threat in about 10 minutes; and clean up that attack within an hour.Take your time to comment on this article."}, {"title": "BitGrail cryptocurrency exchange has been hacked – More than $160 million stolen in Nano", "date": "February 13, 2018", "topics": ["Hacking News", "News"], "authur": "Eslam Medhat", "body": "The Italian cryptocurrency exchange BitGrail announced late last week that it was hacked and lost about 17 million Nano cryptocurrency (XRB, formerly known as RaiBlocks), currently worth over $160 million.A statement on the BitGrail website announced that the company did a security check that discovered unauthorized transactions resulting in a shortfall of 17 million Nano.The owner of BitGrail exchange stated on Twitter that the exchange can’t refund all customers, as it’s currently in ownership of only 4 million Nano, estimated at around $40 million.“NANO on BitGrail have been stolen.Unfortunately there is no way to give it back to you at 100% (we only got 4 MLN XRN right now).The devs, as you have guessed, dont want to collaborate”Only Nano cryptocurrency has been stolen in the hack. The funds withdrew from the wallet of BitGrail, where it is usually stored after customers deposit Nano in their BitGrail accounts.According to a Reddit user:\n“Something that needs to be addressed is that quite a few of these “exchanges” are set up by near-college-age “devs” who are only a couple years past graduating from their javascript boot camps.”Nano cryptocurrency is currently in the top 30 most valuable cryptocurrency based on market cap (23rd) and is exchanging at $10 per unit.Source: bitgrail.com"}, {"title": "A sensitive component iOS source code was leaked by a former Apple intern", "date": "February 12, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "According to News, the intern who took the code took it and shared it to a small group of five colleagues in the iOS jailbreaking community in order to help them with their continuing efforts to circumvent Apple’s secured down mobile operating system. The former agent apparently took “all sorts of Apple internal tools and whatnot,” according to one of the individuals who had first received the code, including additional source code that was obviously not included in the initial leak.The plan was originally to secure that the code never left the original circle of five friends, but apparently, the code flowed beyond the original group sometime last year. Finally, the code was then posted in a Discord chat group and was given to Reddit roughly four months ago although that post was obviously removed by a moderation bot automatically.But then, it was posted repeatedly to GitHub this week, which is while things snowballed to where they are now, with Apple requesting GitHub to remove the code. According to News, a source at Apple claims that the organization was previously aware of the leak before it made it to GitHub, which would make sense since it appears to have been moved around the jailbreaking community for some time already. Apple itself seems cool about the potential security issues, with the business noting in a statement that the code is already three years old.Take your time to comment on this article."}, {"title": "fail0verflow, A group of Hackers managed to run Linux on Nintendo Switch", "date": "February 10, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "According to fail0verflow, there’s a defect in the boot ROM in Nvidia’s Tegra X1 system-on-a-chip. when your console begins, it reads and performs an execution a piece of code stored in a read-only memory(ROM) This code includes instructions about the booting process.It indicates that the boot ROM is saved on the chip when Nvidia builds it and it can’t be changed in any way after that. Even if Nintendo publishes a software update, this software update won’t hit the boot ROM. And as the console loads the boot ROM directly after pressing the power button, there’s no way to circumvent it.The only way to fix it would be to build new Nvidia Tegra X1 chips. So it’s likely that Nintendo asks Nvidia to fix the problem so that new consoles don’t have this vulnerability.fail0verflow also states that you don’t need to install a correction chip to bypass the boot ROM. On the photo, it looks like they secured something on the right side of the device, where the right Joy-Con is thought to be.If fail0verflow decides to share the deed, it could open up many opportunities when it comes to homebrew software and, yes, pirated games. It could have some business implications for Nintendo.Take your time to comment on this article."}, {"title": "Security researchers have discovered a POS (point-of-sale) malware that is intended to steal Credit Card Data", "date": "February 9, 2018", "topics": ["Hacking News", "News"], "authur": "Eslam Medhat", "body": "Security researchers from Forcepoint (US security firm) have discovered a new strain of malware called UDPoS that relies on a different method to steal credit/debit card data from point-of-sale (PoS) systems.A PoS device is designed to perform a retail transaction. It calculates the amount clients must pay for their purchases and give options for clients to make said payment. PoS devices are connected to the Internet to authorize transactions by sellers.The POS malware uses Domain Name System (DNS) queries to exfiltrate stolen credit card information, instead of HTTP that has been applied by most POS malware in the past. UDPoS masks itself as an update from LogMeIn, which is a legitimate remote desktop control service used to manage machines remotely. This method has been used to avoid detection while transporting stolen credit card data pass firewalls and other security controls.LogMeIn said that the malware is designed to fool an unsuspecting user into executing a malicious email, link or file, possibly including the LogMeIn name.“This link, file or executable isn’t provided by LogMeIn and updates for LogMeIn products, including patches, updates, etc., will always be delivered securely in-product. You’ll never be contacted by us with a request to update your software that also includes either an attachment or a link to a new version or update.”Source: forcepoint.com "}, {"title": "A security researcher has ported three leaked NSA exploits to work on all Versions of Windows OS", "date": "February 6, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "The three exploits are EternalChampion, EternalRomance, and EternalSynergy; all three dripped last April by a hacking group known as The Shadow Brokers who said to have stolen the code from the NSA.Several exploits and hacking tools were written in the April 2017 Shadow Brokers dump, the most important being EternalBlue, the exploit used in the WannaCry, NotPetya, and Bad Rabbit ransomware crashes.While EternalBlue grew a favorite tool among malware authors, the Shadow Brokers dump also included many lesser-known exploits. The reason many of these didn’t become public was that they only worked a small number of Windows versions, and did not sustain recent Windows distributions.Now, RiskSense security researcher Sean [email protected] has adjusted the source code for some of these lesser-known exploits so they would be able to work and run SYSTEM-level system on a wide variety of Windows OS versions.The researcher has recently joined these modified versions of EternalChampion, EternalRomance, and EternalSynergy into the Metasploit Framework, an open-source penetration testing project.Dillon has crafted his revised exploits to take advantage of the resulting vulnerabilities:CVE-2017-0143 – Type interference between WriteAndX and Transaction requests – EternalRomance/EternalSynergyCVE-2017-0146 – Race condition with Transaction requests – EternalChampion/EternalSynergy“Instead of working for shellcode execution, it overwrites the SMB connection assembly structures to gain Admin/SYSTEM session,” Dillon says. “The Metasploit Framework module is leaner stripped down packet count/padding, checks extra defined pipes, sprinkles randomness where possible, and has Metasploit’s psexec DCERPC implementation bolted onto it.”Dillon says his modified exploits will work on both 32-bit and 64-bit architectures.Take your time to comment on this article."}, {"title": "A New Cryptomining Botnet Called Smominru Infected Over 500 Thousand Windows Machines", "date": "February 1, 2018", "topics": ["Cyber Attack", "Hacking News", "News"], "authur": "Eslam Medhat", "body": "Security researchers from Proofpoint (cybersecurity firm) have discovered that over 500 thousand Windows machines have been infected with Cryptomining malware called Smominru.Smominru creators used several methods to infect computers. They used vulnerabilities such as EternalBlue (CVE-2017-0144) exploit and EsteemAudit (CVE-2017-0176) exploit to take over computers running unpatched Windows operating systems.According to the researchers:\n“Since the end of May 2017, we have been monitoring a Monero miner that spreads using the EternalBlue Exploit (CVE-2017-0144). The miner itself, known as Smominru”Smominru botnet creators have now mined around 8,900 Monero, estimated at up to $3.6 million, at the rate of roughly 24 Monero per day ($8,500) by stealing computing resources of millions of Windows machines.Proofpoint researchers said that the operators have used at least 25 computers to scan the internet to discover vulnerable Windows machines.“As Bitcoin has become prohibitively resource-intensive to mine outside of dedicated mining farms, interest in Monero has increased dramatically. While Monero can no longer be mined effectively on desktop computers, a distributed botnet like that described here can prove quite lucrative for its operators,”Users are recommended to keep their computers and software updated to evade the infection of any malware."}, {"title": "Cyber Criminals created 28 fake ad agencies and bought over 1 Billion advert views", "date": "January 28, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "These fake ad companies each had individual websites and even LinkedIn portraits for their fake CEOs. Their sole purpose was to interface with larger broadcasting platforms, looking as legitimate businesses.These ads would allow the Zirconium Inc to run JavaScript code that produced a “forced redirect,” effectively hijacking visitors off the original site to an intermediary domain. This intermediary region would fingerprint and match incoming traffic, then redirect the user to another area, also operated by Zirconium.Hackers would use this third domain as an associate traffic jump-off point, allowing others to buy the traffic they captured from legitimate sites.In many cases, users were redirected to pages attempting fake malware-laced Flash updates, websites offering malware-jammed software installers, tech support scams, or other scareware pages.Ad security company Confiant, the one who found this entire operation, says ads bought by this group reached 62% of ad-monetized websites on a weekly basis.All in all, Confiant thinks that about 2.5 million users who’ve found Zirconium’s malicious ads were redirected to a malicious site, with 95% of the victims being based in the US.The entire section flew under the radar for most of the time but became harder to ignore as it grew and researchers began to detect more and more aggressive user fingerprinting scripts.Dangu says the group particularly targeted desktop browsers, ignoring mobile traffic. The user’s working system did not count, the group going after Windows, Linux, Mac, or ChromeOS users alike.The Confiant CTO also says Zirconium used only 20 of its 28 fake ad business identities for this operation, and eight inhabited dormant earlier this week when Confiant published its Zirconium expose.Malware Advertising crews using fake ad companies may be a new thought for the casual infosec-passionate reader, but discussions this Bleeping Computer reporter had with industry experts last year revealed that most experts knew this was occurring, but they hadn’t managed to get all the details commonly to expose this growing trend.Take your time to comment on this article."}, {"title": "Coincheck (cryptocurrency exchange) has lost over $500 Million!", "date": "January 27, 2018", "topics": ["Hacking News", "News"], "authur": "Eslam Medhat", "body": "Coincheck (Japanese-based cryptocurrency exchange) published yesterday that it lost over $532 million at the time of the incident, which seems to be the biggest hack in the history of digital currencies.The company has confirmed the hack without describing how the tokens were taken, and suddenly suspended most of its services, including deposits, withdrawals and trade of almost all cryptocurrencies including JPY, except Bitcoin.According to Coincheck:\nCurrently, payment of all currencies handled by Coincheck (including JPY) is temporarily suspended. With regard to NEM, we continue to temporarily suspend deposits / withdrawals and trading.The Japanese cryptocurrency exchange has reported the breach to the authorities and to Japan’s Financial Services Agency (FSA) to examine the cause of the stolen coins.The executives of the Financial Services Agency said “We will report on the damage situation and cause of the case, measures to prevent recurrence, but first we would like you to take every possible measure to protect our customers,”The price of NEM dropped from $1 to $0.8 (16.5% drop) after the hack news. It is believed that the hacker stole about 7% of all NEM tokens currently in circulation."}, {"title": "Thousands Of WordPress Websites Have Been Infected With A Key-logger & In-Browser Cryptocurrency Miner", "date": "January 27, 2018", "topics": ["Hacking News", "News"], "authur": "Eslam Medhat", "body": "Security researchers from Sucuri have found that about 2,000 WordPress CMS websites are infected with a malicious script (keylogger) that’s running on the WordPress backend login page and a web browser cryptocurrency miner called CoinHive on their frontends.The researchers said that the new attack is tied to a similar operation that took place in early December 2017 that infected over 5,500 WordPress websites. Both incidents used a keylogger and cryptocurrency malware named cloudflare[.]solutions. The name is obtained from the domain name used to serve up the malware in the first attack, cloudflare[.]solutions.Cybercriminals inject these malicious scrips on WordPress CMS source code with weak or outdated security.According to Sucuri researchers:\nThe cdjs[.]online script is injected into either a WordPress database (wp_posts table) or into the theme’s functions.php file, just like we saw in the former cloudflare[.]solutions attack. The cdns[.]ws and msdns[.]online scripts can also be found injected into the theme’s functions.php file:The new campaigns do not yet seem to be as heavy as the first malware campaign, but there are many websites that have failed to correctly secure themselves after the original infection.“To clean up a website that has been compromised with this infection, you’ll need to remove the malicious code from theme’s functions.php, scan wp_posts table for possible injections, change all WordPress passwords(!) and update all server software including third-party themes and plugins.”"}, {"title": "Chronicle, A New Cyber Security Company from Google X", "date": "January 25, 2018", "topics": ["Hacking News", "Tech", "Uncategorized"], "authur": "Harikrishna Mekala", "body": " Google X published a new spinoff concentrating entirely on cybersecurity, dubbed Chronicle.Billed by Google X chief Astro Teller as a “digital safe system,” Chronicle focuses on detecting threats by analyzing and storing security-relevant data within large enterprises. Using Google’s infrastructure, the business claims to be able to detect threats faster and at a comprehensive scale than existing systems, which is probably the key to stopping hacks early.“We think we’ll be able to help groups see their full security picture with much higher accuracy than they currently can,” founder Stephen Gillett said in a News post stating the launch.Further aspects of the project are still thin, but Gillett says early alpha versions of the output have already been tested at a number of Fortune 500 companies.X’s Captain of Moonshots Astro Teller also notes that “the data that security teams need to identify and review attacks is right there in an organization’s current security tools and IT systems, but it’s hidden in large volumes of data and hence can’t easily be seen, understood, or used.”What specifically this new platform will look like remains to be seen, though. Gillett notes that it will run on Alphabet’s support and use machine learning and advanced search capabilities to help businesses examine their security data. Chronicle also says that it will offer its assistance in the cloud so that they can “grow with an organization’s needs and don’t add yet an extra piece of security software to perform and manage.”Chronicle will also include VirusTotal, a successful malware-reporting network that receives over 1 million submissions a day. Acquired by Google in 2012, VirusTotal’s aids are expected to continue unchanged by the launch, although it will now be nested under Chronicle.Take your time to comment on this article."}, {"title": "Google is trying to fix the Bug that is slowing down the Wi-Fi in your home", "date": "January 22, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Google is trying very hard to fix a bug that slows down Wi-Fi networks attached to both Android and Chromecast built-in devices. According to a blog post, Google said a bug in its Cast software on Android phones may mistakenly send a large amount of system traffic, which can slow down or momentarily impact Wi-Fi networks. The organization notes that the impact of the network depends on which router you’re using. People with an Android phone and a Chromecast device, like Google Home, on the same Wi-Fi network, are affected by the bug.Google says it has recognized the issue, and the fix will be issued via a Google Play service update. The organization says users experiencing the problem should reboot their phones and check that their Wi-Fi router has been updated to the latest firmware.The Cast feature on Google’s home devices is the culprit after the WiFi problems, according to a post on the TP-Link website. Cast sends MDNS multicast data packets in order to discover and keep a live connection with Google products such as Home. These packets usually are sent in 20-second intervals.However, after a device wakes up from sleep mode, it sometimes declares a large amount of the packets more than 100,000 on some occasions at a very high speed in a short value of time. The longer the device is asleep, the larger the container burst will be.This issue ultimately may cause some of a router’s primary features to shut down including wireless connectivity, according to the post. Rebooting a router will return WiFi connectivity. Damaging the Cast feature will address the problem, too.“Google Home and Chromecast users with Android phones may encounter issues that cause their routers to respond slowly,” Paula and the Google Home product team admitted in a forum post on Wednesday. “We apologize for any trouble and this week we’ll begin rolling out a fix with an update to Google Play services.”Take our time to comment on this article. "}, {"title": "Senator Cornyn has influenced the 2016 US Election says Twitter", "date": "January 22, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "“As part of our original work to read Russian-linked activities on Twitter through the 2016 U.S. presidential election, we selected and suspended a whole of accounts that were potentially correlated to a propaganda effort by a Russian government-linked corporation known as the Internet Research Agency,” read the email.“Consistent with our delegation to transparency, we are emailing you because we have reason to believe that you either supported one of these accounts or retweeted or liked content from these accounts during the voting period,” the email continued. “This is purely for your own data purposes, and is not related to a security concern for your account.”Cornyn shared a screenshot of the email with his supporters on Saturday.“Finally social media is waking up to manipulation of public judgment by our adversaries,” he wrote. “All of us need to step up to meet this challenge, mainly the Press.”Twitter published on Friday that it swung 1,062 new accounts it found to be connected to the Internet Research Agency.In total, the corporation has found 3,814 Internet Research Agency-linked accounts, which posted 175,993 tweets through the 2016 presidential campaign.The social media company also declared that it would contact 677,775 users to inform them that they liked, retweeted or followed Russian-linked reports following a request from Sen. Richard Blumenthal (D-Conn.).Twitter said, however, that it would not talk users of the exact content they saw and associated with because it has “already suspended these accounts”.Take your time to comment on this article."}, {"title": "OnePlus Has Been Hacked And Its Online Payment System Was Breached!", "date": "January 20, 2018", "topics": ["Hacking News", "News"], "authur": "Eslam Medhat", "body": "OnePlus has stated that credit card data belonging to up to 40,000 clients were affected by the security breach that caused the organization shut down the online payment system earlier last week. The announcement came after a week in which hundreds of clients reported fraud on their accounts while they were purchasing OnePlus products.According to the company:\nHi all, We are deeply sorry to announce that we have indeed been attacked, and up to 40k users at oneplus.net may be affected by the incident. We have sent out an email to all possibly affected users.After an examination and a temporary block made on credit card payments, OnePlus discovered that hackers were able to hack into its website server and were able to install malicious JavaScript code that would grab credit card information once it was entered by customers.After an examination and a temporary block made on credit card payments, OnePlus discovered that hackers were able to hack into its website server and were able to install malicious JavaScript code that would grab credit card information once it was entered by customers.The JavaScript code was able to catch full credit card data, including card numbers, expiry dates, and security codes directly from a client’s browser window. OnePlus said that it has determined where the exploit happened and has found the vulnerability, but the investigation remains ongoing.It’s not yet obvious if the hack was done from outside, or if someone had physical access to the server to place the malicious script.“We recommend that you check your card statements and report any charges you don’t recognize to your bank. They will help you initiate a chargeback and prevent any financial loss.”"}, {"title": "Twitter is trying to notify it’s users if they are exposed to Russian propaganda", "date": "January 17, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "A Twitter spokeswoman did not quickly respond to a question for comment about methods to notify its users.Facebook Inc in December produced a portal where its users could learn whether they had fancied or followed accounts created by the Internet Research Agency. Alphabet Inc has said the way its services finish make it difficult to provide a related notice, a position Democratic Senator Richard Blumenthal scrutinized during the hearing.Senator Mark Warner, the top Democrat on the Senate Intelligence Committee, which is studying Russian meddling in the 2016 election, praised Twitter’s announcement.“After months of forcing Twitter to do the right thing, I‘m cheered the company will soon notify users who saw content from Kremlin-backed trolls,” Warner said on Twitter.Both companies and Alphabet’s YouTube performed before the Senate committee on Wednesday to return lawmaker questions about their works to combat the use of their platforms by violent extremists, such as the Islamic State.But the hearing often directed to questions of Russian propaganda, a vexing issue for internet firms that spent most of the preceding year responding to a backlash that they did too little to deter Russians from practicing their services to anonymously spread divisive messages among Americans in the run-up to the 2016 U.S. elections.U.S. intelligence companies concluded Russia sought to intervene in the election through a variety of cyber-enabled centers to sow political discord and help President Donald Trump win. Russia has repeatedly denied the allegations.The three social media businesses faced a wide array of questions compared to how they police different content on their services, including radical recruitment, gun sales, automated spam accounts, intentionally fake news stories and Russian propaganda.Monje said Twitter had increased its ability to detect and remove “maliciously automated” records, and now challenged up to 4 million per week – up from 2 million per week last year.Take your time to comment on this article."}, {"title": "Satori.Coin.Robber (botnet) is now hacking Ethereum mining rigs by replacing wallet address", "date": "January 17, 2018", "topics": ["Hacking News", "News", "Vulnerabilities"], "authur": "Eslam Medhat", "body": "A new variant of the Satori botnet has raised again with a new target, and this one is hacking into Claymore mining rigs (which mine the cryptocurrency Ethereum (ETH)) and replacing the machine owner’s mining wallet address with the attacker’s wallet.Satori is a botnet which uses a Huawei vulnerability and security issue in Realtek SDK-based devices to take over devices that are using old firmware.Qihoo 360 Netlab security researchers said that “Satori.Coin.Robber” was first detected on 8 January and hosts the same exploits of Mirai botnet. But, a new ability added to this variant is the scanning of mining rigs. The botnet scanned for ports 52869 (CVE-2014-8361 vulnerability in Realtek SDK-based devices) and 37215 (CVE-2017-17215 zero-day in Huawei routers).According to researchers:\nWhat really stands out is something we had never seen before, this new variant actually hacks into various mining hosts on the internet (mostly windows devices) via their management port 3333 that runs Claymore Miner software, and replaces the wallet address on the hosts with its own wallet address.Based on the payout pool connected to the botnet, Satori botnet controls an average calculation power of 1106 MH/s. The botnet has already got the first ETH coin paid at 14:00 on January 11, 2017, with another 0.96 coin in the balance.Users are recommended to check mining configurations and make sure they are using the latest version of the Claymore miner."}, {"title": "Intel’s Active Management Technology can be used to Bypass BIOS passwords, BitLocker credentials", "date": "January 13, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Only laptops and machines on which Intel AMT has been configured are vulnerable, according to F-Secure security researcher Harry Sintonen, the one who claims to have found the issue last July.Intel AMT is a feature of Intel CPUs that leaves system administrators of larger systems to offer remote out-of-band management of personal computers in order to monitor, manage, update, or perform upgrades from afar, without a physical path to devices.Attackers can boot via MEBx and bypass other login systemsSintonen says that Computers on which AMT has been configured externally the AMT signal are vulnerable.He says a malicious actor with a way to the design can press CTRL+P during the boot-up process and choose the Intel Management Engine BIOS Extension (MEBx) for the boot-up routine, effectively avoiding any previous BIOS, BitLocker, or TPM logins.A MEBx key is required, but Sintonen says that in most cases organizations do not change the default, which is “admin.”Attack takes a minute to performMost security authorities scoff at the idea of attacks requiring “physical access” to perform and often demean their value on such issues opposed to other security bugs.But because this attack takes a minute to execute and configure the device for ultimate remote access, Sintonen says this issue should not be neglected and set aside as non-important.Sintonen values that companies configure an AMT password so attackers wouldn’t be able to boot via MEBx and jeopardize the system. Optionally, unlike the Intel Management Engine (ME), AMT can be disabled, an option that Sintonen also recommends in circumstances where AMT use is not a corporate policy.Take your time to comment on this article."}, {"title": "WPA3, A New Wi-Fi standard is here to improve security", "date": "January 12, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "WPA3 will explain Wi-Fi configuration while implementing improved security and data encryption, published the Wi-Fi Alliance, a criteria organization whose segments include Apple, Microsoft, Intel, Samsung, Cisco and other leading technology companies.One notable story of the new model is that it will protect Wi-Fi relationships even when users choose a weak phrase that “falls short of typical complexity characters.” This expects it will likely include guards against brute-force dictionary-based attacks, one of the most successful methods of breaking into wireless networks.There aren’t any scientific details available for WPA3 because the technical specification hasn’t been published yet. However, Mathy Vanhoef, an academic researcher from the University of Leuven, believes that the brute-force security in WPA3 will be resolved by switching to a new key exchange protocol called Simultaneous Authentication of Equals (SAE), or Dragonfly.A few months ago, Vanhoef discovered a serious weakness in the four-way handshake of the WPA2 protocol, which is used by customers who know a Wi-Fi network’s pre-shared key (password) to negotiate an encryption key with the access point. There are applications to mitigate Vanhoef’s attack, dubbed KRACK, but it wouldn’t be unusual if the Wi-Fi Alliance opted for a more robust key exchange mechanism in WPA2’s successor.“Linux’s open source Wi-Fi client and access point previously support the improved handshake,” the researcher said on Twitter. “It just isn’t used in practice. But hopefully, that will change now.”WPA3 is also supposed to encrypt connections on open Wi-Fi networks which, until now, offered no security and privacy to users. According to Vanhoef, this might be achieved through a mechanism called Opportunistic Wireless Encryption.Opportunistic encryption, which has also been offered for other protocols, such as HTTP2, does not provide the same level of security and presumption as authenticated encryption but is generally viewed as a better option than having no encryption at all.Another published WPA3 feature will allow users to more easily configure Wi-Fi connections for devices that don’t have an LCD screen or another human input interface, such as sensors, IoT devices, and even some printers. This will probably be done through a nearby device like a mobile phone, but there are no exact details yet about how exactly it will work.Take your time to comment on this article."}, {"title": "Symantec Researchers Have Discovered A Fake Android App That Steals Uber Credentials", "date": "January 9, 2018", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "Millions of people have become victims of a FakeApp that is using new tricks to cheat Uber users around the world.Security researchers from Symantec corporation have found parts of a new Android malware that is trying to steal passwords, credit card details and phone password of uber users before covering up its own tracks.Hackers are using this malware, which is a variant of FakeApp as a trojan in android to display advertisements and collect sensitive information for all Uber users.According to Symantec:\nthe malware uses the deep link URI of the legitimate app that starts the app’s Ride Request activity, with the current location of the victim preloaded as the pickup point.when the user clicks the Next button the malware sends all data to the remote server and that’s what hackers need. The malware also tries to cover up the steal by displaying a screen of the legal app that shows the current location of the user, and that would not regularly arouse doubt because that’s what’s expected of the original app.However, the Android malware appears in a fake way on the image of Uber user interface to frequently pop-up on a target’s device stealing users ID, passwords and credit card details also other web accounts if it has the same passwords.Users are recommended to keep software up to date, download apps only from the official stores, and pay close attention to the permissions asked by apps."}, {"title": "A hard-coded vulnerability was discovered in WD my Cloud NAS Devices", "date": "January 8, 2018", "topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "authur": "Harikrishna Mekala", "body": "It’s time to learn how to renew its OS because researcher James Bercegay has found a dozen models possess a hard-coded backdoor.The backdoor, lets anyone log in as user mydlinkBRionyg with the password abc12345cba.WD mostly sells the My Cloud range as accommodated for file sharing and backup in domestic environments. But several of the designs with the backdoor is four-disk machines fit for use as a shared warehouse in small business and also competent of being configured as iSCSI targets for use maintaining virtual servers. Throw in the fact that some of the messed-up machines can reach 40TB volume and there’s the very real possibility that sizeable databases are dangling online.Observant readers will have found that the username includes the string “dlink”. D-Link, the group, also makes network associated storage (NAS) devices and Bercegay wrote that he found “references to file handles and directory structure that was fairly unique, and from the D-link device. But, they also absolutely matched my WDMyCloud device”.It became “pretty clear to me as the D-Link DNS-320L had the same exact hardcoded backdoor and same specific file upload vulnerability that was being within the WDMyCloud. So, it seems that the WDMyCloud software receives a large amount of the D-Link DNS-320L code, backdoor and all.”D-Link, he said, reinforced the DNS-320L in July 2014 (firmware version 1.0.6). Western Digital users can eliminate the backdoor by installing version 2.30.174 of their firmware.This sort of thing isn’t uncommon in the small NAS world: Cisco’s efforts were made by QNAP, while other OEMs aim to secure re-badging deals.MyCloud reports that need patching includes MyCloud, MyCloudMirror, My Cloud Gen 2, My Cloud PR2100, My Cloud PR4100, My Cloud EX2 Ultra, My Cloud EX2, My Cloud EX4, My Cloud EX2100, My Cloud EX4100, My Cloud DL2100, and My Cloud DL4100. Products on firmware version 4.x aren’t affected.The file upload bug Bercegay states are in the multi_uploadify.php function.An error in the handling of the gethostbyaddr() function lets an attacker “send a post request that contains a file to upload using the parameter ‘Filedata[0]’, a location for the file to be upload to which is defined within the ‘folder’ parameter, and of course a bogus ‘Host’ header.”Take your time to comment on this article."}, {"title": "Pyeongchang Olympics targeted by hackers says security firm", "date": "January 8, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "The security firm McAfee said in a statement that several teams associated with the Olympics had experienced the malicious email with the primary target being groups affiliated with ice hockey.“The majority of these groups (targeted) had some connection with the Olympics, either in giving infrastructure or in a helping role,” the McAfee report said.“The enemies appear to be spreading a wide net with this campaign.”In the bouts, which began as early as December 22, emails were “spoofed” to make them seem to come from South Korea’s National Counter-Terrorism Center, which was in the method of conducting anti-terror drills in the area in preparation for the Games.McAfee said the emails came in fact from an address in Singapore and revealed the readers to open a text document in Korean.The paper was titled “Organized by Ministry of Agriculture and Forestry and Pyeongchang Winter Olympics,” according to the report.The malware in some cases was hidden in the text, and later in an image a technique recognized as steganography, according to McAfee.“Based on our analysis, this implant discovers an encrypted channel to the attacker’s server, likely giving the criminal the ability to execute commands on the victim’s machine and to install more malware,” McAfee said.McAfee said it anticipates more attacks of this nature, echoing predictions last year from University of California researchers of increasing targeting of sporting events.“With the upcoming Olympics, we expect to see an increase in cyber attacks using Olympics-related themes,” the McAfee report said.Take your time to comment on this article."}, {"title": "Hacking Wireless Networks & Use CoffeeMiner To Inject Cryptocurrency Miners", "date": "January 7, 2018", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "A developer named Arnau from Spain has released a new project called CoffeeMiner that is designed to hack wireless networks to inject cryptocurrency mining code inside connected browsing sessions.CoffeeMiner project use the power of man-in-the-middle attack to inject some javascript code in the html pages reached by the connected users, in this scenario all the machines connected to the same WiFi network will mine cryptocurrency for the attacker.The project works by spoofing ARP messages on a LAN in order to capture unencrypted traffic from other machines on the same network.“In computer networking, ARP spoofing, ARP cache poisoning, or ARP poison routing, is a technique by which an attacker sends (spoofed) Address Resolution Protocol (ARP) messages onto a local area network. Generally, the aim is to associate the attacker’s MAC address with the IP address of another host, such as the default gateway, causing any traffic meant for that IP address to be sent to the attacker instead.”CoffeeMiner will use a tool called mitmproxy to inject the following line of HTML code into non-HTTPS (non-encrypted) web pages requested by other users on the network: When victims view these web pages, the JavaScript code will use your CPU to generate Monero, a cryptocurrency, using CoinHive’s crypto-mining library.The CoffeeMiner project is available on GitHub."}, {"title": "Intel must acknowledge the CPU flaws said by Linus Torvalds", "date": "January 7, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Two flaws entitled Meltdown and Spectre were published this week in Intel processors made since 1995 and corporations have been speeding to offer fixes and workarounds.Meltdown eliminates the barrier between user applications and sensitive parts of the OS system while Spectre, which is also reportedly located in some AMD and ARM processors, can trick vulnerable applications into dripping the contents of their memory.Torvalds was clearly unimpressed by Intel’s bid to play the crisis through its media announcements, saying: “I think somebody inside of Intel must really take a long hard look at their CPUs, and really admit that they have effects instead of writing PR blurbs that say that everything operates as designed.”The Finn, who is perceived for never beating about the forest where technical issues are regarded, questioned what Intel was actually trying to say.“Or is Intel essentially saying ‘we are dedicated to selling you shit forever and ever, and never fixing anything’?” he demanded. “Because if that’s the case, maybe we should begin looking towards the ARM64 people more.”Meanwhile, an Australian who was part of the organization that published advice about the bugs, said: “These bugs in the device can enable hackers using malicious programs to steal sensitive data which is currently prepared on the computer. Such programs can exploit Meltdown and Spectre to get hold of secrets saved in the memory of other running programs.”Dr. Yuval Yarom, of the University of Adelaide’s School of Computer Science, and Data 61, added: “They do this because the processor leaves delayed traces of the information that it’s processing, and these tracks could lead a hacker to find important information.”But he said there was a resolute to the findings too. “Ultimately, I think our data will help to change the way processors are designed, to help prevent such cybersecurity concerns.”The organizations involved in finding the bugs included Google’s Project Zero, the University of Adelaide and CSIRO’s Data61 in Australia, the Graz University of Technology in Austria, Cyberus Technology GmbH in Germany, and the University of Pennsylvania, University of Maryland and Rambus in the US.Take your time to comment on this article."}, {"title": "Attackers Can Steal Windows Credentials By Exploiting The subDoc Feature In Microsoft Word", "date": "January 6, 2018", "topics": ["Hacking News", "Vulnerabilities"], "authur": "Eslam Medhat", "body": "Security researchers from Rhino Labs (a US-based cyber-security firm) have found that cyber criminals can use a Microsoft Word feature dubbed subDoc to fool Windows machines into handing over their NTLM hashes, which is the usual format in which user account credentials are saved.subDoc feature was created to load a document into the body of a different document, so as to include data from one document into the other, while also enabling for the data to be updated and seen on its own.Rhino’s researchers said that the feature can be used to load external (Internet-hosted) subDoc files into the host document, thus enabling for malicious exploitation in specific conditions.According to the researchers:\nThis feature peaked our curiosity as it resembled a similar Office feature we’ve seen abused in the wild, attachedTemplate. Using the attachedTemplate method, an attacker would be able to send an arbitrary document to a target that would, upon opening, open an authentication prompt in the Windows style. It is this innocent looking functionality that usually catches the target by surprise and provides us the opportunity to harvest credentials remotely.To exploit this vulnerability, the researchers said that attackers can place together a Word file that loads a sub-document from a malicious server. Cyber criminals can use a malicious SMB server at the other edge of this request, and instead of sending the requested sub-document, they fool the user’s computer into handing over the NTLM hash required for authentication on a fake domain.The researchers have released an open source tool on GitHub called Subdoc Injector that is intended to create a Word subDoc for a user-defined URL and also to combine it into a user-specified ‘parent’ Word doc."}, {"title": "GPS Location Tracking Services Are Vulnerable To Multiple Vulnerabilities", "date": "January 5, 2018", "topics": ["Hacking News", "Vulnerabilities"], "authur": "Eslam Medhat", "body": "Security researchers have published a report on a series of flaws that they called “Trackmageddon” that affect many GPS and location tracking services. These security flaws could allow cybercriminals to reveal sensitive data on millions of online location tracking devices controlled by vulnerable GPS services.Cybercriminals can use the Trackmageddon flaws to expose information such as GPS coordinates, location history, device model and type, serial number, mobile number and maybe private data —depending on the tracking service and device configuration.They can obtain access to data by using the default credentials (like “123456”), and insecure direct object reference vulnerabilities, which enable an authenticated attacker to access other users’ accounts simply by modifying the value of a parameter in the URL.The researchers tried to contact the vendors behind the affected tracking services to informing them of the severity of these security flaws. They have published a list of services who patched or may have patched the vulnerabilities, a list of services still exposing data, and a list of vulnerable devices.According to researchers:\nAs long as the online service managing your device is still vulnerable changing your password will not matter and there is unfortunately not much you can currently do to protect yourself besides stopping to use the device."}, {"title": "The PR Team of Intel is trying to hide from Chipzilla", "date": "January 5, 2018", "topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "authur": "Harikrishna Mekala", "body": "To help put Intel’s allegations into context. Intel and other technology associations have been made informed of new security research reporting software analysis methods that, when used for malicious plans, have the potential to badly gather sensitive data from computing devices that are working as designed.When malware steals your stuff, your Intel chip is operating as designed. Also, this is why our stock price fell. Please make different stock prices fall, thank you.By the way, here’s what The Creator of Linux kernel Linus Torvalds had to say about this: “I think somebody inside of Intel needs to really take a longspun hard look at their CPUs, and actually acknowledge that they have issues preferably of writing PR blurbs that say that everything operates as designed.By the way, here’s what The Creator of Linux kernel Linus Torvalds had to say about this: “I think somebody inside of Intel needs to really take a longspun hard look at their CPUs, and actually acknowledge that they have issues preferably of writing PR blurbs that say that everything operates as designed.“Is Intel essentially saying ‘we are dedicated to selling you shit forever and ever, and never fixing anything’?”What Intel defined as “software analysis methods,” security researchers describe thus: “Meltdown reveals all security assumptions given by the CPU’s memory separation capabilities.”“Meltdown” is the nickname given to a side-channel attack on memory separation that affects most Intel chips since 2010, as well as a few Arm cores. Intel’s chips may be “producing as designed” but it is this processor design that’s the issue; based on the analysis that has been published, the modern design is inadequate and insecure.Meltdown on Intel CPUs and the Arm Cortex-A75 leaves normal applications to read defended kernel memory, allowing them to steal passwords and other secrets. It is easy to misuse, but easy to patch and workarounds to kill the vulnerability are possible for Windows and Linux, and are already in macOS High Sierra, for Intel parts. There are Linux kernel patches prepared for the Cortex-A75.There’s also extra security flaw named Spectre that affects, to varying degrees, Intel, AMD, and Arm. Depending on your CPU, Spectre provides normal apps to potentially steal data from other apps, the kernel, or the underlying hypervisor. Spectre is hard to exploit, but also difficult to fully patch and is going to be the true stinger from all of this.Take your time to comment on this article."}, {"title": "AMD has announced that its processors were not affected by Intel’s Flaw", "date": "January 4, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "AMD requires to publish security analysis on the flaw later on Wednesday but did present an initial announcement of its own:To be clear, the security investigation team identified three alternatives targeting speculative execution. The threat and the response to the three alternatives differ by microprocessor company, and AMD is not sensitive to all three variants. Due to variations in AMD’s architecture, we believe there is a near zero risk to AMD processors at this time.AMD rose somewhat after AMD issued the statement. The capital had fallen after Intel issued its statement earlier.On Tuesday the News implied that the flaw did not impact AMD’s chips but rather primarily impacted chips from Intel. But Intel’s public announcement on Wednesday indicated that the flaw isn’t limited to Intel’s CPUs. That said, Intel did indicate it’s running with other companies, including AMD, to resolve the issue, and AMD’s initial announcement shows it is cooperating.“As we typically do when a possible security issue is identified, AMD has been struggling across our ecosystem to evaluate and respond to the contemplative execution attack identified by a security research team to ensure our users are preserved,” AMD said.Take your time to comment on this article."}, {"title": "It has been a PR Nightmare for Intel since the Security Researchers found the flaw in the Chips", "date": "January 4, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "On Tuesday, News said a bug lets any software gain entrance to parts of a computer’s memory that are set out to preserve things like passwords. All machines with Intel chips from the past 10 years appear to be touched, the report said, and updates to Microsoft Corp.’s Windows and Mac OS will be required. The security updates may slow down older device by as much as 30 percent, according to News.Flaws in the configurations of microprocessors, which go into rigorous testing and verification, are normally easily fixed by patches in the code that they use to interact with the rest of the computer. But if the error can’t be mended easily in software, it could be required to redesign the chip, which can be extremely costly and time-consuming.Intel is demanded to release an announcement but hasn’t yet discussed on the issue. Historically, the way businesses respond to such problems and how quickly they address them has chosen how big the problem becomes.“This is a possible PR nightmare,” said Dan Ives, head of tech research at GBH Insights. “They must to get ahead of this and try to contain any of the loss to customers as well to the brand.”The report hit Intel shares, which fell as much as 5.5 percent, the steepest drop since October 2016. It gave a lift to rivals Advanced Micro Devices Inc., which climbed as much as 8.8 percent, and Nvidia Corp., which jumped 6.3 percent.The vulnerability may have importance beyond just computers, and may not be the result of a study or testing error. All modern microprocessors, including those that run smartphones, are built to actually guess what functions they’re likely to be asked to run next. By queuing up possible performances in advance, they’re able to crunch data and run software much faster.The difficulty in this case, according to people forward with the issue, is that this imminent loading of education allows access to data that’s normally cordoned off securely. That suggests, in theory, that malicious code could find a way to obtain information that would unless be out of reach, such as passwords.Take your time to comment on this article."}, {"title": "Hackers could crack your four-digit PIN code using smartphone sensors", "date": "January 3, 2018", "topics": ["Hacking News", "Vulnerabilities"], "authur": "Eslam Medhat", "body": "Hackers are always trying to discover ways to exploit and crack smartphones specifically Android devices. Security researchers from Singapore have discovered a new algorithm that exposes a person’s passcode using data from six smartphone sensors.Smartphone’s sensors could give hackers the passcode to crack your device. The researchers discovered that 99.5% of the time the method worked and their device got unlocked. They installed a custom application which collected the data from six sensors (accelerometer, gyroscope, magnetometer, proximity sensor, barometer, and ambient light sensor) installed on an Android smartphone. They were able to pick the correct 4-digit PIN code for the device.Researchers tried to guess the PIN code by collecting the data from three people, who each entered a random set of 70 four-digit pin numbers on a phone and then applied machine learning to the sequences in order to guess the pin code.According to the researchers:\n“When you hold your phone and key in the PIN, the way the phone moves when you press 1, 5, or 9, is very different. Likewise, pressing 1 with your right thumb will block more light than if you pressed 9,”“Along with the potential for leaking passwords, we are concerned that access to phone sensor information could reveal far too much about a user’s behaviour. This has significant privacy implications that both individuals and enterprises should pay urgent attention to,”Users are recommended to have PIN numbers with more than four digits, linked with other authentication systems like one-time passwords, two-factor authentications, and fingerprint or facial recognition."}, {"title": "Game of Thrones Season 8 script has been leaked by a Reddit user", "date": "January 2, 2018", "topics": ["Cyber Attack", "Hacking News"], "authur": "Eslam Medhat", "body": "In August 2017, the Internet was flooded with leaks of the then ongoing Game of Thrones’ season 7. HBO was hit by a cyber attack in which about 1.5 TB of data from the server was leaked.It looks like the world’s favorite show is not going to have an easy job in the next season, which will be the last season of the show since the alleged script of season 8 has been published online.A Reddit user has published scripts of different episodes of the Game of Thrones containing a page of Episode 3, two from Episode 5 and a page of Episode 6.The authors of Game of Thrones haven’t yet confirmed the leaking of the script though, but according to the leaked scripts, Arya Stark (Maisie Williams), Tyrion Lannister (Peter Dinklage), Brienne of Tarth (Gwendoline Christie), Sansa Stark (Sophie Turner), Podrick Payne (Daniel Portman), and the Hound (Rory McCann) will attempt to run away from a group of wights using the Hound driven wagon. The wagon will be crashed. According to the Reddit post, two main deaths were exposed. One of the deaths will be of Podrick.Game of Thrones season 8 is expected to be released in 2019."}, {"title": "Forever21 payment system got Hacked; Credit card information of customers has been leaked", "date": "January 1, 2018", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "A breach of Forever 21 left consumer payment card data exposed to hackers, the retailer verified Thursday. The business didn’t specify how many customers had data stolen, but said the various point of sales computers were affected within April 3 and November 18, 2017. Hackers obtained credit card numbers, expiration dates, confirmation codes and sometimes cardholder names.“We regret this incident happened and any concern this may have caused you,” the organization said in its notificationIn its notification to consumers, Forever 21 said hackers placed malicious software on some point of sales computers in stores throughout the country. It’s an update to a November 14 announcement stating the company may have been targeted by hackers. The breach is a different example of how cybercriminals are targeting major retailers by hacking the regularities that process your credit and debit cards, despite organizations’ efforts to make that harder to do. Fast food chain Chipotle was hit by a similar hack in 2017, as was video game retailer GameStop.Companies have technologies in-house to foil hackers, but they don’t always work. Forever 21 said its point of sales computers, which cashiers use to swipe consumers’ cards, are supposed to be encrypted. That suggests anyone intercepting the data would be unable to read it. But sometimes, that encryption was set off, Forever 21 said in its notification.Take your time to comment on this article."}, {"title": "Password Managers can be exploited using Web Trackers", "date": "December 29, 2017", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "This type of abusive conduct is possible because of a configuration flaw in the login handlers included with all browsers, login managers that allow browsers to memorize a user’s username and password for particular sites and auto-insert it in login fields when the user revisits that site again.Experts say that web trackers can install hidden login forms on sites anywhere the tracking scripts are loaded. Because of the way the login handlers work, the browser will fill these fields with the user’s login information, such as username and passwords.The trick is an old one, identified for more than a decade, but until now it’s only been employed by hackers trying to collect login data during XSS (cross-site scripting) attacks.Princeton researchers say they later found two web tracking settings that utilize hidden login forms to get login information.Fortunately, none of the two services received password information, but only the user’s username or email address depending on what each area uses for the login process.The two services are Adthink and On Audience, and Princeton researchers said they recognized scripts from these two that collected login info on 1,110 sites found on the Alexa Top 1 Million sites list.In this particular case, the two corporations were extracting the username/email from the login field, creating a hash, and tieing that hash with the site visitor’s existing advocacy profile.Researchers from the Princeton Center for Information Technology Policy (CITP) also produced a demo page that users can test using false credentials and see if their browser’s login supervisor fills in the hidden field.Take your time to comment on this article."}, {"title": "Edward Snowden’s Haven App will turn your phone into a spy tool", "date": "December 25, 2017", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Snowden told Moudeina that he was operating on an app that could turn a mobile device into a kind of motion sensor in form to notify you when your things are being tampered with. The app could also tell you when someone had opened your room without you identifying, if someone had moved your things, or if someone had stormed into your friend’s home in the middle of the night. Snowden reported that pivotal talk in an interview with the News. “She got very serious and told me, ‘I want this. I need this now. There are so many citizens around us who need this.’”Haven, announced today, is an app that performs just that. Installed on a cheap burner Android device, Haven posts notifications to your private, main phone in the event that your laptop has been tampered with. If you leave your laptop at the house or at an office or in a hotel bedroom, you can place your Haven phone on top of the laptop, and when Haven recognizes motion, light, or movement basically, anything that might be someone messing with your stuff it logs what occurred. It takes photos, records sound, even takes down fluctuations in light or acceleration, and then sends information to your main phone. None of this logging is stored in the cloud, and the information you receive on your main phone is end-to-end encrypted over Signal.Snowden hasn’t bought a mobile device since 2013, but in the last few of years, much of his time has been taken up by tearing apart smartphones and pushing away at their circuit boards with the aid of fine tweezers and a scope. In 2016, he co-operated with hardware hacker Andrew “Bunnie” Huang on Introspection Engine, a phone case that controls iPhone outputs, alerting you to when your device is broadcasting signals through its antenna.“You shouldn’t have to be saving the earth to benefit from Haven,” said Snowden, but admitted that the people most likely to be using Haven were paranoid developers and human rights activists in the global south. Andy Greenberg describes in News how the Guardian Project worked with the Colombian activist group Movilizatario to run an experiment of the software earlier this year.Take your time to comment on this article."}, {"title": "Security Researchers prove that Windows 10 Facial Recognition can be breached with a Photo", "date": "December 24, 2017", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Their spoofing attempts were declared on the cybersecurity site Seclists on Dec. 18. The cybersecurity experts bypassed Windows Hello which is Microsoft’s password-free security Lock on both a Dell and Microsoft laptop operating different versions of Windows 10, which is the reason for concern for anyone utilizing this feature to log into their account.Deceiving Windows 10 didn’t take too serious effort. It just needed “having access to a suitable photo of an approved person” to “easily” avoid the system, wrote the experts. The photo required is the full image of someone’s face so if someone actually wants to attempt to fool the facial recognition system, the walls aren’t too great.Similar to the iPhone X’s Face ID camera, Hello Windows uses an infrared camera either built-in the or supplemented separately to recognize the individual shape and contours of a face before granting or refusing access to a Windows account. But a defect was found, specifically “an insecure implementation of the biometric face identification in some Windows 10 versions.”Many but not all Windows versions are exposed. In 2016, Microsoft incorporated a new feature called Enhanced Anti-Spoofing to limit this sort of image trickery. But even if this feature is enabled in your Windows settings, the researchers found a way to avoid the facial recognition method that ran older Windows versions, such as a Microsoft Surface Pro 4 device working 2016’s Windows 10 Anniversary update, for instance.However, the SySS researchers discovered that two new Windows versions, 1703 and 1709, are not exposed to their most simple spoofing attacks using a printed photograph if Enhanced Anti-Spoofing is equipped.Their ultimate direction: Updating to Windows 10 version 1709, enabling anti-spoofing, and then having Windows Hello reanalyze your face again.If this sounds unappealing or risky, you can forever go back to using a not dumb password. Infrared facial recognition in customer applications is still relatively new, so flaws should be suspected.Similar to Apple’s Face ID, it strength helps to view Windows Hello as a utility feature, not a security feature.Take your time to comment on this article."}, {"title": "A newly detected Ransomware called Retis", "date": "December 22, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "A security researcher has discovered a ransomware called Retis,  which is a ransomware-type virus that secretly infiltrates the system. Shortly after executed, RETIS encrypts most saved data and adds filenames with the “.crypted” extension.It is a .NET ransomware, so its source code can be easily viewed. When the malware executed it will first target the victim’s Desktop, Documents, and Pictures folder for encryption. After that, it will target the rest of the drives on the computer. Lastly, it will turn the Windows wallpaper as %APPDATA%\\RANSOM.png, which is an installed resource in the executable. The executable also contains a second image resource of a mountain range, but it is not used.The file extensions targeted by this ransomware are:.txt, .doc, .docx, .xls, .xlsx, .ppt, .pptx, .jpg, .jpeg, .png, .one, .pdfThe name of the ransomware is obtained from the string of text located in the windows console, it shows the string “Hack Lab by Retis”.Retis ransomware shares several likenesses with dozens of other ransomware viruses such as Cyclone, Zlocker, and Skeleton.Most ransomware is increased using spam emails, third-party software download sources, fake software updates, and trojans. Users are recommended to be careful, don’t open files (malicious attachments) received from suspicious email addresses – remove these emails without reading."}, {"title": "Loapi Cryptocurrency Mining Malware Can Really Destroy Your Phone!", "date": "December 20, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "Security researchers from Kaspersky have discovered a new malware that is targeting Android phones. This malware, called as Loapi, is a harmful piece of code that can execute five separate malicious actions including mining the Monero cryptocurrency, making DDoS attacks, bombarding infected users with continuous ads, redirecting web traffic, transmitting text messages, and downloading and installing other applications.According to Kaspersky researchers:\nLoapi is an interesting representative from the world of malicious Android apps. Its creators have implemented almost the entire spectrum of techniques for attacking devices: the Trojan can subscribe users to paid services, send SMS messages to any number, generate traffic and make money from showing advertisements, use the computing power of a device to mine cryptocurrencies, as well as perform a variety of actions on the internet on behalf of the user/device. The only thing missing is user espionage, but the modular architecture of this Trojan means it’s possible to add this sort of functionality at any time.Researchers found that the malware mines the Monero cryptocurrency so intensely that leads to the destruction of the phone after few days of its installation.Researchers found that the malware mines the Monero cryptocurrency so intensely that leads to the destruction of the phone after few days of its installation.The Loapi malware forces the user to grant it ‘administrator permissions’ by looping a pop-up until the user hits yes, which provides the malicious app with the same power over your device that you have.To really get rid of Loapi malware, you should boot in the safe mode because the malware will continually close Settings so you cannot deactivate admin privileges. Users are also recommended to only install apps from the official Google play store."}, {"title": "Investigators found out that Barack Obama didn’t enforce FCC Rules", "date": "December 20, 2017", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Obama openly called on the FCC to reclassify broadband providers as “Title II” public carriers and force the rules in November 2014, three months before the FCC election did just that. But an inquiry last year by the FCC’s objective Inspector General’s (IG) office found “no indication” of improper use of pressure by the White House when then-Chairman Tom Wheeler led the net neutrality vote, a newly published document shows.“We found no indication of secret deals, promises or warnings from anyone outside the Commission, nor any indication of any other improper use of power to manipulate the FCC decision process,” the IG’s August 2016 report said of Obama’s role in the resolution to classify broadband providers as traditional carriers and impose net neutrality rules.Instead, Obama’s statements “were made known in the history, in full view of all,” the report said.News published the IG’s report recently after obtaining it via a Freedom of Information Act request.The report doesn’t deny Pai’s claim that the Obama White House pushed the FCC to approve its Title II net neutrality rules. When he led last week’s vote to repeal the rules, Pai said the regulations had been adopted “on direct orders from the previous White House.”Republican lawmakers maintained that the “White House bowled over FCC independence” in a report published in March 2016. Pai lauded the report at the time.But Pai’s claim also detailed in his February 2015 dissent is based principally on Obama’s public announcement and how the FCC changed course after Obama spoke out. No one argues that Obama urged the FCC to impose the rules. But the IG’s report says there was nothing untoward about Obama’s public statement and confirmed Wheeler’s contention in 2015 that “There were no secret instructions from the White House.”Upon conclusion of our review of the records described above, we were satisfied that nothing we discovered refuted the factual ﬁndings in the Senate Staff Report, and more importantly, nothing we found in the complete, unredacted record evidenced any undue influence that would have militated in favor of a more comprehensive investigation, including interviews.Take your time to comment on this article."}, {"title": "Dune Game App Downloaded By Millions Of Users Leaks Sensitive Data", "date": "December 20, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "Security researchers from Pradeo (cybersecurity company) have recognized that the popular spin app on Play Store is sending different apps data on an Android device to a server which is located in China and is making quite a few unfavorable duties than what it is meant to do.According to their searches, the application named Dune is affected by a lot of OWASP flaws and is uniformly leaking sensitive data. It is also declared that the app can help the execution of denial of service (DoS) attacks and can also do data corruption. This application can send important secret data containing the country code, device manufacturer, server provider, device’s commercial name, sort of telephone network, battery level, device model number and operating system.It was reported that the taken data is transferred to 32 servers and due to the residence of 11 OWASP flaws including those that provide permission to other apps for avoiding security access, it is reasonable for third parties to collect sensitive data.The researchers wrote in their official blog post that the application has 20 libraries, which is an over the normal number, and these libraries connect the device to unknown servers and do data leakage."}, {"title": "Fox-IT (Security Firm) has been hacked!", "date": "December 16, 2017", "topics": ["Cyber Attack", "Hacking News"], "authur": "Eslam Medhat", "body": "Fox-IT, the Netherlands-based cybersecurity firm, announced on Thursday that it has suffered a security breach, which ended in some files and emails sent by the organization’s clients to be intercepted by an anonymous attacker.The attacker was able to access the DNS records for the Fox-IT.com domain at their third-party domain registrar, change them to point to a server in their ownership, and intercept and then forwarded the traffic to the primary server that belongs to Fox-IT. He used a popular type of attack which is called a Man-in-the-Middle (MitM) attack.According to the company :\nThe attack was specifically aimed at ClientPortal, Fox-IT’s document exchange web application, which we use for secure exchange of files with customers, suppliers and other organizations. We believe that the attacker’s goal was to carry out a sustained MitM attack.The company has noticed that a number of scans for weaknesses on their infrastructure were made in the days leading up to the attack, but they did not follow up on that because they assumed that was normal.They detected the attack after roughly five hours and immediately worked to recover DNS settings and secure its account with the domain registrar. But, because of caching and how DNS works, it needed some time for the modifications to take effect and the MitM attack was carried out for 10 hours and 24 minutes.During this time, the attacker was able to intercept the credentials of 9 clients, one mobile phone number, a “subset” of names and email addresses, ClientPortal account names, and 12 files, including 3 that included secret client data, the company said. All affected customers have been informed."}, {"title": "Bitcoin ‘Phishing’ Attacks On The Rise As Price Goes Higher And Higher", "date": "December 11, 2017", "topics": ["Cyber Attack", "Hacking News"], "authur": "Eslam Medhat", "body": "After Bitcoin’s price goes higher and higher and has climbed from $11,000 on Monday to almost $17,500 on Sunday, phishing attacks on Bitcoin wallets increased, according to CheckPhish, which is a service that keeps track of new phishing pages against popular companies.According to CheckPhish reports, five domains have been recognized which were attempting to mask themselves as the Blockchain wallet service. Similar bitcoin phishing activity has been reported by others.Moreover, cyber-security firm Fortinet also recognized a spam attack that targeted users with cryptocurrency-related tricks, the security firm found that these spam attacks promotes a fraudulent version of the bot trading tool GunBot in emails. It attempts to download files carrying Orcus RAT malware on user machines with a purpose of taking their Bitcoin data and emptying their wallets.According to Fortinet :\nThe rise of Bitcoin to the top of the burgeoning cryptocurrency market has paved the way to the creation of bot trading applications such as Gunbot. Malicious counterfeit sites are sophisticated in terms of stealth and general infrastructure, and pose great risks to Bitcoin traders who may be tricked by its schemes.Users are recommended to be careful with online services and don’t click on links, download files or open attachments in emails from unknown senders."}, {"title": "A New WordPress Malware called “wp-vcd” Distributes Via Pirated Themes", "date": "December 9, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "Denis Sinegubko (a security researcher from Sucuri) has discovered a new wave of the known malware wp-vcd that injects malicious WordPress admin users into vulnerable or hacked websites.The researcher said that the wp-vcd malware is preinstalled inside pirated WordPress premium themes published for download for free on some websites, he noticed that the malicious code was loaded via the include function and injected malicious code into WordPress core files such as functions.php and class.wp.php.According to Sucuri:\nit was injecting its code on “wp-includes/class.wp.php”, this is an outdated strategy to avoid being detected by the unaware user; since nobody wants to delete WordPress core files and risk the site integrity. However, as security tools become more and more popular, this strategy fails. It’s now pretty easy for any tool to detect modifications on core files. And, since theme files are changed constantly, they found a better place to hide it.The malware runs by adding a hidden admin user to the website’s database, with the username “100010010”. The hackers will use this secret account to access the affected websites so they can perform several malicious activities at later times.The code is also straightforward and doesn’t cover its malicious intentions by encoding or obfuscation of functions…Websites administrators are recommended to install themes and plugins only from trusted locations."}, {"title": "NiceHash (Popular cryptocurrency Mining Service) Has Been Hacked! – $62 Million Stolen!", "date": "December 6, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "The cryptocurrency mining service NiceHash has been hacked, its team said today. It seems that they have lost over 4000+ BTC (about $62 Million), NiceHash said on its official Facebook that there has been a security breach involving NiceHash website and the payment system.NiceHash is one of the biggest easy mining services, with large integrations and pretty good payments. The company provide users with an easy to use CPU & GPU cryptocurrency miner for Windows. With a simple and automatic graphical user interface, it enables users to quickly turn their computer, workstation or server into money-making cryptocurrency mining machine.According to NiceHash:\n“Dear NiceHash users!\nUnfortunately, there has been a security breach involving NiceHash website. We are currently investigating the nature of the incident and, as a result, we are stopping all operations for the next 24 hours.\nImportantly, our payment system was compromised and the contents of the NiceHash Bitcoin wallet have been stolen. We are working to verify the precise number of BTC taken.”The website had been down for many hours for what NiceHash initially said was maintenance. As the maintenance extended through the day, users predicted on social media that the digital wallet had been hacked.“While the full scope of what happened is not yet known, we recommend, as a precaution, that you change your online passwords.”"}, {"title": "Android developers can be hacked through ParseDroid", "date": "December 6, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "Security researchers from Check Point have found an easily-exploitable vulnerability called ParseDroid that could affect the millions of users of integrated development environments such as Intellij, Eclipse and Android Studio. The vulnerability could enable attackers to steal files and execute malicious code on vulnerable systems remotely.According to Check Point researchers:\n“The vulnerabilities in question are the developer tools, both downloadable and cloud based, that the Android application ecosystem, the largest application community in the world, is using,”The ParseDroid attack, actually known as XML External Entity (XXE) flaw, which is activated when a vulnerable Android development tool decodes an app and attempts to parse maliciously crafted “AndroidManifest.xml” file inside it.The ParseDroid attack, actually known as XML External Entity (XXE) flaw, which is activated when a vulnerable Android development tool decodes an app and attempts to parse maliciously crafted “AndroidManifest.xml” file inside it.To exploit this vulnerability, attackers need to fool the developers and reverse engineers into using a maliciously crafted APK file. Just by loading the malicious “AndroidManifest.xml” file as part of an Android project, the IDEs begins spitting out any file used by the attacker.Attackers can also use the same vector to inject malicious files anywhere in the targeted machine’s file system leading to complete remote code execution (RCE).Google and integrated development environments Intellij, Eclipse and Android Studio were warned of this vulnerability. and vendors have patched their platform."}, {"title": "Mailsploit Allows Attackers To Spoof Email Addresses", "date": "December 6, 2017", "topics": ["Hacking News", "Vulnerabilities"], "authur": "Eslam Medhat", "body": "Sabri Haddouche (security researcher from Germany) has found a set of vulnerabilities that he collectively points to as Mailsploit, and which is an array of techniques for spoofing email in more than a dozen popular email clients such as Apple Mail for iOS and macOS, Mozilla’s Thunderbird, Microsoft Mail, and Outlook 2016. Mailsploit allows an attacker to spoof email identities, and in some situations, run malicious code on the user’s machine.“Email spoofing is the creation of email messages with a forged sender address.”Mailsploit simply passes through email servers and avoids established spoofing protection tools (anti-spoofing mechanisms) like DMARC and spam filters. Emails sent with Mailsploit seem to come from completely legitimate senders. In most situations, unless email headers are examined by technicians, emails sent using Mailsploit are undetectable.According to the researcher:\nThe trick resides in using RFC-1342 (from 1992!), a recommendation that provides a way to encode non-ASCII chars inside email headers in a such way that it won’t confuse the MTAs processing the email.Sadly, most email clients don’t correctly sanitize the string after decoding which drives to this email spoofing attack.“Using a combination of control characters such as new lines or null-byte, it can result in hiding or removing the domain part of the original email,”You can check the list of all email and web clients that are vulnerable to MailSploit attack."}, {"title": "FCC has excluded 50,000 Net Neutrality Comments from the documents", "date": "December 6, 2017", "topics": ["Hacking News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "The National Hispanic Media Coalition (NHMC) was able to take the text of net neutrality charges from the FCC via a public accounts request but says it has not been able to persuade the FCC to carry them in the repeal docket. “It appears to me that the committee is going to great lengths to disregard these documents and not include them into the record,” NHMC General Counsel Carmen Scurato told News.This is the latest controversy between the NHMC and the FCC over net neutrality charges. The NHMC filed a Freedom of Information Act (FoIA) request in May for charges that Internet users filed against their ISPs and for the ISPs’ acknowledgments to those complaints.The FCC initially declined to release all of the accusations but eventually complied with that character of the NHMC’s request and produced nearly 70,000 pages of records. The FCC still hasn’t given the NHMC most of the broadband providers’ answers to complaints.The NHMC made the records it obtained from the FCC people at this webpage, and the FCC has posted the reports on its website. But officials at the NHMC argue that the grievances should be part of the official record in the FCC’s repeal of net neutrality rules. The charges may show that the repeal of net neutrality rules is confused, they say.Of course, the FCC has all the records and could include them in the docket itself. The NHMC and about 20 other support groups filed a motion in mid-September to have the documents included, but the motion was denied by broadband industry lobby crowds and then rejected by the FCC.Scurato and NHMC Special Policy Advisor Gloria Tristani went to the FCC office on Friday last week and spoke to an FCC employee who handles the public commenting system. Scurato told News:We hand-delivered two filings with USB flash drives, one of which involved all of the documents that the FCC produced in acknowledgment to our FoIA requests. We were told by staff at the FCC that they would not upload the records in the USB flash drive and preferably would put a note in the record saying that the flash drive was ready for inspection at the commission.Take your time to comment on this article."}, {"title": "40 Million users are suffering the virtual keyboard data breach", "date": "December 6, 2017", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "The researchers demanded data left visible entered names, phone numbers, locations and Google queries.The chief of the Israeli company back the app confirmed the breach but said most of the data was not sensitive.Bob Diachenko, from the Kromtech Security Centre, part of contract company Mackeeper, said the number of data required by the app at the point of the download was “unexpected”.“Why would a keyboard and emoji form need to gather the entire data of the user’s phone or tablet?” he addressed in his report.“Based on the flowed database, they appear to collect everything from communications to keystrokes.”But Eitan Fitusi, chief executive and founder of Ai.type, told the News the expense of data exposed was not as comprehensive as claimed.“It was a subordinate database,” he said of the discovery.Mr. Fitusi said:The database has now been shut down and Mr. Fitusi said he was “certain” about the company’s security.Mr. Diachenko acknowledged that while there were no credit card or fee details, there was a wide range of individual information including social media profiles.Take your time to comment on this article."}, {"title": "Data belonging to 31 million users of a popular smartphone virtual keyboard has been leaked online", "date": "December 5, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "Security researchers from Kromtech Security Center have discovered a huge amount of personal data belonging to 31 million users of the popular smartphone virtual keyboard, Ai.type, has published online after the developer failed to correctly secure the application’s database.Ai.type is a customizable and personalizable on-screen keyboard that runs on iOS and Android, with more than 40 million users all over the world.According to researchers:\n“a simple misconfiguration could allow the database to be easily exposed online. One flaw is that the default settings of a MongoDB database would allow anyone with an internet connection to browse the databases, download them, or even worst case scenario to even delete the data stored on them.”The leaked database includes Full name, phone number, email address, device name, screen resolution, model details, Android version, IMSI number, IMEI number, IP addresses, GPS locations and many more.The strange thing is that the published database also shows that the virtual keyboard application is also collecting users’ contact lists, including the contacts’ names and phone numbers—and already scraped more than 373 million records.It raises the question of why would a keyboard and emoji app need to collect the whole data of the user’s phone or tablet?"}, {"title": "Young Hacker Hacks Prison Network To Get Friend Freed Early", "date": "December 5, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "A Michigan young hacker hacked into the government network of Washtenaw County Jail and changing the Washtenaw County Jail records, with the purpose to help a friend get freed early from jail.The man, Konrads Voits, 27, of Ann Arbor, Michigan, was caught earlier this year after an FBI investigation.According to the plea agreement, Voits registered the domain name of ewashtenavv.org on January 24, 2017. The name of the domain contained two “v” instead of a “w” at the end – the intent was to fool County employees into thinking it was a legitimate domain name for the County.The hacker sent emails to jail staff acting as a man named “Daniel Greene” and asked for help with getting government records, and later also registered the domain name of ewashtenavv.org. The name of the domain included two “v” instead of a “w” a look-alike of “ewashtenaw.org,” the Washtenaw County’s official portal, the intent was to fool County staffers into believing it was a legitimate domain name for the County.The email spear-phishing attacks were unsuccessful, so the hacker called other jail staffers and asked them to visit some websites to download and install an executable (malware) that would “upgrade the County’s jail system.”According to plea agreement:\n“Through the installation and use of this malware, Voits was able to gain full access to the County network, including access to sensitive County records such as the XJail system (the computer program used to monitor and track inmates in the County Jail), search warrant affidavits, internal discipline records, and County employee personal information,”Jail staffers noticed the hack right away and informed the FBI soon after. The Jail also hired a security firm to clean its IT network.Voits now faces up to ten years in prison and a fine of up to $250,000."}, {"title": "Connecting to Airport WiFi is Safe, Right?…..Wrong", "date": "December 5, 2017", "topics": ["Did you know ?", "Hacking News"], "authur": "William Fieldhouse", "body": "After six days of non-stop travelling around the British countryside by train for a Hackathon event, I spent my last day walking along the wintry cold streets of London, eventually leading me to my final destination on my way back home: Heathrow airport.When I stepped foot into one of the busiest airports in Europe, my mind was rambling through various things and ideas I had to prepare for the next day. The moment I noticed the departure board announce that my flight was going to be delayed, I immediately thought, “what am I going to do here for four hours?”. As I headed down the hall to the terminal along with dozens of other passengers, almost all of the shops and restaurants in the departures lounge had closed.I asked a passenger sitting across from me, how the free Wi-Fi option measures up. “Is it any good?” He replied in a heavy British accent. “Let me put it like this: I wouldn’t be relying on it if I wanted to do serious work.” Nonetheless, who would pay for premium, when free is available? I thought to myself.So, I came up with an idea! Why not check it out myself, through a little experiment, how many travellers would pay for premium Wi-Fi and how secure is a public network, when internet users exchange sensitive information, credit card number, confidential documents possibly. Man in the middle attack was my plan of attack. This specific method works on the basis of the attacker secretly relaying/ altering the communication between two parties (internet provider and the user), who believe they are directly communicating with each other.One example of man-in-the-middle attacks, in which the attacker makes independent internet hot spot connections with the victim and relays messages between them to make them believe they are connected directly over a private connection, when in fact the entire conversation is controlled by the attacker. Anyone can imagine that relevant messages passing between the victims and inject new ones. This is straightforward in many circumstances; for example, an attacker within range of an unencrypted Wi-Fi wireless access point, can insert himself as a man-in-the-middle. That was the plan in my case.First of all, I cloned Heathrows’ “Access the Internet” site, changing a few things on the welcome screen of the page such as, increase the price from 4 pounds to 8 pounds, reduce free internet time from four hours to 1 hour, . Then I had to implement the payment integration form, allowing potential victims to easily process their credit cards. I simply used my phone as a hot-spot, changed the SSID name to make it similar to the free one the airport emitted in the area and sat back to wait for the first person to join the “free network”.It took no less than half an hour for someone to connect on my hot-spot and use the standard Wi-Fi free. I had to randomly disconnect few of the active connections on my personal hotspot just to avoid overcharging my phone bill. After one hour, I had my first visitor willing to pay for premium Wi-Fi network and, as simple as that, I had compromised the first credit card. This fake, private hot-spot emitted for at least three hours and gathered approximately 18 credit cards from unsuspecting travellers.  And that was it. Afterwards I dropped the connection and erased the data from my computer.It’s kind of scary how easily I could get the credit card number in a solid format ready for any payment on the web or even sell it in the dark web. A self-described hacker affiliated with the Anonymous post on random darknet site: it is simpler and quicker to buy credit card numbers from villains who hack computers, set up phoney online stores selling non-existent goods at bargain prices, “scan” the numbers from ATMs, rather steal them at restaurants or official documents.It is important to remember how easily someone can create a counterfeit hot-spot and gain access to valuable information.  Care must be taken to avoid using public Wi-Fi on your phone, tablet or computer to check your email, your bank account balance, or any other site that contains or requires your personal data. In most cases, using Internet security software could save you from a lot of trouble, however this case is a little different.The main purpose of this article is to educate and create awareness for users which is relatively easy to do in a public Wi-Fi hotspot environment. It could also easily happen on a home Wi-Fi network, if that Wi-Fi network isn’t properly configured and allows a hacker to connect to that home network. An educated end-user and sound security practices by corporations can protect your valuable data.The views reflected in this article are the author’s and do not necessarily reflect the views of the global KPMG organization or its member firms.Author:\nFotis Sofronis\nLinkedin: https://gr.linkedin.com/in/fsofronis\nCyber Security Supervisor Consultant at KPMGIf you have a war story your would like us to publish then you can get in touch with us via the contact us section at the top of this website"}, {"title": "A New Technique Allows Website Owners To Use Your CPU To Mine Cryptocurrency Even After The Browser Window Is Closed", "date": "December 4, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "Security researchers from Malwarebytes have discovered a new technique that enables website owners or attackers that have hacked websites to keep mining for Cryptocurrency even if you close the browser window.To prove their findings, the researchers have conducted many tests using the latest version of the Google Chrome browser. They noticed that once a user visits a website, the CPU activity rises but is not maxed out, however when the browser window is closed, the activity remains higher than normal as crypto mining continues.According to Malwarebytes:\nThe trick is that although the visible browser windows are closed, there is a hidden one that remains opened. This is due to a pop-under which is sized to fit right under the taskbar and hides behind the clock. The hidden window’s coordinates will vary based on each user’s screen resolution, but follow this rule:\n-Horizontal position = ( current screen x resolution ) – 100\n-Vertical position = ( current screen y resolution ) – 40The new technique has been created to bypass adblockers and is a lot harder to recognize because of how cleverly it covers itself. Closing the browser window using the “X” button is not enough. Users are recommended to use Task Manager to ensure there is no remnant running browser processes and kill them."}, {"title": "PayPal Admits That 1.6 Million Customer Details Stolen At Recently Acquired TIO Networks", "date": "December 4, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "PayPal notified clients on Friday that private data for 1.6 million individuals may have been stolen by hackers who breached the systems of its subsidiary TIO Networks, which is a Canadian organization that operates a network of over 60,000 utility and bills payment kiosks across North America. PayPal acquired it in July 2017 for $238 million in cash.On November 10, PayPal said that TIO had suspended operations in an attempt to protect clients following the discovery of security flaws on the subsidiary’s platform.According to PayPal:\nThis ongoing investigation has identified evidence of unauthorized access to TIO’s network, including locations that stored personal information of some of TIO’s customers and customers of TIO billers. As a result, PayPal is taking steps to protect affected customers.The payments giant said that the PayPal platform is not affected in any way, because the TIO systems are totally separate from the PayPal network, and PayPal’s clients’ data remains secure.“PayPal is working with a consumer credit reporting agency to provide free credit monitoring memberships. Individuals who are affected will be contacted directly and receive instructions to sign up for monitoring.”TIO said that the services will not be completely restored until it’s sure that its systems and network are secure."}, {"title": "After the CEO of Uber has disclosed a new data breach; Three of the Company’s Security Managers have Resigned", "date": "December 4, 2017", "topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "Uber’s CEO, Dara Khosrowshahi, who was placed in the top job in August, revealed the data breach last month shortly after studying of it himself, saying that “none of this should have occurred.” Uber’s security exercises are also under investigation in a high-stakes legal battle with self-driving car organization Waymo, an Alphabet Inc subsidiary.Uber last week announced it fired its chief security officer, Joe Sullivan, over his part in the 2016 data breach, which endangered data belonging to 57 million clients and about 600,000 drivers. The resignations Friday came amid climbing frustration within Uber’s security team over Sullivan’s release and the company’s treatment of the public disclosure of the breach.The three managers who resigned were Pooja Ashok, chief of staff for Sullivan; Prithvi Rai, a senior security engineer and the number two manager in the department; and Jeff Jones, who handled physical security, the Uber spokesperson said. Ashok and Jones will remain at the business until January to assist in the transition, the spokesperson said.A fourth person, Uber’s head of Global Threat Operations, Mat Henley, began a three-month medical leave, said a separate source familiar with the situation. The variances include most of Sullivan’s direct reports.None of the four directly replied to requests for an explanation. Emails in association with the departures, represented by the separate source, complained of nervous and physical strain from the past year.Sullivan in August told News that his security team added around 500 employees.Leadership in the unit has been in confusion since the end last week of Sullivan and a deputy, as well as Uber’s access that it paid $100,000 to hackers to delete taken data from the October 2016 breach and keep it secret, while failing to notify the incident to controls or warn consumers that their phone numbers and other data had been exposed.In the Waymo case, deposition at a pretrial hearing this week focused on allegations by former employee Richard Jacobs that Uber had a distinctive unit within its security team that tried to obtain programming code and other trade puzzles from rivals.Take your time to comment on this article."}, {"title": "Fake Windows Troubleshooting Support Scam Convince Users Into Purchasing A Fake Windows Defender", "date": "November 30, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "“Windows Troubleshooting” is a new nasty scam that distributes as cracked software installer, it displays a fake BSOD, or Blue Screen of Death, on the infected machine and then shows Troubleshooting Windows pop up that seems like legit Windows Troubleshooter.The Troubleshooting scam has been detected by Pieter Arntz (a security researcher from Malwarebytes), the researcher said that Tech Support Scammers use different techniques for distributing themselves. This particular one was offered as a cracked software installer.After installed, the scam will say that your Windows cannot be fixed, prevents you from using Windows, and encourages you to buy a program using PayPal to fix the “detected problems” and unlock the screen.The option of “Buy Windows Defender Essentials” will open a PayPal page to let you purchase the app for $25. The funds will be transferred to the following PayPal address “[email protected]” and use the following URL:\n“https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=DXKLEMZTGTTDY”After a successful payment, victims will be redirected to “hitechnovation.com/thankyou.txt”, which includes the word “thankuhitechnovation” that tells the program to open a new screen that pretends to fix the issues and enables the victim to close the program.How to remove it?To remove this scam, you should first bypass the lock screen, the malware uses a simply breakable mechanism to verify if a victim made a payment or not. But, you can simply workaround this issue by following these steps:– Open the fake PayPal purchase screen.\n– Press Ctrl + O keys from the keyboard to launch open dialog box.\n– Type http://hitechnovation.com/thankyou.txt into Open box and press enter.That’s all. You should be able to close the window and access your Windows because the program will think the user paid and shut itself down."}, {"title": "NSA and US Army’s Classified data was stored in an unprotected server", "date": "November 30, 2017", "topics": ["Hacking News", "News", "Uncategorized"], "authur": "Harikrishna Mekala", "body": "This batch of data was recognized by UpGuard Director of Cyber Risk Research Chris Vickery in September and included information from the US Army Intelligence and Security Command an intelligence collection facility jointly run by the US Army and the National Security Agency (NSA). The information was put in an Amazon Web Services S3 cloud storage bucket mistakenly configured for public access. Within the accessible repository found under the very obviously labeled ‘inscom’ subdomain were 47 viewable files and folders, three of which were ready to be downloaded. The largest downloadable file included a virtual hard drive, which seemed to be used for receiving, transmitting and handling classified data, with files within it ranked as “Top Secret” and “NOFORN” a group meaning that no foreign nationals can view the records regardless of what permission level they hold. There were also private keys used for accessing distributed data systems and hashed passwords stored on the hard drive.The other two downloadable files stored instruction for the contents of the file with the virtual hard drive and what seemed to be a training snapshot on how to label and categorize classified data. At least some of the data in the repository was accessed and achieved by a third-party INSCOM partner.“Although the UpGuard Cyber Risk Team has found and served to secure multiple data exposures involving sensible defense intelligence data, this is the first time that obviously classified information has been among the exposed data,” said UpGuard in its report. Previous UpGuard finds add sensitive data exposed by a defense contractor, a Verizon partner, a federal ad strategizing firm hired by the GOP, a voting machine supplier and a major consulting and management organization.Take your time to comment on this article."}, {"title": "Tizi Backdoor Records WhatsApp, Skype, and Viber Calls", "date": "November 29, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "A backdoor known as Tizi has been detected by Google Play Protect that installs spyware onto Android devices in an attempt to steal data from popular social media applications.The Google Play Protect security team first discovered this family in September 2017 when they detected an application with root abilities. After that, they found many other applications in the Tizi family with same malicious behaviour.According to Google:\nThe team used this app to find more applications in the Tizi family, the oldest of which is from October 2015. The Tizi app developer also created a website and used social media to encourage more app installs from Google Play and third-party websites.Once the backdoor installed, the fake app gains root access of the infected device to install spyware, then send an SMS message with the GPS location of the infected device to a particular number.The Tizi backdoor contains many abilities such as recording voice calls from WhatsApp, Skype, and Viber; sending and receiving SMS text messages; and obtaining calendar events, call logs, contacts, photos, Wi-Fi passwords, and a list of all installed applications. The backdoor can also record ambient audio and take pictures without displaying the image on the device’s screen.We recommend these 4 basic steps:\n– Check permissions.\n– Enable a secure lock screen.\n– Update your device.\n– Ensure Google Play Protect is enabled."}, {"title": "Bitcoin Gold Windows Wallet Has Been Hacked!", "date": "November 28, 2017", "topics": ["Hacking News"], "authur": "Eslam Medhat", "body": "Users of Bitcoin Gold (BTG) are suffering from another cybersecurity issue. The Bitcoin Gold team has earlier reported that someone was able to access their Github repository for the project and replaced the compiled Windows installer file with a “suspicious” file.According to a critical warning sent by BTG:\nAnyone who downloaded the Windows Wallet file between November 21, 2017, 09:39 UTC, and November 25, 2017, 22:30 UTC, should not use the file in any way.The team also said that If the suspicious file was used, the machine on which it was used should be addressed with extreme attention; users should delete the file and the computer should be thoroughly scanned for malware and viruses.The team also said that If the suspicious file was used, the machine on which it was used should be addressed with extreme attention; users should delete the file and the computer should be thoroughly scanned for malware and viruses.Developers said that the fake wallet application did not trigger any malware detections with antivirus software and they were not able to identify any malicious behaviour. But, they labelled the file as “suspicious”.“Until we know otherwise, all users should presume this file was created with malicious intent – to steal cryptocurrencies and/or user information.“Below are the current right SHA-256 checksums for Bitcoin Gold Windows and Linux wallet applications. Only windows version was affected.Windows file SHA-256:\n53e01dd7366e87fb920645b29541f8487f6f9eec233cbb43032c60c0398fc9fa\nbitcoingold-0.15.0-win64-setup.exeLinux file SHA-256:\n25d7bf0deb125ecf5b50925a1c58e98c4b0b0a524470379c952f6b9310e97cfe\nbitcoingold-0.15.0-x86_64-pc-linux-gnu.zip"}, {"title": "Golden SAML technique allows attackers forge authentication to cloud apps", "date": "November 27, 2017", "topics": ["Hacking News", "Vulnerabilities"], "authur": "Eslam Medhat", "body": "A new method named “Golden SAML” has been discovered by security researchers from CyberArk Labs allows cybercriminals forge authentication requests and access the cloud-based applications of organizations that use SAML-compatible domain controllers (DCs) for the authentication of users against cloud services.Attackers can exploit Golden SAML to generate fake enterprise identities and forge auth to obtain access to valuable cloud resources in a federated environment.Security Assertion Markup Language (SAML) is an open standard for exchanging authentication and authorization data between an identity provider and a service provider.According to CyberArk:\n“In a golden SAML attack, attackers can gain access to any application that supports SAML authentication (e.g. Azure, AWS, vSphere, etc.) with any privileges they desire and be any user on the targeted application (even one that is non-existent in the application in some cases).”A SAML normal authentication attempt would look like the image below:\nIn a Golden SAML attack, the client will be the attacker, and the auth process will be changed to take place like in the image below:\nAttackers can use specific tools to obtain the IdP’s private key that is used to sign authentication tokens then use this private key to generate “golden tickets” for auth against cloud-based apps, posing as the IdP."}]