[{"title": "Code Execution Bug In Github Fetches $18,000 to Hackers", "authur": "William Fieldhouse", "body": "GitHub recently has awarded $18,000 to a researcher after he found a bug in the GitHub Enterprise management console which could have resulted in a remote code execution flaw.The company has patched this vulnerability by the end of January, but the news about the flaw did not surface until this week when the GitHub and a German independent pen-tester named Markus Fenske disclosed it.GitHub Enterprise is an on-premises version of GitHub.com that can be used to deploy a GitHub service on their organisation’s local network. This vulnerability is actually a combination of two bugs, Fenske told Thursday.One main problem stems from the fact that they are using a static value to sign the Ruby on Rails session secret for the console. This secret value is supposed to be a randomly generated one per-machine value which is used to sign the cookie, not a static one.GitHub has acknowledged on Tuesday that this static secret was only supposed to be used for their testing and development, but “an unrelated change of the file permissions prevented the intended session secret from being used.”“For testing purposes, they have replaced it with a static value and just forgot to change it back,” Fenske told. In the production environment, there was a mechanism that should have replaced it with a random value. But it did not work.”While GitHub shouldn’t have been using a static secret to sign cookies that hold session data, the other problem, Fenske says, is that session data could be serialised with Marshal. Marshal, a library that converts collections of Ruby objects into a byte stream, has a method, .load, that can return the result of converted serialised data.By knowing this secret, any attacker could have forged a cookie, deserialized by the Marshal.load, and would have tricked GitHub into running whatever code he wanted.Source: Threatpost", "date": "March 21, 2017", "topics": ["Hacking News", "News"]}, {"title": "Microsoft Edge Is The Most Hacked Browser At Pwn2Own 2017", "authur": "William Fieldhouse", "body": "The popular Pwn2Own 2017 hacking contest, which has celebrated its 10th anniversary, came to an end of their three days session in which various security teams have hacked away many browsers and operating systems. Microsoft’s Edge seems to have taken the highest number of hits, while Chrome remained unhackable during this contest.Microsoft has created the Edge browser by rewriting the most of it from the scratch (some parts were even forked from Internet Explorer). The goal of the company was to have a browser which is much more secure and can keep up with Firefox and Chrome when it comes to supporting the latest web and internet standards. The Edge has even implemented sandboxing technologies which are similar to what the Chrome is using, which put it ahead of the Firefox. The Firefox is still trying to play catch-up in this game.But, despite all these improvements in the code cleanness and the security technologies, it did not quite proven itself when it was faced with experienced hackers at contests like Pwn2Own. In last year’s edition of Pwn2Own, the Edge proved to be a little better than the Internet Explorer and the Safari, but it still ended up being hacked twice, while the Chrome is only hacked once.The condition this year seems to have gotten worse rather than better, for Edge. In the last year’s Pwn2Own, the Microsoft’s browser was hacked more than five times.On the first day, Team Ether (Tencent Security) was the first to hack Edge through an arbitrary write in the Chakra JavaScript engine. The team also used a logic bug in the sandbox to escape that, as well. The team got an $80,000 prize for this exploit.On the second day, the Edge browser was attacked fast and furious by multiple teams. However, one was disqualified for using a vulnerability that was disclosed the previous day. ", "date": "March 20, 2017", "topics": ["Hacking News", "News"]}, {"title": "Hackers Make $105K From A VM Escape At Pwn2Own", "authur": "William Fieldhouse", "body": "The contestants at the Pwn2Own hacking competition in Vancouver this year have just pulled off an unusually impressive feat. They have managed to compromise Microsoft’s Edge browser in a specific way such that ti escapes a VMware Workstation virtual machine it is running in. This hack fetched them a prize of $105,000, which is the highest awarded so far in the past three days.According to a tweet this Friday morning, from the contest’s organizers: the members of Qihoo 360’s security team have carried out a hack by exploiting heap overflow bug in Edge, a kind of confusion flaw in Windows kernel and an uninitialized buffer vulnerability in the VMware. The result is a “complete virtual machine escape.”In an e-mail, the Qihoo 360 Executive Director Zheng Zheng wrote, “We have used a JavaScript engine bug within the Microsoft Edge to achieve code execution inside the Edge sandbox, and we used a kernel bug in Windows 10 to escape from it and fully compromise guest machine.” He continued, “Then we have exploited a hardware simulation bug within the VMware to escape from the guest operating system to host one. All if this started from and only by a controlled a website.”Virtual machines are very crucial to the security of large organisations and individuals everywhere. In server hosting environments, they are used as containers which prevent one customer’s operating system and data from being accessed by another customer who is sharing the same physical server. Virtual machines like the VMware Workstation hacked Friday are also used on desktop computers to isolate untrusted content. Should the guest operating system be compromised through a drive-by browsing exploit or similar attack, the hackers still don’t get access to data or operating system resources on the host machine.Friday’s success underscores the central theme of Pwn2Own, that no operating system or application is immune to hacks that thoroughly compromise its security. ", "date": "March 18, 2017", "topics": ["Hacking News"]}, {"title": "Anonymous Brazil Hacks Football Club for Hiring Goalkeeper", "authur": "William Fieldhouse", "body": "The ever so popular hacktivist Anonymous with the help of its counterparts in Brazil has hacked the official website of the Boa Esporte which is a second division football club in state of Minas Gerais. Their website was defaced not just once but twice, the hackers left a deface page along with a message explaining why they have done the attack on them.The reason for targeting the Boa Esporte is its recent initiative of hiring a goalkeeper named Bruno Fernandes das Dores de Souza who was sent to prison for only brutally murdering his ex-girlfriend and his mother of his kid Eliza Samudio in 2010 but also feeding her to his dogs.This Fernandes is more famous by his first name Bruno and was sentenced to prison for about 22 years, but due to the legal technicality, he was released last month. After this, Boa Esporte hired him. Bruno still claims to be innocent of the crime but the hacker community thought otherwise and they decided to hack Esporte’s website and present some messages like “Has Bruno told where is Eliza’s body?”. The site is then hacked for the second time in one day with messages against domestic violence against the women in Brazil. The hackers have also left pictures of Bruno and Eliza as a deface page along with statistics of women in Brazil killed since 2013.The picture of Bruno is a magazine cover in which he’s urging people to “Let him play” while the picture of Eliza is a result of photoshop in which she’s shown saying “I would like to see my son grow.”Site oficial do Boa Esporte é hackeado após contratação do goleiro Bruno #globoesporte https://t.co/FZpFPACmbi— Boa Esporte Clube (@Boa_Esporte) March 12, 2017In must be noted that hackers are not the only community criticizing the hiring of Bruno. In fact, people on social media in Brazil also opposed the decision urging companies to stop sponsoring Boa Esporte. As a result, the food supplementing company Nutrends broke off its sponsorship of the club. ", "date": "March 18, 2017", "topics": ["Hacking News"]}, {"title": "US Military Top Secret Files Leaked Due to an Unsecured Drive", "authur": "William Fieldhouse", "body": "Documents of US Air Force were left on an unsecured backup drive and they are exposing highly sensitive personnel information files on over 4,000 senior and high-ranking officers.According to the security researchers at Mackeeper, the gigabytes of files are accessible to anyone because there is not even a password to protect the drive.This information varies from names and address of 4000 officers, and with their ranks to even their Social Security numbers.Another file is found on this same drive and it lists the security clearance levels of many officers, possibly hundreds, even people with “top secret” clearance, this potentially makes them targets for many people who are trying to get their hands on such details.Other spreadsheets contained contact information of staff and their spouses, along with private personal information and sensitive data.The Mackeeper report indicates that the drive belongs to a lieutenant colonel whose name was not mentioned due to security reasons. Security researcher Bob Dianchenko notified that the owner of the situation and the data was secured.The most shocking document was a spreadsheet of this open investigations which has included the rank, name, location and a detailed description of all the accusations. While many of these accusations were of discrimination, there are also some sexual harassment claims and even more serious.“One example is an investigation into a Major General who is accused of accepting $50k a year from a sports commission that was supposedly funnelled into the National Guard. There were many other details from investigations that neither the Air Force or those being investigated would want publically leaked,” the report reads.Another file has the Defense Information System instructions for encryption of key recovery, which is step-by-step on how to regain the access to an encrypted key, complete with all URLs where someone can request the information regarding the Common Access Card and the Public Key Infrastructure.\n", "date": "March 16, 2017", "topics": ["Hacking News", "News"]}, {"title": "Bug Allows Hackers to Compromise Headphones on Nexus Devices – Fixed", "authur": "William Fieldhouse", "body": "In their recent series of updates, Google has addressed a new set of patches which can make the Nexus 9 devices vulnerable to malicious headphones, reveals the team of security researchers.This vulnerability was tracked as CVE-2017-0510 and it is rated as a critical severity security flaw. This security flaw is described as an extension of the privilege vulnerability code inside the kernel FIQ debugger which “can enable a local malicious application to execute the arbitrary code within context of the kernel.” This issue can lead to a permanent compromise of local devices, and thus leaving the users only one option to repair the device: reflashing the operating system.This bug was found by the Aleph Research, an ex-IBM X-Force researchers team. Despite unusual attack vector, this team is also able to leak stack canaries, derandomize the ASLR (address space layout randomization), conduct a factory reset, and even access the HBOOT, which allowed these people to communicate with internal System-on-Chips (SoCs).The author explained clearly in a blog post , Aleph Research explains that attacks via multiplexed connectors were initially detailed in a BlackHat 2013 paper that focused mainly on USB ports and only briefly mentioned audio connectors. At the time, Nexus 4 was found to include a “TTL UART interface hidden in its headphone jack, a functionality which is enabled if the voltage on the MIC pin exceeds some threshold,” with all Nexus devices (Pixel too) known to have the functionality nowadays.Researchers discovered that the FIQ (Fast Interrupt Request) Debugger could be accessed on Nexus 9, although without a shell on production builds. Hay notes that “FIQ Debugger functionality is enabled even if the UART cable is inserted when the platform is up,” and explains that the supported commands allow for the exfiltration of a lot information by interacting with FIQ Debugger.A hacker, Hay reveals, could dump the process list and can use the console command to view the kernel log and receive an unprivileged shell (on userdebug, eng builds only), or can dump the registers and call stack too.  ", "date": "March 13, 2017", "topics": ["Hacking News", "News"]}, {"title": "1Password Will Give You $100,000 If You Can Crack Its Vault", "authur": "William Fieldhouse", "body": "AgileBits, the developer behind 1password is ready to pay you a bug bounty of $100,000 if you can break into their vault nd obtain a plain text file of “bad poetry.”Earlier, a “capture the flag” bug bounty like this has a mere $25,000. Even though that sum is quite high when it comes to bug bounties, it feels like a pocket change when compared to the new one.The AgileBits through all means necessary, seems to want, to demonstrate that its service is safe, taunting security researchers to find any vulnerabilities if they can.You can find the bounty program on Bugcrowd, which is a general platform for crowdsourcing bug hunts. Any companies can reward security researchers for their discoveries. This is the biggest bounty that is currently on the platform because AgileBits wants to prove a point – that it takes security seriously.Of course, that is how it should be given how 1Password is a popular password manager, keeping all the user login credentials in the same place. If that is cracked, it could pose a very serious security problem to all of its users.“We owe it to our customers to do everything in our power to keep them and their information secure. This means using the ingenuity of real people to help us continually improve the security of 1Password. It was important to us to demonstrate how seriously we take this contribution and have increased the prize to prove it,” AgileBits’ Jeff Shiner told Tom’s Hardware.So how does all this all work? The bug bounty specifies a specific account which white hats will have to breach to get the bad poetry file in it. Of course, most of the users would not be facing an attack like the one normal on their account, but it is a good test for the service. With the increased popularity of password managers, 1password wants to prove its service is safe.", "date": "March 13, 2017", "topics": ["Hacking News", "News"]}, {"title": "WikiLeaks and Tech Companies Join Hands to Fix Security Flaws Exploited by CIA", "authur": "William Fieldhouse", "body": "WikiLeaks will join hands with tech giants like Apple, Google and other such tech companies to fix the flaws that CIA has taken advantage of to hack computers, phones, and other such devices. Julian Assange has made this announcement and came as a reaction to the criticism brought by the public against the WikiLeaks for exposing the data trove for shock value without taking any extra step to help secure these services used by billions of people.Julian Assange, the founder of WikiLeaks, during an online news conference, said that they would work with Google, Apple, and all other technology companies to fix these issues, topping the list of vulnerabilities the companies have discovered themselves among these available files.In the same news conference, Assange has accused CIA of withholding the information about various vulnerabilities and the agency was exploiting the American technology, especially after they have realised that documents describing the flaws had been leaked some weeks ago.Apple, Google, and the Linux Foundation are just some of the many companies which have already stepped forward and said they have fixed “most” of the vulnerabilities which the WikiLeaks documents talked about.“There is a limited ability to try and produce the security fixes for Samsung TVs, for the iPhones, for Android phones produced by Google, for Linux, for Microsoft, because the exact technical details are not well known. We have decided to work with them to give them some exclusive access to the additional technical details we have, so that fixes can be developed and pushed out so people can be secured,” Assange said.This is a bit of a weird role to see Assange in, given his past statements – a defender of tech companies.“Why has the Central Intelligence Agency not acted with speed to come together with Apple, Microsoft, and other manufacturers to defend us all from its own weapons systems,” Assange added.\n", "date": "March 12, 2017", "topics": ["Hacking News", "News"]}, {"title": "Hundreds of Android Security Flaws Patched By Google In Its March Update", "authur": "William Fieldhouse", "body": "Google is very busy in updating the Android OS with the third and most probably the biggest security patch update which the company will release this year. The Android update in March 2017 fixes 105 security issues.This marks a great increase in the number of identified security flaws ever since when Google released a patch for Android back in March 2016 when it contains only 19 flaws and fixes for them, while this year’s patch will fix around 105 flaws. Totally, Google has provided patches for 253 Android vulnerabilities. Nearly 90 of these are patched in January, 58 in the month of February and then 105 in March.According to their official post on the Android blog, The Google has regarded 35 of these 105 vulnerabilities as a highly critical regarding the severity level. Just like the old times this time also,  the media server component is believed to be a very important source of many vulnerabilities.Out of the 35 critical flaws, 9 are remote code execution vulnerabilities identified in Google’s media server whereas the same component is believed to be harvesting seven more high impact denial of service flaws. Two of the 35 vulnerabilities have been labeled as having a moderate impact. Google has always made it a point to patch media server oriented vulnerabilities in all of its updates, but it hasn’t yet disclosed the potential risks that these flaws pose to users. According to Android security director at Google, Adrian Ludwig, there haven’t been any confirmed cases of exploitation of users resulting from the Stagefright media server flaws.There are around 35 flaws that are Qualcomm driver oriented and patched in the March 2017 Android update by Google. These flaws include privilege boosting issues in some its components such as Wi-Fi, bootloader, networking, fingerprint sensor, GPU drivers, and the camera. Six of all these 35 Qualcomm driver flaws are rated critical.", "date": "March 11, 2017", "topics": ["Hacking News"]}, {"title": "Notepad++ And VLC Issues An Update After Vault7 Documents Leak", "authur": "William Fieldhouse", "body": "On the 7th of Match 2017, the Wikileaks has made most possibly the biggest data leak ever about CIA, in a series of documents which are code-named “Vault 7”. In this documents, there are details about the existence of a huge cyber espionage campaign but also show how the agency used zero days security flaws in Windows, MacOS, iPhones, Linux,  and Android devices, There are several other popular software including Notepad and video player VLC.The VLC player has issued an official statement regarding this topic but the Notepad++ has released patches as their name was first on the list of softwares used by the CIA to target Windows users.In its official blog post Notepad++ said the following:The issue of hijacked DLL concerns scilexer.dll on compromised PC, which is then replaced by a modified scilexer.dll built by CIA. When Notepad++ was launched, the modified scilexer.dll is first loaded instead of the original one installed by the creators.It does not mean that CIA is interested in knowing your coding skill or in your sex message content in the Notepad++, but rather they prevent raising any red flags while their DLL does the data collection in background.It’s not a security issue or vulnerability in Notepad++, but to cure this issue, from the release (v7.3.3) forward, notepad++.exe checks the certificate validation in the scilexer.dll before it is actually loaded. If their certificate is found missing, then Notepad++ will fail to launch.Just like knowing lock is useless for those people who are willing to get into my house, I still shut the door and lock it every morning when I leave home. We are in a f**king corrupted world, unfortunately.Otherwise, there are a lot of enhancements and bug fixes which improve your Notepad++ experience. For all the detail change log, please check on the Download page.”Notepad users are advised to download its latest 7.3.3 version from here and also report any bug they find on Notepad++ forum.Image source: Hackread", "date": "March 11, 2017", "topics": ["Hacking News", "News"]}, {"title": "CIA Finally Responds To WikiLeaks Information Dump", "authur": "William Fieldhouse", "body": "The Central Intelligence Agency (CIA) has released a statement in response to the information dumps made by the WikiLeaks about the advanced tools that CIA posses, and stated that they did not conduct any electronic survillance on Americans.The the FBI and CIA launched an investigation in the Vault 7 dump and some unnamed U.S. officials said Reuters that a CIA contractor is the most possible reason for this data breach.During their first press release, Wikileaks said the files are originating from the CIA’s Center for Cyber Intelligence or simply CCI which is in Langley, virginia and has been circulating among the former government contractors and hackers. It is most likely that one of them has provided the information to the Wikileaks.The authenticit of the leaked documents is something that CIA refused to comment on and also about the further investigation about this incident. But, the agency pointed out that their mission is to “aggressively collect” the foreign intelligence from overseas sources in an effort to protect the America from threats like terrorists and hostile nation states.“It is the job of CIA to be innovative, cutting-edge, and first line of defence in protecting this country from enemies abroad,” said the CIA in its statement.The nature of tools suggests that all of them are designed ot operate on specific operations rather that mass surveillance and the CIA pointed out that it is legally prohibited from spying on individuals in United States. The agency said their activities “are subject to rigorous oversight to ensure that they comply fully with U.S. law and the Constitution.”The organisation has expressed concern about the impact of the Vault 7 dump on its operations.“The American public should be deeply troubled by any Wikileaks disclosure designed to damage the Intelligence Community’s ability to protect America against terrorists and other adversaries. Such disclosures not only jeopardise U.S. personnel and operations but also equip our adversaries with tools and information to do us harm,” the agency said.", "date": "March 11, 2017", "topics": ["Hacking News", "News"]}, {"title": "Cyber Attack Simulation Startup Cymulate Raises $3 Million", "authur": "William Fieldhouse", "body": "In the midst of the breaking news of Wikileaks about the true power of the CIA and CIA reacting to it, we see that Cymulate Raises $3 Million in Series of A Funding to Expand Cyber Attack and Simulation BusinessThe Israel-based cybersecurity startup Cymulate has announced on Friday that they have raised a whopping $3 million through a Series A round of financing led by the investment firm Susquehanna Growth Equity.The company was founded by Avihai Bar Yosef and Eyal Wachsman. This company is in Israel. Cymulate offers a cloud-based platform for cyber attack simulation which helps many organisations to assess the security of different systems, such as Windows Domain Network configurations, email, web traffic, web servers, and many more.“By using a game-changing combination of both defence and offensive security and SaaS platform, we at Cymulate helps organisations expose the critical vulnerabilities that are present in their security infrastructure before an original attack take place,” the company founders explains.All the customers can run a one-time security assessment for a price of $9,999. There are many plans available for both enterprise customers and also service providers.", "date": "March 11, 2017", "topics": ["Hacking News"]}, {"title": "Decrypted PlayStation Accounts of 640,000 Users Being Sold on DarkWeb", "authur": "William Fieldhouse", "body": "Researchers claim that the Dark Web marketplaces may be going down at a very fast pace after the major cyber attack by Anonymous on 10,000 websites in dark web.Last week according to a report in HackRead,  a vendor who is found selling more than 1 million Yahoo Gmail accounts in a Dark Web marketplace. Again, the very same vendor is again seen selling listings and this time they are PlayStation users.The handle name of this vendor is “SunTzu583”. They have been selling 640,000 accounts of PlayStation users for just USD 35.71 (nearly 0.0292 BTC) these are stolen from an unknown database. All these accounts has emails along with their clear-text passwords.According to the SunTzu583, this database was not completely stolen from the PlayStation servers, but it sure does contain some unique accounts of the PlayStation users. The SunTzu583 goes on and explains which these accounts may also work on other sites however they are mainly used for the PlayStation-related activities.It must be should also be noted that in 2015, 2.5 million Xbox (Xbox 360 ISO) and Playstation accounts (PSP ISO) were stolen and leaked on the Dark Web marketplaces in February 2017. Also, about five months ago several PlayStation users were complaining that their accounts have been hacked and in some cases, their funds were missing.While the vendor has already announced that the database is not directly stolen from PlayStation servers, it is quite possible that it was taken from a third party server. We at latesthackingne can not confirm the authenticity of this database, but if you have an account on PSN, it is advisable to change its password and also use a different password on other sites.PSN users are not the only one to suffer. Currently, gaming giants including LifeBoat,Epic Games, ESEA, Envoy,  Clash of Clans forum, etc. are also having their data sold on Dark Web marketplaces.Image source: Hackread", "date": "March 10, 2017", "topics": ["Hacking News", "News"]}, {"title": "Google and Apple Says Their Users Are Safe Against CIA Exploits", "authur": "William Fieldhouse", "body": "Afer the huge uproar in people in fear of their privacy, the top companies Google and Apple have come out confidently that most of the vulnerabilities noted by WikiLeaks in the “Vault 7” release, only focuses on hacking tools allegedly used by U.S. Central Intelligence Agency (CIA), and they do not affect the latest versions of their wide range of products.The Microsoft is yet to provide any information and it is now investigating the leaked documents. On the other hand, the Apple said that their initial analysis suggests that most of the issues found in the Vault 7 leaks are patched in their iOS operating system’s latest version. They pointed out that more than 80 percent of the customers are only running the latest release. Moreover, the company has promised to continue working and quickly addressing these identified flaws.Even the Google is busy analysing the leaked data, but the tech giant is confident that the security updates and protections in the Android operating system and Chrome can protect the users against many of these exploits.The files released by WikiLeaks suggest that the CIA has the tools and also capabilities needed to hack any type of system, including desktop computers, networking equipment, mobile devices, and Internet of Things (IoT) devices.The vulnerabilities which affect the operating systems like iOS and Android could have a critical impact as they will allow the attackers to gain control of a device and then access the sensitive user information. Hackers can even obtain messages exchanged via secure applications such as Signal and Telegram without having to break their encryption.Security firms have scrambled to assess the impact of the CIA hacking tools, but so far there is no evidence that the intelligence agency’s exploits are very sophisticated. A majority of the disclosed vulnerabilities have either been patched a long time ago, or they are considered low severity. ", "date": "March 9, 2017", "topics": ["Hacking News"]}, {"title": "The Encrypted Messaging Apps Are Not So Safe And Its Not Their Fault", "authur": "William Fieldhouse", "body": "Right from the moment Wikileaks leaked the data which reveals the true capabilities of CIA, people are urging each other to uninstall the messaging and social networking apps, as CIA can crack the encrypt the messages sent by these apps. The main problem here is not with the apps, but with the operating system itself.People started worrying about their privacy but there are no indications that the CIA has done anything illegal with their power, they just happened to notice a few zero-day vulnerabilities in the giant companies and did not take the responsibility to share the information with the respective companies, potentially putting millions of users at risk.Then, there is another fact that that, the CIA has developed a malware which can bypass the encryption layers used by the popular messaging and social networking apps like, Signal, Telegram, WhatsApp and so on. This is actually not the fault of the apps, since the CIA has based its malware on the Android and iOS, zero-day bugs which they found but choose not to tell Google or Apple about it.When the operating system itself is attacked, there is very little that an app can do to protect the user any further. Since the app itself is made to fit with the operating system. The app depends on it to function properly. Once you have received a message, the app will do what it is supposed to do- decrypt the message. But, if the operating system is compromised by a malware like the one built by the CIA, you can easily give-up on that data since it is no longer protected.Even regular hackers can compromise your device without that much trouble as bypassing app encryption settings. If, for instance, you tap a link you shouldn’t, download a malicious file which then triggers a malware to be downloaded to your device, you can be just as vulnerable.", "date": "March 9, 2017", "topics": ["Hacking News"]}, {"title": "Fortune 1000 Companies More Likely to Face Data Breaches", "authur": "William Fieldhouse", "body": "A new report reveals that the Fortune 1000 companies suffer twice the amount of data breaches their peers.According to the BitSight’s latest report titled “How Secure Are America’s Largest Business Partners? and Rating Cybersecurity Performance of Fortune 1000,” companies which are part of this list are very likely to suffer a data breach. The report also shows that companies with a Security Rating 900 are top and are the safest, while the companies with Security Rating of 500 or lower have five times more chance to experience a publicly disclosed breach compared to companies with a Security Rating of 700 of even higher.“Understanding security maturity of the Fortune 1000 companies provided greater context for any organisation looking to benchmark their own performance,” said Stephen Boyer, the co-founder and CTO of BitSight. “Moreover, the data can be used to improve inform companies of the risks posed when they are sharing data or network access with the Fortune 1000 organisations. For an example, a primary reason for a Fortune 1000 company to have a lower median Security Rating is because of a higher frequency of system compromise on their networks. Awareness about the incident detection and response practices should factor into the process of screening the new vendors.”The BitSight researchers have found that at least one out of every 20 Fortune 1000 companies has experienced a publicly disclosed breach, they found this observing over the past 15 months. Of course, the size of the issue depends on the size of the company. It should also be added that the companies that deal over the Internet a lot have a higher risk of being targeted by hackers, and therefore, to suffer a data breach.There is also the greater problem that a majority of Fortune 1000 companies are found to have at least one remote administration service running on an open port, which may allow unauthorized access to machines.", "date": "March 8, 2017", "topics": ["Hacking News", "News"]}, {"title": "Vault 7: WikiLeaks Reveals CIA’s True Hacking Capabilities", "authur": "William Fieldhouse", "body": "Today, Wikileaks has published a massive collection of data which is the biggest ever leak on CIA( Central Intelligence Agency). This immediate sensational news highlights the hacking capabilities for of CIA.This leak was named Vault 7 by the Wikileaks. All the details regarding the leak are supposed to be presented by Julian Assange himself, but, due to various attacks on his Facebook and Periscope streaming, the organisation is forced to rescheduled this presentation and they have released 8,700 confidential documents.NOTICE: As Mr. Assange's Perscipe+Facebook video stream links are under attack his video press conference will be rescheduled.— WikiLeaks (@wikileaks) March 7, 2017All these documents provide us with a deep insight on what CIA can do when it comes to hacking and cyber espionage against the victims including Internet technology giants, unsuspecting users,  governments, medical sector and leaders across the world.RELEASE: Vault 7 Part 1 \"Year Zero\": Inside the CIA's global hacking force https://t.co/h5wzfrReyy pic.twitter.com/N2lxyHH9jp— WikiLeaks (@wikileaks) March 7, 2017According to Wikileaks’ press release:The first full part of series, “Year Zero”, contains 8,761 documents and files from a isolated, high-security network situated inside CIA’s Center for Cyber Intelligence in Virgina. It follows an introductory disclosure in last month of CIA targeting French political parties and the candidates in the lead up to the 2012 presidential election.Recently, CIA lost control of majority of their hacking arsenal including viruses, malware, trojans, weaponized “zero-day” exploits, and associated documentation malware remote control systems. This an extraordinary collection, which contains more than several hundred million lines of code, gives its possessor the entire hacking capacity of the CIA. These documents also highlight the CIA’s tactics in hacking and extracting the confidential data from a targeted smartphone or smart devices like TVs. Furthermore, the leaks show how CIA worked with the United Kingdom’s MI5 to hack Samsung smart TVs and spy on users.“The attack against Samsung smart TVs was developed in cooperation with the United Kingdom’s MI5/BTSS. After infestation, Weeping Angel places the target TV in a ‘Fake-Off’ mode, so that the owner falsely believes the TV is off when it is on. In ‘Fake-Off’ mode the TV operates as a bug, recording conversations in the room and sending them over the Internet to a covert CIA server.”Image Credit:L Hackread", "date": "March 8, 2017", "topics": ["Hacking News"]}, {"title": "Someone hacked a billboard in Mexico and defaced with porn video", "authur": "William Fieldhouse", "body": "Last Friday, in Mexico City a digital advertisement board which is owned by Grupo Carteleras was hacked and featured a pornographic video for a few minutes.The hacked video displays a woman using an electronic toy on herself. It can be noted that along the video, one can see TeamViwer warning tab, this leads us to the conclusion that the sign board is not hacked but someone used the TeamViwer to play this video using his computer which was operating the board. Here, in this case, the browser was Edge or either Internet Explorer while the operating system was the Microsoft Windows.One of the digital advertisement board owned by the Grupo Carteleras located on the busy road in Mexico City was hacked on last Friday and displayed pornographic content for a few minutes. El año pasado apenas pusieron las carteleras ya teníamos el grupo en wpp, que buena clase era ??— Micaa? (@mica_medero) March 3, 2017On the other hand, Grupo Carteleras has acknowledged the hack and contacted the law enforcement authorities for the further investigation.“We publicly denounce this computer attack on one of our screens and understand this discomfort that can cause to the passersby,” Grupo Carteleras said in a Tweet.Informamos que la pantalla de #Periférico, a la altura de San Antonio ha sido apagada.Denunciamos la intromisión a nuestro sistema. Comparte pic.twitter.com/M0McmPJ37n— Grupo Carteleras (@Carteleras) March 3, 2017Whether it is hacked or not, the company should have conducted an investigation to verify how and why TeamViewer warning message is displayed on the screen and if anyone from the inside was behind this act.This is not the first time when an electronic sign board has been hacked and replaced with pornographic content. Just five months ago, a billboard in Indonesia was hacked and got defaced with a Japanese porn video; while in 2015, a Brazilian bus terminal witnessed a similar hacking feat when its bus schedule and advertising on the screen was replaced with pornographic videos.", "date": "March 8, 2017", "topics": ["Hacking News"]}, {"title": "1 Million Yahoo Accounts With Decrypted Passwords Being Sold on Dark Web", "authur": "William Fieldhouse", "body": "As most of us know, Dark web is the marketplace for all sorts of illegal stuff including guns, drugs, fake id cards. Recently, Dark web has become a home ground for the hackers and cyber criminals to sell their stolen database credentials from many Internet giants.Recently a vendor with the handle “SunTzu583” is found selling millions of the Yahoo and Gmail accounts on a dark web marketplace. This listing was published last week and shows this SunTzu583 selling 100,000 Yahoo accounts which he acquired from the Last.FM breach from 2012, during which 43 million user accounts are exposed and all of them are publicly released in September of 2016. The records contain the emails, usernames and their passwords plain text format. The total price to get this listing is only 0.0079 BTC (nearly USD 10.75) probably as the data is already out in the public.There is another listing from SunTzu583 which shows more than 145,000 Yahoo accounts available for sale for 0.0102 BTC (nearly USD 13.75). These accounts also contain email, usernames and their decrypted passwords. According to the research conducted by the HackRead, other accounts are taken from two other separate breaches  that include Adobe breach in October 2013, during which 153 million accounts are breached with each containing an username, email, internal ID, encrypted password and also a password hint in just plain text and the MySpace breach from 2008, during which 360 million user accounts are stolen and all of them are leaked on the dark web back in 2016.Google’s Gmail is known as one of the most secure email service providers, but there is nothing that Google can do when Gmail accounts are stolen due to a third party breach. The data in discussion here is accounts of 500,000 Gmail users being sold on the same marketplace for the price of 0.0219 BTC (USD 28.24).", "date": "March 7, 2017", "topics": ["Hacking News", "News"]}, {"title": "Windows GDI Vulnerability Found By Google Gets a Temporary Fix", "authur": "William Fieldhouse", "body": "A temporary fix is now available for the Windows Graphics Device Interface (Windows GDI) vulnerability which was disclosed a couple of weeks ago.This flaw was initially discovered by an engineer working in Google’s Project Zero team. His name is Mateusz Jurczyk and reported this in March 2016, along with other issues in user-mode Windows GDI library. Microsoft attempted to resolve this bug with their June 2016 patches but failed to do so and so the reported filed another report in November 2016.As per the policy of Google’s Project Zero. The vendors will have 90 days to resolve their disclosed vulnerabilities, otherwise, the vulnerability will be made public, the same applies for the Windows GDI flaw as well. But, since Microsoft did not release a monthly security update in February, and pushed the patches to March, this vulnerability is not resolved within the given 90 days window.Tracked as CVE-2017-0038, this vulnerability is linked to handling of DIBs (Device Independent Bitmaps) that are embedded in EMF records. The security researcher who found it is able to reproduce the same vulnerability both remotely (in Office Online) and locally (in Internet Explorer).Although the Microsoft has not released a fix for this issue yet, Luka Treiber with the help of 0patch Team devised a temporary fix for the issue. For this, the researcher worked with the proof of concept which Jurczyk from Google published, and says that the issue was visible each time the specially crafted EMF file was loaded in Internet Explorer 11.“CVE-2017-0038 is a bug in EMF image format parsing logic that does not adequately check image dimensions specified in the image file being parsed against a number of pixels provided by that file. If image dimensions are large enough the parser is tricked into reading memory contents beyond the memory-mapped EMF file being parsed,” Treiber explains. ", "date": "March 6, 2017", "topics": ["Hacking News"]}, {"title": "Open Source Projects Can Now Conduct Bug Bounty Programs On HackerOne Platform For Free", "authur": "William Fieldhouse", "body": "On the last Thursday, the HackerOne has announced the availability of a free version of their bug bounty platform named HackerOne Community Edition which will allow the open source projets tools for managing their vulnerability submissions and also creating bounty programs to further improve their software security.According to the company, all the eligible open source projects will receive HackerOne Professional subscription service for free. This will provide them vulnerability submission coordination, which is a deduplication service and bounty programs for projects. HackerOne said they will still charge their usual 20 percent payment processing fee on all the cash bounties paid to the bug bounty hunters.The CEO of HackerOne, Marten Mickos spoke to the threatpost through an email statement that the program was the first of its kind. He said that HackerOne aims to ensure that open-source projects received a great support when it comes to running simple, productive and efficient security programs.“Our company, product, and approach is inspired by, built-on, and also driven by open source and a culture of the collaborative software development,” says HackerOne. “We want to give something back.”HackerOne is connecting businesses with the security researchers to help them find software vulnerabilities since it was founded back in 2012. It has ben a great platform form for companies for both public and private bounties, including Kaspersky Lab, Microsoft, Twitter, Adobe, and Facebook. On Thursday, the Rockstar Games became the latest company to announce a public bounty program.HackerOne said it recognises that open source underpins many products and services and said it was compelled to offer the HackerOne Professional subscription for free. The company said currently 36 open source projects use its platform and more than 1,200 vulnerabilities have been resolved in projects, including Ruby, Rails, Discourse, Django, GitLab, Brave, and Sentry.", "date": "March 6, 2017", "topics": ["Hacking News", "News"]}, {"title": "Rockstar Games Launches A Public Bug Bounty Program", "authur": "William Fieldhouse", "body": "This week, the Rockstar Games has launched a public bug bounty program through the HackerOne. They have been running it in private mode for the last nine months.On the page of the program, the company said that the minimum bounty for a successful vulnerability submission is $150, but researchers can get higher rewards, depending on severity level and complexity of the identified vulnerability. However, they note that higher bounties may be paid out at their own discretion.For the time being, the researchers are required to have a look for vulnerabilities only in a limited set of domains operated by the company.The company specified, “No authorization will be given to test any of the other web applications, video game titles or even mobile applications. No bounties shall be given for any disclosures relating to applications outside the scope of this program.”At the very same time, the researchers are encouraged to hunt for the bugs in support.rockstargames.com, because that portal is running on top of the Zendesk platform, and since Zendesk also participates in the bounty program of HackerOne.Interested researchers can head to this bug bounty program’s page and then go through all of the recommendations and guidelines which the company has published there, as submissions which don’t follow these requirements may not qualify for a bounty.Valid submissions, Rockstar Games says, should also include details on the type of the issue that is being reported, the kind of attack, whether it fits a general CWE (Common Weakness Enumeration) number, details on steps to be taken to reproduce the issue (issues that can’t be reliably reproduced cannot be fixed, the company notes), info on potential impact of the bug, and details on how a malicious user could potentially benefit from the issue.“The privacy, security and experience of our users are of the utmost importance. Under no circumstances may any testing target or negatively affect our users. You must use only accounts you own and/or created specifically for testing purposes,” the company also notes. ", "date": "March 5, 2017", "topics": ["Hacking News"]}, {"title": "China Makes Its Thoughts Clear With Its First Cyberpolicy Paper", "authur": "William Fieldhouse", "body": "China listed sovereignty, peace, shared governance, and the shared benefits as their basic principles and included the brief explanations as to how they take the cyberspace in their first cyberpolicy paper named “International Strategy of Cooperation on Cyberspace.”The main aim of the paper is to give a comprehensive explanation of the China’s policy and the position on cyber-related international affairs, basic principles, strategic goals and also a plan of action in its external relations, according to the English translation of this policy which you can check Xihere.This Policy will be used to “guide the China’s participation in the international exchange and cooperation in cyberspace for a period of time, and to encourage international community to come together and enhance dialogue and cooperation to build a peaceful, open, secure, cooperative and orderly cyberspace and a democratic, multilateral, and transparent global Internet governance system,” said, the nation.The paper is also written to address the opportunities and challenges China predicts it will face in its journey.China also highlighted stability and peace in cyberspace, rule-based order, partnership in the cyberspace, reform of international cooperation on cyber terrorism and cybercrimes, the global internet governance system, and the protection of citizen rights and interests including the privacy as key issues.“Cyberspace is the common space of activities for mankind. The future of cyberspace should be in the hands of all countries, Chinese President H.E. Xi Jinping was cited saying in the paper. “Countries should step up communications, increase consensus and also deepen the cooperation to combinedly build a community of shared future in cyberspace.”At the same time, the policy said that “countries should respect each other’s right to choose their own path of cyber development.”According to the paper, China will continue to actively participate in cyber-related international process while building relations with other nations to reach universally accepted international rules and to establish fair and reasonable global cyberspace governance system. ", "date": "March 5, 2017", "topics": ["Hacking News", "News"]}, {"title": "Telegram And Other Messaging Apps Are Helping Scammers", "authur": "William Fieldhouse", "body": "Famous messaging app Telegram seems to have a privacy issue due to one of its key features.According to the researchers from the Fidelis Cybersecurity, Telegram may have a privacy problem which exposes their users to the scammers.The main reason people use Telegram is the encryption feature it offers to its users. At present, when you sign-up for Telegram, it will scan all your contact list and notify the other users that you are now a member. This is where the security problem lies if your phone number is on someone’s contact list, and he is on Telegram, then he will also be told when you join the service.“If spammer signs up for the Telegram and if he already had your phone number in his contact list, it will also notify him that you also have Telegram,” the post reads. “So, in addition to connecting you with your friends and contacts, this app will also connect scammers to you. Similarly, if you happen to have scammers’ numbers in your contact list for some random reason, then you will get push notifications when they join Telegram.”This looks like a rising problem as the security company noticed that more and more scammers are signing up for their service. Even worse is that there’s no way to prevent other people from knowing that you use Telegram.The risk grows even further when you take the uses of this particular feature for third parties into account. For example, intelligence agencies take this type of apps a “risk factor.” Basically, if you want to have your privacy, they will think you have something to hide. The same assumption could be made by border control officers, and we have all seen what is happening in the American airports.", "date": "March 5, 2017", "topics": ["Hacking News", "News"]}, {"title": "This New Malware Will Soon Start “AtomBombing” U.S. Banks", "authur": "William Fieldhouse", "body": "A new version of Dridex banking malware was detected and it is targeting European banks and it is expected to be used against the U.S. financial institutions in upcoming months. The Dridex 4 incorporates normal usual range of software improvements which we come to expect from this professionally maintained malware. It is also worth noting that it is the first major malware which adopted the new code injection technique called ‘AtomBombing’.The AtomBombing was explained by researchers at enSilo back in October 2016. It is named so, because of the main use of it is Windows’ atom tables; read/writable stores of data which can be used by multiple applications. The Malicious code can also be written to atom tables, and then it is retrieved and injected into an executable memory space.The process mentioned above does not require any exploit against Windows since it just makes use of a feature provided by the Windows. Finally, it is just a new code injection technique which is likely to by-pass the existing AV and NGAV detections.Dridex 4 was found by the IBM X-Force in the early February. It doesn’t implement AtomBombing exactly as described by the enSilo. “In our analysis of new Dridex v4 release,” says the IBM, “we found that the authors of this malware have devised their own injection method, by using the first step of the AtomBombing technique. They have used the atom tables and the NtQueueAPCThread to copy a payload and an import table into RW memory space in target process. But they only went halfway – they used AtomBombing technique for writing of the final payload, then used a completely different method to achieve the execution permissions, and for the execution itself.”Since enSilo’s original description of the technique, malware defenders will have been developing means to detect it. Dridex 4 hopes to bypass these current detections by using a modified method of AtomBombing.Image Credit: Hackread", "date": "March 2, 2017", "topics": ["Hacking News", "News"]}, {"title": "Its Yahoo Again, 32 Million Accounts Accessed via Cookie Forging Attack", "authur": "William Fieldhouse", "body": "\nYahoo finally admitted that details fo 32 million users Yahoo.An unauthorised third party has the company’s proprietary code and learned how to forge the cookies. Yahoo strongly believes that this is the same hacker who caused the 2014 data breach.Yahoo disclosed in its annual report filed with SEC saying “The forensic experts from outside have identified nearly 32 million user accounts and attackers are believed to have used forged cookies were to take over back in 2015 and 2016.”Although the incident is popular and the company has even admitted that high-level execs are aware of what has happened in the previous years, the problem is only mentioned in last autumn in the SEC filing. Customers are only warned a few weeks back, and that their accounts may have been accessed by the use of this sophisticated cookie forging attack.Yahoo has disclosed a massive data breach back in September 2016. The company said that the 500 million accounts which are affected by an unknown actor in 2014. According to these latest filing, Yahoo knew about that the incident from that is the very same year but failed to inform users or make proper security updates.In December 2016, Yahoo one-upped itself by revealing a 2013 data breach which affected 1 billion accounts.Email addresses, hashed passwords, names, phone numbers, security questions and more were exposed in both these data breaches.Up to now, Yahoo says there are 43 putative consumer class action lawsuits filed against Yahoo relating to the security incidents. This is not surprising considering how many people were affected by these data breaches. The fact that Yahoo knew about at least one of them will surely weight in favour of those suing Yahoo, as it should.The data breaches managed to cut down Yahoo’s selling price to Verizon by $350 million, but it’s really a surprise that it did not cancel it altogether.", "date": "March 2, 2017", "topics": ["Hacking News", "News"]}, {"title": "Trolling Noobs Asking to Hack Whatsapp, Facebook, Gmail etc", "authur": "William Fieldhouse", "body": "When I get noobs asking me to give them hacking software for Whatsapp, Facebook, Gmail etc it makes me want to commit some form of major attrocity, the only way I can make myself feel a little better in my response is to do some trolling of my own by creating some hacky looking Batch files that looks like a noobs paradise.I must say how much it still amazes how these people are happy to blindly download and run an executable a stranger has sent to them that could include keyloggers, reverse shells, a script that deletes the entire hardrive or holds it to ransom… the possibilities are endless. Fortunately because we are nice, we wouldn’t do any of the aforementioned to anyone (regardless of how irritating they are)It should be noted my scripts are purely benign and just make the noob think it is running a hacking program, when in fact all it is doing is chucking random green text around the cmd terminal in an endless loop.Here is what my troll script does:Asks for a key to decrypt, this is hardcoded into the batch file and provided to the noobOnce the correct key has been typed in it will then produce a successful message that then outputs a loading screen that is based from sending a few pings to localhost (no it won’t cause a DOS…. and if it does then the computer belongs in the bin)The noob will get a message saying “key loaded, press any key to begin decryption”Once any key is pressed the cmd terminal will chuck out some matrix type output and random green characters in an endless loop. How long will the noob leave it “decrypting” TROLOLOLIn the final version I turned it into a .exe using open source batch to exe file conversion software and named the file something like: “WhatsApp_decryption_tool_v1.3.exe”The code for my benign batch file is listed below if you want to modify, improve it etc", "date": "March 2, 2017", "topics": ["Hacking News", "How To", "News"]}, {"title": "Over a million WordPress sites at risk thanks to this plugin", "authur": "William Fieldhouse", "body": "A famous WordPress gallery plugin which has more than a million installations has recently patched a serious vulnerability which allows the exploitation of the website’s database.Plugins are the backbone of the WordPress and they are what makes it so elegant, but it can also be a pain since most of the plugins have some sort of vulnerability since the programmers have not given much thought for security.Researchers from security firm Sucuri informed that more than a million WordPress sites are exposed to serious risk due to a flaw in the WP-Slimstat plugin.In a blog, Sucuri said that “During a routine audit for our Web application firewall[ WAF], we found a security bug which an attacker could, by breaking plugin’s weak “secret” key, use to perform an SQL Injection attack against target website.”The blog also explains that a successful exploit could allow the attacker to access or download sensitive information from the website like encrypted passwords, WordPress secret keys, etc.All this info can be used by an attacker to hijack an entire Wordpress site.Sucuri ends up by stressing, “This is a very dangerous vulnerability, you should update all of your websites which use this plugin as soon as possible.”Sucuri has estimated that there are over a million WordPress sites possibly at risk due to WP-Slimstat. This is a large number but the grand scheme of things isn’t so bad.On the Internet, there are nearly 75 million live WordPress sites. Almost half of the top 100 tech blogs run on WordPress. Famous and iconic destinations like The New York Times, CNN use WordPress.One of the primary benefits of the WordPress platform is that there is almost guaranteed to be a plugin to do just about anything you can imagine doing on a website. There are almost 30,000 WordPress plugins that have been downloaded a combined total of more than 286 million times.", "date": "March 2, 2017", "topics": ["Hacking News", "News"]}, {"title": "Robots To Become Victims of Cyber Attacks: Researchers", "authur": "William Fieldhouse", "body": "The huge software firms which bring the software to life by using robots are affected by potential vulnerabilities which allow the attackers to remotely take control of the machines, says an analysis done by security firmIOActive.In the very near future, Robots will become very common and we can find them at all most any place likeRobots businesses, homes, the military and law enforcement, industrial environments, and healthcare organisations. The International Data Corporation (IDC) has estimated that in January that the worldwide spending on robotics and related services will reach the mark of $188 billion by 2020.There are many cases in the past years where many people are injured in accidents involving the robots, but experts warn that robots could pose a serious threat if they are vulnerable to remote hacker attacks.IOActive researchers have analyzed home, industrial and business robots from six different vendors:UBTECH Robotics (Alpha 1S and Alpha 2), SoftBank Robotics (NAO and Pepper robots), Universal Robots (UR3, UR5 and UR10), ROBOTIS (ROBOTIS OP2 and THORMANG3), Asratec Corp (V-Sido robot control system) and Rethink Robotics (Baxter and Sawyer).The researchers still have not acquired the real robots and instead they conducted tests on their mobile applications and firmware.IOActive said it has identified nearly 50 vulnerabilities in the tested components, but the security firm noted that it did not conduct an in-depth analysis, which suggests that the actual number of weaknesses is likely much higher.The company has also published a paper providing some non-technical description about the vulnerabilities. The technical details will be made available after the vendors have had a chance to address the flaws.IOActive told SecurityWeek that it has notified all affected vendors, but only four of them have responded so far: SoftBank Robotics, UBTECH Robotics, Universal Robots and Rethink Robotics.uhby", "date": "March 1, 2017", "topics": ["Hacking News", "News"]}, {"title": "Google’s Waymo Sued Uber for Stealing their Self-Driving Car Technology", "authur": "William Fieldhouse", "body": "We always have to be cautious while sending the emails, especially when sending email using the Carbon Copy (Cc) option. The news we are going to share with you details the dangers of mismanagement while sending out Cc email. Although claims made by the Waymo are quite amusing since the CC’d email informed to the company about mass stealing of their trade secrets which containing documents, it sure does enlighten us how the Carbon Copy feature can lead us in trouble.According to their own blog post, Waymo, a famous self-driving car company has accused an ex-Google engineer, the founder of Otto and the top-ranked Uber exec, Anthony Levandowski, for stealing nearly 14,000 confidential documents from the Google before his left. These stolen documents site Waymo in the lawsuit contained the key technology secrets. These were schematics of a circuit board in the documents and also other details about the main mechanisms of self-driving technology including the LiDAR technology and the radar related information. The allegations can be read in detail here:Otto is a self-driving truck firm which is regarded as a ride-hail magnet nowadays. The Waymo also claimed that what made them aware of this treachery was just an email that was accidentally CC’d by one of component vendors of the LiDAR and the Waymo received it as their email address got copied in that mail. Waymo explained that the email contents in detail of its complaint submitted to the court:Furthermore, the Waymo has claimed that this is not a result of sheer luck at all on the Otto’s part, but it was a “concerted plan” devised by the Levandowski to steal the “trade secrets and intellectual property of Waymo.”Waymo alleged in its complaint that Levandowski has told his colleagues a few months back, before the stealing of such a huge number of documents, that he was planning to replicate its competitor Waymo’s technology. ", "date": "February 28, 2017", "topics": ["Hacking News", "News"]}, {"title": "Hacking Internet-Connected Bears Exposes 2 Million Voice Messages and 800K Credentials", "authur": "William Fieldhouse", "body": "Everyone parent loves getting his kids the latest cool toys available, but some of them are straight-up dangerous, especially the ones which are able to connect to the Internet, like CloudPets. As a matter of fact, these adorable little plush toys have managed to leak 800,000 user account credentials and also 2 million message recordings for who wants to listen to.It seems that in between Christmas and the first week of January, the company behind these CloudPets, Spiral Toys, has left customer data on a database which was not even protected by a firewall or even a password. Search engine Shodan was often used to find these unprotected websites and servers. It was put to use to find this MongoDB database where all data from the CloudPets was stored.So, what was exposed? more than 800,000 emails with passwords. Thank god, they are secured with bcrypt, a hashing function which is harder and stronger to crack than others. The Troy Hunt, security researcher who is behind Have I Been Pwned, has analysed the CloudPets data and he claims that a huge number of these passwords are so weak, they might have already been cracked by now.In just the weeks the data was exposed, a couple of security researchers, as well as the malicious hackers, got their hands on this information. It also seems that several cyber criminals have got their hands on this database and held it for the ransom, as the data in CloudPets’ was overwritten twice as of now.“It only takes a little mistake on behalf of data custodian – like misconfiguring the database security – and every single piece of the data they hold on you can be in public domain in just minutes,” Troy Hunt writes in a blog post. He adds that, without any doubt, there are many connected toys with serious security vulnerabilities.\n", "date": "February 28, 2017", "topics": ["Hacking News", "News"]}, {"title": "Adwind RAT Campaign Hits Organizations Worldwide: Kaspersky", "authur": "William Fieldhouse", "body": "Recently observed massive campaign using Adwind Remote Access Tool (RAT) has attacked over 1,500 organisations in more than 100 countries and territories according to the researchers from Kaspersky Lab.These attacks are spread across industries, Kaspersky says, that the consulting was hit the least(5%) retail followed by insurance and legal services (5%), followed by architecture and construction (9.5%), followed by shipping and logistics (5.5%), and followed by distribution sector with highest of (20.1%).The backdoior, Adwind has been there for several years, and the Kaspersky said that it has managed to infect morethan 443,000 users between 2013 and 2016. Also known as the AlienSpy, Unrecom, Sockrat, Frutas, and jRAT, this malware has been associated with number of attacks, with the AlienSpy variant in April 2015 after a report on it was published.The threat of this RAT is openly distributed in the form as a paid service, where any one can use the malicious program by paying a fee to the crooks. According to the Kaspersky, this is the main feature which distinguishes this Adwind RAT from all other commercial malware.This is written in Java and malware is not restricted to a single platform. It can be used to target Linux, Windows, and even MacOS. It can run on other platforms which run Java, like Android. With the help of this threat, the crooks can steal passwords, log keystrokes, and other data from capture screenshots, web forms,  transfer files, record audio and video,and steal a great deal of confidential information as well.As part of the newly detailed campaign, the RAT is being distributed via emails supposedly coming from the HSBC Advising Service (from the mail.hsbcnet.hsbc.com domain), purporting that payment advice has been included in an attachment. Although detailed only now, the activity of this email domain has been tracked back to 2013, Kaspersky Lab researchers say. The article “Adwind RAT Campaign Hits Organizations Worldwide: Kaspersky” was originally posted on Securityweek.", "date": "February 28, 2017", "topics": ["Hacking News", "News"]}, {"title": "Popular Android Password Managers Found Exposing Credentials", "authur": "William Fieldhouse", "body": "Researchers warn that popular Android password managers in android are affected by serious vulnerabilities which can expose the user credentials.A group of security experts from Fraunhofer Institute for Secure Information Technology named TeamSIK from Darmstadt, Germany, has analysed nine of the very famous Android password managers available on Google Play Store.The research was focused on My Passwords from Erkan Molla, LastPass, Keeper, Informaticore’s Password Manager, Dashlane Password Manager, 1Password, F-Secure KEY, Avast Passwords, and Keepsafe, which have somewhere between 100,000 and 50 million installs.While these apps are advertised as being very secure, all of these contained at least one low-level severity vulnerability. The TeamSIK found a total of 26 issues, most of these are patched by the vendors within one month after being reported. But, only Avast has failed to patch the security holes.“The overall results are extremely worrying and have revealed that the password manager applications, despite their bold claims, fail to provide enough protection mechanisms for the stored passwords,” researchers said. “Instead, they misuse the users’ confidence and expose them to even greater risks.”According to experts, some of these applications stored the master password in just plain text, or exposed encryption keys in its code. In some other cases, the users’ stored passwords can be easily accessed and exfiltrated by using a malicious application that is installed on the device.Researchers also determined that some of the apps are vulnerable to data residue attacks and clipboard sniffing. Worryingly, many of the flaws they identified can be exploited without needing root permissions.For example, one of the high severity flaws affected Informaticore’s Password Manager. While the app stored the master password in an encrypted form, the encryption key was found in the app’s code and it was the same for all installations. A similar flaw was also identified in LastPass.", "date": "February 28, 2017", "topics": ["Hacking News", "News"]}, {"title": "A New MacOS ransomware spotted in the wild", "authur": "William Fieldhouse", "body": "Researchers have recently found a new file-encrypting ransomware for MacOS which is being distributed through the bittorrent websites and the users who fall victim to it will not be able to recover their data even if they pay the ransom.Generally, the Crypto ransomware programmes for MacOS are rare. This is the second one we found so far in the wild and also it is written and designed poorly. This malware has been named OSX/Filecoder.E after the malware researchers from the antivirus vendor ESET who discovered it.The OSX/Filecoder.E masquerades is a cracking tool for commercial software like the Microsoft Office and the Adobe Premiere Pro CC for Mac and it is being distributed in form of a BitTorrent download. It is now written in the Apple’s Swift programming language by what seems to be an inexperienced developer, judging from the chunk of mistakes he has made in the implementation.The application installer is also not signed with a developer certificate which is generally issued by the Apple, this makes the installation of the malware harder on recent OS X and MacOS versions, as users has to override default security settings.The main problem with this malware is with the way it encrypts the files. It generates a single encryption key for all the hidden files and it then stores files in an encrypted zip archive. But the malware does not send the encryption key to the attacker before distroying it, killing our last hope to recover our data.This means that even if the victims follow hacker’s instructions on how to pay ransom, they won’t get their files back. The encryption appears to be strong, so it cannot be cracked using alternative means either.“The random ZIP password is generated with arc4random_uniform which is considered a secure random number generator,” the ESET researchers said in a blog post Wednesday. “The key is also too long to brute force in a reasonable amount of time.” ", "date": "February 28, 2017", "topics": ["Hacking News", "News"]}, {"title": "Latest Phishing Scam Targets Online Banking Users", "authur": "William Fieldhouse", "body": "We all know that the cyber criminal community depends widely on phishing scams to attack the innocent users, that is why these attacks are not only increasing but also adding the sophisticated means to trick the users into giving their financial and personal details.Recently, a group of security researchers at Cyren has discovered a phishing scam which is targeting the banking customers worldwide. According to researchers, the targeted platforms include online banking customers of Fargo, Chase, Capital One, Wells and online money transfer giant Venmo and PayPal.This new phishing campaign carries same old method of tricking the users into clicking on an attachment file, but this time the attached the HTML file is embedded with the data URLs. It must be noted that last month, Gmail users were targeted with a similar phishing scam in which attackers embedded data URLs in PDF files which took users to a fake Gmail sign in page.But, since Gmail scam has already been busted, the attackers who are heavily relying on the HTML files to phish the users. According to Cyren, this latest scam is already reaching a new heights with a 50% increase only in the month of February.“These attacks are proving effective at evading detection by many email security systems, which typically allow HTML attachments, or are not capable of scanning their content, and therefore do not detect the telltale “data:text” URI header — as opposed to .exe attachments, which are commonly blocked,” notes the Cyren. Also, the PayPal phishing scams are at a large where the scammers are using a highly sophisticated tricks to steal the login credentials from the users.If you have a PayPal account, it is advisable for you to log in to your account by entering the web address into your the browser’s address bar or through the official PayPal app. The PayPal website has a verified green signature as shown in the screenshot below:", "date": "February 28, 2017", "topics": ["Hacking News", "News"]}, {"title": "Read This Customer Support Chat of Ransomware To Know How Ruthless They Are", "authur": "William Fieldhouse", "body": "Ransomware criminals are chatting with their victims offering them the decryption keys they need and also putting deadlines. They often chat about how the user can obtain Bitcoin.F-Secure, a Finnish security vendor released 34 pages of transcripts from the group chat used by the hackers from the Spora ransomware family. The conversation not only puts a spotlight on the batch’s customer support, said a company security advisor, illustrated intertwining of the Bitcoin and the extortion malware.“We should also be thankful that there are some practical barriers to the purchase of Bitcoins,” wrote the Sean Sullivan from F-Secure in a post to the blog of firm. “If it was any easier to do so, it would be very hard to check the growth crypto- ransomware’s business model.”Sullivan originally wrote that conclusion on last month, in a short section from the “State of Cyber Security” report which F-Secure published then. A few days back, F-Secure posted these transcripts, 20,000 words or more, and dubbed them as the collection a “new supplemental appendix” to the original report they made.“This is [A] fascinating read,” Sullivan said.He was not kidding.In one exchange, a Spora victim said he or she had paid the extortion fee, but had gotten nothing in return. “I already sent you 98USD worth of bitcoin,” the victim reported.In response, the “customer support rep” cursing the victim for entering an invalid Bitcoin destination address. “But do you agree, that it is your mistake, that you entered an incorrect address?” asked the Spora rep.“I just copied the address that was given at the refill page. How can I be mistaken?” the victim replied.In a few of these many similar threads—the transcripts have identified each victim by their first character of the ID created by that ransomware—some of them pleaded for mercy.“ Hello crooks. I agree to pay,” said “0” in a lead-off message. “But 570 dollars for a lot of photos of my grandmother. Can I expect a discount if I leave good feedback on the forum about you?”No, go. “We do not provide any discount. Also, we cannot be sure, that you have only photos,” reported the “support.”At times, the messages are pitiful. “Hello, I am 82 and my family picture [sic] go away—bad, very bad,” reported another victim identified as “0.”Others have played the anger card, the sympathy card, the profanity card. “Am I the one you should hack? No! I am just a small salary man who tries to make ends meet and bring food to his kids,” said “E,” who identified himself as the “Mustapha from Morocco.”You can find the complete Spora transcripts here.The story, “Ransomware ‘customer support’ chat reveals criminals’ ruthlessness” was first published by the Computerworld.", "date": "February 28, 2017", "topics": ["Hacking News", "News"]}, {"title": "Python and Java FTP attacks can punch holes through firewalls", "authur": "William Fieldhouse", "body": "The Python and Java runtimes have failed to properly validate the FTP URLs. This can potentially allow the attackers to pass through the firewalls and access local networks.On last Saturday, Alexander Klink, a security researcher has disclosed an interesting attack in which exploiting an XXE (XML External Entity) vulnerability in Java application is used to send emails.These XXE vulnerabilities are exploited by tricking applications into parsing specially crafted XML files which would force XML parser to leak the sensitive information like directory listings, files, or even information about the running processes on the server.Klink also showed that the very same type of vulnerabilities can also be used to trick Java runtime to initiate the FTP connections to the remote servers by feeding it’s FTP URLs in form of ftp://user:[email protected]:port/file.ext.But, turns out that the default built-in implementation of FTP client in Java does not filter out the special CR (carriage return) and the LF (line feed) characters from the URLs and also interprets them.By the insertion of such characters in the user or the password portions of the FTP URL, Java FTP client can be tricked to execute some rogue commands and can also be tricked to speak SMTP because the syntax for SMTP and FTP are very similar.Klink also showed that by exploiting the XXE vulnerability and this power in Java’s FTP client implementation, a malicious attacker could force a Java app to send emails to an SMTP server of his interest.“This attack is particularly interesting in a scenario where you can reach an (unrestricted, maybe not even spam- or malware-filtering) internal mail server from the machine doing the XML parsing,” Klink said in a blog post.After seeing Klink’s exploit, Timothy Morgan, a researcher with Blindspot Security, decided to disclose a similar attack that works against both Java’s and Python’s FTP implementations.", "date": "February 28, 2017", "topics": ["Hacking News"]}, {"title": "SHA-1 Collision Effects Apache Subversion System", "authur": "William Fieldhouse", "body": "Last week, the Google has announced the first SHA-1 collision attack and CWI appears to have a serious impact on repositories which use the Apache Subversion(SVN) software versioning and revision control system.The developers of the WebKit web browser engine have noticed some severe problems after stheir attampt to add a test for the SHA-1 collision to their own project. After uploading the sample collision PDF files provided by the Google, their SVN repository has become corrupted and prevented any further commits.Google has posted an update on the SHAttered website to warn the SVN users about the risks, and Apache Subversion developers have made a tool that is designed to prevent the PDF files such as the ones provided by the Google from being committed.The search giant also so far only published two PDF documents which prove that the SHA-1 collisions are possible (this means both the files have same SHA-1 hash, but different content). But, after 90 days, Google will release the code which will allow anyone to create such PDFs.Finding the SHA-1 collisions still need significant resources – it can cost an attacker at least $110,000 worth of computing power from Amazon’s cloud services. However it’s still 100,000 times faster when compared to a mear brute-force attack.The SHAttered attack also seem to impact the Git distributed version control system, which cpmpletely rely on SHA-1 for identifying and checking the integrity of file objects and commits.However, “the sky isn’t falling,” according to Linux kernel creator Linus Torvalds. Torvalds pointed out that there is a big difference between using SHA-1 for security and using it for generating identifiers for systems such as Git.Nevertheless, steps have already been taken to mitigate these types of attacks, and Torvalds says Git will eventually transition to a more secure cryptographic hash function. source: secuirtyweek", "date": "February 27, 2017", "topics": ["Hacking News", "News"]}, {"title": "Google Discloses An Unpatched Flaw in Internet Explorer, Edge", "authur": "William Fieldhouse", "body": "The Project Zero from Google has disclosed some potentially serious vulnerability in the Microsoft’s Internet Explorer and Edge web browsers before the company could release the patches.The details about this flaw and the proof-of-concept (PoC) code are made public last week by the Google Project Zero researcher Ivan Fratric after the Microsoft failed to meet 90-day disclosure deadline.The security loophole which is tracked as CVE-2017-0037 was described with a high severity type confusion. By exploiting the vulnerability, an attacker can crash the browser and moreover, arbitary code execution is also possible.This is Microsoft’s second unpatched vulnerability in a their product disclosed by the Google Project Zero this month. Earlier, researcher Mateusz Jurczyk has released various details of a vulnerability with medium severity information and it is a disclosure flaw tracked as CVE-2017-0038.In addition to these, there is also an unpatched denial-of-service (DoS) flaw in the Windows which is caused by how the SMB traffic is handled inside.Microsoft has only released the patches for the Adobe Flash Player this month and postponed its February 2017 updates to March 14  of this year due to an unknown “last minute issue.” It is possible that the three vulnerabilities that are affecting Windows and the browsers are supposed to be fixed by these delayed security updates.The Microsoft on last month has claimed that the security mechanisms in the Windows 10 can block exploitation of a zero-day vulnerability even before the patches are made available for public. As an example the company provided two flaws exploited in sophisticated attacks against organisations in South Korea and the United States before fixes could be released.", "date": "February 27, 2017", "topics": ["Hacking News", "News"]}, {"title": "Kaspersky security expert charged with treason for sharing security data with Verisign", "authur": "William Fieldhouse", "body": "The arrest of Ruslan Stoyanov , the head of computer incidents investigation at Kaspersky, is the result of various claims about him passing the state secrets to US companies. The arrest happened back in December.His arrest has followed various accusations that are made as long ago as 2010 by the Russian businessman Pavel Vrublevsky, who is the founder of Russian online payments company ChronoPay. This suggests that Stoyanov and others had passed on various “secrets” to US companies.“I can confirm Chronopay to be part of this case. In 2010, we have provided the FSB [which is the Russian security services] and other very important Russian agencies with the evidence which at least one FSB employee, and several other people, were involved in this treason,” Vrublevsky told the Reuters.Vrublevsky also claims that Stoyanov has passed on information to various other companies, but has only named Verisign.But, Verisign denied that they handled or passed-on anything which could be described as a secret. But, Verisign’s iDefense unit has compiled dossiers on cyber crime for different clients including the private firms and the government agencies which include the US intelligence services, however, it says their research did not contain any classified information, according to Reuters.“Nothing like the arrangement as described by Pavel Vrublevsky ever took place,” Kimberly Zenz, a former analyst at Verisign’s iDefense unit who knows Stoyanov, told Reuters.Verisign’s denials suggest that “secrets” which Stoyanov was accused of passing are either information about security flaws in various software, or even information about individuals or groups involved in the cyber-crime. Being an independent consultant at the time, Stoyanov would probably have been expected to be paid for his work for Verisign.Stoyanov joined Kaspersky in 2012 following a period as a consultant after he’d left the Russian police cyber crime unit. However, Kaspersky has refused to comment. ", "date": "February 27, 2017", "topics": ["Hacking News", "News"]}, {"title": "Ransomware Can Now Take Victims to Offline for Over a Week", "authur": "William Fieldhouse", "body": "Ransomware became extremely widespread and dangerous nowadays, but its impact is not always very clear to the world. The latest report indicates that ransomware can even block access of a computer to an entire network in just a few seconds, and it can take more than a week for most businesses to get their systems back online.According to this report, which is published in The Grim Reality of Ransomware by Datto, business continuity solutions provider, and Timico, cloud service provider, businesses are suffering a lot due to ransomware attacks and mostly because they are completely unprepared and unplanned for such an attack.The report considers account data which is collected from more than a thousand businesses which have fallen prey to the ransomware over the past year. Nearly 85% of the infected businesses had their files forced offline atleast for a week. A one-third of cases suffered through these issues went on a month of more.What is even worse is that 15% of the total businesses targeted by this kind of attacks has never got their data back, which is a great problem created by the ransomware.It can take ransomware less than a minute to lock down a system. As a matter of fact, 68% of respondents said that effects of an attack are almost instant with data systems becoming useless just within seconds.“Nearly a quarter (23%) of respondents have paid over  $6,221(£5,000) to retrieve their data and 26% paid a fee of between $3,732 – $6,221(£3,000 – £5,000 ). Higher Ransomware fees are found in large corporates, with a third of corporate businesses paying over $6,221(£5,000 ) to recover their data compared to just half that number of SMEs (over 15%). The highest number of SMEs (35%) paid between $622(£500) and $1,866(£1,500) ransom fee,” the report reads.On top of the ransomware they chose to pay, businesses also had financial losses. 53% of respondents estimated that it had cost the business between £1,000 ($1245) and £2,000 ($2,490) per day in lost revenue.", "date": "February 27, 2017", "topics": ["Hacking News", "News"]}, {"title": "CloudBleed Bug Makes Change.org Send Password Reset Emails to Its Users", "authur": "William Fieldhouse", "body": "A famous online petition website, Change.org is now sending emails to all its registered petitioners and encouraging them to change their current account password on their website. The email also came days after the Google employee, Tavis Ormandy from Project Zero exposed a Cloudbleed bug which seems to have leaked some sensitive and personal information from websites which are using the CloudFlare’s service.The email from the company to its users states that they have received a notification from CloudFlare about a security issue which may have compromised the personal information of some users who use their services. Although there is no direct evidence to prove that Change.org has been directly affected by this very issue, still, for security purpose, they advisable their users to change their password. Here’s a full preview of email sent by the Change.org:We wanted to share some of the information that we have received recently from Cloudflare, which is a popular web services provider and the one we use at Change.org, about a security issue which may have exposed personal information of some users who use their services. We have also received a confirmation from Cloudflare stating that there is no clear evidence that the Change.org has been directly affected by the issue. But, when issues like this happen, it is always suggested to change your password and provide an extra level of security, which you can do by following the link given below:We want you to be safe and feel safe when you are using our services and we have been investigating this situation closely to ensure it our users are not affected in any way.Cloudbleed is a bug which is alleged to have originated from the renowned company Cloudflare. As you may already know, Cloudflare offers internet security and infrastructure to some of the world’s biggest tech companies. These includeZendesk, Cisco, Nasdaq etc.Image source: Hackread", "date": "February 27, 2017", "topics": ["Hacking News", "News"]}, {"title": "Updated MongoDB Ransomware Targets MySQL Databases", "authur": "William Fieldhouse", "body": " Back in January, we have heard about the MongoDB ransomware which erased the data from thousands of computers and also forced the victims to the pay ransom. The very same MongoDB ransomware is back in the news now and it is even more powerful and this campaign is also very sophisticated in its design. In a recent attack spree, hundreds of the MySQL databases are targeted and the attackers are demanding 0.2 bitcoin (nearly. $234) from the victim.It can also be noted that the GuardiCore which started attack with cyber-criminals brute-forcing root password of MySQL database and after logging in tables from their database are extracted. In fact, there are two different versions of these attacks; in first version, the attackers will add a new table by the name WARNING to an already existing database.The new table will have all the information about demanded ransom, email address of these hackers and also Bitcoin payment address. The second version is a different one as in this,  a new table with the name PLEASE_READ is added to the newly created database and later, hacker will delete the pre-existing databases on server and just disconnects. This PLEASE_READ will contain a ransom note and the database is sent to hacker’s servers. In both versions, the victims are asked to pay a ransom of 0.2 BTC and are required to communicate with attackers at the address [email protected]Yesterday we started detecting new #Ransomware hitting #MySQL @guardicore's Global Sensor Network. Fill follow up with more data soon. pic.twitter.com/5Vyvs6Q5gU— Pavel Gurvich (@PashaGur) February 13, 2017According toGuardiCore’s findings, all these attacks started occurring from the 12th February and they continued to attack the MySQL servers for almost 30 hours where one IP address 109.236.88.20 was identified to be involved.The further analysis suggested that this IP address belongs to web server hosting service provider firm from the Netherlands bearing name WorldStream. GuardiCore notified them about the attacks as former believed that involved attackers have compromised a mail server of the latter as it serves as both HTTP(s) and FTP server.", "date": "February 27, 2017", "topics": ["Hacking News", "News"]}, {"title": "Cellebrite Can Now Hack iPhone 6 and 6 Plus", "authur": "William Fieldhouse", "body": "The famous Israeli security firm Cellebrite which is famous for cracking the iPhone 5C from San Bernardino shooter case is back in news and this time for a claim the company has made which is: that the Advanced Investigative Service(CAIS) can now hack iPhone 6 and iPhone 6 plus.The announcement came from Cellebrite’s director of forensics research, Shahar Tal who Tweeted that their CAIS tool now supports lawful unlocking and evidence extraction of iPhone 6 and 6 Plus devices.Cellebrite's CAIS now supports lawful unlocking and evidence extraction of iPhone 4S/5/5C/5S/6/6+ devices (via our in-house service only).— Shahar Tal (@jifa) February 22, 2017From the way, the last year case went we can say that Cellebrite can hack 4S, 5C and 5S from Apple without any trouble but Apple is not the only company whose security encryption was compromised by this company. Cellebrite can already unlock Samsung Galaxy Note 5, Galaxy S6 and Galaxy S7.The Intercept reported back in 2016 that to unlock a smartphone, Cellebrite charges nearly 1,500 per phone with a premium unlocking subscription service costs $250,000.Other than CAIS tool, Cellebrite is also offering powerful Universal Forensic Extraction Device (UFED) Physical Analyser 6.0 for the field related assignment. According to the Cellebrite website, the UFED delivers only complete, end-to-end Digital Forensics Platform on the market and has more than 40,000 UFED licenses deployed globally in 100 countries. The UFED tool is being heavily advertised by the company claiming that it can also extract data from messengers like Threema, Telegram, Surespot, and Signal.Though there is not much available on Cellebrite’s website about its new capabilities of unlocking iPhone 6 and 6 Plus the reports are that the company has been selling its products to countries like Turkey, USA, United Arab Emirates, and Russia. Therefore, its capabilities matter since Turkey, Russia and UAE are known for violating human rights.It must be noted that in last month, Cellebrite has suffered a massive data breach in which data of about 900GB in size has been stolen while earlier this month the very same hackers leaked the stolen data on the Dark Web.Image credit: Hackread", "date": "February 27, 2017", "topics": ["Hacking News", "News"]}, {"title": "Chrome Users Forced By Websites to Install Extension Before Leaving", "authur": "William Fieldhouse", "body": "A recently found malvertising campaign is targeting the Chrome users and redirecting them to websites which they can’t leave without installing a malicious Chrome extension.While this is not exactly a common practice among the malvertising, which generally redirects the users to places where a stronger malware can be delivered, including adware, ransomware, banking trojans.The expert from Malwarebytes, Jérôme Segura said that these recent malvertising campaigns are targeting Chrome users and redirecting them to other scam sites, rather traditionally redirecting to malware-ridden sites.Segura wrote saying,”This malvertising flow (an XML feed) demonstrates how the user is redirected to a fake site which is forcing them to install a Google Chrome extension. Enticing may, in fact be a euphemism, since in this case user is giving no choice other than to ‘Add Extension to Leave’, while their browser is just stuck in a never ending loop of those fullscreen modes,” Segura writes.So what will happen once this extension is installed? It will make sure that it stays in hiding by using a 1×1 pixel image as the logo, which becomes a blank space next to the Chrome menu, where extensions are generally present. It also hooks the chrome://settings and chrome://extensions in such a way that any attempts to access these is automatically redirected to chrome://apps so that users cannot get the extension uninstalled.The bad stuff is in a couple of JavaScript files. One has a connection to a command & control server where it can receive instructions on what to do next.“The perpetrators behind this extension are checking for certain keywords within the current URL and blocking/redirecting if the conditions are met. For instance, if the user tries to visit the Malwarebytes website, the browser will immediately get redirected, first to a YouTube video, and then to one of various Potentially Unwanted Programs (PUPs), get-rich-quick schemes, and various other scams,” the blog reads.\n", "date": "February 26, 2017", "topics": ["Hacking News", "News"]}, {"title": "Netflix Launches An Advisor App for Securing Your Devices", "authur": "William Fieldhouse", "body": "Netflix has introduced the Stethoscope which is an open source web app that seeks to help the users to secure their smartphones, computers, and tablets.Developed by the Netflix, Stethoscope is the company’s first project towards helping the users to have a better secure online presence.“The notion of this ‘User Focused Security’ acknowledges that the attacks against corporate users (like phishing, malware) is the primary mechanism leading to security incidents and also data breaches, and it is one of the core principles driving this approach to corporate information security. It is also reflective of our philosophy that these tools are only effective when they are considered the true context of people’s work,” their announcement reads.This app collects information form a user’s device and then it gives them some clear and specific recommendations for the users to secure their systems. By this way, Netflix trusts that people will find it very easier to protect their devices since they have all information comes from the source.Netflix claims that by providing the personalised, actionable information – and not relying on an automatic enforcement – Stethoscope respects people’s attention, time, and autonomy.“It’s important to us that people understand what simple steps they can take to improve the security state of their devices, because personal devices – which we don’t control – may very well be the first target of attack for phishing, malware, and other exploits,” Netflix claims. Of course, they also add that a user falling for a phishing attack can also be a liability for the company itself because it can very well be just the first step in an attack against Netflix’ systems.Stethoscope looks for several details – firewall, disk encryption, up-to-date OS/software, automatic update status, whether the OS is jailbroken or rooted, screen lock, and whether there’s a security software stack present.The source code, along with instructions for installation and configuration are available on GitHub.", "date": "February 26, 2017", "topics": ["Did you know ?", "Hacking News"]}, {"title": "This Crazy Android Ransomware Demands Victims Speak Code to Unlock Phone", "authur": "William Fieldhouse", "body": "Attackers of an older Android ransomware are adding some new capabilities to it by playing around with the source code a little bit. Android.Lockdroid.E is the malware which has been around for about a year, is it is now asking its victims to speak the code provided by its authors to unlock the attacked devices.The folks over at the Symantec warn the Android users that a latest Android ransomware variant comes with speech recognition capabilities and it is now demanding the poor victims to speak the code they have received.Researchers explain that once a device is infected with this Android.Lockdroid.E, the user not allowed to access to his device and he is locked out using a SYSTEM type window before displaying the ransom note. The note is written in Chinese and ti gives instructions on how user can unlock the device.The note also includes a QQ instant messaging ID for contacting if needed more information about how to pay the ransom and get the device unlocked by receiving the code.The user needs access to a new device to contact the attackers since his old one is hacked by them. Then, note instructs the users to press a button which starts the speech recognition functionality The malware then makes use of a third-party speech recognition API to compare the user spoken words with the expected password.“The malware stores the lock screen image and the relevant passcode in one of its Assets files in encoded form with additional padding. I was able to extract the passcode using an automated script. Figure 2 shows a couple of examples of the types of passcodes the threat uses. It should be noted that the threat will use a different passcode for each infection,” reads Symantec’s blog post.This isn’t the first time that attackers experimented with this particular ransomware. In the past, another variant used an inefficient 2D barcode ransom demand, which had to be scanned with another device in order to log into a messaging app to receive information about how to pay the ransom.", "date": "February 26, 2017", "topics": ["Hacking News", "News"]}, {"title": "Google just cracked one of the building blocks of web encryption", "authur": "William Fieldhouse", "body": "Google researchers did something that rather seemed impossible before, they have managed to produce two different documents which have the same SHA-1 hash signatures. This shows nothing is impossible.Why is it such a big deal? well, it has everything to do with the fact that SHA-1 is widely used across the Internet. It’s used for HTTPS certificates which are used to protect your browsing and also in Git repositories. It is also used to find if data in many forms like PDFs, emails, source code, website certificates and so on, have not been tampered with by hackers or not.Coming back to the present, Google has managed to prove that it is, possible to create a hash collision by just altering a PDF without changing the SHA-1 hash value of it. It means that people can be tricked into thinking the altered document or duplicate document was actually the original one, which is worrisome.In a blog post, Google wrote saying, “Today, 10 years after the SHA-1 was first introduced, we are today announcing the first practical technique for generating a collision. This represents the culmination of two years of research which sprung from a collaboration between the Google and the CWI Institute in Amsterdam”.The purpose of this entire effort and spending two years of research into this was to show the tech community that it is necessary to stop the SHA-1 usage. Google has supported the deprecation of SHA-1 for many years, especially when it comes to signing the TLS certificates, due to this type of problem. Chrome has been slowly phasing out of using SHA-1 ever since 2014.“We hope our practical attack on this encryption type will cement that the protocol should no longer be considered secure,” the team added, pushing the tech industry towards using a safer alternative such as SHA-256.", "date": "February 25, 2017", "topics": ["Hacking News", "News", "Tech"]}, {"title": "Was Your Google Account Unexpectedly Signed Out Today? Company Explains Why", "authur": "William Fieldhouse", "body": "Earlier today, the holders of Google accounts around the world faced an unexpected situation where they are asked to re-enter their user login credentials to sign in. All the users did so and successfully gained access to their accounts once again. However, there was a sudden huge uproar that this might be a result of a phishing attack and accounts may have been compromised. But, the company has openly denied such claims and stated that it has nothing to do with any phishing scam or security threats. Google is still in the process of investigating the issue, but it is heartening to learn that the problem isn’t linked with hacking or scamming.We know some of you had issues signing in today. Please try again now. Rest easy — your account's security was not affected.— Google (@Google) February 24, 2017Crystal Cee from Google’s Product Forum said that the  users need to sign in again to use their accounts and use the address “accounts.google.com.”Crystal Cee also noted that if you forgot your password then use the link “g.co/Recover” to get back your account. If using 2-step verification, you can experience a small delay in SMS code reception, so you got to be patient. Or else, you can use any backup codes.The issue is not limited to any single platform as users of Google Wi-Fi, Chromecast, Gmail (on all devices including laptops, PCs and tablets) and Google Home had to enter their login credentials again. When such a huge number of users had to face a similar issue, confusions were bound to arouse. Twitter became the hub of panic tweets and threads were created on Reddit where users from around the world reported about this issue.hey, my account has a 2 step verification and I dont have service anymore. I cant get texts and Im signed out. I dont know how tho.— FROSTY (@DRUNK_BOOBS) February 24, 2017Google issued a notice on its Gmail help forum, which reads “We’ve gotten reports about some users being signed out of their accounts unexpectedly. We’re investigating, but not to worry: there is no indication that this is connected to any phishing or account security threats.” ", "date": "February 25, 2017", "topics": ["Hacking News"]}, {"title": "CloudFlare Blames Internal Faults for Memory and Client Data Leakage", "authur": "William Fieldhouse", "body": "We have seen some recent incidents in which the CloudFlarehas been reported to have lost its client data, now the company blames an unspecified internal fault for all these incidents.According to John Graham-Cumming, the company’s CTO, about 1 in every 3.3 million requests that servers of the company were handling in between 13th and 18th of February this way have leaked.He added saying that, “We think that an internal fault may have led to this memory leakage of a very tiny percentage of the data which we handle on our secure servers”.Tavis Ormandy, a researcher, had pointed out earlier that the Cloudflare servers were leaking data and this leakage was made worse by the fact that most common search engines are caching this leaked data. Cloudflare have been leaking customer HTTPS sessions for months. Uber, 1Password, FitBit, OKCupid, etc. https://t.co/wjwE4M3Pbk— Tavis Ormandy (@taviso) February 23, 2017It has also had come to notice that the CloudFlare’s server has experienced a relatively common problem linked to memory leakages. The leakage of such sensitive data like HTTPs cookies and others, which occurred on these servers, is said to have an affect on some of the major global brands like Lyft, Uber, OKCupid and others.None of these companies are commented on the issue, so far. But, CloudFlare says that thay have taken some necessary steps to address the situation immediately. It was notified of its existence by Ormandy.According to the company, its experts have immediately deactivated the Automatic HTTPS, Server-Side Excludes and email obfuscation features on its servers immediately after it had been notified of the fault. But in what may further complicate matters for the company, it is now emerging that the company may not have taken the issue as seriously as it now states.According to Ormandy, after he notified the cyber security experts at the company about the breach, he was referred to the infamous bug bounty program that the company runs.source: hackread", "date": "February 24, 2017", "topics": ["Hacking News"]}, {"title": "Asiana Airlines Website From South Korea Hacked with Pro-Serbian Messages", "authur": "William Fieldhouse", "body": "Do you remember the guy who defaced the Google Brazil’s domain, his name is Kurio’SH and he is back in the news this time for defacing and hacking the official website of Asiana Airlines, one of the major airlines in South Korea.The website was hacked on 19th February and is left with a deface page along with few messages against Albania and also for Serbia. These messages further mention the name of a Spanish airline Iberia Airlines. You may be thinking what Iberia airlines or even South Korea have to do with Serbia and Albania crises? The answer to that is said by the Kuroi’SH, to Hackread that his initial target was Iberia airline, but since they posed a threat to his privacy, he decided to deface the Asiana Airlines and he is motivated to “spread the word and Asiana is an airline giant.”According to the provided deface message, “I am Sorry, Iberia Airlines, but everyone needs to understand the crime against humanity, carried out by the Albanians p**s touching Serbia – In Pristina, shame now located in Kosovo, there is a monument called NewBorn. A f***ing monument with a clear meaning: peace and a new beginning, let’s forget the past–Jesus, forgive my anger and what I will say, but if I ever end up in that city, I’ll put a bomb of this so-called monument and then destroy it.”If you want to have a full preview of the deface page, you can check here where it was stored in Zone-h mirror as a proof of hack, read here.When asked how Asiana Airlines website was hacked Kuroi’SH explained that “it was done through DNS hijacking from their hosting provider.” Furthermore, the hacker stated that he has nothing to do with Serbia, but he feels that truth needs to be spoken.IMPORTANT NOTICE: Our Domain Name System has been compromised where users are redirected to another website when accessing our URL. (1/2)— Asiana Airlines (@AsianaAirlines) February 20, 2017The matter has been reported immediately and is expected to be fully recovered soon. We apologize for any inconvenience caused. (2/2)— Asiana Airlines (@AsianaAirlines) February 20, 2017", "date": "February 24, 2017", "topics": ["Hacking News", "News"]}, {"title": "Check Out This Chrome Extension to Know How Facebook AI Monitors Your Activities", "authur": "William Fieldhouse", "body": "We all know that the Facebook studies and monitors the activities of its users for various purposes using their own Artificial Intelligence mechanism. This data helps the social network in showing the relevant information on the user’s News Feed, which is usually evaluated by analysing your social media interests and other activities on the website.But, now you have an open source and free tool with using which you can easily keep a track on what kind of monitoring mechanism Facebook has implemented and what kind of your activities does the social network tracks. This tool which is a Chrome extension is called Data Selfie. This tool utilises machine learning algorithms to inspect what is read about your personality by the way you use Facebook. It also identifies your social media patterns and offers an opportunity to ensure totally customised and personalised experience.Through the Data Selfie, you can monitor the way these machine learning algorithms monitor and process all your activities on the Facebook and how they get information about your personality, interests, and habits. This is made possible through the world famous cognitive system from IBM, called the mighty “Watson.” When you download the app, it starts tracking your interactions on Facebook. It checks your every single your Like, post, the amount of time you spent checking out a shared article/post and every little thing such as when you scrolled and for how long. All the information is logged into the app.Data Selfie contains a dashboard that provides valuable insights about the data you liked or viewed and your inferences according to pre-determined combos of machine learning algorithms. The tracked activities and the aggregated information get displayed in a timeline format, which is usually categorised with colour codes to highlight different aspects of your data usage.", "date": "February 24, 2017", "topics": ["Hacking News", "How To"]}, {"title": "This Malware Campaign Obtains Data by Compromising PC Microphones", "authur": "William Fieldhouse", "body": "A security firm named CyberX has discovered that the Ukraine is being targeted by an extensive cyber-reconnaissance operation. In this campaign, the targets are quite broad range and the basic purpose here is to spy on confidential communications of the key Ukrainian officials by remotely controlling their PC microphones. Apart from the Ukraine, CyberX has also identified targets in Russia as well and to some extent even in Saudi Arabia and Austria. Some of the targets are discovered in the separatists’ states of Luhansk and Donetsk.This campaign has been named as Operation BugDrop by CyberX,  and in this, DropBox is used to store the data which is acquired. Based 0n their research, 70 victims have been targeted successfully by these cyber-criminals. These victims come from a variety of fields which include scientific research, critical infrastructure and media, etc.The focus in this operation is to capture the sensitive information like audio recordings, login credentials screenshots etc. Users can manually stop being recorded or at least avoid it by placing a tape on it, but when it comes to microphones, there is no way of disabling it by manipulating the hardware of the computer.According to the CyberX, in Ukraine this malware, BugDrop has so far targeted companies that design remote monitoring systems primarily for Oil and Gas pipeline infrastructures, organisations that monitor human rights, cyber-attacks on main infrastructures and counter-terrorism institutions and engineering company that develops electrical substations, water supply plants and gas distribution pipelines.It is a pretty well-organized operation in which very sophisticated malware is utilised and apparently a resourceful organisation is sponsoring it. The operation is launched via a large back-end infrastructure that stores, decrypts and analyses various GB of unstructured data obtained from the victims on a daily basis. Moreover, a massive team of human analysts is required to sort out and process the captured data manually or using analytic tools like Big Data.source: hackread", "date": "February 22, 2017", "topics": ["Hacking News"]}, {"title": "CompTIA Offers New Security Analyst Certification", "authur": "William Fieldhouse", "body": "One of the ISACA surveys which is released in the RSA week illustrates the state of cybersecurity workforce development and also its current trends. The results came out as no surprise to anyone in the industry: recruiting security talent is hard.The ISACA survey makes two interesting statements: firstly, that 70% of the enterprises “require atleast a security certification for open cyber security positions”. And secondly is that for 55% of the enterprises, “practical and hands-on experience is most important qualification for a cyber security candidate.” Since a candidate cannot get any experience without getting a position, new candidates for open cyber security jobs need more help with other ‘qualifications’.CompTIA has announced a new security qualification: named CSA+. It sits in between Security+, and CASP.The CSA+ focuses on skills which are required for the use of threat detection tools, interpretation of results and data analysis to identify vulnerabilities, threats and risks. It certifies a proficiency in data-driven security.“By placing a greater emphasis on data analytics, we can get a real-time, holistic view of the behaviour of the network, its users and the devices to identify the potential vulnerabilities and then strengthen them before an actual intrusion happens,” explained CompTIA’s senior director for products, James Stanger.This is perhaps the most critical area of the overall cyber security skills gap, and one that is growing faster than most. The Bureau of Labor Statistics states, “Employment of information security analysts is projected to grow 18 percent from 2014 to 2024, much faster than the average for all occupations. Demand for information security analysts is expected to be very high, as these analysts will be needed to create innovative solutions to prevent hackers from stealing critical information or causing problems for computer networks.”“Data analytics is the key,” says Jim Lucari, the senior manager of certification at the HP Enterprise. “Everybody in the technology should have this CSA+. ", "date": "February 22, 2017", "topics": ["Hacking News", "News"]}, {"title": "Google Shares Data on Corporate Email Attacks", "authur": "William Fieldhouse", "body": "Generally, corporate email accounts are much more likely to receive phishing, malware and spam emails than a general personal inbox, according to an analysis by Google.Gmail service by Google has more than one billion active users and the company says they block hundreds of billions of attacks aimed at corporate accounts every week. At the RSA Conference last week, Google shared some insight on the threats which target corporate inboxes and how these numbers compare to other types of accounts.The data which is collected so far this year shows that a normal corporate email account is 6.2 times more likely to receive a phishing email, 4.3 times more likely to receive malware, and nearly 0.4 times more likely to receive a spam compared to personal inboxes.While corporate accounts seem to be favourite targets for attackers, when it comes to spam and non-profit, phishing, education and government organisations are even more likely to see malware attacks compared to businesses.The IT, entertainment and housing sectors are most targeted in spam campaigns, but when it comes to phishing attacks, they are more likely to be aimed at the finance and insurance sector. coming to malware attacks, real estate was by far the most targeted sector.The sheer volume of phishing attempts depends on the location; for instance, in Japan, the financial sector receives a lot more phishing emails than in the United Kingdom and the United States. Google has also noticed that the IT industry in Brazil is roughly twice as many phishing attempts than in the U.S. and the U.K.Japan and India are the countries with the most spammed inboxes, and the U.S., Germany and France are the largest spammers. In the first part of 2017, the highest percentage of phishing emails were sent to accounts in Japan, followed at a distance by Brazil, Canada and the United States.Google’s experts pointed out that targets are selected based on several criteria, including size, type of organisation, the sector of activity, and location (country). That is why they believe defences must be tailored based on each organisation’s risk profile.source: securityweek", "date": "February 21, 2017", "topics": ["Hacking News", "News"]}, {"title": "It’s Not Just You, YouTube is down for everyone (Updated)", "authur": "William Fieldhouse", "body": "If you are wondering why YouTube is down for you, you are not alone, the world’s biggest video-sharing website is suffering an unknown outage currently and the users are unable to access the website.The users who visit the website can see a 500 error along with a message saying, “500 Internal Server Error Sorry, something went wrong. A team of highly trained monkeys has been dispatched to deal with this situation”, like the one seen below.According to the DownDetector, the YouTube came down around 6 pm GMT. However, we do not have any clear reason for the site coming down. People at Hackread are keeping an eye on this situation and once the website is up or if there is an official statement about the incident from Google about the downtime we will be updating this article.After being offline for more than 2hours YouTube came back, but, there has been no word from Google on this incident and why the website was down. Stay tuned and we will update Google’s comment on this issue.", "date": "February 21, 2017", "topics": ["Hacking News", "News"]}, {"title": "Parents urged to destroy data collecting toy doll", "authur": "William Fieldhouse", "body": "A German privacy watchdog is encouraging parents to get rid of “My Friend Cayla” which is a doll which has a tendency in storing personal information from it’s keeper.Germany’s Federal Network Agency, named “Bundesnetzagentur,” voiced their warning since a student named Stefan Hessel discovered Cayla’s dodgy tendencies.Stefan studies at the University of Saarland, he says Cayla’s speaker and microphone system are vulnerable to external attacks with the following statement.“There are specific reasons the doll is a prohibited broadcasting system under the Telecommunications Act. Each bluetooth capable device within a range of about ten meters can connect to it and use speakers and microphone. In an attempt I had access to the doll over several walls. There is no built-in fuse.”The notion that Cayla can function as an eavesdropper from several rooms away – or even allow others to talk to whoever’s playing with it – is just the latest issue to plague this doll. Let’s not forget the Electronic Privacy Information Center (EPIC) filed a complaint against Cayla and i-Que Intelligent Robot, another toy made by a Los Angeles manufacturer called Genesis, for their ability to “record and collect the private conversations of young children without any limitations on collection, use, or disclosure of this personal information.”", "date": "February 20, 2017", "topics": ["Hacking News", "News"]}, {"title": "Germany Bans Internet-connected ‘Spy Doll’ Cayla", "authur": "William Fieldhouse", "body": "The German regulators have banned the internet-connected doll called “My Friend Cayla” which can chat with children. When asked for the reason, they said it was a de facto “spying device”.The Parents around the country were urged by the Federal Network Agency to disable the interactive toy since they enforce bans on surveillance devices.The agency’s head, Jochen Homann said, “Items which conceal microphones or cameras and which are capable of transmitting a signal, and therefore can transmit some data without detection, compromise the people’s privacy. This applies in particular to children’s toys. The Cayla doll is now banned in Germany. This is to protect the most vulnerable in our society.”Here is how the doll works: It sends the child’s audio question wirelessly to an app on a device, which then converts it into text and searches the internet for an answer and then sends back a response that is again voiced by the doll.In a statement, the German regulators warned that anything a child says, or other people talk, could be recorded and transmitted without parents’ knowledge.It said, “A company can also use the toy to advertise directly to the child or the parents.”“Moreover, if the manufacturer has not adequately protected the wireless connection, the toy can be used by anyone in the vicinity to listen in on conversations undetected.”Genesis Toys, which manufactures this doll, says on its website that it “they are committed to protecting your and your family’s personal information.“Our objective is to ensure that our products and services are safe and enjoyable for our customers”.It also says that Cayla “is programmed to not utter, display or even say words or images that would be inappropriate for children to hear or see”.The company regularly reviews “encryption and physical security measures” to guard against unauthorised access to customers’ personal information.  ", "date": "February 20, 2017", "topics": ["Hacking News"]}, {"title": "FBI Is on the Hunt for 123 Cyber Criminals", "authur": "William Fieldhouse", "body": "At now, the FBI is trying to bring to justice about 123 people who are accused of various cyber crimes, in hope to put them to trial in the United States.Unit chief of the International cybercrime coordination cell, Steven Kelly spoke at the RSA Conference, IT News. According to a statement given by him, this number is from a recent fugitive apprehension initiative which seeks to understand who all of these charged individuals in cyber crime cases are across the FBI.Kelly said, “I think it is a massive number. It’s a lot of people that who are not brought to justice just because they are across the world. They are in a place where we do not have an extradition treaty, and that is a problem.The FBI unit chief, alongside representatives from European Cybercrime Centre and US Department of Justice, has taken the opportunity to express their concerns about a large number of cybercriminals on the loose. “We’re not going to build a deterrence model for the cybercrime if we can’t get our hands on these people,” Kelly pointed out.According to him, spending two years making a case, bringing it to a grand jury and getting charges is not going to do much if they can’t actually get the people responsible and other criminals will continue acting just as before, with impunity and from safe havens where the FBI can’t reach them.Another issue here is the fact that most extradition treaties were not written with cyber crime in mind and are often limited to what they cover. John Lynch, chief of the computer crime and intellectual property department in the DoJ’s criminal division explains that many countries have restrictions about extraditing their own citizens and could, instead, be asked to pursue charges against them in their land.", "date": "February 19, 2017", "topics": ["Hacking News", "News"]}, {"title": "Android Mobile Malware Targets Israeli Military", "authur": "William Fieldhouse", "body": "The servicemen in Israeli are under cyber attack, with thousands of devices that are compromised and turned into a spy gear.According to the Kaspersky Lab, starting in the mid last year, more than 100 Israeli servicemen are hit by an attack which exfiltrated data to attackers’ command and control (C&C) servers. Then, these devices are pushed Trojan updates which allow the attackers to extend hackers to extend their powers.Experts believe that the campaign is still going on and in its beginning stages, targeting various Android devices. The smartphones or tablets are once compromised and are turned into spying devices which can make use of their audio and video capabilities.There are many social engineering techniques, leveraging various social networks in order to make soldiers share their confidential information.According to the Kaspersky, which has worked with IDF C41 and IDF Information Security Department unit, here the victims are the Israeli servicemen of different ranks, most serving in the Gaza Strip.Victims are using social networks to install a malicious application and once the APK file was downloaded from malicious address, that app needs to be installed manually. This app demands permission to delete and install all the packages and to write to external storage, as well as to access the Internet and to access the network state.Depending on each device, the dropper relies on the configuration server to figure out which payload is best to download. The dropper also sends a list of installed apps on the device. Depending on what’s already there, one variant will pretend to be a YouTube layer, while others are chat apps, something we’ve noticed before with other types of malware.One payload – “WhatsApp_Update” – is capable of executing manual commands triggered by the operator and scheduling tasks that collect information periodically from various sources.\n", "date": "February 19, 2017", "topics": ["Hacking News", "News"]}, {"title": "A New Self-Healing Malware Targets Online Shops", "authur": "William Fieldhouse", "body": "The Security experts have found a new malware strain that is targeting online shops which are running on Magento, one of the very popular e-commerce platforms. What sets this malware apart from others is the fact that it can self-heal by using its code hidden in the database of the website.According to the researchers, this is not the first web malware which hides code in the database of the website, but it is first written in the SQL, as a procedure.How does this work? Well, whenever the user places an order, this malware starts execution. Then, this malicious database trigger executes before Magento platform and even puts together PHP and assembles the page, reads a blog post which was signed by Willem de Groot, researcher who analysed the malware discovered by Jeroen Boersma.In the query, he says, checks for existence of this malware in footer, header, copyright, and in every CMS block. If this doesn’t find anything, it then re-adds itself.“The discovery shows us that we have entered a new phase of this malware evolution. Just scanning files is barely enough anymore, latest malware detection methods should now include database analysis also,” de Groot writes.The malware which is affecting these stores is using the Magento platform can steal user card information, which puts quite a lot of people at risk. The SQL part of the code, however, makes sure that the malware survives as long as possible on the platforms.Web security firm High-Tech Bridge CEO Ilia Kolochenko told Softpedia that excluding highly-sophisticated targeted attacks, almost every modern malware can be pretty easy and quickly detected when used in watering hole attacks on popular websites. Detection of their malware, however, means loss of profit for hackers.“Therefore, it’s quite predictable that they start using more and more sophisticated techniques to prevent websites owners, administrators, and visitors to detect the fact of the breach and malware infection.", "date": "February 17, 2017", "topics": ["Hacking News", "News"]}, {"title": "Insecure car-controlling Android apps are a godsend for car thieves", "authur": "William Fieldhouse", "body": "with cars being an expensive purchase, a car requires an approach to security that is as integral as your bank account. However car manufacturers priorities lie in creating car-controlling apps with features that will make a car owners’ life easier with the focus on security being less prioritized than providing good security according to Kaspersky Lab researchers.Having tested seven different proprietary Android apps from different car manufacturers or third-party developers, they used methodologies like reverse engineering and GUI overlay protection and integrity checks for example whether they encrypt sensitive data such as usernames and passwords.With malware being fairly easy to compromise Android devices, the results are pretty shocking:\nThe researchers said that “Theoretically, after stealing credentials, an evildoer will be able to gain control of the car, but this does not mean that the criminal is capable of simply driving off with it. The thing is, a key is needed for a car in order for it to start moving. Therefore, after accessing the inside of a car, car thieves use a programming unit to write a new key into the car’s on-board system,”“Now, let us recall that almost all of the described apps allow for the doors to be unlocked, that is, deactivation of the car’s alarm system. Thus, an evildoer can covertly and quickly perform all of the actions in order to steal a car without breaking or drilling anything.”It should also be noted that they also told Wired that cyber criminals have started buying and selling connected car app credentials (usernames and passwords, PIN numbers and Vehicle Identification Numbers) for various makes and models of therefore the days of attacks doxing this stolen information might be in the distant future.", "date": "February 17, 2017", "topics": ["Hacking News"]}, {"title": "Yahoo Hacked Once Again: Company Issues Security Notice to Users", "authur": "William Fieldhouse", "body": "Yahoo was busy investigating the huge-breach which exposed more than 1 billion user accounts and now the company has found that between in 2015 and 2016 some potentially malicious activity was identified on the website. The company revealed on Wednesday that as of now, it has issued the warning notification to all the users but they have not specified how many users have been affected, still Yahoo is certain that user accounts are compromised during the mentioned time period. This notorioud activity is believed to be caused by using Forged Cookies.The warning notification that is sent by Yahoo to affected users is as follows:“Based on an on-going investigation, we believe that a forged cookie may have been used back in 2015 or 2016 to access your account.”The Yahoo told  Guardian that it reported about the forged cookie back in November 2016 itself for the first time and has addressed the issue in its December 2016 security update but some users are being notified this month. The spokeswoman from Yahoo said that after investigating that the issue, they found user accounts for which the forged cookies are used. But, “Yahoo is in the process of notifying all of potentially affected account holders. Yahoo has invalidated the forged cookies so they cannot be used again,” she added.We know that last year Yahoo revealed the involvement of state-sponsored actor in stealing private data more than 500 million users in a mega-breach that occurred between 2013 and 2014. The stolen data includes important private details such as date of birth, email IDs and security questions answers of the users. This particular breach was utterly devastating for Yahoo since it raised concerns and questions about the security measures employed by the company.The data breach also sabotaged the deal between Yahoo and Verizon Communications in which the former was supposed to sell its email service, mobile apps and websites to the latter.", "date": "February 16, 2017", "topics": ["Hacking News"]}, {"title": "Researchers Found Yet Another Malware Designed to Compromise Mac Devices", "authur": "William Fieldhouse", "body": "A renowned IT security/antivirus firm named Bitdefender, has recently identified that the latest strain of Xagent for the Mac which is being used as a backdoor for the attackers. After this malware is installed using Komplex downloader, it looks for debugger’s presence and if it is not found it waits for a network connection to be enabled and to contact to its C&C servers. Then the attackers will activate specific payload modules. APT28, a Russian hacking group is believed to be playing a crucial role in the development of these tools to infiltrate and infected the systems that run on iOS, Windows, Linux and Android. Perhaps now their only target has become the Mac devices, which is they are reports about one Mac malware after another one.In a blog post published on Tuesday, the researchers at Bitdefender explained that Xagent’s Mac version could be made to perform tasks like obtaining passwords, intrusion, taking screenshots and stealing iOS backups that are stored on infected Mac device. Xagent is a payload with the modules that can search the system configuration of Mac devices, the offload running processes and launch the executable codes. The aspect which hinted at the involvement of the APT28 [Pdf] in distribution of Xagent is a file path located in malware’s binary file which showed writer of Komplex developed it. Komplex is a first-stage Trojan that was used by Sofacy too to compromise devices. According to the findings of Bitdefender researchers, Xagent’s Mac version is being planted by Komplex too.The APT28 group has been active since 2007 and shares close ties with the Russian government. The group’s members are well-versed in Russian and operate according to Russian business timings while they usually attack Ukraine, Romania, US, Canada and Spain, which probably are facts that led to the assumption that it is linked with Russia.\n", "date": "February 16, 2017", "topics": ["Hacking News"]}, {"title": "PayPal users face “Payment Successfully Made Via Ali Express” Phishing Scam", "authur": "William Fieldhouse", "body": "PayPal is one of the biggest platforms used for sending and receiving the payments by small medium and even large enterprises. This also makes it the most obvious target for the cyber criminals that is why PayPal phishing scams have become so common these days. However, with every single new attack, the attackers are coming up with a new idea and new tactics to trick the innocent users and steal their financial and personal information.Recently, many PayPal users have received an email which claims a payment of $450.0 USD that has been made to lie.xyy ([email protected]) from their official PayPal account through the AliExpress for iPhone 6S Black 32GB with but in case the user did not even make this payment and was now looking to resolve the issue they clicked the link.If you are someone who likes to keeps an eye on online scams, you may easily suspect that something is wrong with this login to your PayPal account, you will just login to check what is going on while many innocent users may simply click on the link in the email body and fall victim for the scam. I personally, was in great shock since I never made any payment for an iPhone 6s from AliExpress or Alibaba but upon going through the email content it pretty certain that this was nothing out a Phishing scam.As it can be seen in the email content, the scammers are trying to convince users that the order is being processed and during this time you are unable to do any operation on their order but the fact is that one can file a dispute against the order or payment sent through PayPal.The email address which is used by the scammers to carry this attack out is [email protected] Upon clicking on the roadrunner.com domain, users are redirected to twcc.com (Time Warner Cable Central).source: hackread", "date": "February 15, 2017", "topics": ["Hacking News", "News"]}, {"title": "YouPorn Teams Up With HackerOne for Bug Bounty Program and Offers Up To $25,000", "authur": "William Fieldhouse", "body": "One of the most watched pornography websites in the world, YouPorn teams up with the ever so popular HackerOne to launch a bug bounty program with rewards offering up to $25,000.This mature entertainment website is just another one of the latest brands to choose to have their networks tested by the white hat hackers to keep themselves bugs free and kill bugs if they managed to find any.The company behind this site says that they want to make sure their online visitors are as safe as possible while visit their site. Therefore, depending on the level of severity of the bug or issue found, hackers will be rewarded from $50 to $25,000, the latter, of course, for very critical weaknesses that are found in their systems.From Alexa ranks, you can find that YouPorn stands at 230th of most visited websites in the world. And the website claims to achieve around about a billion video views each month. With numbers as big as those, it’s no surprise the company behind the website wants to make sure it is safe for the safe.Looks like the YouPorn is following in steps of its sister company Pornhub which launched its own bug bounty program last yeat for the very same reasons.“We encourage the researchers to reach out to us and let us know if they find any potential issues, and we will be very happy to work to resolve the issue they found. We guarantee that they are to be fairly rewarded for their time and effort,” said YouPorn vice president Brad Burns.Bug bounty programs have become increasingly popular over the past few years. On top of companies that run their own programs, such as Google and Facebook, for instance, HackerOne helps companies across the world test out the safety of their systems.Google, for example, paid $3 million in rewards last year alone, putting the number at $9 million since the program’s inception in 2010.", "date": "February 15, 2017", "topics": ["Hacking News"]}, {"title": "Someone DDoSed A University Server By Hacking Its Vending Machines", "authur": "William Fieldhouse", "body": "The fact that IoT(Internet of Things) are vulnerable to exploitation is a well-known fact. The malicious actors get their jobs done easily, thanks to phenomena of default login credentials used by the sys admins which makes them the easy targets. We also came to know about capabilities of even smaller number of infected IoT devices since they are turned into an army of botnets to create havoc at any internet network of a targeted organisation. This recent incident does again prove that these incidents are sure to happen if we continue to make IoT devices with vulnerabilities.The RISK (Research, Investigations, Solutions and Knowledge) department researchers of Verizon Enterprise were tasked with the investigation of internet blockage at one of the unidentified US university and they found that [PDF] thousands of infected IoT devices are responsible for the internet cutting off. The attackers have reprogrammed these devices to start attempting to connect with seafood-oriented websites.The attackers have hacked 5,000 devices so all of these send out DNS queries continuously (A DDoS attack) and fulfill their malicious objectives. The attackers have used a variety of devices from vending machines to street lamps. The network of the University has resultantly, started to finally slow down the malware in the IoT devices which started attacking its drink vending machines. When one of the devices is infected, the malware started searching for more vulnerable devices and the chain reaction followed suite. When a single device was infected, the malware modified its admin password making it difficult to remove the infection.When the IT staff of the university got a hint of the malware attack, they quickly responded by tracking down the new passwords and since these were transmitted in clear text format instead of being encrypted, their job became easier as they were able to intercept them using a packet-sniffing app. ", "date": "February 15, 2017", "topics": ["Hacking News"]}, {"title": "JavaScript Apps Get Anti-Tampering Protection for Safer Devices", "authur": "William Fieldhouse", "body": "All the JavaScript apps are now a lot safer thanks to the new technology from the Arxan Technologies that protects the apps from being tampered.“The patented technology of Arxan turns applications into a self-defending and tamper-proof app. For Javascript, once processed by the solution set we developed, your JS code will no longer be readable to tools or hackers, but, more important is that, we have intelligent guards that will define code at runtime while it is running inside the user’s browser,” CTO of Arxan, Sam Rehman told the Softpedia.This Arxan Application Protection for the JavaScript provides security to all JavaScript-based apps, including Android apps and hybrid iOS, as well as the web pages. This will help the brands to protect their image and the finances, as well as to prevent IP theft and compliance risk.Rusty Carter, VP of Product Management said, “We have developed a solution which empowers our customers and take the advantage of JavaScript without actually sacrificing security, making their apps self-protecting and also resilient against the reverse-engineering and code tampering, while not giving up on protecting sensitive data, cryptographic keys, and the communication with the server APIs,” said .While it is clear that this type of technology has many advantages for the companies, we wanted to know what are the benefits to end-users.Sam Rehman told that people trust their mobile devices more than they trust their laptops and desktops and that, as of 2015, adults have spent, on average, more time on mobile devices than any other type of device.As more people trust their mobile devices, the need for protecting the apps, data, and keys on their devices increases. “Arxan turns applications into secure and self-protecting applications. For end-users, that means more secure mobile transactions, whether it’s mobile banking or mobile commerce. Also, your credentials and sensitive data are also protected, so you can safely use your devices, for example, to manage any sensitive and private data,” Rehman says.\n", "date": "February 14, 2017", "topics": ["Hacking News"]}, {"title": "Marcher Trojan Infected Thousands of Android Devices", "authur": "William Fieldhouse", "body": "Researchers at the Dutch security firm Securify have done a detailed analysis of an Android banking Trojan called Marcher and was discovered that a single botnet managed to steal a large number of payment cards.The Marcher has been around since 2013, but it has initially attempted to trick users into handling over their payment card details using phishing pages like Google Play. Back in March 2014, this malware started targeting many banks in Germany and, by summer of 2016, there are more than 60 targeted organisations in the U.S., Australia, U.K., Poland, Turkey, France, Spain and other countries.The malware has been disguised as many popular apps, like WhatsApp, Netflix andSuper Mario Run.Securify also identified nine Marcher botnets in the last 6 months, and all of them are provided with some new modules and targeted web injects by Trojan’s creators.One of these botnets, which mainly targets the customers of banks in Germany, Austria and France, has infected more than 11,000 devices, including 5.700 in Germany and 2,200 in France. The attackers’ C&C server stored 1,300 payment card numbers and other banking information.Based on the analysis of the command and control (C&C) server used by the cybercriminals, researchers determined that a majority of the infected devices had been running Android 6.0.1, but the list of victims also included more than 100 Android 7.0 devices.“Marcher is one of the Android banking Trojans which use the AndroidProcesses library, and enables the application to obtain the names of the Android packages which is currently running in foreground. That library is generally used because it uses the only publicly known way to retrieve the information on Android 6 using the process OOM score read from the /proc directory,” explained the researchers at Securify.", "date": "February 14, 2017", "topics": ["Hacking News"]}, {"title": "Turkish Hacker Arrested in US for Stealing $55million", "authur": "William Fieldhouse", "body": "A Turkish citizen of age 35, Ercan Findikoglu, was sentenced to jail on Friday by New York court to 8 years in prison due to his leadership role in a cyber criminal organisation which caused significant losses to the banks around the globe.Findikoglu, known online as “Predator”, “Segate” and “Oreon,” pleaded guilty in last March to a computer intrusion conspiracy, an access device fraud conspiracy, and also effecting transactions with unauthorised devices. He nearly faced 58 years in prison.According to the authorities, in between 2011 and 2013, the criminal gang Findikoglu was also part of three major campaigns which resulted in the losses worth more than $55 million.These cyber crooks hacked into the systems of the payment card processing companies and stole the card data, including their PINs, and eliminated the withdrawal limits on all those cards. All the stolen card data was sent back to every other member of the group who encoded it onto magnetic strips of the blank cards. The cards and their PIN numbers were then distributed to a network of cashiers who then made thousands of fraudulent withdrawals at ATMs globally.In their first operation, that took place in February 2011, these fraudsters made nearly 15,000 withdrawals in around 18 countries, and stole roughly $10 million.Their third and largest operation took place back in February 2013, when these fraudsters withdrew nearly $40 million from 36,000 ATM transactions in around 24 countries. The cashiers in New York alone managed to obtain $2.4 million as a result of nearly 3,000 withdrawals.Findikoglu was arrested in Germany in 2013 and extradited to the U.S. in 2015. Once he completes his prison sentence in the United States, he will be sent back to Turkey, where he has been sentenced to nearly 20 years in prison for payment card fraud.The U.S. court that sentenced Findikoglu on Friday also ordered him to pay more than $55 million in restitution, but the New York Daily News reported that Turkish authorities seized all his assets and his current net worth is $150,000. ", "date": "February 14, 2017", "topics": ["Hacking News"]}, {"title": "Deleted browsing history on safari may not actually be deleted", "authur": "William Fieldhouse", "body": "Elcomsoft, a Moscow-based firm which creates forensics software said that it was possible [Pdf] to retrieve the deleted browser history beyond a year. The Elcomsoft CEO Vladimir Katalov stumbled upon while he was testing out his latest hacking tool to see his safari history on his iPhone. He found that Apple was storing the consumer data in a secret cloud from iCloud called the “Tombstone.”When Vladimir his phone breaker software to extract the browser history, he found that deleted data upto a year old is still recorded and available. In an interview with Forbes, Katalov claimed “We have found that they stay in their cloud, probably forever,”  records which are deleted from both iPhone and Mac interestingly were termed as “cleared” but not “deleted” in the Safari. These claims are verified by an IOS expert brought in by the Forbes.Civil rights groups and the privacy security experts could be in uproar with all these revelations. The policy analyst at the American Civil Liberties Union (ACLU), Jay Stanley stated that to Forbes “Overall, assuming that this was a mistake, it is a reminder that storing of data is as default as a technical matter,” he added saying “Browsing history is a very sensitive collection of data. It reveals to people’s interests, concerns, worries and in many cases their every fleeting thought, as well as health information, information on their sexuality”.“In this release, we added the ability to pull Safari browsing records going back more than one year, and this includes records that have been deleted a long time ago”, says Vladimir Katalov, ElcomSoft CEO. “The user does not have a chance to see these records anywhere on their device or in the cloud, and may not have a clue they even exist.”Having data that you wish deleted to be then recorded and kept is a breach of trust, people should be comfortable with the knowledge that their commands are carried out accordingly, companies should always follow best practices and make the instructions of the user; hence we always recommend search tools that do not keep records. ", "date": "February 14, 2017", "topics": ["Hacking News", "News"]}, {"title": "Social Media Phishing Rose 500%", "authur": "William Fieldhouse", "body": "Summer Olympics, Through the 2016, the social media phishing attacks have increased by 500%, reveals a new Proofpoint research. This data includes cases of angler phishing, where the attackers intercept the customer support channels on social media during their attempt to steal the victim’s credentials, which proved to be the very common in financial services, but also in entertainment accounts.According to the Quarterly Threat Summary of Proofpoint, the last trimester of 2016, has also been an increase in the fraudulent accounts across the social channels. In fact, they have doubled from third to the fourth quarter. The risk that these accounts pose is high as they can be easily used for social spam, phishing, malware distribution, and so on.“In that end, the researchers at Proofpoint observed a 20% increase in spam content across Facebook and Twitter quarter over quarter,” the report reads.Furthermore, legitimate Twitter support accounts are now sending more private messages than ever, with a 25% increase in the year’s last quarter, compared to the previous period. But while these support accounts are now sending more messages and customers become accustomed to interacting with brands via DMs, angler phishing becomes easier.One thing attackers were attracted to was, understandably, hot topics. For instance, there was a high number of fraudulent “Super Mario Run” pages that appeared in Q4, before and after the launch of the mobile game. Pokemon Go was also quite an attraction. Many pages featured download links that led either to malware or surveys.Another main finding in the report was that there are about 4500 mobile apps associated with the including sponsor brands, Summer Olympics, which were risky or downright malicious.Locky payloads were delivered via attached JavaScript or zipped JavaScript, but it was also attached to Microsoft Word and Excel documents featuring malicious macros, URLs linking to zipped JavaScript files or zipped VBScript files.", "date": "February 12, 2017", "topics": ["Hacking News"]}, {"title": "Gmail Found Delivering Spoofed Messages Without Warning", "authur": "William Fieldhouse", "body": "Gmail has some pretty strong spam filters and it has always been one of their strong points.Google manage to keep out most of the spam from hitting your inbox, but still, it cannot keep out everything. Especially when it comes from a spoofed @gmail.com address.According to researcher Renato Marinho, from a Brazilian security firm named Morphus Labs, Gmail does not filter or warn users about sketchy messages from another spoofed @gmail.com address. Marinho also writes that while an email appears to have come from another valid Gmail account, but it actually comes from a server which is not Gmail related. This is something that spammers or even hackers who are looking to harm you can certainly take advantage of this.It seems that only clue left to indicate something is not right with this is that spoofed email is, in the sender field, you will see the Gmail address was sent from another server. This information is not available, however, if you’re checking your mails on Android or iOS apps.Marinho also explains that for scheme to work, spoofed Gmail address that the sends the message needs to pretend to be valid because if that doesn’t happen, that message goes straight into the spam folder.According to this researcher, in order for all this to happen, the email of spammer’s server must first connect to Gmail saying it wants to deliver a message from his domain, even if it’s not a legitimate one. Instead, the address is switched to a fake Gmail address to fool Google.While this loophole can be potentially problematic, Google does not believe the issue needs to be tracked as a security bug because it doesn’t really affect the confidentiality or integrity of the Gmail users’ data, says Marinho who contacted Google with this issue.\n", "date": "February 12, 2017", "topics": ["Hacking News"]}, {"title": "1.5M Unpatched WordPress Sites Hacked", "authur": "William Fieldhouse", "body": "Experts say that the attackers have taken a liking to content-injection vulnerability that is disclosed last week which is patched in WordPress 4.7.2. It has been exploited to used to deface 1.5M sites so far.This issue has evolved into “one of the known worst WordPress related vulnerabilities to come up in some time,” researchers at WordFence, a Seattle-based firm that makes WordPress security plugins, said on Thursday.WordPress has silently patched this issue. An unauthenticated privilege escalation vulnerability in the REST API endpoint, which is when it pushed version 4.7.2 on Jan. 26. A core developer with in the CMS said the following week that they waited to disclose this vulnerability to ensure that millions of more sites could deploy this update. WordPress has a feature which automatically updates the CMS on the majority number of sites, but some users choose not to use it and test updates before applying them.Mark Maunder, the WordFence’s Chief Executive Officer, said that researchers have seen the biggest spike in attacks on this Tuesday when the company has blocked roughly 13,000 attacks from campaigns which are 20 and different.The reason for the influx, Maunder said, is because at the beginning of the week attackers refined their attacks to bypass a rule that WordFence and other companies had implemented. While WordFence was quick to engineer a new rule to prevent the bypass, attackers were still able to succeed in infecting a slew of sites–more than 800,000 over a 48-hour period from Tuesday to Wednesday–he said.In some instances, hackers are competing to compromise sites that haven’t yet applied the fix. WordFence researchers claim they’ve come across some sites where multiple hackers attempt to take credit on multiple pages for hacking them. The defacing and re-defacing will likely continue until those sites apply the 4.7.2 fix, Maunder says. ", "date": "February 12, 2017", "topics": ["Hacking News", "News"]}, {"title": "Old Windows Malware Techniques Used in New Mac Malware", "authur": "William Fieldhouse", "body": "Just because Macs are not victims of malware that often, doesn’t mean they are completely safe. As this new Mac malware detected earlier this week proved.The Mac security researchers have detected two separate MacOS malware in this week. One of these exploits relies on an old Windows technique. A malicious Microsoft Word that is abusing macros, with title “U.S. Allies and Rivals Digest Trump’s Victory – Carnegie Endowment for International Peace,” has been sent.Patrick Wardle, director of security firm Synack noted that, when Mac users opened the received document in a Word application configured in order to allow macros and ignore warnings, the embedded macro has automatically checked that the LittleSnitch security firewall wasn’t running.It then downloads a payload which is encrypted, decryptable using a hard-coded key and then executed the payload. It seems that code in macro was taken from one of the open-source exploit frameworks for Macs called EmPyre. By the time the document was tracked by the specialists, the site payload was downloaded from was no longer serving that, so it is impossible to tell exactly what it has been doing.Given the fact that the code was very similar to EmPyre, this malware could very well monitor webcams, steal encryption keys and password, and access browser history logs.While this type of attack is nowadays considered primitive, especially given the fact that Office itself advises against allowing macros to run with a clear warning about potential viruses, some Mac users were still affected.The other malware instance discovered this week also relied on classic Windows tactics by faking a regular software update dialog that downloads malicious code rather than the app’s needed update. The MacDownloader virus presented itself as an Adobe Flash Player update, which everyone knows are annoying. This is what attackers were counting on, of course, as people either dismiss the updates or just press yes to get them dismissed once and for all.\n", "date": "February 10, 2017", "topics": ["Hacking News"]}, {"title": "After Linux, Mirai Botnet is Attacking Windows", "authur": "William Fieldhouse", "body": "Recently the Antivirus firms Dr.Web’s researchers have found that a new variant of Mirai bot, the famous IoT malware. This recently found new variant is able to target Windows systems and can even take on more ports than its original Linux version. Dr.Web researchers have named the new version as Trojan.Mirai.1.This Mirai’s Windows version is now used by cybercriminals to infect Internet of Things (IoT) devices and also conducting DDoS attacks. The original version of this malware was found in August 2016 by a researcher MalwareMustDie. Back then, the malware was identified as malware designed to target the IoT devices and turn them into a controllable bot specifically. Many high-profile organizations like DynDNS and OVH hostings are among the key targets.The purpose of this development of a Windows compatible version of the infamous malware, according to Dr.Web researchers, is to ensure that the Mirai is “spread to even more devices.”The Mirai malware is able of infect a diverse array of devices, but it’s main targets are IoT devices and internet routers. Once the malware infects a device, it selects random IP addresses and tries to log in through SSH or Telnet port.This new version is believed to be developed for Microsoft Windows and is written in C++ language. According to the researchers, it was designed to “scan TCP ports from indicated range of IPs to execute various commands and distribute many other malware.”When it was launched, this malware creates a link with its C&C (command and control) server and downloads the “configuration file (wpd.dat), and extracts the list of IP addresses.”Afterward, it launches the scanner and also checks for other ports. After Trojan.Mirai.1 succeeds in compromising a new device with the malware, it runs the Linux OS and also launches various commands to create a DDoS Mirai bot, but if the device is running MS Windows OS, it just releases its copy. Additionally, it creates DBMS user through using the login ID “Mssqla and password Bus3456#qwein.”source: hackread", "date": "February 10, 2017", "topics": ["Hacking News"]}, {"title": "Indian hackers hacked Facebook groups for posting teen porn images", "authur": "William Fieldhouse", "body": "We recently heard about the Anonymous taking down 20 percent of the Dark Web for posting child pornography on those websites and now a very similar operation was launched against groups/pages on Facebook for uploading pornographic content. But, this time, the attack are started by a group from Kerala, India, hacker group who call themselves Kerala Cyber Warriors (KCW) and claim to be an ethical hacking collective.According to Deccan Chronicle, an Indian newspaper, KCW hacked into 59 Facebook profile pages and groups that are believed to be involved in sharing explicit content which includes child porn images.  ‘Deepa and Sneha Fans’, ‘Love Life Girls Love Sex’ and ‘I love Ansiba’ are some of these hacked groups. KCW somehow managed to locate and took down 25 groups and 34 pages on Facebook for illegally sharing the pornographic content that involves minors and women.Some of these hacked groups or pages displayed private/intimate images of females of all ages while some of these were marketed as revenge porn sites on which users can upload pictures of their previous partners. Some groups/pages offered sexting service and also allowed posting of illegal content even from random people. Some of these pages are dedicated to running online prostitution rings too.Although the Kerala police have been trying to hunt down these groups with their recently launched Operation “Big Daddy” but look like their efforts are not enough or effective while KCW was a lot more efficient in this case. This hack attack from KCW echoed the tactics and strategies of Anonymous as well. The hacker group uploaded a warning message in the cover picture section of their hacked pages claiming that they will expose the perpetrators of the crime and operators of the pages if they don’t stop these malicious activities immediately. The warning message contained the famous quotation from Anonymous, which reads: ", "date": "February 10, 2017", "topics": ["Hacking News", "News"]}, {"title": "Ticketbleed an SSL vulnerability similar to Heartbleed", "authur": "William Fieldhouse", "body": "There’s a new bug in town affecting F5 Network devices called Ticketbleed, the naming convention came about due to the simalarity to Heartbleed, however this bug is only specific to F5’s Big-IP appliancesThe vulnerability is within the implementation of Session Tickets using a technique designed to speed up repeated connections.When the client provides a Session ID together with a Session Ticket, the server should normally echo back the Session ID to show acceptance of the ticket. Session IDs memory sizes can be between 1 and 31 bytes.The F5 stack always echoes back 32 bytes of memory, even if the Session ID was shorter. Therefore an attacker providing a 1-byte Session ID would receive 31 bytes of uninitialized memory. As a consequence the servers can be tricked into leaking 31 bytes of memory at a time according to the F5 press releaseThe issue was discovered by Filippo Valsorda from Cloudflare’s Crypto Team with other Cloudflare employees when investigating a customer issue. You can read the technical explanations on the Filippo.io blog.Valsorda has also made available a simple online tool that allows users to find out if their server is affected to the Ticketbleed attack. Internet scans by the researcher relieved that 949 of the Alexa top one million websites were vulnerable, including 15 from the top 10,000 sites. Based on the top one million hosts on Cisco’s Umbrella cloud security platform there were over 1,600 found to be affected.", "date": "February 9, 2017", "topics": ["Hacking News", "News"]}, {"title": "VC of HackerOne Penetrates Pockets for $40 Million", "authur": "William Fieldhouse", "body": "The famous Bug bounty provider HackerOne has announced on Wednesday that they have raised $40 million in a Serious C financing round that is led by the Dragoneer Investment Group.This San Francisco-based startup offers a software-as-a-service(SaaS) platform which provides the technology and automation to help organisations to run their own bug bounty and vulnerability management programs.The company says that the new funds will be invested in technology development, expanding market reach, and also strengthen their hacker community which has more than 100,000 white hat hackersThe company was co-founded by Alex Rice who is the company’s CTO and also the man behind Facebook’s bug bounty program, Merijn Terheggen, the man who serves as CEO, Jobert Abma (the tech lead) and Michiel Prins (the product lead). HackerOne has gained publicity back in November 2013 when they have announced hosting the Internet Bug Bounty project which is funded by Facebook and Microsoft.According to this security startup, greater than 38,000 security vulnerabilities are resolved across greater than 700 HackerOne customers, with makes more than $14 million in bug bounties awarded as of now, $7 million of this was awarded only in 2016.In 2016, the U.S. Department of Defense (DoD) selected HackerOne to run the U.S. federal government’s first bug bounty challenge, Hack the Pentagon, which HackerOne says resolved more than 138 vulnerabilities discovered by 1,400 hackers.In October 2016 the DoD announced that it awarded a combined $7 million to HackerOne and Synack for helping the organisation’s components launch their own bug bounty initiatives. With $3 million awarded to HackerOne, the company will help the DoD run challenges similar to Hack the Pentagon, while Synack will provide assistance for a private program open only to highly vetted researchers, the DoD said, adding that the private program will focus on the Pentagon’s sensitive IT assets.Other HackerOne customers include CloudFlare, Airbnb, GitHub, New Relic, General Motors, Qualcomm, Starbucks, Nintendo, Uber and Lufthansa. ", "date": "February 9, 2017", "topics": ["Hacking News", "News"]}, {"title": "Zero-Day in Windows Moves From A Critical Issue to High-Risk", "authur": "William Fieldhouse", "body": "A 0-day vulnerability (CVE-2017-0016) that is affecting Windows’ SMBv3 (Server Message Block) protocol which was revealed last week is no longer considered as a Critical issue, but as a High-risk.The issue resides in the way in which Windows handles SMB traffic and also allows an unauthenticated attacker to exploit and cause a denial of service remotely. This issue is basically triggered when a Windows client system which is vulnerable connects to a malicious SMB server.SMB is basically an application-layer network protocol which provides computers to access files, serial ports, printers, and miscellaneous communications in between nodes on a local network. It offers an inter-process communication mechanism which is authenticated.This flaw is revealed publicly after security researcher who discovered it has published a proof-of-concept exploit on the GitHub. The CERT Coordination Center (CERT/CC) at the Carnegie Mellon University assessed an issue as critical and even suggested that it can have a severity score of 10, as the possibility of exploitation for an arbitrary code execution.In the meanwhile, however, the CERT revised the initial advisory and has removed all mentions of an arbitrary code execution, while also downgrading the severity score of the issue. With a CVSS (Common Vulnerability Scoring System) score of 7.8, the bug is now rated High risk in the updated advisory.“To be vulnerable, a client needs to support SMBv3, which was introduced in Windows 8 for clients and Windows 2012 on servers,” Johannes B. Ullrich, Ph.D., Dean of Research for the SANS Technology Institute, notes.Update: “Windows is the only platform with a customer commitment to investigate reported security issues, and proactively update impacted devices as soon as possible,” – a Microsoft spokesperson told the SecurityWeek in a statement. “Our standard policy is that on issues of low risk, we remediate that risk via our current Update Tuesday schedule.”", "date": "February 9, 2017", "topics": ["Hacking News"]}, {"title": "Google Challenges Search Warrant Ruling", "authur": "William Fieldhouse", "body": "Google is now planning to appeal a ruling that is made on Friday that it must has to comply with the search warrants involving the customer data stored on the servers outside of the United States. The case is very similar to an earlier one involving Microsoft. Back in July 2016, the 2nd U.S. Circuit Court of Appeals in New York, said Microsoft could not be forced to turn over their emails that are stored on a server outside of US. Now, however, Magistrate Judge Thomas Rueter of Philadelphia has taken the opposite to the view with Google.Both these cases involve search warrants that are issued under 1986 Stored Communications Act (SCA). The Microsoft has also initially ordered to comply. They appealed, and also eventually Judge Susan Carney of appeals court said that SCA does not give the US courts authority to force the internet companies in the United States to seize the customer email contents stored on the foreign servers. At that time, Brad Smith, the Microsoft chief legal officer said, “It makes clear that the US Congress didn’t give the US Government authority to use search warrants unilaterally to reach beyond the US borders.”The Google has expected this precedent to be upheld in their own refusal to comply with a very similar search warrant. Government’s key argument is that there is no search undertaken on foreign soil; the data is brought back lawfully to the US, and that search is conducted lawfully within the US. For Google, this argument was accepted; but for Microsoft it has been rejected.“Though the retrieval of the electronic data by Google from its multiple data centers abroad has the potential for an invasion of privacy, the actual infringement of privacy occurs at the time of disclosure in the United States,” Rueter wrote.Google has said it will appeal the ruling. “The magistrate in this case departed from precedent, and we plan to appeal the decision. We will continue to push back on overbroad warrants,” it said in a statement. ", "date": "February 8, 2017", "topics": ["Hacking News"]}, {"title": "Android Ransomware Becomes More Powerful by Using Dropper", "authur": "William Fieldhouse", "body": "The Symantec security researchers warn that the use of droppers to infect devices with ransomware has now spread to Android.This usage of dropper along with malware is a relatively new technique, although it is a very popular for desktop computers. Furthermore, the researchers say, the actors who are using it have also implemented a 2D barcode technique that is meant to help them receive payment from victims, only problem is they did it ineffectively.Lockdroid ransomware that was spotted about a year ago was designed to encrypt the user files and then perform other nefarious activities as well. It the requests device admin rights and, if the user allows them, it can also lock the device, prevent the user from uninstalling by modifying the user interface (UI), and can even force factory resets, and thus erasing all the user data from the infected device.The malware designed now to drop the Android.Lockdroid.E ransomware is being distributed via third-party apps, but also through forum posts and text messages. This malware first attempted to drop a version of itself only onto rooted devices, or locks those devices that haven’t been rooted, Symantec discovered.Once installed on a device, the malicious app checks to see whether the device has been rooted and requests root access permissions if it has. The malware claims that this would allow it to access thousands of adult movies for free, in an effort to convince potential victims of the necessity of these permissions.Once the user agrees, the malware drops a copy of itself onto the device, by remounting the /system partition, copying the embedded APK file for Android.Lockdroid.E to /system/app/[THREAT NAME].apk, changing the dropped APK file’s permission to executable, and rebooting the device so the threat can run on boot completed as a system application.", "date": "February 6, 2017", "topics": ["Hacking News", "News"]}, {"title": "“This is you?” is the latest Facebook scam and It’s so Appealing", "authur": "William Fieldhouse", "body": "Facebook is undeniably the most used social media platform in the world, and it makes an attractive target for the online scammers and cyber criminals.The latest to join this group is the bandwagon of message-based scams on this social network and they are “This is you?” scam. Here, what’s happening is that the users receive a message on their Facebook profile page, which is generally sent from one of their friends. The message takes the title “This is you?” with the question mark at the end of the title which makes the user more curious to find out if she or he is anyhow linked to that URL.The link contains a YouTube video that is embedded in it. This would supposedly show the video in which friend identified recipient to be present. However, this is all just a big fat lie, since the message is a scam and link is malicious. It must also be noted that your friend is not the one who sent you this link, but it is the cyber criminals behind thid scam.The link does not actually redirect the victims to the video, and you will also be convinced to open the link since it shows to have around 400,000 views already. Do not open the link at any cost or else you will be in trouble. The scammers are sending different links to different users. This is why it has become difficult for Facebook to block these links although the company is trying to reduce the impact of the scam by preventing them to their best ability.You also need to be very careful. Some links may redirect you to Amazon probably because the scammers have signed up for the affiliate marketing of Amazon.com in which the company gives referral commission. Once you click on the link, any future purchases you make from that website will help the scammers earn some cash. ", "date": "February 6, 2017", "topics": ["Hacking News"]}, {"title": "Blue Badge Verification Phishing Scam On Twitter Goes Viral", "authur": "William Fieldhouse", "body": "The account verification in Twitter means, you will receive the blue verified badge. At present, anyone can apply for this and the Twitter team will take the necessary decision whether to award or not. The people who seek this elusive badge have now become the target audience of cyber criminals who have launched a phishing scam targeting them.The IT security researchers at the Proofpoint have found a phishing scam that targets Twitter users in which the cyber criminals are pretending to be the official Twitter team which does the verification of an account with a blue badge. But, in reality, this scam is just about stealing the login credentials and the financial data.This scam is very sophisticated as it starts with a Twitter account “@SupportForAll6” (which is now suspended) placing legitimate ads on the Twitter which are then linked to a phishing website “twitterhelp.info” (this is also suspended, obviously). Once the user has clicked on the ad, they are straight forward taken to their phishing site which then asks them to “Get started” the verification process.Furthermore, if the user clicks on the Get Started tab, they are then taken to another page that asks them to add their phone umber, passwords, login email, and their credit card data. Just remember, the Twitter verification process is totally free.According to Proofpoint “While there is no validation on the form asking for account information, allowing users to submit empty values, this is not the case with the financial information; this cannot be submitted without providing the requested credit card information.”It must be noted that the official Twitter support account has more than 5 million followers and checked with a blue badge unlike the one with 119 followers with no verification badge whatsoever.", "date": "February 6, 2017", "topics": ["Hacking News"]}, {"title": "Anonymous Takes Down 20% of the Dark Web after Finding Child Porn", "authur": "William Fieldhouse", "body": "The Dark Web is now having a tough weekend since the hacker group affiliated with Anonymous managed to break into servers of Freedom Hosting II to take down over 10,000 websites in Dark Web.All the visitors of these websites hosted by Freedom Hosting II service gets a chilling greeting message. “Hello, Freedom Hosting II, you have been hacked.”The Freedom Hosting II is one of the largest hosting services for the underground websites. They hold some 15 to 20 percent of all the websites on the Dark Web, as per the estimates of researcher Sarah Jamie Lewis. All of these websites are .onion and they can, therefore, be accessed using the Tor browser.The Hackers stole a database of the Freedom Hosting II and defaced all the websites hosted and then demanded a ransom if they want their data back. Some of the stolen data is already dumped on another site that is hosted on Tor network. The researcher behind the Have I Been Pwned tweeted. This collection of data includes the mail details of more than 380,000 users.The main reason for Anonymous to target this hosting service and all of its website is that they do not have any tolerance to child pornography. They explain in a message posted on these hacked sites. “Moreover you host many scam sites, some of which are evidently run by yourself to cover hosting expenses,” they add.The notice mentions that all files have been copied and the database has been dumped, amassing to 74GB of files and 2.3GB of the database. “Up to January 31st you were hosting 10,613 sites. Private keys are included in the dump,” the message reads.Anonymous hackers mention that over half of the files hosted on Freedom Hosting II servers were related to child pornography, which is, obviously illegal. It has become a common occurrence for dark web sites to host such vile content, something that law enforcement is aware of and has been trying to combat.", "date": "February 5, 2017", "topics": ["Hacking News", "News"]}, {"title": "Chinese Cyberspies Now Target Russia With Their Latest Malware", "authur": "William Fieldhouse", "body": "A China-linked cyber hacker group was using new malware and some new techniques in their attacks targetted at military and aerospace organisations in Russia and Belarus.Back in July 2016, the security firm Proofpoint reported that threat actor had been using the PlugX RAT and NetTraveler to target Russia and neighbouring countries. Researchers now reveal that, at around the same time, this group started using a new downloader, dubbed as ZeroT, and Microsoft Compiled HTML Help files to deliver the PlugX.The attackers have sent victims some .chm files that contain an HTM file and also an executable. When this help file is opened, a Russian-language text is shown and the victim is asked by User Account Control (UAC) feature in Windows to allow the access to execute an “unknown program.” If the user selects “Yes,” the ZeroT downloader is then dropped onto their system.Similar to the earlier attacks, APT actor also has used specially crafted Word documents that are created with an exploit generator called MNKit. This Office exploit generator has allowed the researchers to find out the connections between different groups believed to be operating out from China.The emails and files used as bait often referenced the Commonwealth of Independent States (CIS), which is an alliance of former Soviet Union countries, Russian government programs, and Russia’s defense industry.The threat group has also used self-extracting RAR archives to deliver ZeroT. Many of these archives included an executable named “Go.exe,” which leverages the Event Viewer tool in Windows to bypass UAC.Once it infects a system, ZeroT contacts its command and control (C&C) server, and uploads information about the infected system. ZeroT then downloads a previously known variant of the PlugX RAT, either directly as a non-encoded PE payload or as a Bitmap (.bmp) image file that uses steganography to hide the malware. ", "date": "February 4, 2017", "topics": ["Hacking News", "News"]}, {"title": "Witcher 3 Old Dev Forum Hacked and 1.9 Million Credentials Dumped", "authur": "William Fieldhouse", "body": "CD Projekt RED, famous game developer studio was the victim of a data breach back in March 2016 when the hackers got hold of nearly 1.9 million user credentials that are stolen from its online forum.Even though the stolen data was on breach notification website Have I Been Pwned? for quite a few days now, company is now contacting the people about this situation and advising them to change the password just for the safety reasons, while also explaining the situation in a smooth and better way.The studio is popular for developing the major successful games like the Witcher franchise. It was attacked in march of 2016 and according to the company, a cdprojektred.com forum database was accessed and selected up by the hackers, this contains data belonging to 1.9 million users.At the time of the event happening, the hacked database was not in active use and they said since it was not used for almost a year, the forum members are asked to move over to GOG.com and then create accounts there, which is a lot better protected. “These accounts are additionally protected by two-step authentication. The forum engine has also been upgraded since then to the newest and most secure version, fixing the vulnerability that allowed said access,” said the company’s message.The database that is dumped online has usernames, email addresses and passwords which were hashed and “salted.” This is a very common practice involving the adding of random characters to the passwords when they are being hashed, in order to increase security by introducing the random factor which hacker cannot use or replicate to retrace the passwords. Even though the passwords are not stored in just plain text, they are not directly accessible to hackers for sure.It is, however, advisable that people change their passwords if they used the same ones for multiple accounts. The old forum data has not been moved over to the GOG.com site, so that’s another layer of protection there.", "date": "February 4, 2017", "topics": ["Hacking News", "News"]}, {"title": "Hacker Reveals How Cellebrite Hacked iPhone from San Bernardino Case", "authur": "William Fieldhouse", "body": "Finally we have the answer to how Cellebrite managed to hack the iPhone in the San Barnardino shooter case. The answer is repourposing other existing cracking tools that are used to jailbreak iPhones.Last month a hacker broke into Cellebrite’s servers and stole 900 GB of data. The same hacker is now dumping the tools stolen from the company as reported by the Motherboard.The publicly released files relate not just to Android and BlackBerry devices, but also to older iPhone models. Some of this data seems to be copied from other cracking tools which can be found with a little online digging.As the United States heads towads a more authoritarian society with Trump at the leading position, the hacker wants to make a point here. Considering Trump’s appointees in important positions who would really want authorities to have backdoors in various encryption tools so that they can snoop to their hearts desires,  now the hacker’s position does not seem so strange.“The debate around the backdoors is not going to go away, rather it is certainly going to get even more intense as we move toward a more authoritarian society. It is important to demonstrate that when you create these hacking tools, they will make it out. The history should make that clear,” the hacker said.The data that the hacker dumped comes from a remote Cellebrite server, extracted from UFED images. The information had been encrypted, but the hackers managed to break down the security layers. According to the ReadMe file that accompanies the data dump, the fully functioning Python script set to utilize the exploits, ripped and decrypted, is included in the package for which links had been shared over Pastebin.\n", "date": "February 4, 2017", "topics": ["Hacking News", "News"]}, {"title": "Metasploit Now Supports Hacking of Cars", "authur": "William Fieldhouse", "body": "Everyone who knows anything about hacking will know what Metasploit is, no need for a formal introduction. After a major update to the platform, functionality for hardware hacking and cars (amongst other hardware) has been introduced.Rapid7 transportation security research director Craig Smith says that Metasploit can be trained to work with almost any vehicle interface.Smith:\n“Metasploit condensed a slew of independent software exploits and tools into one framework and now we want to do the same for hardware. The Hardware Bridge API extends Metasploit’s capabilities into the physical world of hardware devices.“Much in the same way that the Metasploit framework helped unify tools and exploits for networks and software, the Hardware Bridge looks to do the same for all types of hardware.”Smith goes on to say that Metasploit will offer several interactive vehicle-related commands for cars that sport CAN buses.CAN stands for Controller Area Network and is a vehicle bus standard designed for enabling electronic control units and devices to communicate with one another in applications without a host computer.Some applications for CAN are:\n– Engine Management Electronic Control Unit\n– Transmission Electronic Control Unit\n– Anti-Lock Braking Electronic Control Unit\n– Traction Control Electronic Control Unit\n– Airbag Electronic Control Unit\n– Power Steering Electronic Control Unit\n– On-Board Diagnostic (OBD) Connector\n– Controller Area Network (CAN Bus)Metasploit will updated in due course to cover more hardware hacking including internet-of-things (IOT) devices, software defined radio, and even industrial control systems.", "date": "February 3, 2017", "topics": ["Hacking News", "News"]}, {"title": "Australian Nuclear Science and Technology Organization (ANSTO) breached by hackers", "authur": "William Fieldhouse", "body": "The Australian Nuclear Science and Technology Organization (ANSTO) was breached by hackers who stole scientists’ usernames and passwords.The Register reports that systems hosting the web portal was targeted, this is what is used by researchers from ANSTO and other third parties, the hackers managed to steal usernames, email addresses, and hashed passwords.An email that was sent to users of the Australian Synchrotron User Portal suggests the attack occured on January 27, but there is no further mention of how the hackers got in. Users are advised to change their passwords. It is not currently known which hashing algorithm was used to one-way encrypt the passwords, fingers crossed it’s not the depressingly popular MD5 algorithmIf the passwords were to be cracked, any who have reused the same password and email combination on other websites could lose control of those accounts too.It should be clarified that the database is isolated from the nuclear reactor that’s also on the campus where ANSTO is located.", "date": "February 3, 2017", "topics": ["Hacking News"]}, {"title": "Avast Releases Three New Decryption Tools to Fight Ransomware", "authur": "William Fieldhouse", "body": "Since there is a huge increase in the number of ransomware infections, the cyber security firm Avast released three decryption tools to help victims, and reaching a total of 14 such tools made available by them.“In last year, more than 200 new ransomware were discovered, it’s growth of in-the-wild samples is two-folded, but the good news is that hundreds of millions of AVG and Avast users are protected against this notorious threat,” says a blog post signed by Jakub Kroustek, the reverse engineer and malware analyst at the Avast.The newly released three new decryption tools address three different ransomware strains namely Jigsaw, HiddenTear and Philadelphia/Stampado. Some solutions for these strains are already available, those are from other security researchers. Avast, however, decided that it is better to have multiple options.That is because these three ransomware strains are very active and frequently encountered. Since the encryption keys used update quite often and so must the decryption tools. In the end, whether it is Avast’s tools or those made by any other security researchers that work against these ransomware, it’s all for the very same purpose.“Last but not least, we were able to significantly speed-up the decryption time, more precisely the password brute-force process, so e.g. some of the HiddenTear variants will be decrypted within minutes instead of days. The best results are achieved when decrypting files directly from the infected machine,” Kroustek writes.HiddenTear has been around for a while and the code is actually hosted on GitHub. Given the fact that it is so present, many hackers have gone and tweaked the code and starting using it. Encrypted files have a wide range of extensions: .34xxx, .locked,  .BUGSECCCC,.bloccato, .lock, .saeid, .unlockit, .Hollycrypt,.monstro, .lok, .razy, .mecpt, .암호화됨,  .flyper, .kratos, .8lock8, .fucked,.CAZZO, .krypted, .doomed. and more.After all these files are encrypted, a text file will appear on the victim’s desktop.", "date": "February 2, 2017", "topics": ["Cyber Attack", "Hacking News", "News"]}, {"title": "This Malware Steals login data, bitcoin from cryptocurrency wallets", "authur": "William Fieldhouse", "body": "An Internet security firm named Cyren found a new malware that can steal passwords and bitcoin from cryptocurrency wallets on computers. Cyren wrote on its blog that the malware is basically targeting the banking customers and this campaign is a quite huge one. The Singapore and US-based users are mainly the targets of this campaign.The malware is delivered in the form of a executable attachment file through emails related to the bank transfers. Usually, the recipient thinks that ha received a deposit and get deceived very easily. The attackers are using bots to generate the phoney emails which appear to be sent from a reliable banks like Emirates DBS and NDB. The file is usually in the PDF format with filename Swift_Copy.Pdf.exe.According to the Cyrene researchers, this malware, when executed deletes itself and then generates a file named Filename.vbs. This file is created in the startup folder of Windows OS. When victim restarts the PC or logs into computer again after signing out malware script runs and that file is located in this folder: AppData\\Local\\Temp\\subfolder.The malware is designed to investigate and identify the registry for sensitive information such as passwords and other data related to software installed on the PC. A majority of the focus is on FTP and web browsing software or software that contains credential data. The malware collects data from all the web browsers installed on the computer and looks for crucial information such as usernames/passwords, cookies, cache and history. It also locates email clients.This malware is a type of keylogger as it can record almost everything that is typed by the user or victim on the keyboard. In fact, the location of the mouse’s clicks is also logged by the malware. As of now, the cryptocurrencies targeted by the malware include the following: “Bitcoin, Litecoin, Namecoin, Anoncoin, Bytecoin, BBQcoin, Craftcoin, Digitalcoin, Devcoin, Feathercoin, Florincoin, Fastcoin, Freicoin, Infinitecoin, I0coin, Ixcoin, Junkcoin, Luckycoin, Litecoin, Mincoin, Megacoin, Primecoin, Phoenixcoin, Quarkcoin, Terracoin, Tagcoin, Worldcoin, Yacoin and Zetacoin.” ", "date": "February 2, 2017", "topics": ["Hacking News"]}, {"title": "What is DuckDuck Go, How Does it Work?", "authur": "William Fieldhouse", "body": "The main features of DuckDuckGo could be described as “a search engine that doesn’t track you”. It says it does not to use cookies to follow users actions and promises it doesn’t collect personal information of any kind. They even claim your IP address is hidden.Normally when clicking on a link from Google and Bing, even in incognito mode, the terms of the search are sent to the site you’re visiting within the HTTP referrer header. When you visit that site, the computer you’re using shares information, such as the IP address. This information can ultimately be used to identify you.The often uncomfortably personal contents of your searches won’t be shared with any third-party advertisers, insurance companies etc etc. So, if you just happen to search for, *cough* “male enlargement treatments” or maybe “how to get out of bad credit,” it can’t be traced back to you according to DuckDuckGo’s privacy policy.An additional method to help avoid search leakage is to use a proxy. DuckDuckGo has a Tor exit control, which essentially creates an end-to-end anonymous/encrypted search. Simply typing !proxy domain into DuckDuckGo will automatically route you through a proxy, be mindful though that proxies can be slow, especially the free ones, the DuckDuckGo proxies are funded through advertising.Will DuckDuckGo share my information with the authorities?. DuckDuckGo disclosed it doesn’t receive law enforcement requests because there is no data to request.Weinberg commented saying:“I think that law enforcement has essentially understood we don’t have anything to give them; they don’t really come knocking for things. Most of these laws are about turning over existing business records and we don’t have any records to turn over. There’s really nothing to take from us.”If you are one of those people who doesn’t want to be part of the surveillance culture that is so prevalent these days then “Duck it” instead of “Google it”.", "date": "February 2, 2017", "topics": ["Hacking News", "News"]}, {"title": "PayPal Users, Beware of This Phishing Campaign Trying to Steal Your Identity", "authur": "William Fieldhouse", "body": "If you are a PayPal user, you will obviously be very careful about the emails you receive about your balance and whatnot. This is because there are numerous phishing campaigns targeting PayPal users and here is another new one.The latest phishing campaign tricks the PayPal users by using fake pages that are really well done, these are hard to distinguish from the real ones. According to the ESET researchers, this latest attack uses very convincing bait and takes the user through fake web pages that look legitimate and tricks user into revealing his login credentials and other needed personal information.The emails user receives include logos, wording that looks just fine at the first glance. But when you have a closer look at the text, you can find grammar and syntax errors and this suggests that the author is not a native English speaker.These emails say you something like, PayPal needs help resolving an issue with the user account and there are some temporary limitations to your account until this problem is solved. This will urge the user to hurry up and fix the cause of the trouble. The email also includes a “log in” button at the bottom of the email. Once you click it, you are taken to the attacker’s web page.Sure, the page might look real, but the URL is anything but, indicating that it’s all a hoax. Once there you will have to enter your login credentials which will effectively go out to the scammers. You are then presented with data to back up the “limited account” lies presented in the email.The next page you’re taken to makes this scam even more dangerous because this is where they try to steal your identity. You have to provide phone number, your address, social security number, mother’s maiden name, date of birth and more.", "date": "February 2, 2017", "topics": ["Hacking News"]}, {"title": "Pentagon Servers are Flawed and Easy to Hack", "authur": "William Fieldhouse", "body": "The U.S. Department of Defense can be at a huge risk of being attacked by hackers very easily, a security researcher warns.According to the ZDNet, who cites the Dan Tentler, the founder of cybersecurity firm Phobos Group, there are several misconfigured servers run by Department of defence could allow attackers an easy access to the internal government systems. This includes eagerness of foreign actors to find a way to get into U.S. systems, especially since they can easily make it look as if the attacks are from within the United States.Dan said that he’s probably not the first to discover these flaws since they are particularly easy to discover. He added that they are probably already being exploited now.“There were hosts which were discovered having serious technical misconfiguration problems that can be easily abused by an attacker outside or inside of the country, they could implicate the US as culprits in hacking attacks if they desire so,” Tentler told ZDNet.They have informed the  Pentagon of the problem eight months ago, but still, no security fix has been deployed to correct those servers. This indicates cross negligence. This is mostly because the vulnerable servers were not part of the scope of the bug bounty program run by the Pentagon, which started about a year ago.The Pentagon has been running a bug bounty program in the past year, allowing white hats to find and report bugs and flaws in the system in exchange for money, something that tech companies have been doing for years. The extent of what they can test for flaws is limited, however, since only defense.gov and .mil are open to the program.", "date": "February 1, 2017", "topics": ["Hacking News"]}, {"title": "PlayStation and Xbox forum hack exposes personal details of over 2.5 million gamers", "authur": "William Fieldhouse", "body": "The forums that were exposed to the breach were the’XBOX360 ISO’ and ‘PSP ISO’ forums, these specific websites were designed to be a haven where gamers could obtain links to free downloads of games for Xbox and Playstation consoles. The forums were breached originally by hackers in 2015, the details of the which have only just been exposedAccording to security researcher Troy Hunt, who owns the website ‘Have I Been Pwned’says that the compromise included email addresses, account passwords and IP addresses of 2.5 million games.Robert Capps, VP of business development at NuData Security, commented on the article saying:“The recently disclosed data theft from the unofficial PlayStation and Xbox forums is yet another example of the need for consumers to be wary of who they provide their information to online.”“While this site is mostly used to distribute pirated copies of games, DVD’s and BluRays, consumers who use the forums need to make sure that they are vigilant. Keep alert to any phishing scams that may appear in email as a result of this hack, changing passwords on any site where the passwords or usernames used on these sites are used.”“This data is likely to be sold on the dark web and used for future cyber crime. It’s a good reminder to choose unique passwords on all sites that require registration.”Details of the hackers that were responsible for the breach have not yet been brought to light, but users of the forums are being advised to change their passwords.", "date": "February 1, 2017", "topics": ["Hacking News", "News"]}, {"title": "Fake WhatsApp, Netflix, Facebook Android Apps Contain SpyNote RAT", "authur": "William Fieldhouse", "body": "Due to its open source nature, hackers are recently targeting Android devices more as the source code is freely available for anyone who is interested in to have a look. Recently we can see a huge increase in the third party apps for the Android users but these do come with a price.Recently, IT Security researchers at the Zhavscaler have identified many fake apps that are uploaded by hackers and cyber criminals. These apps are infected with SpyNote RAT (Remote Access Trojan). The website HackRead has reported on SpyNote in August last year back when Palo Alto’s Unit 42 revealed that their Trojan allows the hackers to gain remote administrative control of those devices upon which the users have installed applications in the APK format, process of downloading apps in APK format on Android devices is also known as “sideloading” which is only possible if you allowed “Unknown Sources” in the security settings.“Netflix, Whatsapp, YouTube, Video Downloader, Google Update, Instagram, Hack Wifi, AirDroid, WifiHacker, Facebook, Photoshop, SkyTV, Hotstar, Trump Dash and PokemonGo.”Among all the above-mentioned apps, the Zscaler researchers have put their interest on fake Netflix app that is being infected with a new variant of the SpyNote RAT. According to the Shivang Desai of ZScaler, “The Android apps and iOS for Netflix are very popular, properly turning a mobile device into a television using which users can stream TV programs and movies anytime and anywhere. “But these apps, with their popularity and many millions of users, have captured attention of the bad actors, too, who are now exploiting the popularity of Netflix to spread their malware.”The new variant comes with capabilities to perform actions including viewing contacts, reading text messages, turning on the microphone of an infected device, recording screen, listening to conversations, send user files to a Command & Control (C&C) set up by cyber criminals and take screenshots.", "date": "January 31, 2017", "topics": ["Hacking News"]}, {"title": "Routers From Netgear Contain Bug that Allows Hackers to Gain Admin Credentials", "authur": "William Fieldhouse", "body": "Many owners of Netgear routers are at high risk of being getting hijacked by hackers as a serious security void hole was found by researchers.These are found by the security researcher Simon Kenin from the Trustwave and he shared the information with the folks at the Netgear. The company has managed to patch some bugs but still, it seems that some routers are still open to hackers.The security problem found here allows the attackers to access the router and collect the admin access passwords. Any remote hacker can use this vulnerability if remote administration is set to the Internet facing. Basically, this feature is turned off, but anyone with the physical access to a network that has a Netgear router can easily exploit it locally. A general example of this scenario is a café with public WiFi or some other place which offers a relatively similar feature.We know that most people choose to reuse their passwords. So, once an attacker gains the admin password, he can check all the devices that are connected in that network and try to access them with the same password(which might actually work considering how many network admins do not take security seriously).Kenin also pointed out that, by using the existing malware along with ever so popular Mirai botnet can change all the infected devices into bots. If that is not possible, he can change the DNS to further infect more machines on the network.The researcher came upon this flaw almost a year ago. He figured out that he could trigger an error message on his own router, and then the router could be tricked into revealing the numerical code that can be used with the password recovery tool to get the admin credentials.\n", "date": "January 31, 2017", "topics": ["Hacking News"]}, {"title": "Google Paid About $3 Million To WhiteHat Hackers as Bug Bounty", "authur": "William Fieldhouse", "body": " The bug bounty program of Google has awarded hackers with $3million throughout 2016. This indicates us how important such programs are for the safety of everyone. Using the knowledge of these bug bounty results, Google has successfully managed to escape from backdoors in their systems and get hacked. The hackers put their minds to test and get paid for sending the bugs to the home company.The company’s 2016 year in review reports puts the spotlight on bug bounty program, this insists that this is an important part of Google, especially since they are on a mission to keep their users safe. Over 350 researchers have contributed to this program in 2016, and they all come from all over the world, or, 59 countries to be more specificIn total, they are over 1,000 bugs found in the Google’s services and apps reported back to the Google. If you are wondering how profitable it can be for the hackers to spend their time looking for the bugs in Google, you should know the highest payout given for a single vulnerability report was $100,000. Yes, you read that one right. Given the fact that normal bugs are not rewarded which heftily, that particular vulnerability must be quite an important one.By comparison, in 2015, Google paid $2 million in the bug bounty program, so it’s a pretty large hike up last year’s $3 million. This is easily explained by the fact that Google increased the minimum payout last year, in some areas even by a 50%.Google isn’t the only company that’s been known to have bug bounty programs. In fact, most companies do and it’s clear that it can be quite lucrative even when working as a white hat hacker. Many private researchers make quite a bit of money just by looking for bugs, without taking into account the extra they make in their day jobs.\n", "date": "January 31, 2017", "topics": ["Hacking News", "News"]}, {"title": "Woman steals a man’s laptop look what happened next", "authur": "Harikrishna Mekala", "body": "Stu Gale, A Canadian of Cochrane, Alberta lost his laptop when he left it in his car.It was reported in CTV News Calgary saying that a truck has been stolen from the parking lot where Stu’s car is parked nearby but the Thief didn’t recognize that the laptop is installed with the Remote logging Software like Team Viewer or VNC.So, Stu was able to log into his laptop remotely only to find that the thief who stole his laptop is a woman,She was using her Facebook account when Gale logged into his laptop while she went away he snooped into her laptop and extracted information about her friends as well as making a call to one of her friends. CTV News Calgary quotes Gale:I went through and got her phone numbers, friends list and pictures, and while I was doing that, two [chat] conversations started. I called one of them and told her [that the person in possession of his computer] was on a stolen laptop and told her I’d give [that person] the opportunity to return it.But he didn’t stop there he texted all phone numbers found in her account, conveying that he planned to report the woman to the Police.He also left a note on her Facebook page more over he posted the information to a number of Facebook groups. Once the woman noticed, she deactivated her Facebook profile.She was however convicted without trial (So to speak), even though people may think that she stole the laptop because she was caught using it, there may have been other reasons for her being in possession of it.If somebody gets caught at the crime scene it doesn’t necessarily mean that they have actually committed the crime as there maybe a vast case  scenario, for example she may have bought the goods from a thief unwittingly or been gifted the laptop.Whilst we can’t blame Gale for his actions, there is also a law that states an individual can’t invade the privacy of an another individual.A computer Security expert Tom Keenan said,If you take somebody’s Facebook and you repost it, that’s a form of privacy invasion. You really do need to think about what you’re doing. Probably a better idea to take it to law enforcement.In this Scenario, Gale victimized the thief by invading the privacy of the Woman.Gale took the information and handed it over to the police, they stated that they are confident they will catch the thief.Take your time to comment on this article. ", "date": "January 31, 2017", "topics": ["Hacking News", "News", "SPY"]}]