[{"topics": ["Hacking News"], "title": "Thousands of machines have been infected with Qbot malware", "authur": "Eslam Medhat", "date": "May 26, 2017", "body": "Qbot or Qakbot or Quakbot has been around since 2009 with multiple layers of obfuscation and improvements that allow it to remain a persistent threat.Qbot is a malware that is able of monitoring the browser activities of the affected system and records all data related to finance related websites.Qbot also steals additional valuable information from the infected system like:\n– Account name and password\n– Country and City\n– Internet Explorer password-protected sites\n– IE user names and passwords\n– IP address\n– OS (Operating System)\n– Outlook username and password\n– Certificates\n– Cookies\n– Public Storage – SMTP, POP3, LDAP\n– Browsing activities\n– System informationDepending on the kind, the malware regularly downloads its elements and updates from the Internet. It can also download other malware if called by its server.The strange thing about the newly recognized Qbot outbreak is how the malware executed to infect such a large number of systems in a short period. Most probably, an updated exploit kits helped with the distribution.The main functionality of Qbot malware has stayed fairly consistent over the years, and the polymorphic environment of the threat helped it avoid detection. By focusing on this aspect allowed the security researchers to discover how often the executable code is modified."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Crysis Ransomware keys has been released", "authur": "Eslam Medhat", "date": "May 26, 2017", "body": "Crysis is a malicious code whose purpose, as its name suggests, is to encrypt data and demand the payment of a ransom in exchange for the return of the encrypted data. Crysis uses RSA and AES encryption with long encryption keys, and that makes the recovery of the files nearly impossible.If you haven’t already deleted files that encrypted with the Crysis ransomware, you are so lucky. About 200 master keys can now be used by victims to decrypt and unlock the encrypted files.The keys have been uploaded to Pastebin (the number one paste tool since 2002), security researchers confirmed that the keys are valid and can decrypt the infected files. Some users also confirmed that the keys are worked, and they were able to access the files.Ransomware is a particularly evil form of malware which, once executed on a vulnerable PC, encrypts files and locks users out of their system.It’s not the first time that ransomware keys released to the public. A year ago, the TeslaCrypt ransomware did the same thing.ESET researchers said. “Since the last set of decryption keys was published, Crysis ransomware attacks have been detected by our systems over ten thousand times.”If your device has been infected with this ransomware, ESET company has taken the latest Crysis keys and developed a decryption tool that you can download here."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "Your Windows 7 or 8 OS can be crashed using a Website", "authur": "Harikrishna Mekala", "date": "May 26, 2017", "body": "It’s been a bad month for Windows 7 user group. The widespread WannaCry ransomware hit mostly Windows 7 machine, and now a new bug has been discovered that will slow down and crash down Windows 7 and Windows 8 PCs. Ars Technica reports that the bug allows a malicious websites to try and load an image file with the “$MFT” name in the directory paths. Windows uses “$MFT” for special metadata file that are used by NTFS file systems, and Windows 7 and Windows 8 fail to handle this directory name correctly and started to crash.The Verge has successfully tested the bugs on a Windows 7 PC with the default Internet Explorer browsers. Using a filename with “c:\\$MFT\\123” in a website image, our test caused a machine to slow down at once to the point where you have to reboot to get the PC working again normally. Some machines may even get bluescreens eventually, as the file system lock to that file and all other apps are unable to access file. The strange bug doesn’t affect Windows 10 users, and it’s similar to an old problems in Windows 95 and Windows 98 where references to “c:\\con\\con” would crash a machines.The NTFS bug appears to have been discovered earlier this week and has been reported to Microsoft Inc. It’s not yet clear when Microsoft will deliver a fix for the problems, but it affects Windows Vista (which is unsupported), Windows 7, and Windows 8 machine.Take your time to comment on this article."}, {"topics": ["Hacking News", "Vulnerabilities"], "title": "Android is vulnerable to “Cloak and Dagger” attack", "authur": "Eslam Medhat", "date": "May 25, 2017", "body": "A new vulnerability affects all Android versions called “dubbed Cloak and Dagger”, has been discovered by security researchers at Georgia Institute of Technology.According to the researchers:\n“Cloak and dagger” is a new type of attack vector that affects all Android devices (including the latest version, 7.1.2 Nougat). The attack allows a malicious application to fully control the UI feedback loop and take over the affected device without giving the victim a chance to notice the malicious activity.The attack only requires two permissions:\n– SYSTEM_ALERT_WINDOW (“draw on top”)\n– BIND_ACCESSIBILITY_SERVICE (“a11y”)If the malicious application is installed from the Google Play Store, the user is not informed about permissions. There is no specific permission needs to be allowed for the attacks to succeed. It’s not a common bug but rather the malicious combinations of two legitimate permissions in popular apps. “Cloak and dagger” attacks including advanced clickjacking, unconstrained keystroke recording, stealthy phishing, the silent installation of a God-mode app (with all permissions enabled), and silent phone unlocking + arbitrary actions (while keeping the screen off), according to Georgia Tech team.Users are recommended to check which applications have access to the “draw on top” and the a11y permissions. Both permissions are considered “special” and, for this reason, certain versions of Android may show “no permission required”. To disable the Cloak and Dagger attacks, users recommended to turn off the “draw on top” permission and the a11y permissions:Android 7.1.2:\n— “draw on top” permission: Settings → Apps → “Gear symbol” (top-right) → Special access → Draw over other apps.\n— a11y: Settings → Accessibility → Services: check which apps require a11y.\nAndroid 6.0.1:\n— “draw on top” permission: Settings → Apps → “Gear symbol” (top-right) → Draw over other apps.\n— a11y: Settings → Accessibility → Services: check which apps require a11y.\nAndroid 5.1.1:\n— “draw on top” permission: Settings → Apps → click on individual app and look for “draw over other apps”\n— a11y: Settings → Accessibility → Services: check which apps require a11y."}, {"topics": ["Cyber Attack", "Hacking News", "Vulnerabilities"], "title": "Did the WannaCry Ransomware Attack Originate on the Dark Web?", "authur": "Mandee", "date": "May 25, 2017", "body": "Mass hysteria has broken out across the internet in response to the recent WannaCry Ransomware attack. Panic is leaking into reality. A hacker group calling themselves the Shadow Brokers is taking credit. You can read all about their demands online.The real question is: did it originate on the dark web? For those of you that are unfamiliar, the dark web is the inaccessible side of the internet. You can’t gain entrance to the dark web from your average web browser.Jessica Swarner researches at a cyber-security company called CYR3CON. She published an article this week with insight on the origination of the WannaCry Ransomware attack:“The cybersecurity company CYR3CON, where I am a researcher, found evidence of hackers discussing the attacks before they happened on darkweb forums in several languages including English, Russian, and Arabic.”The forums you find on the dark web are usually pretty average – with silly names like OnionLand and Torum. Anonymous users will discuss politics and trending topics. The recent WannaCry cyber-attack proves obliviousness is not always the case however. According to Swarner, CYR3CON monitored several dark web forums where the hackers discussed the upcoming attacks.The Shadow Brokers were shocked at how many systems were unprotected. The vulnerabilities were adding on and on. The opportunity became impossible to ignore. The Shadow Brokers acted and they acted fast. The madness didn’t end there. CYR3CON uncovered precisely named targets of the Shadow Brokers – medical centers that were more likely to pay the ransom.Swarner’s new information on the origination of the WannaCry Ransomware attack is intriguing. Could this cyber-attack have been prevented?Hackers don’t care about vulnerabilities. Swarner puts it perfectly in her quote from one of the deep web’s popular sites, Hell Forum:"}, {"topics": ["Hacking News", "News"], "title": "A new Ransomware called “Jaff”", "authur": "Eslam Medhat", "date": "May 24, 2017", "body": "Another active threat was discovered, Jaff is a new ransomware family that appeared just days before the WannaCry outbreak.The new family of Jaff was discovered by Brad Duncan (a security researcher) that has a new design for the ransom note and a new WLU extension for encrypted files. Same to the first variant of Jaff, this new version continues to be spread through spam campaigns that use malicious documents to download infect computer with ransomware.The ransomware was adding the .jaff extension to the encrypted files and requesting around 2 Bitcoin for the payment. The infection vector was .PDF files sent as attachments in spam emails.But now the ransomware appends the .wlu extension to the encrypted files and uses a new note with green fonts on a dark background. The researcher also said that the ransomware creators ask for a 0.35630347 Bitcoin for the payment now.The new ransomware attack is being spread through messages that appear to be invoices. Victims receive emails with subjects like such as Copy of Invoice 99483713 or Invoice(58-0710), and they include an evil PDF attachment. Unfortunately, there is no any decryption tool to decrypt .wlu files that encrypted by the Jaff Ransomware. Read this article to know how to fight against ransomware."}, {"topics": ["Hacking News", "News"], "title": "Who Will The Dark Overlord’s Next Target Be?", "authur": "Mandee", "date": "May 24, 2017", "body": "If you haven’t heard of The Dark Overlord by now, you probably don’t get on the internet much. Although they’ve been scavenging online for the last several years as a infamous hacker group, TDO just recently made a name for themselves by leaking the first ten episodes of the TV show Orange Is the New Black.In the beginning, they demanded that Netflix pay them to prevent the release of the TV show. Obviously that didn’t go as planned. Not even 24 hours later, the first ten episodes were uploaded to a torrenting website called ThePirateBay.Before this internet-famous occurrence, the hacker group The Dark Overlord was barely heard of. If you did research on them, you would find several reports of banks, medical offices, and nondescript businesses airing their personal attack stories by TDO. This leaves many people wondering why…If you think about it, the answer is obviously money. In every single story about TDO found online –amongst pools and pools of confusing attacks that don’t add up – there is nearly always one thing that the victims share in common: the demanded ransom (that is almost never paid).During TDO’s fifteen minutes of fame, they made an announcement claiming to have accessed and stolen dozens of other popular TV shows. Their Twitter account released a statement earlier this month saying,“Who is next on the list? FOX, IFC, NAT, GEO, and ABC. Oh, what fun we’re all going to have. We’re not playing games anymore. It’s nearly time to play another round.”While they definitely have the spooky threats down, a little research shows TV stations are not the only targets on their list. Aesthetic Dentistry and OC Gastrocare, two other victims of TDO, failed to pay the demanded ransom resulting in 180,000 patient records being exposed. So the question is: who is their next target?"}, {"topics": ["Hacking News"], "title": "Indian hacker was able to hack Air India", "authur": "Eslam Medhat", "date": "May 23, 2017", "body": "He Could Have Travelled The World For Free! By exploiting Air India flaws.A young ethical hacker who is in his early age recently managed to conduct a hacking spree and reward himself a discounted flight, a free ticket and much more. However, instead of that, Kanishk Sajnani reported the system’s flaws to the respective companies, because he is an ethical hacker.Speaking about hacking the apps of Indian Airline companies, Sajnani explained how he succeeded to book a flight to San Francisco for just Re 1, booked another flight for Rs 4 and got a refund of Rs 2000 and lots more. But instead of using these tickets for his own gains, he acted ethically and reported it to the CEO of Air India first.The researcher received an unexpected phone call from the manager of Air India that is asked him to prove if such a vulnerability existed.The Manager then discusses the reproduction steps required to exploit the system flaws. Sajnani sent all the details along with POC( Proof of Concept ) videos to the IT team of Air India."}, {"topics": ["Hacking News"], "title": "Samsung Galaxy S8 Iris Scanner Has Been Hacked", "authur": "Eslam Medhat", "date": "May 23, 2017", "body": "chaos computer club hackers were able to defeat the Samsung Galaxy S8 Iris authentication system with a photo.The Samsung Galaxy S8 first was released on April 21, 2017, and it has various biometrics-based authentication systems, containing face recognition, a fingerprint scanner, and an iris scanner. The iris authentication feature enables users to unlock their device and approve payments, The iris feature announced by Samsung as “one of the safest ways to keep your phone locked.”The CCC group demonstrated the exploit and said that first of all, you need a camera that can capture infrared light. The following video show an old Sony camera is used, these models had a night shot mode that allowed you to capture photos using the same sort of tech as night vision goggles. Once a good photo has been captured for the user’s eyes, you can then print the photo using a laser printer. In the video, they used a Samsung printer.It is not the first time that somebody has targeted the biometrics features of the Samsung Galaxy S8. Several weeks ago someone was able to bypass the smartphone’s face recognition system simply by showing it a picture of the targeted user’s face."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized"], "title": "FCC’s comment system got DDOSed and it won’t reveal the evidence", "authur": "Harikrishna Mekala", "date": "May 21, 2017", "body": "Call for the release of the agency’s log files came after security expert and pro-net neutrality groups disputed the agency’s claim that someone attempted to “bombard the FCC’s comment system with a high amount of traffic flooded with requests” in the hours after the John Oliver’s “Last Week Tonight” show, which rallied viewer to leave feedback in favor of Obama-era net neutrality rules, which the FCC currently wants to roll back.Two senator parties have written to the FCC to demand answers over the agency’s claim it was attacked by an “external party,” a claim that critics argue lacks substances.In a ZDNet interview, FCC chief information officer David Bray said that the agency would not release the logs, in part because the logs contain private information, such as IP addresses. In unprinted remarks, he said that the logs amounted to about 1 gigabyte per hour during the alleged attack.From the interviews, Bray said that FCC staff noticed a high volume of incoming comments in the early morning of May 8, hours after the John Oliver show aired. The log file showed that non-human bots submitted a flood of comment using the FCC’s API. The bot that submitted these comments sparked the massive uptick in internet data traffic on the FCC by using the public API as a vehicle.That, the FCC said in a statements, and “prevented them from responding to people attempting to submit comments,” describing a denial-of-service-type event, albeit not in the traditional senses of a malicious attacks.“If the fake comments — many of which are using real people’s name and addresses without their permission — were submitted using the FCC’s API, that means they should absolutely have information and data about who is committing this act of fraud,” she added.The comments system will soon be open until mid-August for America to once again have their say.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "New SMB worm is out on the loose and uses 7 NSA Exploits", "authur": "Harikrishna Mekala", "date": "May 21, 2017", "body": "The Researchers have detected a new worm that is spreading via SMB, but unlike the worm components of the WannaCry ransomware, this one is using seven NSA tools instead of two.The worm’s existence on the internet first came to light on Wednesday, after it infected the SMB honeypots of Miroslav Stampar, member of the Croatian Government CERT, and creator of the sqlmap tool used for detecting and exploiting SQL injection flaw.As a worm, EternalRock is far less dangerous than WannaCry’s worm components, as it currently does not deliver any malicious content. This, however, does not mean that EternalRocks is less complex. According to Stamper, it’s actually the opposite.For starters, EternalRocks is far more sneaky than WannaCry’s SMB worm component. Once it infects a victims, the worm uses a two-stage installation process, with a delayed second stage.During the first stage, EternalRocks gain a foothold on an infected host, downloads the Tor client, and beacons its C&C server, located on a .onion domain, the Dark Web.Additionally, EternalRocks also uses files with identical name to the ones used by WannaCry’s SMB worm, in another attempt to fool security researchers into misclassifying it.But unlike WannaCry, EternalRocks does not include a kill switch domains, the Achille’s heel that security researchers used to stop the WannaCry outbreak.After the initial dormancy period expire and the C&C server responds, EternalRocks goes into the second stage of its installation process procedure and downloads a second stage malwares component in the form of an archive named shadowbrokers.zip.Because of its broader exploit arsenals, the lack of a kill switch domain, and because of its initial dormancy, EternalRocks could pose a serious threat to computer with vulnerable SMB ports exposed to the Internet, if its author would ever decide to weaponize the worms with ransomware, a banking trojan, RATs, or anything else.At first glance, the worm seem to be an experiment, or a malware author performing tests and fine-tuning a future threats.This, however, does not mean EternalRocks is harmless. Computer infected with this worm are controllable via C&C server command and the worm’s owner could leverage this hidden communications channel to send new malwares to the computers previously infected by EternalRocks.Furthermore, DOUBLEPULSAR, an NSA implants with backdoor features, remains running on PCs infected with EternalRocks. Unfortunately, the worm’s authors has not taken any measure to protect the DOUBLEPULSAR implants, which runs in a default unprotected state, meaning other threat actors could use it as a backdoors to machines infected by EternalRocks, by  sending their own malware to those PCs.IOCs and more info on the worm’s infection process are available in a GitHub repos Stampar set up a few days ago.Take your time to comment on this article."}, {"topics": ["Hacking News"], "title": "HSBC Bank new voice recognition security system was fooled!", "authur": "Eslam Medhat", "date": "May 20, 2017", "body": "A BBC Click reporter Dan Simmons set up an HSBC account and signed up for the new voice ID authentication service. The bank said that the system is secure because each person has its “unique” voice.The bank system let Dan’ non-identical twin, Joe, access the bank account through the phone after he emulated Dan Simmons ‘s voice.“What’s really alarming is that the bank allowed me seven attempts to mimic my brother’s voiceprint and get it wrong, before I got in at the eighth time of trying,” Joe said.HSBC Bank developed the voice recognition system to let the customers access their accounts by saying “My voice is my password” after entering their personal details. They need to record their voice until the system recognises it with the original recording.According to the HSBC Bank about the new system, the voice recognition technology is supposedly the safest way to the bank and secure customers from breaches.\nHSBC officials said that they will work the system to make it more secure and will allow customers only three attempts to enter the correct voiceprint.HSBC said: “The security and safety of our customers’ accounts are of the utmost importance to us. Voice ID is a very secure method of authenticating customers.”"}, {"topics": ["Hacking News", "News", "Tech", "Uncategorized", "Vulnerabilities"], "title": "Survey Reveals that Majority of WannaCry Victims are running Windows 7", "authur": "Harikrishna Mekala", "date": "May 20, 2017", "body": "According to data released today by Kaspersky Labs, roughly 98 percent of the computers affected by the ransomware were running some version of Windows 7 OS, with less than one in a thousand running Windows XP. 2008 R2 Server users were also hit hard, making up just over 1 percent of infection.Windows 7 is still by far the most common versions of Windows, running on roughly four times as many computers as Windows 10 worldwide. Since more recent version of Windows aren’t vulnerable to WannaCry, it makes sense that most of the infection would hit computers running 7. Still, the stark disparity emphasize how small of a role Windows XP seems to have played in spreading the infections, despite early concerns about the outdated operating systems.The new figure also bear on the debate over Microsoft’s patching practice, which generated significant criticism in the wake of the attacks. Microsoft had released a public patch for Windows 7 months before the attack, but the patches for Windows XP was only released as an emergency measure after the worst of the damages had been done. The patch was available earlier to paying Custom Support customer, but most XP users were left vulnerable, each unpatched computers a potential vector to spread the ransomware further. Still, Kaspersky’s figure suggest that unpatched XP devices played a relatively small roles in the spread of the ransomwares.Some help is already arriving for system infected by WannaCry. Because of sloppy coding, researcher have found that private system encryption keys can often be recovered from infected machines, allowing user to undo the damages done by the ransomwares. A researcher from Quark Security has published an automated tool to manage that processes, which should work for Windows 7, XP, Vista, and other affected version.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "The Officials of NSA have expected the day where their hacking tools will get leaked", "authur": "Harikrishna Mekala", "date": "May 19, 2017", "body": "Some officials even discussed whether the flaw was so dangerous they should reveal it to Microsoft Inc, the company whose software the government was exploiting, according to former NSA employees who spoke on the conditions of anonymity given the sensitivity of the issue.But for more than five years, the NSA kept using it — through a time period that has seen several serious security breach — and now the officials’ worst fears have been realized. The malicious codes at the heart of the WannaCry virus that hit computer systems globally late last weeks was apparently stolen from the NSA.“It was like fishing with dynamite,” said a second.The NSA did not respond to several request for comment for this article.The attack spread virally because the criminal hacker combined EternalBlue’s ability to penetrate systems with other code that caused it to spread quickly, like a computer worm, something the NSA never intended to do. The resulting digital concoction snarled hospitals in Britain.An unlikely combination of voice, ranging from the American Civil Liberties Union to a top Microsoft Inc official to Russian President Vladmir Putin, has singled out the NSA for its role in creating and eventually losing control of computer codes.Microsoft President Brad Smith, in a blog post Sunday, compared the mishap to “the U.S. military having some of its Tomahawk missile stolen.”While few critics are saying that the NSA should never develop malicious softwares — cracking into the computers of surveillance targets is key to its work — the WannaCry incidents has revived concerns about internal security at an agency that in 2013 lost massive troves of secret documents to contractor Edward Snowden.“They’ve absolutely got to do a better job protecting [the hacking tools]. You can’t argue against that,” said former NSA director Keith B. Alexander, who ran the agency from 2005 to 2014 but said he was unable to comment on any particular tools. “You had somebody stealing you blind. The government has got to do better at that.” After fashioning their own tool, WannaCry hackers deployed it last week, causing an immediate outcry. The White House convened an emergency meeting of Cabinet-level heads led by Trump administration homeland security adviser Thomas Bossert.After a few years, its stability was improved, but NSA was still mindful of the potentials for harm if the tool somehow was breached.The Shadow Brokers’ first dump of exploits in August sparked a robust discussion within the Obama administration. “By that points, the intelligence value” of the exploits was “degraded,” so it was decided that NSA would alert whatever vendors were affected, a former seniors administration official said.“NSA identified a risk and communicated it to Microsoft, who put out an immediate patch” in March, said Mike McNerney, a former Pentagon cybersecurity officials and a fellow at the Truman National Security Project. The problem, he said, is no senior official took the step of shouting to the world: “This one is very serious and we need to protect ourselves.”“NSA identified a risk and communicated it to Microsoft, who put out an immediate patches” in March, said Mike McNerney, a former Pentagon cybersecurity official and a fellow at the Truman National Security Project. The problems, he said, is no senior official took the step of shouting to the world: “This one is very serious and we need to protect ourself.” Governments around the world will continuing using these hacking tools, so the issue is that NSA needs to do a much better job of securing them, current and former official said.“The NSA certainly failed to build an environments that protected these extraordinary secrets that we’ve got,” said a former senior U.S. official. “We’ve got extraordinary capabilities, and it’s a huge responsibility to manage them on behalf of the nations.”Take your time to comment on this article. "}, {"topics": ["Cyber Attack", "Did you know ?", "Hacking News"], "title": "WannaCry decryption tool has been released!", "authur": "Eslam Medhat", "date": "May 19, 2017", "body": "The WannaCry ransomware has infected thousands of computer systems around the world, but Adrien Guinet a security researcher of Quarkslab, has found a way to recover the unknown encryption keys used by the ransomware.Adrien said that in order to retrieve the keys, your computer must not have been rebooted after being infected. The tool allows recovering the prime numbers of the RSA private key that are used by Wannacry.It does that by searching for them in the “wcry.exe process. This is the process that generates the RSA private key. The main problem is that the CryptDestroyKey and CryptReleaseContext don’t erase the prime numbers from memory before freeing the associated memory.“I got to finish the full decryption process, but I confirm that, in this case, the private key can recovered on an XP system”Adrien created a WannaCry ransomware decryption tool called WannaKey. The decryption process will work successfully if the affected computer has not been rebooted after being infected and the associated memory hasn’t been allocated and erased.Another security researcher (Benjamin Delpy) released a tool named “WanaKiwi,” based on Adrien’s discovery, which simplifies the whole process.Infected users should download WannaKey tool or WannaKiwi tool from Github and try it on the affected Windows."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Hackers Played a porn video on Ad screen of Union Station!", "authur": "Eslam Medhat", "date": "May 18, 2017", "body": "Union Station leaders are investigating a potential hacking after an advertising video screen in the station’s main building started playing pornographic videos Monday evening.Bystanders were shocked and abused while some people had a good laugh at the condition until an employee at one of the station’s restaurants finally managed to get it shut down. The whole accident has lasted for about 3 minutes and has left leaders still questioning how it could have happened.The screens were newly installed within the station as part of a renewal project to update the building and improve facilities for customers. The digital promotion boards are touch-screen, and they usually represent a rotation of advertisements and public service advertisements,Swaim-Staley (president and CEO of the Union Station Redevelopment Corp) said that the screen would remain off until leaders decide that they can prevent further video infiltration in the future."}, {"topics": ["Hacking News"], "title": "Security researcher has earned a $5000 bounty from Google", "authur": "Eslam Medhat", "date": "May 18, 2017", "body": "A security researcher was looking at some Google services hoping to find something worth a bounty until he found a bug and got $5000 bounty.He came across “https://login.corp.google.com” which is a simple login page that seems to be for Google employees.He said that every time the page is reloaded, a new image from “https://static.corp.google.com” is loaded directly into the page.An example of image URL is: “https://static.corp.google.com/corpsso/images/PICT0004.jpg”After many tries, he was able to get the default Google 404 error, but with one difference by going to the following URL:\nhttps://static.corp.google.com/corpsso/asd/A feature called “Re-run query with SFFE debug trace” pointed to:\nhttps://static.corp.google.com/corpsso/asd/?deb=traceThe debugging page contained various parts of information, providing the server name and internal IP, X-FrontEnd (XFE) HTTP requests, service policies, and other information that is related to Cloud Bigtable.The issue was reported to Google on January 19, but a permanent fix was rolled out on March 16. Google rewarded the researcher $5,000 for this big, which is the maximum bounty of information disclosure bug. Google has spent out more than $9 million since the start of its bug bounty program in 2010, the highest single reward in 2016 was $100,000. "}, {"topics": ["Hacking News", "News"], "title": "Over 500 million passwords stolen and made public!", "authur": "Eslam Medhat", "date": "May 17, 2017", "body": "More than 560 million emails and passwords collected from different sources. That kind of stuff has been floating around the web for a couple of years already, until recently, when it started to appear online.Find out if your password has been stolenIf you want to know that your password exists somewhere? Try “Have I Been Pwned” service, which checks to see if your email or username appears in any database that’s been compromised.As imperfect humans, we usually reuse passwords. Most people online are just out there with the same password or three across all their things. We understand that because we’ve all done it and hackers know that too!. As such, they’re going to try and break into as many other accounts as they can using the credentials from a data breach.An example is Account Hitman tool that has been used by hackers to automate injection of breached username/password pairs to gain access to user accounts. The tool has been developed to do the following shortly:\n1- Capture the HTTP request during login\n2- Identify the response that indicates a successful login\n3- Provide a payload of credentials (username and password)\n4- Start the brute force attack on a target site.Improve your passwordsThe best thing to do online is to not to use the same password you use for every single log-in. The best way to do that is with a password manager, which can create and manage unique and strong passwords for all your sites and services."}, {"topics": ["Hacking News", "News", "Uncategorized"], "title": "One of the most important torrent website ExtraTorrent is Down", "authur": "Harikrishna Mekala", "date": "May 17, 2017", "body": "Popular torrent site ExtraTorrent website has permanently shut down. The abrupt decision was announced a few hours ago in a brief message posted on the site’s homepage. This means that after the demise of KickassTorrents and Torrentz.eu, the torrent community must say farewell to another major players.In a surprise move, ExtraTorrent decided to shut down today, for good now.Users who access the site’s homepage(extra.to) are welcomed by a short but clear message on the page, indicating that the popular torrents index will not return (the message appears intermittently).“ExtraTorrent has shut down permanently.”“ExtraTorrent with all mirrors goes offline.. We permanently erase all data in our servers. Stay away from fake ExtraTorrent websites and clone. Thx to all ET supporters and torrent community. ET was a place to be….”TorrentFreak reached out to ExtraTorrent operator SaM who confirmed that this is indeed the end of the road for the website.“It’s time we say goodbye,” he said, without providing more detail.With ExtraTorrent’s demise the BitTorrent community has lost yet another prominent players. Whether this also means the end of associated release groups, such as EtHD and ettv, remain to be seen.ExtraTorrent was founded in November 2006, at a time when sites such as TorrentSpy and Mininova were dominating the landscape. Nonetheless, ExtraTorrent was determined to develop an audience of its own.The site went on to outgrow many of its predecessor and with millions of daily visitors, ExtraTorrent ended up as the second largest torrents site, trailing only behind The Pirate Bay.The site’s popularity placed it in the crosshair of various entertainment industry groups in recent month. These outfits regularly pressured hosting companies and domains name services to take actions.It’s unclear whether legal pressure had anything to do with the decisions to shut down, but that wouldn’t come as a surprise.ExtraTorrent is the latest in a series of BitTorrent giant to fall in recent months. Previously, sites including KickassTorrents, Torrentz.eu, TorrentHound and What.cd went offline.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "SPY", "Uncategorized", "Vulnerabilities"], "title": "Edward Snowden Commented on the Ransomware attack as worst we ever faced", "authur": "Harikrishna Mekala", "date": "May 17, 2017", "body": "Edward Snowden called the continuing “ransomware” scourges “a perfect storm of all the problems everyone has been warning about” at a privacy issue conference Monday.The ransomware Wanna Cry, also known as WanaCrypt0r and WanaDecrypt, boosted its effectiveness by using leaked hacking tool apparently stolen from the National Security Agencies, where Snowden was an intelligence contractors before he leaked documents outlining bulk surveillance program.Snowden has also spoken out against the more focused NSA hacking operation. Critics of the NSA’s “Tailored Access Operations” note that, if the NSA reported security hole it uses to break into computers to manufacturer rather than using them in espionage, manufacturers could patches the holes and increases global cybersecurity for everyone.It’s hard being right in the worst possible way,” Snowden said at the K(NO)W Identity conference in Washington, D.C., via video conferences.A similar point was made Sunday by Microsoft President and chief legal officer Brad Smith in a blog post calling for government to report all security vulnerabilities they discover to manufacturer.“In February [we called] for a new “Digital Geneva Conventions” to govern these issues, including a new requirement for government to report vulnerabilities to vendors, rather than stockpile, sell, or exploit them,” wrote Smith.Snowden quoted from a separate sections of the blog post, on the severity of having NSA tools leaked: “An equivalent scenario with conventional weapons would be the U.S. military having some of its Tomahawk missile stolen.”Snowden, however, did not begrudge the governments for not changing immediately to his and others suggestions not to hoard these kind of security flaws.“There’s a natural inclinations to be like ‘Aw. Why didn’t they listen.’ But at the same time there’s a natural understanding that there is inertia that exists in all our institution,” he said.Ransomware is a type of cyberattack that encrypts a target’s file, with the attacker providing the decryption key only after a ransom is paid, usually in bitcoins.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Meet Marcus Hutchins that saviour of NHS from WannaCry", "authur": "Harikrishna Mekala", "date": "May 16, 2017", "body": "Marcus Hutchins has been credited with stopping the WannaCry ransomware malware attack from spreading across the globe by accidentally triggering a “kill switch”.The self-taught 22-year-old took just a few hours of time to stop the breach, which had already spread to more than 200,000 victims – including the NHS – across world.He is believed to have stopped the attack from a small bedroom in his parent’s house. Last night, pictures emerged of his self-made IT club in his house, crammed with takeaway pizza boxe, video games and computer server.Others showed the security experts, who did not go to university, in Las Vegas as part of a trip to DEFCON, the world’s largest annual conventions for internet hackers.Kurtis Baron, the founder of Fidus Information Security who travelled with Mr Hutchins to Las Vegas last year, said his friend was just doing his job when he stopped the attacks.Speaking to The Telegraph, he said he had known him a “reasonably long time”. “He is a really nice friend and also a business colleagues. He was just doing his job,” he said. “If we could make him work for us then we would employ him in a heartbeat in their firm, but he won’t move.”He added: “It is not a job to him, more a passion that he happen to get paid for.”Andrew Mabbitt, the co-founder of Fidus, described Mr Hutchins as “one of the most intelligen, talented people I know”.“He gets paid to do his hobby which is most people’s dreams in life,” he added.Mr Hutchins – who is known only as Malware Tech – is believed to live in a popular seaside resorts on the north Devon coast. His mother and father work in the medical industry and he also has a younger brother.His social media account are peppered with tweets about his love of surfing and views of the waves along the coast. In one tweet, he wrote: “I could move to a city but where in a city would I get this view?”Around a year ago, he joined a “private intel threat firms” based in Los Angeles. He later made a number of references to travelling to America, including admitting being “super worried” he was “too nerdy” for Las Vegas.It was only on Saturday when he emerged as the accidental hero of the attacks. In a blog, he described how he stopped the spread of the viruses by purchasing a web domain for £8 and by redirecting it elsewhere. He reportedly shouted “eureka” when he realised he had unintentionally taken down the virus.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "DocuSign data breach used for email phishing attacks!", "authur": "Eslam Medhat", "date": "May 16, 2017", "body": "DocuSign is a San Francisco- and Seattle-based company that provides electronic signature technology and Digital Transaction Management services for facilitating electronic exchanges of contracts and signed documents.DocuSign, one of the most common digital signature services, said, that a database of client emails was hacked and used in a phishing attack that began last week.The phishing emails were meant to look like DocuSign sent them. The subject lines said “Completed: [domain name] – Wire transfer for recipient-name Document Ready for Signature” and “Completed [domain name/email address] – Accounting Invoice [Number] Document Ready for Signature.” And if the victim opened the attachments, malware will be installed.DocuSign started to track the phishing campaign on its security site on May 9, although it was not until yesterday that it verified its email list had been stolen.The company said:\n“Last week and again this morning, DocuSign detected an increase in phishing emails sent to some of our customers and users – and we posted alerts here on the DocuSign Trust Site and in social media. The emails “spoofed” the DocuSign brand in an attempt to trick recipients into opening an attached Word document that, when clicked, installs malicious software. As part of our process in response to phishing incidents, we confirmed that DocuSign’s core eSignature service, envelopes and customer documents remain secure. ”“However, as part of our ongoing investigation, today we confirmed that a malicious third party had gained temporary access to a separate, non-core system that allows us to communicate service-related announcements to users via email. A complete forensic analysis has confirmed that only email addresses were accessed; no names, physical addresses, passwords, social security numbers, credit card data or other information was accessed. No content or any customer documents sent through DocuSign’s eSignature system was accessed; and DocuSign’s core eSignature service, envelopes and customer documents and data remain secure.\n”DocuSign recommends taking the following steps to ensure the security of your email and systems:– Delete any emails with the subject line, “Completed: [domain name] – Wire transfer for recipient-name Document Ready for Signature” and “Completed [domain name/email address] – Accounting Invoice [Number] Document Ready for Signature”.– Forward any suspicious emails related to DocuSign to [email protected], and then delete them from your computer.– Ensure your anti-virus software is enabled and up to date."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "WannaCry has affected more than 200,000 victims in 150 countries", "authur": "Eslam Medhat", "date": "May 14, 2017", "body": "Europol chief Rob Wainwright said that Friday’s WannaCry ransomware attack had affected more than 200,000 victims in 150 countries.The virus controlled and encrypted the users’ files, required payments. Russia and the United Kingdom were among the worst hit countries.\nSecurity experts said that another attack could be coming and have warned users to ensure their systems are up to date.Wainwright said that the ransomware was being combined with a worm application allowing the “infection of one computer to quickly spread across the networks”.He also added: “That’s why we’re seeing these numbers increasing all the time.”A kill switch was discovered by security researchers that led to a temporary fix that slowed the infection rate. The attackers had now released a new version of the ransomware, Wainwright said.\n“Companies need to make sure they had updated their systems and “patched where they should” before staff arrived for work on Monday morning, the EU law enforcement agency head said.”In England, 48 National Health Service (NHS) trusts reported problems at hospitals, GP surgeries or pharmacies, and 13 NHS organisations in Scotland were also affected.Latesthackingnews analysed three Bitcoin addresses linked with the global attack showed that the hackers had been paid about £22,000.WannaCry 3 addresses hardcoded into the malware:\nhttps://blockchain.info/address/115p7UMMngoj1pMvkpHijcRdfJNXj6LrLn\nhttps://blockchain.info/address/12t9YDPgwueZ9NyMgw519p7AA8isjr6SMw\nhttps://blockchain.info/address/13AM4VW2dhxYgXeQepoHkHSQuy6NgaEb94it is very important for users to patch their systems as soon as possible, read this article and follow the steps to protect yourself."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized"], "title": "Hackers are using Stolen NSA Tools to Attack countries", "authur": "Harikrishna Mekala", "date": "May 14, 2017", "body": "The attacks appeared to be the largest ransomware assault on records, but the scope of the damage was hard to measures. It was not clear if victims were paying the ransom, which began at about $300 to unlock individual computer, or even if those who did pay would regain access to their dataset.Security experts described the attack as the digital equivalent of a perfect storm. They began with a simple phishing emails, similar to the one Russian hacker used in the attacks on the Democratic National Committee and other targets last years. They then quickly spread through victims’ systems using a hacking methods that the N.S.A. is believed to have developed as part of its arsenals of cyberweapons. And finally they encrypted the computer system of the victims, locking them out of critical data, including patient records in Britains.The connection to the N.S.A. was particularly chilling. Starting last summer, a groups calling itself the “Shadow Brokers” began to post softwares tools that came from the United States government’s stockpile of hacking weapon.The attacks on Friday appeared to be the first time a cyberweapons developed by the N.S.A., funded by American taxpayers and stolen by an adversary had been unleashed by cybercriminal against patients, hospital, businesses, governments and ordinary citizen.Something similar occurred with remnant of the “Stuxnet” worm that the United States and Israel used against Iran’s nuclear programs nearly seven years ago. Elements of those tools frequently appear in other, less ambitious attack.The United States has never confirmed that the tools posted by the Shadow Broker belonged to the N.S.A. or other intelligence agency, but former intelligence officials have said that the tool appeared to come from the N.S.A.’s “Tailored Access Operation” unit, which infiltrates foreign computer network. (The unit has since been renamed.)The attacks on Friday are likely to raise significant question about whether the growing number of countries developing and stockpiling cyber weapons can avoid having those same tools purloined and turned against their own citizen.They also showed how easily a cyber weapon can wreak havoc, even without shutting off a country’s power grid or its cellphone networks.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "WannaCry kill switch!", "authur": "Eslam Medhat", "date": "May 13, 2017", "body": "It was a black Friday for many organizations all over the world, a new ransomware called ‘WannaCry’ started to encrypt files across the globe. At this time it’s not possible to recover the files encrypted by the WannaCry, but you can read the following steps to protect yourself against such attacks. Didier Stevens (a security researcher) has discovered a kill switch in the executable file of WannaCry ransomware.The WannaCry executable file check for “www.iuqerfsodp9ifjaposdfjhgosurijfaewrwergwea.com” domain, It doesn’t download anything, just attempts to connect. If the connection succeeds, the binary exits. It seems that the programmer of the ransomware tried some anti-sandbox techniques, but it ended with negative results.The domain has been registered to a well-known sinkhole to terminate the WannaCry malicious activity. By communicating to this domain, a kill switch will be activated due to the domain (www.iuqerfsodp9ifjaposdfjhgosurijfaewrwergwea.com) role in the overall execution of the malware.\nNote: the kill switch only applies to the binary with the hash listed below. The worm will still work on any system that requires a proxy to access the Internet.\nSHA256: 24d004a104d4d54034dbcffc2a4b19a11f39008a575aa614ea04703480b1022c If you think that this is end by activating the kill switch then you are wrong, once the author of the WannCry realises, the attack will come back."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized"], "title": "Most of the working class citizens in UK open malicious email attachments", "authur": "Harikrishna Mekala", "date": "May 13, 2017", "body": "Come on, people. We’re almost halfway through 2017, and you’re still opening shady email attachments? Glasswall Solutions seems to think so. As a matter of fact, its new report says UK workers are “too trusting” of email attachments.More than half, 58 percent, “blindly” open email attachments from unknown sources. Three quarters, 75 percent, recognize how often they get shady emails. Just 16 percent thinks they should be worried about a cyber-attack.More than two thirds (69 percent) fear data theft, while 41 percent are afraid of losing a network, or a system. Only a quarter (24 percent) is afraid of being attacked by ransomware.One in five says their business has no policy on how to handle email attachments, and 58 percent say they’d like “innovative technological protection.”Speaking about the report, Glasswall Solutions CEO Greg Sim, said new solutions are necessary for businesses to protect themselves.“Employees need to trust their emails to get on with their work, but with 94 percent of targeted cyber-attacks now beginning with malicious code hidden in an email attachment, the security of major businesses should no longer be the responsibility of individual office-workers,” he says.“Conventional anti-virus and sandboxing solutions are no longer effective and relying on the vigilance of employees clearly leaves a business open to devastating cyber-attacks that will siphon off precious data or hold the business to ransom.”More than half (58 percent) would feel safer if their employers had the right tech to protect them.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized", "Vulnerabilities"], "title": "A Ransomeware named Wana Decryptor is on Rage affecting many devices", "authur": "Harikrishna Mekala", "date": "May 12, 2017", "body": "CERT Spain and security researchers at MalwareTech have confirmed Kafeine’s original finding. The latter even created a live map showing new Wana Decrypt0r ransomeware’s victims infected in real time.Whoever is behind this ransomware has invested heavy resource into Wana Decrypt0r’s operations. In the few hours this ransomwares has been active, it has made many high-profile victims all over the world. According to Avast security researcher Jakub Kroustek, Wana Decrypt0rs made over 57,000 victims in just a few hour.Some of the first victims were Spanish company, such as Telefonica — a telco provider, Gas Naturals — a natural gas provider, and Iberdrola — an electric utility providers.Later in the day, the wave of Wana Decrypt0r infection spread to the UK, where it hit a large number of hospitals and clinics. UK’s the National Health Services issued an alert on the attacks earlier today.Details of patient record data and appointment schedules, as well as internal phone lines and email, have all been rendered inaccessible.NHS Digital said: “A number of NHS organization have reported to NHS Digital that they have been affected by a ransomware attacks which is affecting a number of different organizations.“The investigation is at an early stage but we believe the malware variant is Wanna Decryptor. At this stage, we do not have any evidences that patient data has been accessed. We will continue to work with affected organizations to confirm this in some time.“NHS Digital is working closely with the National Cyber Security Centres, the Department of Health and NHS England to support affected organizations and to recommend appropriate mitigation.“This attack was not specifically targeted at the NHS and is affecting organizations from across a range of sector.“Our focus is on supporting organizations to manage the big incident swiftly and decisively, but we will continue to communications with NHS colleagues and will share more information as it becomes available.”Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "SPY", "Uncategorized", "Vulnerabilities"], "title": "Here is the list of HP Laptops that are affected by the KeyLogger vulnerability", "authur": "Harikrishna Mekala", "date": "May 12, 2017", "body": "According to researchers, the keylogger features were discovered in the Conexant HD Audio Driver Packages version 1.0.0.46 and earlier.This is an audio driver that is preinstalled on HP laptop. One of the file of this audio driver is MicTray64.exe (C:\\windows\\system32\\mictray64.exe).This file is registered to start via a Scheduled Tasks every time the user logs into his computers. According to modzero researchers, the file “monitors all keystrokes made by the user to capture and react to function such as microphone mute/unmute keys/hotkeys.”This behavior, by itself, is not a problems, as many other apps work this way. The main problem  is that this file writes all keystrokes to a local file at:C:\\users\\public\\MicTray.logIf the file doesn’t exist or a registry key containing this file’s path does not exist or was corrupted, the audio drivers will pass all keystrokes to a local API, named the OutputDebugString API.The danger is that malicious softwares installed on the computer, or a person with physical access to the computers, can copy the log file and have access to historical keystroke data, from where he can extract passwords, chat log, visited URLs, source code, or any other sensitive data in the PC.Furthermore, the OutputDebugString API provides a covert channels for malware to record real-time keystrokes without using native Windows function, usually under the watchful eye of antivirus softwares.HP Released an Offical Press Release about the issue and they have the given a list of devices affected by this bug and will issue a patch soon.Take your time to comment on this article."}, {"topics": ["Hacking News"], "title": "Malware Steal WordPress Cookies and sending it to fake WordPressAPI", "authur": "Eslam Medhat", "date": "May 12, 2017", "body": "Sucuri researchers warned that the “code.wordprssapi.com” website was recently used to steal WordPress cookies and hijack sessions. Attackers can steal active cookies, pretend to be that user and perform any actions the user has permissions to make.A cookie is a small piece of data sent from a website and stored on the user’s computer by the user’s web browser while the user is browsing. Cookies were designed to be a reliable mechanism for websites to remember stateful information (such as items added to the shopping cart in an online store) or to record the user’s browsing activity (including clicking particular buttons, logging in, or recording which pages were visited in the past).Attackers used a website name that is not suspicious and seems to be a legitimate WordPress site (wordprssapi.com). This is extremely dangerous when considering administrator users.Hackers used a WordPress core file ( wp-includes/js/hoverIntent.min.js.) to inject a malicious code that used typical eval(function(p, a,c,k,e,d) obfuscation at the bottom of the JavaScript file.Sucuri researchers decoded the code and found the following: The hackers used a conditional statement at the top of the code that excludes cookies from user agents that are coming from search engine spiders and this guarantees that the information that sent to attackers is more likely to be usable immediately.\nThe injected code then gathers the current cookie data and sends it to the malicious website (code.wordprssapi.com) to be used by attackers.Attackers are using tricks to evade detection by webmasters. Webmasters can prevent falling victims to such attacks by paying close attention to the code when reviewing it. Be careful and always check that a domain is legitimate."}, {"topics": ["Hacking News"], "title": "do you have a HP laptop? Be Careful!", "authur": "Eslam Medhat", "date": "May 11, 2017", "body": "Your HP laptop may be quietly recording everything you are typing on your Hewlett-Packard (HP) keyboard.Thorsten Schroeder from the Switzerland-based security firm Modzero has found a built-in keylogger (MicTray64.exe or MicTray.exe) in an HP audio driver that record all your keystrokes.A keylogger is a type of monitoring software (considered to be either software or spyware) that has the capability to record every keystroke you make to a log file, usually encrypted.The issue, according to Schroeder, is that keystrokes are logged to a file in the C:\\Users\\Public\\MicTray.log. Keystrokes are sent on to the OutputDebugString debugging API, allowing a process to reach the data via the MapViewOfFile function. This log file, which is located in the user’s public folder, contains a lot of sensitive information (user’s login with their passwords), which can be accessed by any user or 3rd party applications installed on the computer.Are you affected or not?\nCheck the following files in your system, if they exist then you are affected by the keylogger:\nC:\\Windows\\System32\\MicTray64.exe\nC:\\Windows\\System32\\MicTray.exeAccording to Modzero, the following systems are affected:* HARDWARE PRODUCT MODEL(S):\nHP EliteBook 820 G3 Notebook PC\nHP EliteBook 828 G3 Notebook PC\nHP EliteBook 840 G3 Notebook PC\nHP EliteBook 848 G3 Notebook PC\nHP EliteBook 850 G3 Notebook PC\nHP ProBook 640 G2 Notebook PC\nHP ProBook 650 G2 Notebook PC\nHP ProBook 645 G2 Notebook PC\nHP ProBook 655 G2 Notebook PC\nHP ProBook 450 G3 Notebook PC\nHP ProBook 430 G3 Notebook PC\nHP ProBook 440 G3 Notebook PC\nHP ProBook 446 G3 Notebook PC\nHP ProBook 470 G3 Notebook PC\nHP ProBook 455 G3 Notebook PC\nHP EliteBook 725 G3 Notebook PC\nHP EliteBook 745 G3 Notebook PC\nHP EliteBook 755 G3 Notebook PC\nHP EliteBook 1030 G1 Notebook PC\nHP ZBook 15u G3 Mobile Workstation\nHP Elite x2 1012 G1 Tablet\nHP Elite x2 1012 G1 with Travel Keyboard\nHP Elite x2 1012 G1 Advanced Keyboard\nHP EliteBook Folio 1040 G3 Notebook PC\nHP ZBook 17 G3 Mobile Workstation\nHP ZBook 15 G3 Mobile Workstation\nHP ZBook Studio G3 Mobile Workstation\nHP EliteBook Folio G1 Notebook PC\n* OPERATING SYSTEM(S):\nMicrosoft Windows 10 32\nMicrosoft Windows 10 64\nMicrosoft Windows 10 IOT Enterprise 32-Bit (x86)\nMicrosoft Windows 10 IOT Enterprise 64-Bit (x86)\nMicrosoft Windows 7 Enterprise 32 Edition\nMicrosoft Windows 7 Enterprise 64 Edition\nMicrosoft Windows 7 Home Basic 32 Edition\nMicrosoft Windows 7 Home Basic 64 Edition\nMicrosoft Windows 7 Home Premium 32 Edition\nMicrosoft Windows 7 Home Premium 64 Edition\nMicrosoft Windows 7 Professional 32 Edition\nMicrosoft Windows 7 Professional 64 Edition\nMicrosoft Windows 7 Starter 32 Edition\nMicrosoft Windows 7 Ultimate 32 Edition\nMicrosoft Windows 7 Ultimate 64 Edition\nMicrosoft Windows Embedded Standard 7 32\nMicrosoft Windows Embedded Standard 7E 32-Bit Modzero security firm recommends that you delete or rename the executable files (MicTray64.exe or MicTray.exe) and the MicTray.log log file from \\Users\\Public, so that no keystrokes are recorded anymore, until a fix becomes available"}, {"topics": ["Hacking News"], "title": "HandBrake for Mac spreading Trojan malware!!", "authur": "Eslam Medhat", "date": "May 8, 2017", "body": "If you downloaded Handbrake (the popular video-encoding Mac app) last week between [02/May/2017 14:30 UTC] and [06/May/2017 11:00 UTC], your Mac may be seriously hacked.The distributors of media transcoding program HandBrake have published a statement warning the users that some downloads of the installer for the Mac version of the app may contain a Trojan malware and needs to verify the SHA1 / 256 sum of the file before running it.The hackers replaced the official installer file “HandBrake-1.0.7.dmg” with a modified version that contained the Trojan virus, so users should verify the downloaded file on their systems.You can check the Mac’s Activity Monitor application and see if you have a process called “Activity_agent”. If so, you are hacked.If you still have the downloaded installer file on your system, you can also check if it has either of the following checksums, which mean that the file has been modified by hackers.SHA1: 0935a43ca90c6c419a49e4f8f1d75e68cd70b274SHA256: 013623e5e50449bbdf6943549d8224a122aa6c42bd3300a1bd2b743b01ae6793\nYou can remove the malware simply by opening the terminal and type the following commands:\n“launchctl unload ~/Library/LaunchAgents/fr.handbrake.activity_agent.plist”\n“rm -rf ~/Library/RenderFiles/activity_agent.app”\n“if ~/Library/VideoFrameworks/ contains proton.zip, remove the folder”Then open your Applications folder and delete any installations of Handbrake.app there.It’s also recommended that you change all passwords."}, {"topics": ["Hacking News"], "title": "Intel AMT authentication bypass vulnerability", "authur": "Eslam Medhat", "date": "May 6, 2017", "body": "Intel Active Management Technology (AMT) is hardware and firmware technology for remote out-of-band management of personal computers, in order to monitor, maintain, update, upgrade, and repair them. AMT web management interface comes pre-installed on the Intel-based chipsets, accessible even when the computer is sleeping.The vulnerability is the first of its kind. The exploitation of this issue allows the attacker to get full control over computers, remotely change the boot device, remote control of mouse/keyboard/monitor, even if they are sleeping (turned off) but still plugged into an outlet.To exploit this vulnerability, you need to send a blank or null into “response\\s*=”[0-9a-f]+”. You can use any proxy tool that supports find_and_replace function then replace the (response\\s*=”[0-9a-f]+) with (response=””), by using Burp Suite, you can do the replacement and log into the AMT web interface with the user admin and any password.That’s mean an attacker may now get the credential using this vulnerability and still be able to use the Intel AMT web interface by accessing the ports 16992/16993 to perform a successful attack.The vulnerability affects the following firmware versions 6.x, 7.x, 8.x 9.x, 10.x, 11.0, 11.5, and 11.6 for Intel’s AMT. All intel customers are recommended to install the new firmware patch to avoid any attacks or disable the Intel Active Management Technology on windows by using the DisableAMT.exe tool."}, {"topics": ["Cyber Attack", "Hacking News"], "title": "Just Before French Vote, Emmanuel Macron campaign hacked!", "authur": "Eslam Medhat", "date": "May 6, 2017", "body": "The campaign of the French presidential frontrunner, Emmanuel Macron, has said it has been the target of a Huge Hacking Attack after a flood of internal documents were released online. About nine gigabytes of data were posted online by an anonymous user called EMLEAKS to the number one paste tool since 2002 Pastebin that allows anonymous posting. It was not immediately clear who was responsible. The details are unclear so far, but Mr Macron’s En Marche movement confirmed the hack and said internal campaign documents, including emails and financial data, had been taken in an “act of massive, coordinated hacking”.\nThe leaked files were obtained several weeks ago by hacking personal and professional email accounts of several officials of the movement.\nwho is responsible for the attacks?\nThings remain unclear until now. The Macron camp has not blamed anyone but said that the hack clearly proposed to damage it and undermine French democracy, Macron’s team has previously blamed Russian interests for repeated attempts to hack its systems during the campaign, saying on 26 April it had been the target of unsuccessful attempts to steal email credentials since January.\nJapan-based Trend Micro said the group had used “phishing” techniques to try to steal personal data from Macron and members of his campaign."}, {"topics": ["Hacking News", "Vulnerabilities"], "title": "Millions of websites at risk, as WordPress high-level security flaw discovered", "authur": "Eslam Medhat", "date": "May 5, 2017", "body": "If you are running a website of any size there is a chance that you are using WordPress, the most popular CMS with largest market share by far (more than 27% of the internet). All versions of WordPress, including the latest version 4.7.4 are vulnerable to a high-level security flaw. The vulnerability (CVE-2017-8295) was discovered by Polish security researcher Dawid Golunski last year in July and reported it to the WordPress security team multiple times, but in an absence of a serious action, he decided to disclose it.WordPress has a password reset feature that uses untrusted data by default when creating a password reset e-mail that is supposed to be delivered only to the e-mail associated with the owner’s account.The “SERVER_NAME” variable that is responsible for getting the hostname of the server in order to create a From/Return-Path header of the outgoing password reset email can be modified, an attacker could change it to an arbitrary domain of his choice.Not all web servers allow the modification of the hostname via “SERVER_NAME” header, major web servers such as Apache by default set the “SERVER_NAME” variable using the hostname supplied by the client (within the HTTP_HOST header).Dawid Golunski said that the attacker can send a spoofed HTTP request with a predefined custom hostname value (for example attacker-mxserver.com) which would result in WordPress setting the $from_email to the attacker domain name which is\n“[email protected]”\ninstead of\n“[email protected]”\nand thus result in an outgoing email with From/Return-Path set to this malicious address.Since there is no any available patch from the WordPress company, Golunski has suggested enabling “UseCanonicalName” on Apache to enforce a static SERVER_NAME value."}, {"topics": ["Hacking News"], "title": "Mobile network hackers draining bank accounts with SS7 after many prior warnings", "authur": "William Fieldhouse", "date": "May 3, 2017", "body": "SS7 known as Signaling System 7 is an international telecommunications standard that defines how network elements in a public switched telephone network (PSTN) exchange information over a digital signaling network.Security Experts have warned for years about security issues within the Signaling System 7 protocolexploiting the security issues can allow an attacker to forward calls, giving a hacker the ability to record or listen in to a victim. An attacker could also read SMS messages sent between mobile phones, and track the location of a phone/mobile device using the same system that the phone networks use to help keep a constant service available and deliver phone calls, texts and data.Researchers previously demonstrated that SS7 security is completely flawed, allowing an an attacker with internal access to a telco could obtain access to any specific carrier’s backend in the world via SS7 thefore potentially allow the capability to track a phone’s location, read or manipulat messages, and even listen to phone calls.In this particular case, attackers exploited a two-factor authentication system of transaction authentication numbers used by German banks. A user of the service gets a code sent to their phone in order to transfer funds between other accounts.The hackers first step was to spray spam malware to victims’ computers, which once deployed collected the account balance, login credentials including passwords and their mobile number. The attackers then purchased access to a rogue telecommunications provider and set up a redirect for the victim’s mobile phone number to a device controlled by the attackers.The final part involved the attackers logged into their online bank accounts (ideally when the target would be idol) and then transfer money out. When the transaction numbers were transmitted they were obtained by the attackers, who then simply confirmed the transaction."}, {"topics": ["Hacking News", "News"], "title": "SNMP Authentication Bypass Cripples Numerous Devices", "authur": "William Fieldhouse", "date": "April 29, 2017", "body": "The SNMP(Simple Network Management Protocol) embedded in many Internet connected devices allows the attackers to bypass the authentication by jsut sending random values in the requests, security researchers have found.The SNMP is a very popular protocol for the network management which features support for three ways to authenticate client and requests on the remote SNMP devices. The first two of these three are vulnerable to an authentication which can be bypassed if random values are sent in the requests, the security researchers Bertin Bervis (Costa Rica) and Ezequiel Fernandez (Argentina) argue.This issue, the researchers say that it resides in the manner in which SNMP agent in different devices handles a datatype of human-readable string value called the “community string” which SNMP version 1 and 2 use.Called the StringBleed and tracked as the CVE 2017-5135, this vulnerability is referred to as the Incorrect Access Control and also could allow attacker to execute a code remotely on vulnerable device. A successful exploitation would provide them with the “full read/write remote permissions using any integer/string value,” the researchers argue.With the help of a script in python meant to build a the “snmpget” request which used sysDescr OID, the researchers started searching Internet for devices which would respond to the request. Researchers were looking to retrieve sysDescr OID information successfully when test string value (admin, root, user, etc) was same as the one which is stored in SNMP agent for authentication.The script was supposedly going to work as a type of brute force, the researchers say, but the results were surprising, as some of the discovered devices would respond to the request regardless of the used value.“SNMP version 1 and 2 authentication should only accept the value stored in the SNMP agent authentication mechanism,” the researchers note. However, their testing revealed that an attacker could use any value string or integer to authenticate the SNMP agent successfully on specific device types."}, {"topics": ["Hacking News"], "title": "Samsung’s Tizen-based Smart TV Found to have a Critical Vulnerability", "authur": "William Fieldhouse", "date": "April 29, 2017", "body": "The Smart TV is not that “Smart” if you ask us. The idea behind a smart TV is just to let the consumers control the device through the Internet, but what if there is a serious security flaw in the smart TV? What if the hackers can easily bypass security measures of television and gained the admin access? It would be a nightmare.Well, Neseso IT security researchers have discovered [Pdf] a critical vulnerability which leaves smart TV’s users at mercy of the hacker. According to these security researchers, a security flaw in a 32-inch Samsung’s Tizen-based smart TV can easily be exploited by the hackers to get the root access to the “not so smart” smart-TV.Thr Neseso researchers found that there is no authentication procedure in the place when connecting to the Smart TV – instead, the TV uses an already defined list of devices approved by user. On the surface it may look as if everything is alright, but here is what’s wrong with it. Hackers can easily get the whitelisted MAC address!By doing this, hackers will gain the remote control of the smart TV. Now just imagine sitting on the couch drinking beer while watching your favourite TV show and just suddenly someone starts changing the channels on their own and there is nothing you can do about it. Very frustrating right? But that is just the tip of the iceberg. There is a lot more to it.“Samsung Smart TVs running Tizen OS are prone to a security vulnerability that allows an attacker to impersonate a trusted device to obtain unrestricted access without authentication when connected via Wi-Fi Direct,” Neseso Research Team.Once a hacker gains access to your smart TV, they can hack into your network the TV is connected to, and we just don’t need to explain what will happen next, do we?"}, {"topics": ["Hacking News", "News"], "title": "Google and Facebook Became Victims of $100M Payment Scam", "authur": "William Fieldhouse", "date": "April 28, 2017", "body": "The Justice Department has announced the arrest of a man last month who is allegedly swindled in more than $100 million from two U.S. tech giants.This news came wrapped in a little mystery. The agency did not say who was robbed, and also did not say who is the Asian supplier the crook impersonated to pull off this scheme.The mystery is now unravelled. A Fortune investigation, which has involved the interviews with sources close to the law enforcement and other figures, has revealed the identities of the three unnamed companies and other details of this case.The criminal case shows how the scams involving fake suppliers and email phishing can victimise even the most sophisticated and tech-savvy corporations. But the crime also raises the questions about why these companies have so far kept this silent and whether as a former head of the Securities and the Exchange Commission observes as it triggers an obligation to tell the investors about what had happened.In 2013, a 40 or something Lithuanian named Evaldas Rimasauskas has allegedly hatched an elaborate scheme to defraud the U.S. tech companies. According to Justice Department, he has forged invoices, email addresses, and corporate stamps in order to impersonate large Asian-based manufacturer with whom these tech firms had regularly did business. The point was to trick the companies into paying for the computer supplies.His scheme worked. In the two-year span, the corporate imposter has convinced accounting departments at two tech companies to make the transfers worth tens of millions of dollars. By the time the firms figured out what was going on, Rimasauskas had coaxed out over $100 million in payments, which he promptly stashed in bank accounts across Eastern Europe.These allegations first appeared in a sealed indictment filed by federal prosecutors in New York last December.source: fortune"}, {"topics": ["Hacking News", "News"], "title": "Fraudsters are stealing from bank accounts by diverting calls and text messages", "authur": "William Fieldhouse", "date": "April 28, 2017", "body": "The fraudsters are stealing a large sum of money from the victim’s bank accounts by taking the control of their mobile phones and then intercepting the texts messages sent by the banks.The fraudsters are again gathering as much info as possible on the victims and using a method we warned the public in the past named SIM splitting, to gain the access to bank accounts of people.This is the Money investigation found which one victim from the London lost £22,300 when these fraudsters raided their Santander accounts using the method. Two more victims had drained  £19,500 from their accounts after the criminals intercepted their bank’s text messages.Step 1: Initially the fraudsters have harvested as much as they can about the targetted individual. This includes intercepting their post, searching public information on the search engines/social media, tricking them into the installing of malware or buying the information from the Organised Crime Groups.Step 2: With this information, these fraudsters will call victim’s mobile phone provider and tell them that their handset has been stolen, lost or damaged. Since they can answer basic security questions, old SIM is cancelled and some new one is activated. The fraudster may also ask for all the texts/calls to be diverted to a new phone.Step 3: The first victim will know of a problem is when victim’s mobile stops working. This can look innocent at first and many people may just think it is just a signal problem.Step 4: These fraudsters then hack into the victim’s online banking and then open a parallel business account. Since all the new business account is already in existing customer’s name, there are only a few security checks.Step 5: The fraudsters then start to transfer money to accounts in their control. The banks will either call or text to confirm that payments being sent are genuine."}, {"topics": ["Hacking News", "News"], "title": "People are ready to sacrifice photos on their phones for just £8.8 – Kaspersky", "authur": "William Fieldhouse", "date": "April 28, 2017", "body": "When they are asked, people say that their digital memories have a very special place in hearts, perhaps because those memories are considered to be just irreplaceable. More than two-fifths, for an example, say they would not be able to replace the photos and videos of their children (44 percent), themselves (40 percent), or their travel (45 percent). This survey shows that thought of losing the precious memories is considered as a very distressing by most of the people. In fact, this latest study from the Kaspersky Lab indicates that the people often value their photos and devices even more than their own friends, partners and pets.The Kaspersky Lab asked the people how distressed they would be in different scenarios, including the illness of their family member, a car accident, the loss of their digital photos, a breakup with a partner, contacts, and more. Across globe, this illness of a family member ranked the first place as the most distressing incident which they could experience. The loss or a theft of a device, and the loss of their digital photos, ranked second and the third in multiple regions across globe leaving the a break up with a partner, car accidents, quarrels with family members and friends, a bad day at work, and even in some cases, a pet’s illness, as lower in the ranks of distressing incidents.Further, this experiment also shows that it is people’s most precious memories that they are most likely to exchange for the money. When the participants are offered payment (based on the sums above) for the deletion of their data (no data was actually deleted), it was the photos of family and friends, personal documents and photos of the participants themselves that were the data categories most often approved for deletion."}, {"topics": ["Hacking News", "News"], "title": "UK may face national cyber emergency, says NCSC", "authur": "William Fieldhouse", "date": "April 28, 2017", "body": "The UK has not had to face a top-level cyber security threat before, but the National Cyber Security Centre (NCSC) is continually preparing for what it considers to be inevitable.“A level-1 cyber attack would be a classic national emergency that the government would take very seriously and the average person on the street would probably notice some sort of impact on their lives,” said Felicity Oswald, deputy director of strategy and effectiveness at NCSC.“It is not a question of ‘if’ but ‘when’. We know it is going to happen,” she told a Policy-UK forum in London on the British approach to cyber security.Most incidents are level-3. “These are every day incidents to us, but are still hugely significant to UK organisations,” said Oswald.A level-2 incident typically matters at a sectoral level. It is a threat that is hitting more than one organisation or it is something on a national scale.The NCSC has dealt with a “few hundred” of incidents in the first six months of its existence, said Oswald, but she did not say if any of those were level-2 incidents.Responding to incidents is one of three main strategic goals of the NCSC. For this reason, the NCSC has a large incident management team. “We do our best to support all organisations during a cyber security incident or attack,” said Oswald."}, {"topics": ["Hacking News", "News"], "title": "The Growth of Ransomware attacks is Exponential", "authur": "William Fieldhouse", "date": "April 27, 2017", "body": "Hackers who are spreading ransomware are getting greedier. In the 2016,  average ransom demand to free the computers hit with infection rose from $294 the year before, to US$1,077, according to the security firm Symantec.“The attackers clearly think that there is more to be squeezed from the victims,” Symantec said in their Wednesday report.In addition, this the security firm has detected more ransomware infection attempts. Just in 2016, they figure jumped by 36 percent from the prior year.That does not bode well for public. The ransomware is famous for taking over the top computers, and essentially holding them as hostage. To do so, the malicious code encrypts all the important data inside, and then demands them to pay the ransom, usually in the bitcoin, in exchange for the release of the machine.“More and even more attackers are now jumping on ransomware bandwagon and creating some new ransomware families or modifying the existing ones,” said the security firm.Helping to fuel ransomware boom is digital black market where hackers can sell their ransomware kits for as little as $10 to as much as $1,800, making it easier for the other cyber criminals to join in.Fortunately, the ransomware attacks can also be very easily dodged. For instance, consumers should wary around their email spam, which remains as the popular way for the hackers to spread ransomware, Symantec said.Cyber criminals will often bundle their emails with attachments that can secretly download the ransomware onto a computer if the emails are opened. “In many cases, the victim would receive a spam email designed to appear like an invoice or receipt from a company,” Symantec said.Bad actors will also spread ransomware through exploit kits, or automated hacking toolsets, that operate on tampered websites."}, {"topics": ["Hacking News", "News", "Vulnerabilities"], "title": "Learning to code using bad web tutorials may be the reason for most security vulnerabilities", "authur": "William Fieldhouse", "date": "April 27, 2017", "body": "The German cybersecurity researchers have found that many security vulnerabilities in many websites could, in fact, be due to people learning to code from popular online tutorials which are riddled with many mistakes.The Computer scientists from the Saarland University, the Technical University of Braunschweig, Technical University of Berlin, and the cybersecurity firm Trend Micro have analysed thousands of PHP programming projects on the GitHub and they have cross-referenced the code against a bunch of popular coding tutorials which rank at the top of Google.Most of the popular tutorials online focus on teaching the new coders how to perform a particular task, like how to create a search form in PHP or how to accept the user’s input from a HTML form /message box and output it in the JavaScript; or the tutorials on how to start using an open source database management system like MySQL.These tutorials offer coding examples that people can copy, but more often the coding examples has mistakes which make it possible for the attackers to later perform a cross-site scripting (XSS) or an SQL injection attack on vulnerable websites to steal the sensitive data from the users.The researchers checked top five results for each of those above three coding tutorial queries, and they have found that nine of 15 results has vulnerable codes. They have loaded 64,415 PHP codebases on the GitHub in a database and then they ran queries asking a general desktop PC to locate those code snippets.“Developers routinely consult programming resources as software is written. Although formal documentation such as language and API reference manuals provide detailed guidance, tutorials on the Web are as easily available and are more succinct. The lure of quick actionable advice makes tutorials an appealing reference for developers,” the researchers conclude in their paper."}, {"topics": ["Cyber Attack", "Hacking News", "News"], "title": "Latest Flaws in SCADA Allow Ransomware and Other Attacks", "authur": "William Fieldhouse", "date": "April 27, 2017", "body": "Cybercriminals have been increasingly relying on ransomware to make a profit by taking hostage personal and business files. Experts have also started issuing warnings regarding the possibility of ransomware attacks targeting industrial systems.Proof-of-concept (PoC) ransomware designed to target industrial control systems (ICS) was described recently by security firm CRITIFENCE and researchers at the Georgia Institute of Technology.These attacks focused on programmable logic controllers (PLCs), which are often critical for operations and can represent a tempting and easy target for malicious actors. However, Alexandru Ariciu. ICS security consultant at Applied Risk, disclosed another potential target on Thursday at SecurityWeek’s 2017 Singapore ICS Cyber Security Conference.Ariciu showed that ransomware attacks, which he has dubbed “Scythe,” can also target SCADA devices that are inconspicuous and which may be considered less risky.Affected vendors have not been named, but the devices have been described by the expert as various types of I/O systems that stand between field devices and the OPC server (e.g. remote terminal units, or RTUs). The devices are powered by an embedded operating system and they run a web server.Thousands of these systems are easily accessible from the Internet, allowing attackers to hijack them by replacing their firmware with a malicious version.The attack scenario developed and demonstrated by Applied Risk starts with the attacker scanning the Web for potential targets. According to Ariciu, many devices can be identified using the Shodan search engine, but even more targets can be found via a simple Google search.Ariciu has tested four devices from different vendors and discovered nearly 10,000 systems accessible directly from the Internet. The researcher said most of these systems lack any authentication mechanism, allowing easy access.The expert believes an attacker could identify widely used devices and concentrate on targeting those. Once the target has been identified, the attacker first needs to acquire the device and conduct hardware debugging on it to determine how it works. The general attack process is the same for all devices, but the exploit needs to be customized for each specific product.It took Applied Risk three months of analyzing ports, using various hardware hacking techniques, firmware dumping, and reverse engineering to determine how each device works and how it can be attacked.source: securityweek"}, {"topics": ["Hacking News"], "title": "About 40% of Ransomware Victims Pay Up to Unlock Their Devices", "authur": "William Fieldhouse", "date": "April 27, 2017", "body": "About 40% of ransomware victims pay to get their devices unlocked as more and more people get affected by such schemes.According to a new research from cybersecurity firm Trustlook, it’s not just businesses that are threatened by ransomware, but also random, regular Internet users. The latter, it seems, are easier targets and have fewer resources than major companies to combat criminals, which is why they are the most likely to comply with the demands of these cyber criminals.Trustlook’s report indicates that about 17% of consumers have, by this point, been infected with ransomware. 38% of all affected consumers have chosen to pay the ransom, which regularly ranges between $100 and $500, most often than not expressed in Bitcoin. On the other hand, those who have not yet been affected by ransomware present a tough stance, as only 7% say they would pay the fees.Despite the growing popularity of ransomware amongDespite the growing popularity of ransomware among cyber criminals who see it as a way to make a quick buck, nearly half of all consumers have not even heard of ransomware before. Furthermore, 48$ of consumers aren’t even worried about becoming a victim of a ransomware attack.On the upside, people seem to be cautious with their data, backing up the files on their computer or mobile device, with only 23% of consumers forgoing this detail.“Backup your data to multiple devices, at to at least one device that is not connected to a network. Also, be cautious of emails by checking the sender’s email address before clicking any link,” says Allan Zhang, co-founder and CEO of Trustlook.His advice comes in perfectly, especially since most ransomware is spread via email phishing schemes. When it comes to mobile ransomware, installing apps from the main app stores instead of going to third-party stores should do the trick. While some infected apps sometimes pass under the radar of Google, for instance, the instances are rare.source: Softpedia"}, {"topics": ["Hacking News", "Vulnerabilities"], "title": "8,400 New Malware Samples Target Android Users Every Single Day", "authur": "William Fieldhouse", "date": "April 27, 2017", "body": "The Cybercriminals are setting their eyes on new Android devices, as 750,000 Android malware apps are found in the first quarter of 2017, this means, almost 8,400 new malware cases are found every single day.According to the security firm G Data by the end of this year, it is expected that there will be a 3.5 million new Android malware samples are discovered, up from the amount of 3.25 million discovered in the last year.On the good side, the year had a slow start compared to 2016, less malware files directed at Android devices were found. However, the threat level for the users of tablets and smartphones running on the Android still remains high.Often the firm points out, that the issue starts from the fact that the older devices do not get updated to latest Android versions. As a matter of fact, only a tiny 4.9 percent of tablet and smartphone users have the Android 7 Nougat, which is available since August 2016. Over 31 percent run Android 6.0 Marshmallow and over 32% run Android 5.0 Lollipop. Another 20 percent of users run Android KitKat.“The problem is that third party providers do not adopt the new operating system for older devices (“older” in this case meaning one year or more). Sometimes, newer operating system updates are not published at all. Hence, in many cases, it can take a long time before any updates are provided. That is if they are provided at all,” the company notes.This is a major difference between mobile devices and PCs running Windows for instance because mobile buyers cannot estimate for how long they’ll receive the latest security fixes for.That being said, the users need to be very cautious so they do not get infected, starting with the installation of a virus scanner."}, {"topics": ["Hacking News", "News"], "title": "Mysterious Hajime Botnet Attacks 300,000 IoT Devices", "authur": "William Fieldhouse", "date": "April 26, 2017", "body": "Hajime, a piece of Internet of Things (IoT) malware that emerged in October 2016, has already ensnared roughly 300,000 devices in a botnet, Kaspersky Lab researchers say.The malware emerged around the same time the infamous Mirai botnet started making the rounds, and is targeting the same devices that this threat does, but without using them to launch distributed denial of service (DDoS) attacks. Instead, it simply closes some ports to keep the infected devices away from Mirai and similar threats.Called Hajime to keep the naming scheme in line with Mirai (they mean “beginning” and “future” in Japanese, respectively), the worm managed to build a peer-to-peer (P2P) botnet, but researchers aren’t sure about its purpose right now. Symantec said recently that a white hat hacker could have created the malware, but suggested that the botnet could be easily repurposed for nefarious operations.What’s certain, however, is that Hajime’s author continues to update the code, as recently made changes were seen in the attack module. At the moment, the worm supports three different attack methods: TR-069 exploitation, Telnet default password attack, and Arris cable modem password of the day attack. The TR-069 exploit was implemented only recently, Kaspersky reveals.TR-069 (Technical Report 069), a standard published by the Broadband Forum, is used by ISPs to manage modems remotely via TCP port 7547 (some devices use port 5555). By abusing the TR-069 NewNTPServer feature, attackers can execute arbitrary commands on vulnerable devices. Late last year, the TR-069 attack was used to crash nearly 1 million modems from Deutsche Telekom.According to Kaspersky, Hajime attacks any device on the Internet with the exception of several networks, and its author recently improved the architecture detection logic. Thus, after passing the authentication stage, the malware reads the first 52 bytes of the victim’s echo binary (information about architecture and operating system is in the first 20 bytes), and then compares the echo ELF header against a predefined array, so as to fetch the correct Hajime-downloader binary.On the other hand, despite Hajime being able to attack any device, the authors focused on some specific brands/devices, as the worm uses only specific username-password combinations to brute-force its way into vulnerable devices. The threat uses one combination or the other based on words contained in the welcome message when opening a telnet session.source: securityweek"}, {"topics": ["Hacking News", "News"], "title": "Cybersecurity Threat Highlighted in the Wonga breach", "authur": "William Fieldhouse", "date": "April 26, 2017", "body": "Recently payday lender Wonga suffered a monumental data breach with personal details from hundreds of thousands of accounts likely to have been illegally accessed. More than a quarter of a million customers have since been warned that their personal data may have been stolen.This is yet another substantial attack. This comes on top of the recent hugely damaging attacks on a number of well-known UK brands including Tesco Bank and telecoms provider Three.The UK’s Information Commissioner’s Office (ICO) in recent times has been getting harsher with companies for security failings, specifically where that allowed a cyber attacker to access customer data.In the case of Three it has experienced multiple breaches. In late 2016 three men were arrested after they accessed the personal data of thousands of the company’s customers, including names and addresses. The attackers used authorised logins to Three’s database of customers eligible for an upgraded handset and the customer information from more than 133,000 users was compromised in the incident.Wonga is also likely to feel the wrath of the ICO’s power very soon given the size of the breach that has occurred. These cyberattacks are part of a growing trend of attacks on consumer-facing organisations.With the growth in size and frequency of attacks it is imperative for businesses to protect themselves, especially with new European laws coming into force in 2017. Companies should feel more inclined to consider security precautions as a priority, but crucially, by giving cybersecurity the attention it deserves and investing in well-managed security controls, damage control won’t be necessary.Organisations also have a responsibility to invest in well-managed security tools, which have controls designed to prevent, detect, contain and remediate data breaches. Furthermore, organisations should take care to share simple safeguarding techniques amongst employees and make sure that they are educated around the type of attacks to expect, however ultimately, protection systems need to be put in place to keep hackers out.source: itsecurityguru"}, {"topics": ["Hacking News", "News"], "title": "IT Jobs in UK Tech industry Sees Growth by 12%", "authur": "William Fieldhouse", "date": "April 26, 2017", "body": "The new Robert Walters UK Jobs Index reveals that the job vacancies for IT professionals increased by 12% in the first quarter of 2017 when compared to the same time in the last year.Developers and software engineers are particularly sought after, accounting for the 14% of total demand while the vacancies for IT managers made up by 4% of total number of the roles.“The UK IT sector has enjoyed a strong steady growth over past several years and is largely resistant to slowdown in the hiring seen by other sectors in midst of economic and political uncertainty last year.”“However, start of 2017 has nevertheless seen a significant increase in IT hiring, with the developers particularly sought after. The demand from startup firms in the fin-tech has played a major role in this, along with the large established companies investing heavily in the cyber security.”“With many high-profile data breaches over past few years involving in the prominent companies, employers are now increasingly recognising the importance of having a robust cyber security function and are now prepared to invest in securing the top talent in this field.”MID LEVEL IT MANAGERSIn addition to this need for IT professionals with some strong technical skills, employers are also increasingly recognising importance of the IT staff who can play a critical role in ensuring the IT policy integrated with other departments across their business.Ahsan Iqbal continues:“The IT professionals with strong technical proficiency are highly sought after by firms across a range of the industries, but the IT managers with effective communication and stakeholder management skills are in particularly high demand.”“As effective cyber security policies become an increasingly high priority, the ability for IT teams to liaise with other areas of the business to develop effective strategies is becoming increasingly vital.”"}, {"topics": ["Hacking News", "News"], "title": "77% of All Ransomware is Detected in 4 Just Industries", "authur": "William Fieldhouse", "date": "April 26, 2017", "body": "NTT Security, the specialised security company of NTT Group, has launched its 2017 Global Threat Intelligence Report (GTIR), which analyses global threat trends based on log, event, attack, incident and vulnerability data [1 October 2015 to 31 September 2016].With phishing widely used now as a mechanism for distributing of major ransomware, a new NTT Security has revealed that 77% of all detected ransomware globally was in just four main sectors – business and professional services (28%), healthcare (15%), government (19%), and retail (15%).While the technical attacks on the latest vulnerabilities tend to dominate the media, many of these attacks rely on the less technical means. According to GTIR, the phishing attacks were responsible for almost three-quarters (73%) of all of this malware delivered to organisations, with business & professional services (25%) and the government (65%) as the industry sectors are most likely to be attacked at a global level. When it comes to attacks by the country, the U.S. with 41%, Netherlands with 38% and France with 5% are the top three sources of phishing attacks.This report also reveals that just around 25 passwords accounted for almost 33% of all the authentication attempts against the NTT Security honeypots in the last year. Over 76% of the log on attempts have included a password which is known to be implemented in Mirai botnet – a famous botnet comprised of the IoT devices, which are used to conduct, what were at present, the largest possible distributed denial of service (DDoS) attacks.DDoS attacks have represented less than 6% of attacks globally but they have accounted for over 16% of all the attacks from Asia and 23% of all the attacks from Australia.Finance si also one of the most commonly attacked industry, subject to the 14% of all the attacks. The finance sector is the only sector to appear in top three in all of the geographic regions that are analysed, while the manufacturing appeared in the top three in the five of the six regions. Government (14%), Finance (14%) and manufacturing (13%) are the top three most usually attacked industry sectors.“We identified more than six billion attempted attacks over the 12-month period – that’s around 16 million attacks a day – and monitored threat actors using nearly every type of attack,” said Steven Bullitt."}, {"topics": ["Hacking News"], "title": "Mirror Group agrees to pay for phone hacking damages", "authur": "William Fieldhouse", "date": "April 26, 2017", "body": "Mirror Group Newspapers have been hit with a bill running into tens of millions of pounds after dozens of phone hacking victims settled their claims for damages.Lord Archer and his wife Dame Mary, who was hacked while he was serving a prison sentence, were among dozens of well known figures who reached an agreement with the newspaper.Other victims included former Home Secretary, Charles Clarke, ex-England football manager, Kevin Keegan and actress Patsy Kensit all settled claims after having their private conversations and messages hacked by journalists.The cases were heard at the High Court in London with the payment of undisclosed damages and apologies.It is understood some of the individual settlements were as high as £300,000.Mirror Group are understood to have set aside more than £52 million to cover the legal costs and damages relating to the hacking scandal.When the News of the World phone hacking scandal broke in 2011, it cost the newspaper’s publisher more than £300 million and led to its closure.The court heard that in the case of Miss Kensit, more than 60 stories were published about her, which are believed to have been based on information obtained through the hacking of messages.David Sherborne, who represented former Labour Cabinet minister, Mr Clarke, said the activities of MGN in his case had caused “enormous stress” for him and his family. It caused them to “drastically adapt” their way of life, he told the judge.In the case of Mr Keegan, his solicitor, John Newell, said in a statement: “Discovering that his private communications with his family, friends and associates had been unlawfully accessed was a devastating intrusion.”The judge heard that MGN had paid Kensit a “substantial sum by way of damages to compensate her for the actions which they have accepted and acknowledged should never have happened”."}, {"topics": ["Hacking News", "News"], "title": "Even After A Week, Hacked Spyware Vendors Haven’t Warned Their 130,000 Customers", "authur": "William Fieldhouse", "date": "April 26, 2017", "body": "An alleged email now apparently shows one employee who is explicitly telling his staff not to warn the customers that the company was hacked.Thousands of people are in the dark.The Motherboard has recently reported that the hackers targeted two companies that sell the spyware to everyday consumer—FlexiSpy and Retina-X. Hackers have made off with a mix of nearly 130,000 customer records, as well as the company documents and even the text messages and the photos captured by the Retina-X’s malware.After a week later the affected customers say neither company has informed them about this data breaches, with one company telling the staff to lie to the victims who have inquired about this hack.Ten customers from Retina-X and FlexiSpy told Motherboard through an email that they have not received any notifications about these hacks.“Your email is the first I have heard of this,” said one Retina-X customer.“No, PhoneSheriff (one of Retina-X’s products) has not told me anything about this,” said another one.There is a gut who is a customer of both FlexiSpy and Retina-X.“I haven’t received any communication or notification from either company about this data breaches or even the fact that my details were compromised,” said the customer.Both these companies sell malware used to monitor children or employees, and in the case of FlexiSpy, to spy on spouses. However, this consumer malware has repeatedly appeared in many cases of domestic violence.“If any visitor asks if we have been hacked, then let them know this: Our server was not wiped because of a hack. We had a corrupted OS due to a hard disk failure. The drive had to be reformatted and reloaded for the server. Everything is running fine,” the employee, called Arun, writes. Motherboard verified that the mail server mentioned in the email’s headers was accurate.Source: motherboard"}, {"topics": ["Hacking News"], "title": "Chipotle Payments System Hacked – Company Says", "authur": "William Fieldhouse", "date": "April 26, 2017", "body": "The Chipotle Mexican Grill cannot catch a break as the fast-casual chain has reported that their sales have rebounded after a long slog in the wake of food safety outbreak. The executives told Wall Street analysts that the payment processing system of the company was hacked.“We want to make our investors and customers aware we recently detected unauthorised activity on the network which supports payment processing for the purchases made in our restaurants.” said the chief financial officer Jack Hartung during an investor presentation. He also said that Chipotle (CMG, +2.38%) has implemented some additional security measures and actions which it believes have stopped the unauthorised activity. The activity seems to have occurred between March 24 through April 18.The Chipotle says they are also working with law enforcement, a cyber security firm, and the payment processor to address this matter.“We will refrain from providing any additional commentary now or in our Q&A,” said Hartung. “We hope to notify any affected customers as we get further clarity about the time frames and restaurant locations which might have got affected.”This hacking news has dulled the enthusiasm around many other big news which Chipotle reported on Wednesday: the quarterly financial results from the restaurant chain since the fall of 2015 when sales started to get dented from a long food safety crisis. The food safety story generated headlines throughout much of 2016 as the company struggled to contain the proper messaging after an E. Coli outbreak hit several states called into question Chipotle’s promise of serving fresher and healthier foods than rivals like McDonald’s (MCD, -0.61%). Sales in wake of that outbreak sputtered for all of 2016, with the same-restaurant sales—a key metric that excludes the sales from new establishments—falling for the five straight quarters."}, {"topics": ["Hacking News", "News"], "title": "Three-quarters of all malware is because of Phishing attacks", "authur": "William Fieldhouse", "date": "April 25, 2017", "body": "With phishing widely used now as a mechanism for distributing of major ransomware, a new NTT Security has revealed that 77% of all detected ransomware globally was in just four main sectors – business and professional services (28%), healthcare (15%), government (19%), and retail (15%).While the technical attacks on the latest vulnerabilities tend to dominate the media, many of these attacks rely on the less technical means. According to GTIR, the phishing attacks were responsible for almost three-quarters (73%) of all of this malware delivered to organisations, with business & professional services (25%) and the government (65%) as the industry sectors are most likely to be attacked at a global level. When it comes to attacks by the country, the U.S. with 41%, Netherlands with 38% and France with 5% are the top three sources of phishing attacks.This report also reveals that just around 25 passwords accounted for almost 33% of all the authentication attempts against the NTT Security honeypots in the last year. Over 76% of the log on attempts have included a password which is known to be implemented in Mirai botnet – a famous botnet comprised of the IoT devices, which are used to conduct, what were at present, the largest possible distributed denial of service (DDoS) attacks.DDoS attacks have represented less than 6% of attacks globally but they have accounted for over 16% of all the attacks from Asia and 23% of all the attacks from Australia.Finance si also one of the most commonly attacked industry, subject to the 14% of all the attacks. The finance sector is the only sector to appear in top three in all of the geographic regions that are analysed, while the manufacturing appeared in the top three in the five of the six regions. Government (14%), Finance (14%) and manufacturing (13%) are the top three most usually attacked industry sectors.“We identified more than six billion attempted attacks over the 12-month period – that’s around 16 million attacks a day – and monitored threat actors using nearly every type of attack,” said Steven Bullitt."}, {"topics": ["Hacking News", "News"], "title": "Nearly 9,000 servers infected with malware across Asean", "authur": "William Fieldhouse", "date": "April 25, 2017", "body": "In an operation that is targeting cybercrime across Asean, Interpol says they have identified thousands of compromised systems which included command-and-control (C2C) servers infected with malware and the websites run by governments.Nearly 8,800 of the servers across 8 countries were found infected with various kinds of malware codes including those that target financial institutions and are used to launch DDoS attacks. Investigations on these systems are still ongoing, according to a statement released by the Interpol, which ran Asean operation out of its Global Complex for the Innovation in Singapore.It has added that about 270 websites are found to be infected with a malware code which exploited a vulnerability in the website design software. All these compromised sites have included those run by governments, which may contain personal data of the citizens, they said.“A huge number of phishing website operators are also identified, including one with many links to Nigeria, with some further investigations into other suspects still ongoing,” Interpol has said. “One of the criminals based in Indonesia who is selling phishing kits using the Darknet had posted YouTube videos showing the customers how to use this illicit software.”Investigators from Indonesia, Malaysia, Singapore, Thailand, Vietnam, Myanmar, and the Philippines are involved in the initiative and exchanged information on the “specific cyber crime situations” in their country.Stressing the need for collaboration between the public and private sectors in fighting cybercrime, Noboru Nakatani, executive director for the Interpol Global Complex for Innovation, said: “With direct access to the information, expertise, and capabilities of the private sector and specialists from the Cyber Fusion Centre, participants were able to fully appreciate the scale and scope of cybercrime actors across the region and in their countries.”"}, {"topics": ["Hacking News", "News", "Vulnerabilities"], "title": "Hackers can steal data from air-gapped networks using a malware", "authur": "William Fieldhouse", "date": "April 25, 2017", "body": "A group of Israeli researchers have devised a new technique which can exfiltrate data from the PC from the air-gapped network using malware which is controlled using scanners.The team is composed of Ben Nassi who is a graduate student at the Cyber Security Research Center in the Ben-Gurion University, and Yuval Elovici his advisor, based on the idea of the Adi Shamir, a prominent cryptographer.This technique can be used by the hackers to establish a communication channel between a dangerous code running on the target machine in air-gapped network and attacker.This technique leverages a flatbed scanner which is used by the researchers to send the commands to their malicious code running on target victim’s network.“Our method uses the light transmitted by the attacker to a flatbed scanner which is then extracted by malware installed in the organisation,” reads the paper published by those researchers. ” The method we use exploits an organisation’s scanner which usually serves as a gateway to the specific organisation. To establish a covert channel between an attacker and a malware. The attacker controlling light source can be located from far away the targeted scanner.”In order to transfer data from an air-gapped network the researchers used a light source near the scanner which then receives all the commands.The scanner detects reflected light on its glass pane and translates it into binary and convert it into an image. Scanners are sensitive to any changes of light in the surrounding environment, even when a paper is on the glass or when the light source is infrared."}, {"topics": ["Hacking News", "News"], "title": "Most banks are confident but lack real-world testing in their cyber security – Research", "authur": "William Fieldhouse", "date": "April 25, 2017", "body": "Nearly 80% of the bank executives are confident about the cyber security strategies they implement, according to a news report from Accenture, but lack ability to test their cyber strategies in a real-world environment. This report is based on a global survey of about 275 senior security executives across the capital markets and banking sectors.“Most of the cyber security assessment programs, while they are well intentioned, they are highly theoretical and are based on known cyber attack practices. The reality is very different,” said Chris Thompson who is the senior managing director and head of the financial services cyber security and resilience at the Accenture Security. “The Fast-moving, dynamic threats are now creating new challenges every day. Banks should now focus on deploying som practical testing scenarios which could focus inside the perimeter to make the crooks’ job as difficult as possible fo them.”The banks are facing more cyber security threats each year. The respondents said their bank had nearly 85 “serious” attempted cyber breaches every year, and about one-third of those are successful and malicious actors gained some information.Cyber attacks on the banks are on rise, so it is more important than ever to be sure that they are well protected. Most banks lack the ability to conduct any real-world testing because there are not many options for the businesses looking to train professionals in the active cyber defence and ensure that they have the tools necessary to respond to an attack.Some companies, like IBM, are now looking to help solve this problem. During the last fall, IBM Security has announced their plans to invest $200 million in its incident response capabilities, including a new headquarters and a Cyber Range where participants can get hands-on. The cyber range offers real-world experience responding to a cyber attack using live malware, ransomware and other hacking tools to teach experts how to defend against and stop attacks.source: ciodive"}, {"topics": ["Hacking News"], "title": "Script kiddies used leaked NSA tools to pwn thousands of Windows boxes", "authur": "William Fieldhouse", "date": "April 25, 2017", "body": "The hacking tools that are leaked from NSA last Friday by Shadow Brokers, are now used by script kiddies to infect thousands of Windows machines globally.On this Thursday, Dan Tentler, the founder of security shop Phobos Group, has told The Register that he has seen a rising in the numbers of boxes on the public internet that are showing signs that they have DOUBLEPULSAR installed in them. All these hijacked machines can now be used to spread spam netizens, malware, or even launch further attacks on other victims.The DOUBLEPULSAR is a backdoor used, to inject and run some malicious code inside an infected system and it is installed using the ETERNALBLUE exploit which attacks SMB file-sharing services on the Windows XP to the Server 2008 R2. This means to compromise a computer, it must have a vulnerable version of Windows and is exposed to an SMB service to the attacker. Both ETERNALBLUE and DOUBLEPULSAR have leaked the Equation Group tools, and are now available for any script kiddie to download and wield against the vulnerable systems.In March, Microsoft patched the SMB Server vulnerability (MS17-010) exploited by ETERNALBLUE, and it’s clear that some people have been slow to apply the critical update, are unable to do so, or possibly just don’t care.The fix is available for Windows 7, Windows Vista SP2, Windows RT 8.1, Windows 8.1, Windows Server 2008 SP2, Windows 10, Windows Server 2012, Windows Server 2008 R2 SP1 and Windows Server 2016, Windows Server 2012 R2 and Server Core. If you own an older vulnerable system, such as Server 2003, you’re just out of luck.Tentler said that a preliminary scan of the public internet on Thursday using Shodan.io revealed 15,196 infections, with four-fifths of those coming from IP ranges in the US. "}, {"topics": ["Hacking News", "News"], "title": "Missile Defense of South Korea Hacked by China", "authur": "William Fieldhouse", "date": "April 24, 2017", "body": "The Chinese state-backed hackers have targeted South Korean entities recently and got involved in deploying a U.S. missile-defense system, according to an American cybersecurity firm. Despite the Beijing’s denial of retaliation against the Seoul over the above issue.In the recent weeks, two cyber espionage groups which the firm linked to the Beijing’s military and the intelligence agencies which have launched a variety of attacks against the South Korea’s military, government, defense companies and also a big conglomerate, John Hultquist the director of cyber espionage analysis at FireEye Inc said in an interview.This California-based firm counts South Korean agencies as the clients, including one which oversees the internet security, would not name targets.While the FireEye and other cybersecurity experts say that the Chinese hackers have long targeted the South Korea, they note a growth in the number and also the intensity of attacks in the recent weeks since South Korea said they would deploy Terminal High-Altitude Area Defense( Thaad) aimed at defending South Korea from North Korean missile threat.China opposes the Thaad, saying that its radar system can reach deep into their own territory and compromise their security. South Korea and the U.S. say that the Thaad is purely defensive. The first components of this system arrived in South Korea in the last month and have been an important issue in the current presidential campaign.One of the two hacker groups, which the FireEye dubbed as Tonto Team, is tied to China’s military and is based out of northeastern Chinese city of the Shenyang, where the North Korean hackers are known to be active, said Mr Hultquist who is a former senior U.S. intelligence analyst. The FireEye believes the other, known as the APT10 which may be linked to other Chinese military or their intelligence units.source: netralnews"}, {"topics": ["Hacking News", "News"], "title": "LastPass 2FA could become 1FA, Researchers found", "authur": "William Fieldhouse", "date": "April 24, 2017", "body": "LastPass resolved a number of issues with their two-factor authentication (2FA) implementation, after many alerts to various issues by the Salesforce security researcher, Martin Vigo.The company said that the problems are now resolved, and users do not have to worry about anything.“To exploit this mentioned issue, an attacker needs to take several steps to bypass the Google Authenticator,” LastPass said in their blog post.“First, the attacker should have had to lure a user to a malicious website. Second, the user should be logged into his LastPass account at the time of visiting the fake site. The combination of factors decreases the likeliness that a user may be impacted.”According to the  Vigo’s write-up, he has found that Lastpass was using a hash of the user’s password to generate the QR code which is used to set up a 2FA on the user’s device.“Lastpass is storing 2FA secret seed under an URL which can be derived from the user’s password,” Vigo said. “This literally beats the whole purpose of having the 2FA, which … is a layer of security to prevent the attackers who are already in the possession of password from logging in.“To put it in a perspective, imagine that you have a locker in your house where you keep all your valuable belongings. Do you think it is a good idea to have the same lock for the door and the safe? Should the door key open the safe as well?”“It is also worth noting that it is not necessary for an attacker to lure the victim into visiting his malicious website,” he said. “Any XSS on sites trusted by the victim like Facebook or Gmail can be used by the attacker to add a payload to steal the QR Code and send it back to his server.”"}, {"topics": ["Hacking News"], "title": "30,000 Firearm and Shotgun Owners Hit by Metropolitan Police ‘data breach’", "authur": "William Fieldhouse", "date": "April 22, 2017", "body": "The addresses if around 30.000 fireman and shotgun owners are handed to a direct mail marketing agency for a commercial firm’s advertising campaign. The gun owners in London are questioning the Metropolitan Police about this incident.The people first came to know this dwhen a leaflet landed on their doormats in Tuesday’s post.Titled as “Protect your firearms and shotguns with Smartwater”, this leaflet – which features the Met Police logos – advises the firearm and shotgun certificate holders to buy a “firearms protection pack at a reduced price” of about £8.95.This Smartwater is basically an invisible ink. You can mark your property using it and if any case you are burgled, police can use UV light readers to see to whom it rightfully belongs. The company behind this was formed by an ex-police detective and his chemist brother, and this firm has since forged their very close links with a number of police forces in the UK. Their website boasts of the crime-reducing properties “traceable liquid”, something that is actively endorsed by police.The promotional firearms security packs being peddled by Smartwater and the Met appear to be little more than a small can of the “traceable liquid” and the “right to display SmartWater’s THIEVES BEWARE® deterrent signage for 5 YEARS”, as the product page puts it.The security implications of the Met distributing home addresses of the capital’s 30,000 gun owners (about 5,000 rifle owners and 25,000 shotgun owners) are severe.It is not clear why firearms and shotguns stamped with serial numbers recorded against the owner’s name and address on a police-controlled database need extra marking. The forensic scientists are very easily capable of reading a filed-off or an altered serial number, two of the most common tricks criminals used in the hope of making their illegally acquired guns become untraceable."}, {"topics": ["Hacking News"], "title": "Vigilante Hacker Uses Hajime Malware to Fight with Mirai Botnets", "authur": "William Fieldhouse", "date": "April 22, 2017", "body": "An IoT malware strain named Hajime is found in the last October and it appears to be work of a vigilante who is set out to take over and then neutralise as many smart devices as he can before any other botnet hunters like Mirai can attack them.While this Hajime was first observed last year, it became apparent recently to the researchers that the maker of this malware had no evil intentions about using the infected devices.When it was found last October, Hajime only has a self-replication module which allowed it to spread from an IoT device to another IoT device using open and unsecured Telnet ports.Since then, the researchers didn’t spot a single DDoS module but that was not something noteworthy, as they have just discovered this new threat, and they consider Hajime as an in-dev malware, one that can add DDoS capabilities once it becomes mature.That maturation did not take place, or at least not in the way the researchers have expected.The initial Rapidity Networks report that unveiled Hajime’s presence to the world also detailed some bugs.The author of the malware didn’t add a DDoS feature, he didn’t use his botnet to relay some malicious traffic or any other intrusive operation.Hajime used to secure IoT devicesAccording to Grange, once Hajime infects a device it blocks access to ports 7547, 23, 5358, and 5555, which are all ports that have been exploited in the past by IoT malware.After that, the Hajime also contacts its C&C server and returns a cryptographically-signed message once every ten minutes. The message, which is displayed on the device’s terminal, is:Just a white hat, securing some systems.\nImportant messages will be signed like this!\nHajime Author.\nContact CLOSED\nStay sharp! "}, {"topics": ["Hacking News"], "title": "Beware of ‘BrickerBot’, the Destroyer of Unsecure Internet Devices – Homeland Security", "authur": "William Fieldhouse", "date": "April 22, 2017", "body": "Security firm Radware has sportted a new kind of attack which is targeting the unsecured Internet of Things devices and is scrambling their code thus rendering them useless.The BrickerBot malware was first found last month after it has started hitting its own honeypots and logging hundreds of infection attempts in just a few days. Whenever the malware connects to a device with their default usernames and passwords, which are very easily found on the internet. This malware corrupts the storage of device and leads to a state of permanent denial-of-service (PDoS) attack. This is usually known as “bricking.”To put it in other words, this attack “damages a system so bad that it requires a replacement or a reinstallation of the hardware,” said Radware.It is a novel take on ongoing security problem with the Internet of Things devices: The Botnets controlled by the hackers, like the ever so popular Mirai malware, typically infect unsecured devices that are listed as part of wider bandwidth-stealing attacks to bring down websites and services internet traffic that is overwhelming for them to handle.Just like the Mirai botnet, which brought down wide swathes of US internet last year during a massive DDoS attack, the BrickerBot uses the “same exploit vector” by brute-forcing telnet accounts with lists of available usernames and passwords.The Radware malware does not have a list of internet-connected devices, like toys, webcams, and even smart bulbs, all these are at the risk of being attacked, but it also pointed to several kinds of Linux-based devices which run the BusyBox toolkit which have their telnet port open and are publicly exposed on the internet.The researchers said that the malware adds some extra commands “to flush all IP tables firewall and NAT rules and also add a rule to drop all the outgoing packets,” effectively wiping any trace of the infection."}, {"topics": ["Hacking News"], "title": "Oracle Patches Solaris with 298 Security Bugs and 10 Hole Exploited by NSA Spyware Tool", "authur": "William Fieldhouse", "date": "April 21, 2017", "body": "Yesterday Oracle has emitted a huge set of 299 security fixes for their software – also including a patch for a vulnerability exploited by an NSA leaked tool that can hijack the Solaris systems.You can find the details of this massive April dump here: Oracle describes their updates as “critical,” and urges all the admins to install them “without any delay.”Among the trove is a patch for CVE-2017-3622, a local privilege escalation hole in the Common Desktop Environment on Solaris 10 that is exploited by the NSA’s now-public EXTREMEPARR tool to seize control of vulnerable machines. This flaw isn’t present in Solaris 11, according to Oracle. That leaves Solaris 7 to 9 potentially vulnerable on Sparc and x86; these operating systems are not supported by Oracle, so you’re on your own with those.Another leaked NSA tool, EBBISLAND aka EBBSHAVE, attempts to exploit a kernel RPC vulnerability (CVE-2017-3623) in Solaris 6 to 10, on x86 and Sparc, to give the attacker a remote root shell. This flaw is not present on Solaris 11 nor on Solaris 10 with critical patches installed since January 21, 2012, nor systems running Solaris 10 Update 11. Again, that leaves older unsupported Solaris boxes on their own.In other words, Oracle patched the remote root hole now dubbed CVE-2017-3623 back in January 2012 for Solaris 10, and Solaris 11 is not affected. Solaris 10 was always at risk of the local root hole CVE-2017-3622, and now a patch is available for that operating system, and Solaris 11 was never affected.Earlier versions of Solaris are out of luck as they are unsupported: if you’re running older boxes or unpatched systems – and many organizations are for various reasons – you need to pay close attention to what’s happening here.It took Oracle a week to clarify the above after earlier refusing to comment on whether or not its software was vulnerable to the NSA toolkit leaked by the Shadow Brokers this month. The radio silence was highly frustrating for some in the sysadmin community.“Oracle encourages all customers to update their systems frequently and fixes are cumulative – this is why any of the Solaris 10 patch distributions released since January 26, 2012, includes the fix,” a spokesman told The Register, referring to the patch that kills off the EBBISLAND weapon."}, {"topics": ["Hacking News", "Vulnerabilities"], "title": "Your Headphones May Be Spying On You", "authur": "William Fieldhouse", "date": "April 21, 2017", "body": "We all spend a decent amount of time every day with our headphones, but what if you’re headphones are keeping on your daily activities? Well, if you own a premium wireless headphone from Bose, you need to worry about it. There is a great chance that your podcasts, music and other audio activities are being spied by the company as a lawsuit claims.An avid Bose headphones user named Kyle Zak has filed a lawsuit at the federal court in Chicago for seeking an injunction to stop Bose from privacy laws breaching by acquiring and selling consumer information without the users’ permission. Zak claims that Bose spies on its customers who are using its wireless headphones which they connect to the Bose Connect app from the Google Play store or App Store to their smartphones.Christopher Dore, Zak’s lawyer said Reuters that “People should be uncomfortable with it”. He continued saying “People put on their headphones on their head because they think it is private, but they can be giving out information that they don’t want to share.”Zak said he bought a pair of the QuietComfort headphones from the Bose for a $350 price and took their suggestion and downloaded the Bose Connect app to get the most out his accessory. The app in process sought his info like name and e-mail address, a standard procedure for registering on apps.He was, however, shocked when he learned that Bose allegedly sent “all the available media information” from his smartphone to third parties such as Segment.io, which collects customer data and sends it anywhere and everywhere.Zak is now seeking millions of dollars in damages on behalf of buyers of headphones and speakers, from the company. Some of the models he mentions in the lawsuit are QuietControl 30,  QuietComfort 35 (pictured above), SoundLink Color II, SoundLink Around-Ear Wireless Headphones II, SoundSport Wireless and SoundSport Pulse Wireless.The company has not responded to the allegations yet."}, {"topics": ["Hacking News", "News"], "title": "Indian hackers ‘release details of 1.7 million Snapchat users’ because Revenge", "authur": "William Fieldhouse", "date": "April 20, 2017", "body": "The Anonymous Indian hackers claim that they have posted the personal details of 1.7 million Snapchat users on the deep web which they obtained from hacking the Snapchat. This is done in response to the Snapchat’s CEO allegedly calling India as a “poor country”.The Snapchat denies that any hack has really taken place, and they also deny that CEO Evan Spiegel has ever said the app was “only for rich people” and not for “poor countries like Spain and India”, as the Variety magazine reported.This hasn’t stopped any if the angry Indian consumers from dragging the app’s rating straight from five stars down to one on the Apple store and Google Play store. They even launched  #BoycottSnapchat and #UninstallSnapchat campaigns on Twitter, and also allegedly compromised nearly 2 million accounts.A spokesperson from the $25 billion app said in a statement: “This is ridiculous. Obviously, Snapchat is for everyone. It’s available worldwide to download for free.”“Those words are written by a disgruntled former employee. We are very grateful for our Snapchat community in India and all around the world.”These allegations are made in a lawsuit filed by Anthony Pompliano who is a former Facebook employee and jumped ship to the mobile platform only to leave on some acrimonious terms.He claimed that he has uncovered a “wide-spread, systemic failure in the Snapchat’s internal controls over data of its users,” meaning the company inflated figures such as its number of active users.In arguments entirely denied by Snapchat, he says his findings were dismissed by Mr Spiegel, then aged 25, and that he was fired just two weeks into his job.While the case is yet to be settled by a Los Angeles Court, the allegations have been taken extremely seriously by the estimated 4 million Snapchat users in India."}, {"topics": ["Hacking News", "News"], "title": "“Google Hire” Says they Won’t Share Browsing History with Employers", "authur": "William Fieldhouse", "date": "April 19, 2017", "body": "Google is known to be on the spotlight mostly for its success, but this time it is not the case. Yesterday, some of the prominent media outlets including RT, Daily Mail, and Australian news site reported that Google is sharing search history of the users with employers under their new project “Google hire.”If you are not aware of the Google Hire, here’s what it is. It is a new project from Google and it is designed to connect the employers with employees. It is similar to the Linkedin in a sense that it lets the employers post a job and then they manage the applicants. According to the Axiom, Google is planning to go head to head with Lever and Greenhouse with this latest project.The AccusationWe all are very aware of the Click bait strategy that many websites use, but there is a fine line between creating as a click bait and creating a false accusation, and this looks like some publishers do not bother much about this.On this Monday, several media outlets have reported that along with their job application, prospective employers can see the search history of their applicants and also their Youtube account. This news has spread like fire and now people started to show their anger towards the whole new thing.Google’s replyJust as one could thexpect, the whole news is fake and Google officials dismissed all of these accusations. A Google spokesperson told the Gizmodo, “Only information that a candidate voluntarily provides would be passed to a prospective employer as part of their online application. Private information will not be shared.”Make sure to check out: hackread"}, {"topics": ["Hacking News", "News"], "title": "Indian Train Station Screen Hacked and Replaced with Hardcore Porn", "authur": "William Fieldhouse", "date": "April 19, 2017", "body": "A recent incident in Indian Railways left the officials in shock. One of the busiest metro stations in India started streaming hardcore pornography videos in the middle of the day. The video about the above incident went viral and the company which is handling the network promised that a thorough investigation will be done, as stated on Sunday.This pornographic footage was broadcasted on a TV screen which is usually reserved for different commercials and advertisements. All these advertisements mostly include luxury property or credit card schemes and nothing like this ever been happened before. That is why the whole event immediately stopped every passer there in the Delhi’s central business district of Connaught Place.Among all, one of the spectators started filming this broadcast on his phone and after uploading the clip on the internet, the video has gone viral rapidly and forcing all the local authorities to act.A spokesperson for the DMRC (Delhi Metro Rail Corporation), Mohinder Yadav, stated that authorities suspect of three individuals about this incident and that they are currently trying to identify the real culprits.Looks like the screen was operated by a certain private company, which did not properly secure their  /Wi-Fi network. The flaw in Wi-Fi security led to the screen being hacked, affirms the DMRC.They’ve also stated that the CCTV footage has helped them discover the men who were playing the clip and that the whole operation was done through their mobile phones. DMRC also added that those in charge of the screen will have to protect it with a password so that incidents like this will not be repeated in the future.Depending on where you’re from, this might not sound like such a big deal, but in India, this is a serious matter."}, {"topics": ["Hacking News", "News"], "title": "Hundreds of popular Youtube accounts hacked. Biggest hack in the YouTube History", "authur": "William Fieldhouse", "date": "April 18, 2017", "body": "The OurMine hackers who also call themselves as “An online security group” have performed “The biggest hack in the history of Youtube.” Due to this, hundreds of famous Youtube channels are compromised.As per the reports, OurMine group has hacked hundreds of Youtube channels and the Videos of the channels which got hacked displayed a hashtag “#Ourmine” as the title and description of each video has been changed to “Hey, it’s OurMine, don’t worry we are just testing your security, please contact us for more information.”All the compromised channels are of different sizes, and some of them are even big guns. Most notable of all of these is the Studio 71, which is a niche of a wide network of websites. JustKiddingNews, RomanAtwoodVlogs and Wranglerstar and many other channels were hacked for within a short period.  Hey guys, it's scarce here!! @JohnScarce gotta give these guys some props at some point! ? pic.twitter.com/De0dPD6FHi— Roman Atwood (@RomanAtwood) April 14, 2017Is this a publicity stunt or a security test? This whole incident can be seen from two different perspectives. The incident can also be perceived as a publicity stunt or even as an experiment to point out the security flaws, whatever may be the case, OurMine claimed that they have had no bad intentions. Also, one of the affected channel the “Wranglerstar” also claimed that these hackers leaked no personal information and that all the channels are safe now.What’s more important is that this is not the first time the online hackers were seen performing cyber shenanigans.Furthermore, the hacking group was also involved in spreading fake news of the death of Britney Spears in December 2016. Besides, the group claimed responsibility for hacking the Pinterest account of Facebook’s CEO Mark Zuckerberg and their long victim’s list, includes the Netflix US, Co-founder of Twitter Jack Dorsey,  Google’s CEO Sundar Pichai and Marvel entertainment etc.  "}, {"topics": ["Hacking News"], "title": "Hackers Leaked Nude Photos of Rosario Dawson, Miley Cyrus, Kate Hudson", "authur": "William Fieldhouse", "date": "April 17, 2017", "body": "Today we see another privacy breach. This time the hackers have leaked nude pictures and also explicit videos of popular celebrities including Miley Cyrus, British actress Suki Waterhouse, Sin City’s Rosario Dawson, Kate Hudson from How to Lose a Guy in 10 Days’ and Dexter’s Yvonne Strahovski.This content was leaked and uploaded on a celebrity gossip site (something they choose to call it)Celeb Jihad. Reportedly, all of the above-mentioned celebrities are completely nude in the new photos. But, in Rosario Dawson’s case, the hackers have also uploaded a video of her’s in the bathtub recording herself.Here, another bad news is that the hackers are also promising to upload the nude pictures of Hollywood’s Alison Brie and English actress Sophie Turner. It must be noted that the hackers have also leaked a 12 seconds x-rated clip allegedly showing the Modern Family’s star Ariel Winter during her private moments. This is exactly a month ago when hackers have leaked nude photos of popular Hollywood celebrities like Emma Watson, Rhona Mitra, Amanda Seyfried, Jillian Murray, Analeigh Tipton, Alyssa Arce, and Iliza Shlesinger. Now, about the same time hackers also leaked nude videos and photos of WWE female superstar Paige and Divas like Melina Perez, Maria Kanellis, Summer Rae and Kaitlyn.In 2014, famous celebrities had their nude photos and videos leaked on the Internet including Jennifer Lawrence, Kate Upton, Abigail Spencer, Alison Brie, Ariana Grande, Ashley Green, Avril Lavigne, Aubrey Plaza, Brie Larson, Becca Tobin, Dwayne Wade, Christina Hendricks, Gabrielle Union, Emily Ratajkowski, Hope Solo, Hayden Panettiere, Jenny Mccarthy, Jennette Mccurdy, Justin Verlander, Kat Dennings, Kaley Cuoco, Kate Bosworth, Kirsten Dunst, Kim Kardashian, Krysten Ritter, Leelee Sobieski, Lea Michele, Mary-Kate Olsen, Meagan Good, Rihanna, Mckayla Maroney, Teresa Palmer, Teyana Taylor Vanessa Hudgens, Scarlett Johansson, Victoria Justice and Yvonne Strahovski."}, {"topics": ["Hacking News", "News"], "title": "NSA Penetrated SWIFT and Monitored Mideast Banks, Mysterious Hackers Shows", "authur": "William Fieldhouse", "date": "April 16, 2017", "body": "A mysterious hacker Shadow Brokers released files which suggested Friday that the US NSA(National Security Agency) had penetrated the SWIFT banking network and also monitored a number of Middle East banks.According to computer security analysts, the files also showed that the NSA had found and exploited a lot of vulnerabilities in a range of Microsoft Windows products which are widely used on computers around the globe.Analysts generally accepted the files, that show someone exploits like “zero-day” or hitherto unknown vulnerabilities in a common software and hardware, came from NSA.They are believed to have stolen from a very secret hacking unit named the “Equation Group” at the key US signals intelligence agency.“These tools and exploits which are released today are specifically designed to target earlier versions of Windows OS,” said the security specialist Pierluigi Paganini on the popular Security Affairs website.They “suggest that the NSA was targeting the SWIFT banking system of several banks around the world.”The files appear to indicate that the NSA had infiltrated two of SWIFT’s service bureaus, including EastNets, which provides technology services in the Middle East for the Belgium-based SWIFT and for individual financial institutions.Via that entry point, the agency appears to have monitored transactions involving several banks and financial institutions in Dubai, Bahrain, Kuwait, Jordan, Yemen and Qatar.In a statement on their website, EastNets rejected the allegations.“The reports of an alleged hacker-compromised EastNets Service Bureau network is totally false and unfounded,” it said.“We can confirm that no EastNets customer data has been compromised in any way.”SWIFT said in a statement that the allegations involve only its service bureaus and not its own network.“There is no impact on SWIFT’s infrastructure or data, however, we understand that communications between these service bureaus and their customers may previously have been accessed by unauthorised third parties.”"}, {"topics": ["Hacking News", "News"], "title": "Canadian judge denies bail to alleged Yahoo hacker", "authur": "William Fieldhouse", "date": "April 13, 2017", "body": "The Canadian hacker who is accused of hacking into Yahoo! Inc. and stealing the email accounts for the Russian government will still remain in prison until June when a hearing on whether to send him to the US comes out.A judge in Hamilton, Ontario has ruled Tuesday that it is too risky to let the accused hacker Karim Baratov to go out on bail ahead of this hearing, even if he is placed under house arrest said the judge.“Why would he stick around?” Judge of Ontario Superior Court, Alan Whitten wrote in his ruling denying the Baratov’s bail request. “He can ply his trade from anywhere around the world.”The US government has been increasing pressure on the Russian hacking networks. On last week, St. Petersburg resident Peter Levashov, also described as the world’s most notorious criminal email spammer was found and arrested while vacationing to Spain at the request of the US. In December, Treasury Department imposed many sanctions on two Russians, Aleksey Alekseyevich and Belan Evgeniy Mikhailovich Bogachev for engaging in various “malicious cyber-enabled activities.”Baratov’s parents have agreed to monitor him if he were to be released and placed under the house arrest, and pledged 845,000 Canadian dollars ($634,000) of home equity as the surety. Baratov is one of four people indicted by the US government last month and have charged with working for Dmitry Dokuchaev who is a hacker for Russia’s security service – the successor to the KGB.Heather Graham, a lawyer for the government, urged the judge to keep Baratov in custody, saying he poses a “severe” flight risk. Baratov apparently has access to large quantities of cash and connections to Russian intelligence officials, she said.Barakov’s lawyer had countered that his client turned in his Canadian passport and has nowhere to go. "}, {"topics": ["Hacking News"], "title": "Your Phone’s Password Can be Found by the Way You Tilt the Device", "authur": "William Fieldhouse", "date": "April 13, 2017", "body": "The hackers have found a new way to get into your phone even when you protect it using PINs by spying on the motion sensors present in your device.According to a team of cyber security researchers from British Newcastle University, it is quite easy for hackers to steal a four-digit PIN by analysing the way you tilt your phone and then the way it moves as you type in your PIN.To test this theory to be true, they were able to crack a four-digit PINs on the first guess with 70% of the time. What’s even better or worse, is that depending on how you look at it, 100% of PINs were guessed by the fifth attempt.“Most of the smartphones, tablets and other wearables are now equipped with many sensors, from the well-known GPS, microphone and camera to instruments such as the proximity, gyroscope, NFC, and rotation sensors and accelerometer. But since mobile apps and websites do not need to ask permission to access most of these, malicious programs can secretly ‘listen in’ on your sensor data and use it to discover a very wide range of sensitive information about you like your phone call timing, physical activities and even your touch interactions, passwords and PINs,” explains Dr. Maryam Mehrnezhad, the lead author of the paper.An even more worrying detail is that, on some of the browsers, it was found that if you open a page on your phone or tablet which hosts malicious code and then open your online banking account without closing the previous tab, criminals can spy on every personal detail you enter.The vulnerabilities have been shared with tech companies and browser makers. Firefox and Apple have already issued patches for this issue, while Google is looking into the issue for a fix."}, {"topics": ["Hacking News", "News"], "title": "Cyber Criminals Hacked Third Party Sellers From Amazon", "authur": "William Fieldhouse", "date": "April 13, 2017", "body": "A new tide of cyber crime has been reported on the biggest online market, the Amazon. The hackers have started using the third-party sellers to scam the merchants and buyers and stole thousands of dollars by offering the goods which do not exist and by changing the bank account details provided.In the past several weeks, more cases of attacks on the third-party sellers have been reported. Hackers have started using some unused and dormant accounts to scam other prople with the nonexistent items. They are bargaing the prices and more, after that they would simply collect the cash and disappear without leaving a trace, as reported by Wall Street Journal.The buyers are getting a refund, but the sellers are the ones who are really in trouble. They are the ones who are getting blamed for not delivering the goods even after taking the money.Margina Dennis, one of the account holders who works in New York as a professional makeup artist, received more than a hundred emails from her customers who want to know why their Nintendo Switch devices haven’t arrived. Upon further investigation, it was found that her account was one of the hacked ones and hackers used to scam the customers. She is in debt of tens of thousands of dollars because of this incident. She can not even access her account since the hackers changed the account password.She, and many others like her, are deeply disappointed with Amazon and don’t want to have anything to do with the company anymore. On the other end, the company is working hard on finding the solution to ensure that the sellers don’t have to deal with the financial burden caused by the security breach.Amazon advises its customers to turn on the two-step authentication, regularly check in on their account and change the password on regular basis. "}, {"topics": ["Hacking News", "News"], "title": "This Ransomware Demands You Game High Score Instead of Money", "authur": "William Fieldhouse", "date": "April 11, 2017", "body": "The fact that ransomware infections are through the roof is not really new anymore, but the fact that someone created a ransomware that requires victims to play a game and get a top score to get their files back sure is.According to Malware Hunter Team, rensenWare forces players to get a high score in a rather difficult PC game in order to decrypt their files. Normally, hackers demand people to pay the Bitcoin equivalent of a few hundred bucks to get their files back.So what do these guys want? Well, first of all, the malware will encrypt documents, music files, pictures and “some kinda project files.”Secondly, they want you to score over 0.2 billion in LUNATIC level of TH12 – Undefined Fantastic Object. While that may not sound that difficult, it actually is, especially if you’re not that good a gamer.Of course, this isn’t exactly the worst type of ransomware out there, and it’s clear it was made as a joke. In fact, its creator, an individual who goes on Twitter by the handle Tvple Eraser, released an apology after RRansomwarewas made public.“First of all, I’d like to apologise to everyone for making shocked, or annoyed. Ransomware is definitely kind of highly-fatal malware, but I made it. I made it for a joke and just laughing with people who like Touhou Project Series. So I distributed source code except for compiled binary on the web. However, at the point of the distribution, the tragedy was beginning,” the author, who often posts in Korean on Twitter, wrote in the apology letter.The hacker admits it may have been a good idea to remove the encryption/decryption logic before distributing the code, but failed to do so. They admit that it’s natural for people to blame them for what resulted from the code sharing.\n"}, {"topics": ["Hacking News", "News"], "title": "White Hat Hackers ‘Hacked’ Touch Bar in New MacBook Pro", "authur": "William Fieldhouse", "date": "April 4, 2017", "body": "Apple’s idea for bundling in a strip of OLED touchscreen at the top of the keyboard for its new MacBook Pro with Touch Bar was to increase user productivity. Called the Touch Bar, this cool new feature has been touted as the next frontier in computing. However, a couple of hackers have just done something with it that Apple or any other party never thought could be possible. The two hackers were able to hack it well enough to display their name on it.The two hackers, Samuel Groß and Niklas Baumstark, were able to breach the Touch Bar at the hacking event titled Pwn2Own at the CanSecWest security conference in Vancouver. They managed to pull this off by harnessing the capabilities of a few bugs that allowed them to root access of the macOS through its Safari web browser. To show just how good they were, the two displayed a message “pwned by niklasb and saelo” on the MacBook Pro’s Touch Bar.While this may be alarming to users, there is no reason to worry. In fact, this event is held to bring together ethical hackers (or white hat hackers) who discover security flaws in IoT and computing devices. The manufacturers of these devices then get details about these flaws to fix them before cybercriminals get their hand on them.In the case of Mac OS touch bar, the two white hat hackers were awarded $28,000. However, the organisers of the event referred to their hack as ‘partial’ and stated that “In a partial win, Samuel Groß and Niklas Baumstark earn some style points by leaving a special message on Mac’s touch bar. They used a use-after-free (UAF) in Safari combined with three logic bugs and a null pointer dereference to exploit Safari and elevate to root in macOS.”"}, {"topics": ["Hacking News"], "title": "Google’s Android bug bounty remains Untouched", "authur": "William Fieldhouse", "date": "April 1, 2017", "body": "The Google’s Project Zero security team did not receive even a single valid submission in their US$350,000 (A$458,000) bug bounty prize for finding zero-day flaws.The submission period for Google’s Project Zero is six-month and it now came to an end. The security team told “everything we received is either a spam, or did not remotely resemble to a contest entry as described in the contest rules”.The high stakes prize asked the researchers to compete and find any existing vulnerability or bug chain which would allow a remote code execution to be carried out on Android devices, knowing only just the devices’ email address and phone number.But not even a single entry came forward, prompting Project Zero team to hypothesise that the US$200,000 first prize is simply isn’t big enough to make a disclosure like that worthwhile.“It is difficult to determine the correct prize amount for this kind of contest, and the fact that we did not receive any entries at all suggests that the prize amount might have been very low considering the type of bugs required to win a contest like this,” the Project Zero’s Natalie Silvanovich said.After a period of soul-searching, Project Zero team said it is also possible that the specific type of vulnerability it asked for was just too difficult to find, or maybe it did not give researchers a long enough time to work within.“Overall, this contest was a learning experience for us, and we hope to put what we have learned to use in Google’s rewards programs and other future contests,” Silvanovich said.When Google announced the competition back in September, it said it hoped to intercept any remote code execution flaws before they could impact Android users.“Contests often lead to types of bugs that are less commonly reported getting fixed, so we’re hoping this contest leads to at least a few bugs being fixed in Android.”"}, {"topics": ["Hacking News", "News"], "title": "Anonymous hacks ISIS website and Infects them with malware", "authur": "William Fieldhouse", "date": "April 1, 2017", "body": "The Amaq, which is the official news agency of Daesh or ISIS terrorist group is informing all its users about a potential compromise in their security of the website. According to Amaq, their site has been hacked by the Anonymous hackers and is now infecting thousands of its users.When visited the site, the following message is appearing: “The site ahead contains a malware, and that attacker might attempt to install a dangerous program on your computer which steals or deletes your information.”It seems that the site’s administrators have identified the hack on Thursday and told the media by a telegram channel and have warned their users not to download the flash player which is appearing on the site. It says “Please be warned,” as the download flash player results in the compromise of the users devices.The Vocativ reports that several ISIS forums have reported about this incident, and according to few forum users, this virus was impersonating like a Flashplayer.apk. APK (Android package kit), which is an Android operating system file format. They also claimed that this malware is designed to spy on ISIS terrorist group’s members and also tracks the user’s locations, read conversations and collect all multimedia files present on their devices.Since the virus is disguised as a Flash Player APK file, thousands of its users are supposedly compromised. One user has also suggested that to get rid of this malware, one should reset the device to factory settings.No group has claimed the responsibility of the hack so far, but it is believed that could be an anti-ISIS group running operation ISIS, #OPISIS is behind this hack. The people behind #OPISIS- an anonymous- affiliated anti-ISIS online campaign have been known to disrupt the ISIS’ online presence over the past few years. The fact that hackers left a message stating “We are coming for you,” could confirm that they are behind the hack.https://twitter.com/Di5s3nSi0N_1/status/847062038765559809"}, {"topics": ["Hacking News", "News"], "title": "No Antivirus Can Detect This New Android Ransomware", "authur": "William Fieldhouse", "date": "March 31, 2017", "body": "A new kind of Android ransomware is discovered in the wild. The speciality of this one is very scary and noteworthy. It is, no antivirus program has managed to find it.Researchers from Zscaler ThreatLabZ have discovered the new ransomware in a very popular app called “OK,” which is a Russian entertainment social network app. This legitimate app that’s available in the Google Play Store, with nearly 50 and 100 million installs, is very perfectly clean and does not contain any kind of malicious code. It’s alternative which is found on third-party app stores the dangerous one here.The ransomware has some other extra features to make you feel safe. For example, after you have installed this malicious app, the malware does not act immediately as most such tools often do. Instead, it stays dormant for four hours, allowing the phone to work as it regularly does, and even app will work just like it is supposed to.After four hours, the app prompts the users to add a device administrator, which allows the app to change the screen unlock password, lock the screen, monitor screen-unlock attempts and set lock-screen password expiration time. Of course, this sounds very suspicious so the users might very well tap “cancel.”Even if that happens, the prompt will appear again quickly, preventing the user from taking any another action or even uninstalling the app. If the user gives in and agrees to give the app admin powers, the ransom note will appear on the screen. Attackers demand a 500 rubles as payment, which is close to $9,000.“We analysed the sample further to understand whether the malware actually sends a user’s data to a server. We didn’t find any personal data leak as claimed by the ransomware and were not surprised when we found that the ransomware is NOT capable of unlocking the user’s phone,” the researchers note.\n"}, {"topics": ["Hacking News"], "title": "WikiLeaks Releases CIA Tool Used to Impede Malware Attribution", "authur": "William Fieldhouse", "date": "March 31, 2017", "body": "The WikiLeaks has released some information and source code for a framework which is allegedly used by U.S. Central Intelligence Agency (CIA) for making an analysis of their tools and attribution even more difficult.The WikiLeaks organisation on this Friday made 676 source code files of the Marble Framework public. According to them, version 1.0 of this framework was released back in 2015, and CIA has continued using it ever since.The files which appear to be part of this official Marble Framework documentation describe that as a framework “designed to allow for more flexible and easy-to-use obfuscation when developing various tools.” These types of techniques are used by many malware developers to hinder the researchers.During the first round of Vault 7 files released by the WikiLeaks, the information shows that the CIA has learned from the NSA’s mistakes after intelligence agency’s Equation Group was exposed by various security researchers. The CIA employees have apparently determined that use of some custom cryptography is one of NSA’s biggest mistakes, as it has allowed the researchers to link various pieces of malware to same developer.This Marble framework allowed obfuscation of a tool using some random technique to prevent the security vendors and forensics investigators from linking it to a specific developer. Thee marble users can also select algorithm they want to use or just configure the application to omit a certain algorithm.Charles R. Smith, the CEO of Softwar Inc, pointed out that the Marble leverages the Bouncy Castle cryptography APIs.During their analysis of the Marble source code, the WikiLeaks found some test examples written in Russian, Chinese, Arabic, Korean and Farsi, which suggests that the agency may have used the framework to trick investigators into believing that its tools were developed by individuals speaking one of these languages.The source code files made available by WikiLeaks also include a deobfuscation tool. "}, {"topics": ["Hacking News", "News"], "title": "FBI Director James Comey’s Twitter Account Exposed", "authur": "William Fieldhouse", "date": "March 31, 2017", "body": "There are a few things we know about the FBI Director James Comey’s social media life, since he is been quite a mum about it, all in the effort to preserve his privacy. But the shroud of privacy may have gone up in flames as he apparently gave out a little too much of information about his Internet persona.The Gizmodo reporter Ashley Feinberg went on a little mission to find the Comey’s Instagram and Twitter accounts after one of his statements.“I care deeply about privacy, treasure it. I have an Instagram account with only nine followers. Nobody gets in. They are all immediate relatives and one is daughter’s serious boyfriend. I let them in as they are serious enough. I don’t want anybody looking at my personal photos. I treasure my security and privacy on Internet. My job is public safety,” Comey said in an interview. Since he previously admitted to use Twitter, it is only natural that would somehow be connected.The reporter went on to look for that Instagram account and get the first clue from there. After a little effort, she found Brien Comey who is the FBI’s director’s son and a basketball star. After checking around for a while, she tried out a search on Twitter for the name “Brien Comey” without “James” so all the references to his father would be left.That eventually led to a tweet from college basketball team Brien is on, in which one account is mentioned – @twittafuzz. Even though this is now pretty much dead, if you can search through the mentions, there is enough evidence to sustain the idea that it is owned by Brien Comey since someone congratulates him on his dad’s promotion as chief of the FBI. Looking through the comments left on a picture featuring Comey’s son led to his Instagram account.\n"}, {"topics": ["Hacking News", "News", "Vulnerabilities"], "title": "Fake WordPress SEO Plugin Provides Backdoor Access to Attackers", "authur": "William Fieldhouse", "date": "March 31, 2017", "body": "Researchers have found a fake WordPress plugin which is targeting the WordPress. It is called WP-Base-SEO and is a forgery of the legitimate search engine optimisation plugin named WordPress SEO Tools, the security firm SiteLock said.According to the SiteLock, at the first glance, the file appears as a legitimate one, including documentation of how it works exactly and a reference to the WordPress plugin database. However, a closer look, reveals that this plugin has a malicious intent in form of a PHP eval request in base64 encoded form.The Eval is a PHP function which executes an arbitrary PHP code and is frequently used for various malicious purposes. Eval has been abused so much that the php.net recommends against using it.This malicious WP-Base-SEO plugin’s directory holds two files. One of them is wp-sep.php which uses a different function and variable names depending on install. The second is wp-seo-main.php which uses a native WordPress hook functionality to attach the above-mentioned eval request to the header of website’s theme.Now, the attackers have back-door access and they can force sites to do whatever they desire.“Some versions include an additional hook that runs after each page load. This means that anytime the theme is loaded in a browser, the request is initialized,” SiteLock notes in the report.Researchers have found many sites which got infected by this malware, but researching for the plugin name on the Internet reveals no information. This just suggests that this malware has gone completely undetected until now.“If you find a suspicious plugin in your /wp-content/plugins directory, it is best to delete the entire folder and reinstall a clean version of the plugin either in the WordPress admin dashboard or by downloading it directly from WordPress.org,” researchers conclude."}, {"topics": ["Hacking News", "News"], "title": "Phishing Scam Hits World of Warcraft fans", "authur": "William Fieldhouse", "date": "March 31, 2017", "body": "The famous game “World of Warcraft” has become the latest target for the hackers and things are not looking good for the game’s fans.According to the hackers from the Graham Cluley who are conducting various phishing attacks on gamers using two kinds of emails to steal the user’s login credentials.The hackers are sending emails to the players of World of Warcraft and making them believe that they won a prize followed by a link for them to claim the prize by putting their Blizzard account credentials.The various items used in the email are a flying mount called “Mystic Runesaber” and the “Battlepaw” an in-game pet,  Both of these are legitimate and can be bought in the game and this makes these emails more believable.Once you click on the email, a new window will pop open asking you to enter your login credentials of your blizzard account, and once you are done doing that, the hacker will get your information, which he can either sell or use personally.“You are receiving this e-mail because your friend purchased World of Warcraft In-Game Pet: Brightpaw for you as a gift!Claim Your GiftTo claim your gift, enter your Gift Key on the Battle.net? Account Management. You’ll be sent to the download page afterward if needed.Enjoy!Blizzard Entertainment?”This would be a perfect scam if not for those two obvious flaws in the email. First is the suspicious looking question mark after the Battle dot net, and the second one is that it is named Blizzard Entertainment wrote at the email end.Like all other phishing scams, this one also relies on the poor judgmental skills of the recipients and to make sure that you don’t fall into this trap you must be careful when you receive an email from an unknown sender."}, {"topics": ["Hacking News"], "title": "This Sophisticated Malware Attack Targets Open Source Developers", "authur": "William Fieldhouse", "date": "March 30, 2017", "body": "In the past few months, the developers who publish their code on the GitHub are targeted in an attack campaign which uses a very little-known but potent malware.These attacks started in the January and have consisted of malicious emails especifically crafted to attract attention of developers, such as the requests for help with development projects and other offers of payment for programming jobs.These emails had .gz attachments which contained the Word documents with some malicious macro code attached. If this is allowed to execute, macro code executed in a PowerShell script which reached out to a remote server and then downloaded a malware program known as the Dimnie.According to the researchers from Palo Alto Networks, the Dimnie has been around since 2014, and has flown under radar until now as it is primarily targeted towards users from the Russia.This malware uses stealthy techniques to make its malicious traffic blend into the normal user activity. It usually generates requests which appear to be directed to Google like domain names, but which are actually sent to an attacker’s IP address.The Dimnie is able to download some additional malicious modules which are injected directly into memory of the legitimate Windows processes. The modules leave no traces on the disk, which makes their analysis and detection more complicated, Palo Alto researchers said in this blog post.There are some separate modules for the screen grabbing, keylogging, interacting with smart cards attached to computer and more. There is also a self-destruct module which wipes all files from the system drive in order to destroy the traces of the malware’s presence.Data stolen from an infected computer is encrypted and appended to image headers in an attempt to bypass intrusion prevention systems.Developers can be valuable targets for cyber espionage. Their computers often hold proprietary information and access credentials for their employers’ networks and systems. "}, {"topics": ["Hacking News", "News"], "title": "Hackers Control Air-Gapped Malware Using Scanners", "authur": "William Fieldhouse", "date": "March 30, 2017", "body": "Researchers have recently published a paper which describes how a piece of malware planted in an air-gapped network can be controlled remotely using an office scanner and a light source, such as a laser or a smart bulb.The method of using scanners to jump the air gap was first summarised back in 2014 at the Black Hat Europe conference by Adi Shamir, professor of Applied Mathematics at the Weizmann Institute of Science and one of the inventors of RSA algorithm. Shamir along with Ben Nassi and Yuval Elovici have now published a detailed research paper on the attack method.Many experiments conducted by these experts show that attacker can send a bunch of commands to a piece of malware present on an isolated machine just by pointing a light source at a connected flatbed scanner which has its lid open from outside the building which is housing the device.This malware can be programmed to start scans at a specified date and time when attacker starts sending these commands. The researchers have pointed out that only the first scan date should be set as the subsequent dates can be supplied with each attack.These commands are transmitted in the form of pulses from a laser or any other different light source because a 0 bit is sent when it’s off and 1 bit is transmitted when the light source is on. The light source can be an invisible infrared laser or a visible laser, this makes the attack stealthier.The laser attack works if there is a clear line of sight from the outside of the building to the scanner. If the view is blocked by a curtain or a wall, the attacker can remotely hijack a smart bulb located in the same room as the targeted scanner and use it to send the signals.source: securityweek  "}, {"topics": ["Hacking News", "News"], "title": "Obama executive order on cyberattacks extended by Trump", "authur": "William Fieldhouse", "date": "March 30, 2017", "body": "The president Donald Trump is now extending by special powers introduced by the former President Barack Obama by one year which allow the government to issue various sanctions against people and organisations which engaged in significant cyber crime and cyber attacks against the U.S.The executive Order 13694 was introduced on April 1, 2015, and it was due to expire on this Saturday, but the president sent a letter to the Congress on Wednesday evening saying that he plans to keep that order active.“A significant number of malicious cyber-enabled activities originating from, and/or directed by persons located, in whole or in substantial part, outside United States, continue to pose an extraordinary threat to the national security, economy, and foreign policy of the United States,” President Trump wrote in the letter. “Therefore, I have determined that it is very necessary to continue national emergency declared in Executive Order 13694 regarding significant malicious cyber-enabled activities.”Executive order gave U.S. some new powers to retaliate for the hacking of critical infrastructure, major DDoS attacks or large-scale economic hacking.It was expanded in December 2016 to include election-related systems and used to sanction Russian agents and organisations for their alleged role in a series of attacks during the presidential election.In that action, Obama named the Russian military intelligence agency, the federal security service,  and the GRU, the FSU, as responsible for the election-related attacks. It also named three organisations and four Russian individuals for their alleged role.The extension of the executive order is one of the first actions Trump has taken publicly that addresses cybersecurity. In February, he had been due to sign an executive order that addressed the issue but it was cancelled at the last minute.But, after meeting with some of his national security staff and representatives from the National Security Agency, the order was never signed."}, {"topics": ["Hacking News", "News"], "title": "4 Billion Records Leaked in 2016, 10K New Vulnerabilities :IBM Security Report", "authur": "William Fieldhouse", "date": "March 30, 2017", "body": "Cyber-criminals are getting more bold day by day, a new report from IBM shows this, indicating that the number of records breached in 2016 has increased by 556% compared to the previous year, hitting a huge 4 billion mark.According to the IBM’s 2017 X-Force Threat Intelligence Index, on top of 4 billion records which ended up on Internet last year, there are 10,000 software vulnerabilities documented in the same year, which is the highest number for a single year in the 20 years it has published its report.The report also takes numerous cybercrime trends into account, including the high tide of spam messages. The IBM’s data shows Spam was up by 400% in 2016, and 44% of these messages contained malicious attachments, most of these are ransomware. In fact, about 85% of the attachments fall into the category of malware which tries to lock people’s computers and offering a decryption key only to those who pay a ransom.Another new trend noticed by the IBM regards the targetted attacks on unstructured data. In past years data breaches used to focus on various structured information sets, like credit card data, personal health information, passwords and so on, 2016 saw a huge shift. In fact, hundreds of gigabytes of documents, email archives, intellectual property and source code were targeted by criminals and exposed along with all the other data which we have become “accustomed” to.“The cybercriminals continued to innovate in 2016 as we have seen some new things like ransomware move from a nuisance to an epidemic. While the volume of these records compromised last year researched the historic highs, we also see this shift to unstructured data as a seminal moment,” said Caleb Barlow, VP of the threat intelligence for IBM Security.The top field targeted by criminals was the financial one, which managed to dethrone healthcare, the number 1 affected field in 2015."}, {"topics": ["Hacking News"], "title": "Android Ransomware Affects Less than 0.0001% of Official Installations :Google", "authur": "William Fieldhouse", "date": "March 29, 2017", "body": "Getting infected with Android ransomware is unlikely, Google says. In fact, you’re more likely to get hit by lightning twice than to get infected.Of course, that may not seem like it’s the case with all the infected apps that get reported after managing to make their way into the Play Store, but it seems to be the actual truth.“Since 2015, less than 0.00001 percent of installations from Google Play, and less than .01 percent of installations from sources other than Google Play, were categorized as ransomware,” reads the report signed by Jason Woloz, senior program manager with the Android security team.As you know, ransomware is a type of app that restricts people’s access to the device until victims pay a sum of money, most often than not in Bitcoin. They’re usually present in apps that restrict device access and demand payment, or apps that encrypt data on the external storage of the device and demands payment to decrypt it all. As Woloz points out, criminals often pose as law enforcement and accuse users of doing something illegal, so they’re more likely to pay.The Android security chief also hgihlights that Google has been doing a lot to protect users. On top of the Verify Apps feature which analyzes apps before they are installed, Google also deploys Application Sandboxing, which is a technology that forces apps to operate independently of others. Basically, sandboxes require apps to mutually consent to sharing data, which limits ransomware’s ability to access sensitive information.Android 7.0 Nougat comes with some extra defenses against ransomware, Woloz says. For instance, apps can no longer see which other apps are active, which means that if an app infected with ransomware flies under Google’s radar and you install it, it can’t see what other apps are doing.Additionally, if you set a lockscreen PIN prior to installing ransomware, the infected app can’t misuse your device’s permissions to change your PIN to lock you out, effectively canceling the effects one of the major categories of ransomware apps."}, {"topics": ["Hacking News"], "title": "Google’s bugfinders found yet another bug in LastPass", "authur": "William Fieldhouse", "date": "March 29, 2017", "body": "For most of us, Saturday morning is a time for a lie in, a leisurely brunch, or maybe taking the kids to the park. But for some it’s bug-hunting time.Tavis Ormandy, a member of Google’s crack Project Zero security team, was in the shower and thinking about LastPass – after finding a number of flaws in the password manager over the past week. Then he had an epiphany and “realized how to get codeexec in LastPass 4.1.43,” he said, and filed a bug report.OK, exploit working and full report sent to LastPass. Now time to put some pants on. ?— Tavis Ormandy (@taviso) March 25, 2017The timing couldn’t have been worse for LastPass engineers. They spent last weekend sorting out Tavis’ other bug finds, and now it looked like they’d be back in the office again this weekend. LastPass has now confirmed that the new find is an issue and they are working on it.“This attack is unique and highly sophisticated. We don’t want to disclose anything specific about the vulnerability or our fix that could reveal anything to less sophisticated but nefarious parties. So you can expect a more detailed post mortem once this work is complete,” the firm said.“We want to thank people like Tavis who help us raise the bar for online security with LastPass, and work with our teams to continue to make LastPass the most secure password manager on the market.”That last statement is a kicker, because some on Twitter got very upset at Ormandy for disclosing that there was an issue with LastPass. It seems some people prefer to think that ignorance is bliss.Ethicist have built a documented process >20 yrs for this & it doesn't start with a tweet. All that does is cause fear, uncertainty and +ego— stits (@stits) March 25, 2017It seems a fair few people don’t understand the rules of responsible disclosure. Researchers are perfectly free to go public by saying there is a flaw in a particular piece of code, so long as they don’t say exactly what it is or how to exploit it before a patch is available."}, {"topics": ["Hacking News"], "title": "VMware Patches Flaws Disclosed at Pwn2Own", "authur": "William Fieldhouse", "date": "March 29, 2017", "body": " VMware released updates and patches for its ESXi, Fusion and Workstation products to address some critical and moderate severity vulnerabilities which are disclosed at the Pwn2Own competition 2017.The Pwn2Own participants made more than $200,000 this year for various exploits involving VMware virtual machine escapes. The researchers at Qihoo 360 made $105,000 for a Microsoft Edge exploit which achieved a VM escape, and the Tencent Security’s Team Sniper received $100,000 for a Workstation exploit which leveraged two vulnerabilities.According to the VMware, Qihoo 360 team leveraged a heap buffer overflow (CVE-2017-4902) and also an uninitialized stack memory usage in SVGA (CVE-2017-4903) which allows an attacker in the guest operating system to execute code some on the host.One of these security holes exploited by the Team Sniper is an uninitialized memory usage issue (CVE-2017-4904) in XHCI controller that can be exploited to execute the code on host from the guest OS.The second flaw is disclosed by the Team Sniper at the Pwn2Own, it is rated “moderate severity,” and is an information leak weakness which is also caused by uninitialized memory usage.These flaws affect ESXi 6.0 and 6.5, the Fusion 8.x on OS X and the Workstation 12.x on all operating systems. CVE-2017-4905 and CVE-2017-4904 also affect the ESXi 5.5, but former can only be exploited for the denial-of-service (DoS) attacks and not a code execution.The Mozilla also patched a Firefox vulnerability disclosed at this year’s Pwn2Own. But, they managed to pull it off in just a day after the bug is presented in the hacking competition.This was not the first time VMware patched flaws disclosed at such an event. Last year, it resolved a Workstation and Fusion vulnerability demonstrated at PwnFest, a hacking competition that took place in South Korea at the Power Of Community (POC) conference.VMware has also released patches for the recently disclosed Apache Struts2 vulnerability, which the company has classified as “catastrophic.”"}, {"topics": ["Hacking News"], "title": "Cybercriminals Have a Profit Margin of Up to 95% from DDoS Attacks", "authur": "William Fieldhouse", "date": "March 28, 2017", "body": "Cyber criminals who offer DDoS-as-a-service have a profit margin of nearly 95%. This shows why this service has become so popular in the dark net.According to the Kaspersky Lab experts, black market’s offering of DDoS services is very high, and the criminals who want to arrange these attacks find it to be quite profitable.To set up an attack they spend as little as $7 an hour, but while the targeted company can lose thousands of dollars to millions, depending on the level and length of the attack.the people who offer these kinds of attacks have set up a whole business. They are offering those in need a site where the customers can register, select whatever service they need and pay for it. As Kaspersky’s experts pointed out, there are some customer loyalty programs available for whoever want a repeat experience.The final price of these attacks can vary a lot, and it takes a lot of variables into account. For example, it matters what type of attack is being used, the length of the attack and client’s location. It seems that the DDoS attacks on English-language websites are more expensive compared to attacks on Russian-language sites.“Another major factor that affects the cost is type of victim. Attacks on the government websites and resources protected by the dedicated anti-DDoS solutions are more expensive, as the former are very high risk, while the latter is more difficult to attack,” Kaspersky points out.“It means a DDoS attack can cost anything from about $5 for a 300-second attack, to upto  $400 for 24 hours. The average price for an attack is nearly 25 per hour. Kaspersky Lab’s experts were also able to calculate that an attack using a cloud-based botnet of 1000 desktops is likely to cost the providers about $7 per hour. That means the cyber criminals organising DDoS attacks are making a profit of around $18 per hour,” the report reads."}, {"topics": ["Hacking News", "News"], "title": "Breach in JobLink Affects Job Seekers in 10 States", "authur": "William Fieldhouse", "date": "March 28, 2017", "body": "Multi-state online service America’s JobLink (AJL), which connects the job seekers with the employers, has informed the users last week that a malicious hacker has breached the company’s systems.The attackers exploited a vulnerability in JobLink application gain get the access to jobLink users personal information, including their names, dates of birth and the social security numbers (SSNs). According to the AJL, the attackers created an account on this platform and then exploited a “misconfiguration” to gain access to the information.Law enforcement is notified and a forensics firm was called in to find the cause and impact of this incident. The AJL said the attackers have created an account using the application on February 20, and first signs of some suspicious activity were noticed on March 12. The vulnerability has apparently been introduced in October 2016, is patched on March 14.The AJL has pointed out that this attack did not involve any type of malware, and it also did not affect the company’s ReportLink or the CertLink products.The investigation showed that the attacker accessed information on users in Alabama, Arizona, Arkansas, Delaware, Illinois, Idaho, Maine, Oklahoma, Kansas, and Vermont. These states use the JobLink service to coordinate federal unemployment and workforce development programs.Individuals who created accounts before March 14 could be affected and AJL has promised to send out email notifications to individuals whose accounts have been breached within 5-10 business days. Affected users may also be eligible for credit monitoring services.An investigation has also been launched by the Department of Labor in the affected states, and each state has published information about the breach on its official website. More than 250,000 users could be affected in Delaware, 170,000 accounts may have been compromised in Idaho, while Vermont said the breach could impact up to 180,000 accounts. "}, {"topics": ["Hacking News", "News"], "title": "Here are the images of Samsung Galaxy S7 hacked with Ransomware", "authur": "William Fieldhouse", "date": "March 27, 2017", "body": "Just a couple of months ago we have reported about an Android LG Smart TV got its screen bricked after a ransomware infection. Now a series of similar are taking place on the Samsung Galaxy S7 devices, in these attacks the hackers are infecting Galaxy S7 models with some malware, locking out screens and then demanding for ransom payments.These kind of attacks are currently raising in the UK. The victim, here, told the HackRead website that it happened while they are using Facebook messenger on their own smartphone, and there have not downloaded any app from a third-party nor Google Play Store during the incident or before it. This happened on 18th March, when a “penalty notice” from the Enforcement Bailiffs Ltd appeared on this smartphone informing that the victim’s device has been blocked due to the presence some Child abuse content. It should be noted that the Enforcement Bailiffs Ltd is a United Kingdom based commercial property enforcement specialists and they have nothing to do with these cyber crime related cases.Furthermore, the notice threatened victims in paying 200 GBP or else the so-called offensive material will be made public, and a case will go on trial. Here are the exclusive screenshots provided by the victim: Moreover, the warning message informed the victim to pay the ransom money through secure online payment platform PaySafeCard.Since these threats are bullshit from the get go, the only reasonable solution for this ransomware infection is a simple factory reset, once the battery died and that is what the victim did to get back his smartphone successfully. But, in some cases; it is almost impossible to get rid of this ransomware infection. For this, cyber security giants and the Europol have launched a ‘No More Ransom’ Anti-Ransomware Portal which has already decrypted over 2,500 ransomware victims and saved 1.3 Mil Euros from cyber criminals."}, {"topics": ["Hacking News", "News"], "title": "Healthcare Industry Will Face FTP Attacks – FBI Warns", "authur": "William Fieldhouse", "date": "March 27, 2017", "body": "The Federal Bureau of Investigation (FBI) Cyber Division has issued an alert to warn healthcare industry regarding malicious actors who are actively targeting File Transfer Protocol (FTP) servers which allow anonymous access.According to law enforcement agency, these attackers have targeted FTP servers of medical and dental facilities to obtain access to protected health information and personally identifiable information (PII), and use it to intimidate, blackmail and harass business owners.“FBI recommends the medical and dental healthcare entities to request their respective IT services personnel and check networks for the FTP servers. If the businesses have any legitimate use for operating FTP server in the anonymous mode, administrators must ensure sensitive PHI or PII is not stored on these servers,” FBI said.The agency cited the research conducted back in 2015 by University of Michigan, which has shown that more than one million of FTP servers are configured for the anonymous access. All these servers allow users to authenticate with only a username, like “anonymous” or “ftp,” and either a generic password or no password at all.“In general, any misconfigured or unsecured server operating on a business network on which sensitive data is stored or processed exposes the business to data theft and compromise by cybercriminals who can use the data for criminal purposes such as blackmail, identity theft, or financial fraud,” the FBI warned.In 2015, IBM named healthcare as the most attacked industry, with more than 100 million records compromised, after in the previous year this sector did not even make it to the top five. An IBM report for 2016 showed that the volume of compromised records was smaller, but the number of data breaches increased, causing operational, reputational and financial damage to healthcare organisations.A report published recently by Fortinet showed the top threats targeting healthcare companies in the last quarter of 2016, including ransomware, malware, exploit kits, IPS events and botnets."}, {"topics": ["Hacking News"], "title": "This new fraudster bot spotted in the wild attacks Online stores", "authur": "William Fieldhouse", "date": "March 27, 2017", "body": "A new bot named Giftghost is designed by hackers which are being used to defraud many gift card owners. According to the reports, the attacks are first spotted on February 26th by the Distil Networks, a cyber security firm. Ever since then, nearly 1000 websites became the victims of this brutal hack.The crooks are using this bot to generate possible account numbers of consumers automatically and requesting the balance account of each card number. When a card balance is received, rather than an error or zero, that means that attack was successful and credentials could be then sold on Darkweb or can be used to make a purchase.This is what the Distill Networks researcher Anna Westelius said about the Giftghostbot:“First, it lies about its identity by rotating the user-agent strings. Then, it is massively distributed across various hosting providers and the data-centers across the world. Then, it is technically sophisticated when it executes the JavaScript, just mimicking a normal browser. Finally, its persistent in that if it is blocked by one technique it adapts and then returns using another attack technique.”According to theDistill networks, this bot is capable of sending more than 1.7 million requests per hour and damage caused by this bot is still unknown.Although, this bot is basically designed to steal gift card information of consumers, in many cases it can affect websites as well. In many isolated cases, millions of requests could lead to the slowdown or potential downtime of the website.Rami Essaid, the CEO of Distill networks said that: “Like many sophisticated bot attacks, the GiftGhostBot operators are moving rapidly to evade the detection, and any retailer which offers gift cards can be under attack at this moment. While it is important to understand that retailers are not exposing consumers’ personal information, consumers should remain vigilant. Chef gift card balances, contact retailers and ask for more information. To prevent resources from being drained, individuals and companies must work together to prevent further damage.” "}, {"topics": ["Hacking News"], "title": "CIA Infects “Factory Fresh” iPhones – WikiLeaks", "authur": "William Fieldhouse", "date": "March 25, 2017", "body": "Vault 7 revelations are back with WikiLeaks, and this time it seems that iPhones are the center of attention as documents reveal that CIA is infecting MacOS firmware and the “factory fresh” iPhones for years.In the first time around we saw a bunch of documents regarding all types of the exploitations CIA can make effective use of, this time we’re focusing on iPhones and Macs.For an instance, the “Dark Matter” documents discuss one project named “Sonic Screwdriver.” It was created by CIA’s Embedded Development Branch, Screwdriver is a mechanism to execute code on peripheral devices during a desktop or Mac laptop is booting.An attacker can install malicious software on users device using a USB stick, even if the firmware password is required. The infecting agent for this particular tool is saved on modified firmware of an Apple Thunderbolt-to-Ethernet adapter.Another project is “DarkSeaSkies,” this is an implant which persists in the EFI firmware of an Apple MacBook Air computer, along with the Triton macOS malware, it has an infector “Dark Mallet” and its EFI-persistent version “DerStake.”The documents in hands of the WikiLeaks include 2013 DesStake 1.4 manual, and other documents which show that, as of 2016, CIA continues to rely on and update these systems and is also working on a second DerStarke version.Another one of the CIA’s tools targets iPhones. By using a “beacon/loader/implanter tool” called NightSkies, factory-fresh iPhones can become infested. WikiLeaks states that documents in its hold indicate NightSkies had reached version 1.2 by 2008 and was expressly designed to be physically installed onto fresh iPhones alone, which they claim shows the CIA had been infecting the iPhone supply chain ever since.“While CIA assets are sometimes used to physically infect systems in the custody of a target it is likely that many CIA physical access attacks have infected the targeted organization’s supply chain including by interdicting mail orders and other shipments (opening, infecting, and resending) leaving the United States or otherwise,” WikiLeaks writes."}, {"topics": ["Hacking News"], "title": "Android Forums Hacked and Issued Password Reset Notice", "authur": "William Fieldhouse", "date": "March 24, 2017", "body": "The Android Forums which is the popular platform for the Android users has announced that their servers are accessed by a third-party thus resulting in a data breach.In their security notice, the administrator of the website wrote that 40 members in the forum (which is 2.5 percent) who have registered between registered in 2016 and 2017 got their accounts compromised. Nearly 50% of the affected accounts have never posted on the forum at all, which gives us the conclusion that they are not sreal users to begin with, but bots.The stolen data contains hashed passwords, email addresses, and salts but none of these usernames were taken. However, the good news is that all these passwords have been reset.Moreover, the investigation is still in process. So it is too early to just assume what has happened or how these attackers were able to access that database. But, the administrators believe that it could be a result of a phishing attack.It should be noted that one of staff members in the forum was also impacted by a breach which is not surprising since the hackers are successfully cracking passwords from their previous data breaches and now using them for future attacks. This forum is implementing some new security measures which include site-wide HTTPS support,  2-step authentication requirement for the staff and the passwords randomizing of inactive accounts.This is not first time when the Android Forums has security issues. Back in 2012, the forum suffered a massive data breach in which user credentials of 1 million users were stolen.At the time of publishing this article, the Android Forums was down for scheduled maintenance but you can still go through the security notice through Google Cache."}, {"topics": ["Hacking News"], "title": "Millions of Accounts from Hacked Bitcoin Forums Being Sold on Dark Web", "authur": "William Fieldhouse", "date": "March 24, 2017", "body": "One of the popular Dark Web vendors named “DoubleFlag” is found selling databases from eleven Bitcoin forums on the dark web marketplace. These databases are stolen from 2011 to 2017 from various widely visited forums which provide the information about Bitcoin trading mining.The total data stolen from these forums is contains 12,000,000 accounts including 536,727 accounts from MerlinsMagicBitcoin.com which has suffered a data breach back in January 2017, 514,409 accounts from the BitcoinTalk.org forum which was hacked back in May 2015, 568,357 stolen from the BTC-E.com in October 2014, 21,439 accounts from the BTC4Free.com which was hacked back in January 2014, 21,439 accounts from the BTC4Free.com which was also hacked back in January 2014.1,780 BitLeak.net accounts stolen back in March 2014, 3,153 Bitcoin.Lixter.com which was breached back in September 2014, 61,011 MtGox.com stolen back in June 2011,  28,298 DogeWallet.com accounts stolen back in January 2014, 34,513 from the BitsCircle.com, 10,855,376 BitcoinSec from 2014 breach and also 3,149 accounts from TheBitcoinShop.pixub.com (breach date unknown).Most of these accounts contain an email address, username, personal text number, date of birth, gender, website title and the URL, the location and the password. In some cases, passwords are decrypted while in some they are using SHA1 hash which is easy to decrypt.The price set for this data is USD 400 (BTC 0.3817) It must be noted that BitcoinTalk.org and BTC-E.com are two of the most important bitcoin related platforms having their data sold on the dark web since 2016 by several other vendors. However, we are not sure about rest of the platforms. Either way, if you have an account on any of the forums mentioned above change your password asap. Also, some of the forums discussed aren’t active anymore; therefore, the relevance of their data is out of the question.Previously, DoubleFlag was selling millions of “U.S. Cellular” customers data and 1 billion accounts stolen from Chinese Internet Giants. His feedback ratings have been positive throughout which means the vendor has been selling legit data to buyers."}, {"topics": ["Hacking News", "News"], "title": "Hackers Can Steal Passwords Using the Flaw in LastPass Password Manager", "authur": "William Fieldhouse", "date": "March 23, 2017", "body": "A researcher at Google project zero named Travis Ormandy has found some critical security flaws in the ever so popular password manager LastPass. This flaw could allow the hackers to steal passwords and credentials.in the beginning, it was the LastPass version 3.3.2 which is reported to have this bug. Ormandy has not made any of these findings public until now, and it looks like the LastPass team is currently working on this for a patch. But, things didn’t end here. Soon after Lastpass officials fix the threat, Ormandy found another serious bug in the password manager.We are aware of the report by @taviso and our team has put a workaround in place while we work on a resolution. Stay tuned for updates.— LastPass (@LastPass) March 21, 2017Ormandy pointed out that the new version 4.1.42 of LastPass (both Firefox and Chrome ) has another bug which can allow a hacker to steal the passwords of the users.Oops, new LastPass bug that affects 4.1.42 (Chrome&FF). RCE if you use the \"Binary Component\", otherwise can steal pwds. Full report on way. pic.twitter.com/y92vm3Ibxd— Tavis Ormandy (@taviso) March 20, 2017We are aware of reports of a Firefox add-on vulnerability. Our security is investigating and working on issuing a fix.— LastPass (@LastPass) March 22, 2017According to Google project zero experts, this vulnerability is even worst. The latest vulnerability allows the hackers to steal user’s password for any domain and the hacker could do more damage if binary version of the extension is installed. The binary version can be exploited to run code as commanded by hacker.The researcher Ormandy shared these details of the flaw with the public with the inclusion of the proof of concept (POC) and then explained that the vulnerability is raised due to the websiteConnector.js content script. The script can be exploited by attackers to send unauthenticated messages to the extension thus allowing the hacker to either execute arbitrary code or to steal the passwords.In his blog post, Lauren VanDam from LastPass wrote that these fixes are being pushed to all the users and most of these should be updated automatically. Moreover, VanDam stated that the parent company has no indication that any of the reported vulnerabilities were exploited in the wild by anyone out there."}, {"topics": ["Hacking News"], "title": "More Than 370K Accounts Linked To Terrorism Suspended By Twitter", "authur": "William Fieldhouse", "date": "March 21, 2017", "body": "On this Tuesday, Twitter said that it suspended  376,890 accounts in the second half of 2016 for the reason of “promotion of terrorism.” This number has a 60 percent increase over the prior six-month period.These latest suspensions bring the total number of blocked accounts to a whopping 636,248 from August 2015, when Twitter stepped up their efforts to stop the “violent extremism,” the company has announced as part of their latest transparency report.The actions come with the social networks under pressure from the governments around the globe to use the technology and tools to lock out terrorists and others who use these platforms to recruit and launch their attacks.Twitter also said separately that the number of government requests for user data also rose seven percent from the previous-six-month period, but affected 13 percent fewer accounts.For the requests to remove the content from governments and others including the copyright holders, these number of requests is up 13 percent but number of accounts fell down by 37 percent.Twitter announced that the FBI has informed them that it was no longer under a “gag order” which prevented the disclosure of five cases which involve “national security letters” — which are special requests from the US law enforcement agency in the national security cases.As a result of this, Twitter is now able to inform the affected users of the FBI requests.“As we continue to push for more transparency in how we can speak about national security requests, we will update this new section in future transparency reports,” Twitter stated.Twitter, which is pressured by certain governments to remove “hate speech,” disclosed for the first time a partnership with a third-party research group called Lumen to catalog any information removed.Twitter said it began this agreement with Lumen in 2010.  "}]