[{"topics": ["Hacking News"], "date": "November 26, 2017", "authur": "Eslam Medhat", "title": "Attackers Used Fake Symantec Blog To Distribute Proton MacOS Malware", "body": "Security researchers from Malwarebytes Labs found that cyber criminals using fake Symantec blog website to spread Proton malware against macOS users. On the fake website, the attackers published an “analysis” discussing the existence of a phony malware threat called CoinThief. They advised users to install “Symantec Malware Detector” to protect themselves against that malware. Actually, the download file was Proton malware designed to infect devices and steal victims’ data.The malware is being promoted via “symantecblog.com”, which is a good match for the original Symantec blog, even copying the same content. The registration data for the domain seems to be legitimate, using the same name and address as the original Symantec website. The email address used to register the domain is dead.According to the blog post by Malwarebytes Labs:\nThe fake site contains a blog post about a supposed new version of CoinThief, a piece of malware from 2014. The fake post claims that a new variant of CoinThief has been spotted. In fact, as far as I’ve been able to determine, this is a made-up story, and no such new variant of CoinThief actually exists.Users who downloaded and installed the malware on their Mac devices might be under real threat since Proton malware can gain root-access privileges and enable an attacker to gain complete control over the targeted device."}, {"topics": ["Hacking News"], "date": "November 25, 2017", "authur": "Eslam Medhat", "title": "Imgur confirms that it was hacked in 2014", "body": "Imgur is one of the best places to share and enjoy the most awesome images on the Internet. Every day, thousands of people use Imgur to be entertained and inspired.Imgur (one of the world’s most visited websites) has confirmed email addresses, passwords were stolen in 2014 hack, the company said that an unknown hacker was able to steal data of 1.7 million users, representing about 1.13% of Imgur’s entire 150 million users.The breach didn’t contain personal data because the website has “never asked” for real names, addresses, or mobile numbers.Only emails and password hashes were stolen in the breach. The company said that the data were hashed using the SHA-256 algorithm, which is breakable.According to Imgur:\nOn November 23, Imgur was notified of a potential security breach that occurred in 2014 that affected the email addresses and passwords of 1.7 million user accounts. While we are still actively investigating the intrusion, we wanted to inform you as quickly as possible as to what we know and what we are doing in response.Imgur had been told on Thanksgiving of a data breach on November 23 by the popular security researcher Troy Hunt, who manages the data breach notification service Have I Been Pwned. The breach went unnoticed for 4 years until the stolen information was sent to Troy Hunt."}, {"topics": ["Hacking News"], "date": "November 25, 2017", "authur": "Eslam Medhat", "title": "CoinPouch Blockchain Wallet Has Been Hacked!", "body": "Users of CoinPouch wallet have lost over $655,000 worth of Verge cryptocurrency this week, CoinPouch said on its official Twitter that one in all its nodes containing Verge foreign coin has been hacked.According to CoinPouch:\nWe discovered a hack of a @vergecurrency node that is connected to Coinpouch which resulted in the loss of user’s funds. We are preparing a statement of the hack and the actions we are taking regarding the hack.The company said that the following wallet address (DM5Esw71BnTdJzX1FWpNLvdnrLuCS91v4N) hold the stolen coins. By looking at the wallet address, it seems that there are over 126 million Verge (XVG) coins in the wallet which is around $668,532.The company said that the following wallet address (DM5Esw71BnTdJzX1FWpNLvdnrLuCS91v4N) hold the stolen coins. By looking at the wallet address, it seems that there are over 126 million Verge (XVG) coins in the wallet which is around $668,532.CoinPouch has later reached cryptocurrency exchange platforms and required them to blacklist the thief’s wallet, wishing to trap the funds inside.Verge has blamed CoinPunch for not securing their platform and they said:\n“our condolences to all customers that had their funds saved on coinpouch. hopefully we are able to discover out what occurred. appears the cash have ended up at this handle: DM5Esw71BnTdJzX1FWpNLvdnrLuCS91v4N”CoinPouch is currently waiting for the Thanksgiving related holidays in the United States to continue its investigation into the hack."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "November 22, 2017", "authur": "Harikrishna Mekala", "title": "$100,000 was paid to Hackers by Uber to delete the leaked data of 57 Million Users", "body": "Endangered data from the October 2016 attack included names, email addresses and phone numbers of 50 million Uber riders throughout the world, the business told News on Tuesday. The personal data of about 7 million drivers were obtained as well, including some 600,000 U.S. driver’s license plates. No Social Security numbers, credit card information, trip location details or other data comprised, Uber said.At the time of the event, Uber was negotiating with U.S. controls investigating separate claims of privacy violations. Uber now says it had a statutory obligation to report the hack to regulators and to drivers whose license amounts were taken. Instead, the company paid hackers to remove the data and keep the breach quiet. Uber said it considers the information was never used but declined to disclose the information of the attackers.“None of this should have fallen, and I will not make excuses for it,” Dara Khosrowshahi, who took over as chief executive officer in September, said in an emailed statement. “We are shifting the way we do business.”After Uber’s confession Tuesday, New York Attorney General Eric Schneiderman launched an inquiry into the hack, his spokeswoman Amy Spitalnick said.Hackers have fortunately infiltrated numerous companies in recent years. The Uber violation, while large, is dwarfed by those at Yahoo, MySpace, Target Corp., Anthem Inc.and Equifax Inc. What’s more disturbing are the extreme measures Uber took to hide the attack. The violation is the latest scandal Khosrowshahi inherits from his predecessor, Travis Kalanick.Kalanick, Uber’s co-founder, and former CEO, heard of the hack in November 2016, a period after it took place, the company said. Uber had just resolved a lawsuit with the New York attorney general over data security revelations and was in the process of selling with the Federal Trade Commission over the handling of customer data. Kalanick declined to comment on the hack.Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "November 20, 2017", "authur": "Eslam Medhat", "title": "BankBot Trojan Sneaks Into Google Play Store Yet Again!", "body": "Google made many efforts to make the Play Store away from malicious apps, but some apps were able to fool the anti-malware protections and infect users with malware.Security researchers from different security companies have discovered two new malware campaigns targeting users of Google Play Store, one of them is spreading a new variant of BankBot, which is a popular family of banking Trojan that mimics actual banking apps in attempts to steal users’ login details.The researchers said that they first found the flashlight applications on 13 October, and discovered the infected games and cleaner apps in late October and early November. They also said that Some versions remained on Google Play until as late as 17 November and had been installed by thousands of users.According to researchers:\nThe new version of BankBot has been hiding in apps that pose as supposedly trustworthy flashlight apps, tricking users into downloading them, in a first campaign. In a second campaign,  the solitaire games and a cleaner app have been dropping additional kinds of malware besides BankBot, called Mazar and Red Alert.Once the BankBot installed with the required privileges, the app shows an overlay on the top of the original apps whenever users launch one of the applications from the malware’s list and steal whatever banking information the user’s types on it.Users are recommended to install apps only from trusted sources because BankBot’s payload was downloaded from an external source."}, {"topics": ["Hacking News"], "date": "November 18, 2017", "authur": "Eslam Medhat", "title": "A new variant of EMOTET Trojan avoid malware analysis", "body": "Security researchers from Trend Micro have discovered a new variant of the EMOTET banking Trojan that uses new evasion features enabling it to evade sandbox and malware analysis.EMOTET is a piece of malware program that is essentially used to steal financial information and other sensitive data, it can also be used as a Trojan downloader. According to Trend Micro:\n“We recently discovered that EMOTET has a new iteration (detected as TSPY_EMOTET.SMD10) with a few changes in its usual behavior and new routines that allow it to elude sandbox and malware analysis.”Some malware are created to sleep for a period of time to evade detection from malware analysis products. The analysis program will switch its sleep period to a very short time to scan for malicious actions. The trojan’s anti-analysis technique includes checking when the scanner watches activities to evade detection. CreateTimerQueueTimer helps EMOTET do the job every 0x3E8 milliseconds.The researchers said that EMOTET’s dropper shifted from using RunPE to using a Windows application programming interface (CreateTimerQueueTimer). This API generates a queue for lightweight objects called timers, which are intended to allow the selection of a callback function at a specified time.EMOTET trojan is not the first malware to misuse this API, Hancitor banking Trojan also dropped PONY and VAWTRAK used it in its dropper as well."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "November 16, 2017", "authur": "Harikrishna Mekala", "title": "Department of Homeland Security has Hacked the Boeing 757 remotely", "body": "This hack was not conducted in a laboratory, but on a 757 gathered at the airport in Atlantic City, N.J. And the real hack happened over a year ago. We are only now listening to it thanks to a keynote given by Robert Hickey, flight curriculum manager within the Cyber Security Division of the DHS Science and Technology (S&T) Directorate.“We got the aircraft on Sept. 19, 2016. Two days later, I was delighted in accomplishing a remote, non-supportive, penetration,” Hickey said in an article in Avionics Today. “That means I didn’t have anybody affecting the airplane; I didn’t have an insider threat. I stood off using normal stuff that could get through security, and we were able to build a presence on the systems of the aircraft.”While the aspects of the hack are classified, Hickey acknowledged that his team of industry experts and academics pulled it off by accessing the 757’s “radio incidence communications.”You might recognize when a governmental watchdog confirmed that the interconnectedness of modern commercial airliners could “possibly provide unauthorized remote access to aircraft avionics systems.” The matter was that a hacker could go through the Wi-Fi passenger network to hijack a plane while it was in flight.And in a 2015 report by the U.S. Government Accountability Office, the bureau warned, “Internet connectivity in the cabin should be thought a direct link between the aircraft and the outside world, which adds potential malicious actors.”At the time, U.S. Rep. Peter DeFazio (D-Ore.) said, the “FAA must focus on aircraft certification examples that would prevent a terrorist with a laptop in the cabin or on the area from taking control of an airplane over the passenger Wi-Fi system.”The same year, security researcher Chris Roberts departed up in hot water with the feds after tweeting about hacking the United Airlines plane he was flying on. The FBI claimed Roberts said he took restraint of the navigation.A Hack In The Box giving by Hugo Teso in 2013 suggested that thanks to the lack of authentication features in the protocol Aircraft Communications Approaching and Report System (ACARS), an airliner could be constrained via an Android app. Flight management software organizations, as well as the FAA, disputed Teso’s claims.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "November 15, 2017", "authur": "Harikrishna Mekala", "title": "A Vietnamese Security Researcher shows how to hack Apple’s Face ID", "body": "A publication on Friday by Bkav, a Vietnamese cybersecurity firm, that it had broken Apple’s Face ID, and A video apparently showing an iPhone being opened when pointed at a mask, was greeted with some skepticism.However, he refused to register a user ID and the mask on the telephone from scratch because, he said, the iPhone and mask need to be fixed at very specific angles, and the mask to be refined, a process he said could take up to nine hours.Apple declined to state, referring reporters to a page on its website that explains how Face ID works.That page says the chance of a random person opening another user’s phone with their face was about 1-in-a-million, compared to 1-in-50,000 for the earlier used fingerprint scanner. It also says Face ID allows only five unsuccessful match attempts before a passcode is required.Anh confirmed that preparing the mask wasn’t easy, but he said he assumed the demonstration showed facial recognition as a way to validate users would be risky for some.“It’s not easy for regular people to do what we do here, but it’s a concern for people in the security sector and significant people like politicians or heads of corporations,” he said.“These important people should unquestionably not lend their iPhone X to anyone if they have initiated the Face ID function.”It’s the first proclaimed case of researchers obviously being able to fool the Face ID software.Cybersecurity experts said the issue was not so much whether Face ID could be broken, but how much effort a hack required.“Nothing is 100 percent secure,” wrote Terry Ray, chief technology officer at U.S.-based cybersecurity company Imperva, in a note. “Where there’s a will, there’s a door. The questions are: How much trouble would someone go to, and how significant would they spend, to get your data?”Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "November 13, 2017", "authur": "Harikrishna Mekala", "title": "Face ID just got Hacked with the help of a mask by a security firm", "body": "Apple uses the Tenth Anniversary iPhone X Phone to replace Touch ID. Because the award handset features an edge-to-edge protection and has very slim bezels, Apple had to get up with a way to reinstate the fingerprint scanner that powers Touch ID. So the group in Cupertino decided to use a facial identification system to unlock the device and verify Apple Pay purchases.Apple requires that Face ID is so tight that the odds of a random character using their face to break into someone’s iPhone X are one in one million. Bkav says that because it learns how AI works on Face ID, it was able to avoid the feature and trick it. Different elements were used to create certain areas of the party. For example, silicone was used for the nose and 3D printing was used in other areas. The contracting firm says that Apple is relying too greatly on the feature’s Artificial Intelligence.The mask cost $150 to make, and Bkav says that with its experience to break into the iPhone X, the mask could be practiced to learn personal secrets from political leaders, business executives, and billionaires. The firm says that facial acknowledgment is not a good security tool and says that when it comes to biometrics, a fingerprint scanner is the best way to keep intruders from crashing into your phone.“The mask is crafted by combining 3D printing with a plan and 2D images, besides some special processing on the faces and around the face, where there are large skin areas, to fool AI of Face ID.”-Ngo Tuan Anh, Vice President of Cyber Security, BkavTake your time to comment on this article."}, {"topics": ["Hacking News", "Vulnerabilities"], "date": "November 12, 2017", "authur": "Eslam Medhat", "title": "blockchain.info vulnerability allows attackers to steal bitcoin wallet backups", "body": "Blockchain.info is a bitcoin cryptocurrency wallet and block explorer service. Started in August 2011, the service presents information on new transactions, mined blocks in the bitcoin Blockchain charts on the bitcoin economy, and statistics and resources for developers.Security researcher (Shashank) has discovered a critical vulnerability in blockchain.info, he was able to steal anyone’s bitcoin wallet backup of their account with negligible user interaction.The researcher said that the backup feature creates a JSON file which is the backup of your account allow you to download, Email it to yourself , or store it quickly on your Google Drive and Dropbox accounts. The main issue is that if anyone else gets your JSON file, he can easily import it at blockchain.info and steal all your bitcoins from your account.According to the researcher:\n“I noticed once you click on Dropbox or Gdrive button you will be asked to login with your google or dropbox account and once its authorised blockchain will automatically store the backup file in the your dropbox or Gdrive using your access token.”If someone makes a Google drive authentication, The URL will be like this without any csrf token:\n“https://blockchain.info/wallet/gdrive-update?code={YourGdriveToken}”Now, if an attacker wants to steal anyone’s bitcoin wallet backup, he will do the following:\n1- authenticate with Google Drive at blockchain.info.\n2- Catch the Google Drive token\n3- Send the following link to the victim.\nhttps://blockchain.info/wallet/gdrive-update?code={GoogledriveToken}\n4- Once the link is clicked, the bitcoin wallet backup will be stored in the attacker’s Google Drive account"}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "November 12, 2017", "authur": "Harikrishna Mekala", "title": "North Korean Radio Station got Hacked and the station broadcasted “The Final Count Down”", "body": "News of the event was posted on Twitter by vigilante hacker, “The Jester,” who has in the past increased fame by hacking jihadist websites, and who in October 2016 destroyed the website of the Russian Ministry of Foreign Affairs with the message, “Stop attacking Americans.”“A god amongst us has hijacked 6400kHz (North Korean station) and is presenting the Final Countdown,” said The Jester on Twitter on Nov. 9, and posted a link to a reporting of the broadcast.On Sept. 23, Strategic Sentinel declared on Twitter, “Radio Pyongyang has publicized coded messages on 6400kHz. Usually, when they do this it signals an upcoming provocation.”“The most likely thought for these messages is an expected missile test on the heels of #DPRK FM #UNGA statements,” it stated in September, just after North Korea declared it was considering a hydrogen bomb test in the Pacific Ocean.It also noted that, earlier, North Korea made broadcasts two days before managing a nuclear test, one day before a ballistic missile test, and one day before Japanese flyovers.After the North Korean broadcast was hijacked to play a ’80s rock song, many reacted on Twitter with praise and laugh while poking fun at the absolute regime.Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "November 10, 2017", "authur": "Eslam Medhat", "title": "ToastAmigo Android Malware Discovered Using New “Toast Overlay” Vulnerability", "body": "Security researchers from Trend Micro have found a new Android malware that can quietly install other malicious apps on an infected device by using the Android Toast overlay vulnerability. The malware detected by the company as ToastAmigo, which is the “first observed weaponized use” of vulnerability CVE-2017-0752 in Toast.Overlay attacks are usually used by Android malware for phishing attacks, but using Toast gives some advantages, including the fact that it does not need the same kinds of permissions as other windows, and it enables an app to present a window that covers the device’s whole screen.Trend Micro researchers found two applications, covered as app lockers and both named Smart AppLocker, they are being used to spread ToastAmigo malware. One of them has been installed more than 500,000 times. The full abilities of the malware are not known, but it is believed to have ad-clicking, app-installing, and self-protecting/persistence abilities.According to Trend Micro:\n“The miscellany of the malware’s malicious functionalities, combined with a relatively unique attack vector, makes them credible threats. In fact, the aforementioned functionalities can actually be modified for further cyberattacks”\n“Since TOASTAMIGO and AMIGOCLICKER can misuse Android’s Accessibility feature to virtually do anything, this malware can update itself when getting the remote server’s commands.”"}, {"topics": ["Hacking News", "News", "Vulnerabilities"], "date": "November 8, 2017", "authur": "Mandee", "title": "Google Play Store Security Breach: Fake WhatsApp Update", "body": "The Google Play store has made headlines recently when cyber criminals were able to hack in and post a fake WhatsApp messenger update for download. More than a million Android phone users were tricked into downloading the app but the overall breach was relatively minor.Hackers were able to breach the store by adding a simple line of code which masked the app and made it look as though it was from the original developer of WhatsApp. This, in turn, is how they were able to trick the Google Play store into allowing the app update to be posted to begin with.Google has since removed the fake app and is currently taking steps to prevent any similar future attacks. Fortunately, users that downloaded the fake app didn’t experience much trouble. The app was designed to bombard the user with ads to download other apps, the legitimacy of those apps is unknown but also being investigated.This latest Google Play store breach has made headlines due to the hackers using the new tactic that allowed them to mask the app as being offered by the original developer of WhatsApp. It doesn’t ask for too many permissions so those who downloaded it don’t have too much to worry about.There are several steps you can take in order to protect yourself from similar attacks such as this one. Updates should be offered from the app itself, not in the form of a new download. Also, make sure to have security software that is properly updated on your smartphone as most people are oblivious to this fact.Experts advise that users never download through 3rd party sources as they are often a threat to the device’s security. As long as user’s make sure to pay attention to potential threats and keep updated on recent security threat news, all should be well."}, {"topics": ["Hacking News", "Uncategorized"], "date": "November 8, 2017", "authur": "Harikrishna Mekala", "title": "Texas church shooter’s Phone is completely encrypted says the FBI", "body": "At a press conversation, Christopher Combs, the FBI designated agent in charge of the research, said the phone had been moved back to the FBI in Quantico, Virginia for review. Investigators have identified Devin Patrick Kelley as the criminal in the shooting, which opened in the town of Sutherland Springs.“Unfortunately, at this point in time, we are powerless to get into that phone,” Combs said.The criticisms echo other high-profile events where the FBI said it was formed from accessing a phone because of encryption technology used in Phone. Most memorably, the FBI and Apple went to court last year in a superior legal dispute over whether the business could be forced to help law execution access a phone used by the shooter in the 2015 San Bernardino attack.Combs explicitly drew the contact between the Texas shooter’s encrypted device and those employed by others. “It highlights an issue that you’ve all caught about before, with the advance of the technology and the phones and the encryptions, law implementation, whether that’s at the state, local or federal level, is frequently not able to get into these phones,” he said.Combs said he would not specify which phone was used because he did not want to “tell all bad guy out there what smartphone to buy.”"}, {"topics": ["Hacking News"], "date": "November 7, 2017", "authur": "Eslam Medhat", "title": "The MantisTek GK2 keyboard logs everything you write with a built-in keylogger and send it to China", "body": "Many users online, spotted by Tom’s Hardware, noticed that the hidden keylogger in Mantistek GK2 Mechanical Gaming Keyboard was sending off their data and that it was reaching Chinese business e-commerce giant Alibaba. Alibaba provides a server hosting service, so it’s possible that the private data is making it’s way to someone who is hiring the service.According to Tom’s Hardware:\n“The main issue seems to be caused by the keyboard’s “Cloud Driver,” which sends information to IP addresses tied to Alibaba servers. Alibaba sells cloud services, so the data isn’t necessarily being sent to Alibaba, the company, but to someone else using an Alibaba server.”After a deep look, Tom’s Hardware team discovered that Mantistek keyboard does not hold a full-fledged keylogger. But, it logs how many times a key has been pressed by the user and sending this information back to online servers. It seems that there is no malicious purpose, but logging and sending keystroke counts without users’ approval breaks trust and puts systems’ security at risk by leaking sensitive data.After a deep look, Tom’s Hardware team discovered that Mantistek keyboard does not hold a full-fledged keylogger. But, it logs how many times a key has been pressed by the user and sending this information back to online servers. It seems that there is no malicious purpose, but logging and sending keystroke counts without users’ approval breaks trust and puts systems’ security at risk by leaking sensitive data.Users can stop the keylogger by ensuring that the MantisTek Cloud Driver software isn’t running in the background. Also, they can block the CMS.exe executable in the firewall."}, {"topics": ["Hacking News", "News", "Tech", "Uncategorized"], "date": "November 7, 2017", "authur": "Harikrishna Mekala", "title": "Physicists are thinking that Quantum Particles can solve all the security Issues", "body": "Within a few cycles, researchers displayed the system in the lab, and today quantum cryptography is displaying commercially viable recognition to companies such as ID Quantique in Geneva, Switzerland.But the entire device is a little counterintuitive.  The private information is not sent using quantum workers at all. Instead, physicists use quantum means to send a code called a one-time pad that is used to encrypt the initial message. The encrypted message is then sent over an average telecommunications carrier and decoded in the usual way. The method is called quantum key distribution.Computer scientists know that an information encoded using a one-time pad package be broken. So the security comes from the knowledge to send the one-time pad with perfect privacy, which is what this suggestion guarantees.And that raises an intriguing question. If it’s possible to send the one-time pad securely using quantum workers, why not just send the primary message that way?Today, Wei Zhang at Tsinghua University in Beijing and a few friends say they have done just this. The new method is called quantum secure direct communication, and the Chinese team has used it completed 500 meters of fiber-optic cable for the first time.The reason scientists have relied on one-time pads in the past is simple. At issue is whether a communication has been overheard. Physicists can check this because quantum bits cannot be measured without consuming the information they contain.So when photons are transmitted, if they arrive in the same state they were sent in, a listener cannot have extracted the data they contain. But if they arrive in a different state, that is clear evidence that the data has leaked into the background and the message is not secure.In practice, physicists can be sure that a data is secure as long as this leakage is below some sharp threshold.The difficulty is that the leakage becomes possible only after it has occurred. So a listener would already have the data by the time scientists found out about the ruse.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News"], "date": "November 6, 2017", "authur": "Mandee", "title": "Proton Malware Found Hiding in Elmedia Player Downloads", "body": "Researchers at ESET, a popular cyber security software, discovered the Elmedia Player download has been laced with Proton malware software and has compromised several Mac devices. Although Apple has made repeated claims to their devices being the most secure on the market, apparently, that is not the case.Experts have made a statement claiming anyone who downloaded and installed the Elmedia Player before 3:15pm EDT on October 19th, 2017, are highly likely to have been infected with the Proton malware. It is critical that infected users take immediate action to remedy their devices because this particular malware is designed to steal the user’s information.Cyber attacks that steal sensitive information cause a variety of problems including theft of the user’s funds, log in information, and even media on the device that could be used against the owner. The Proton malware in the Elmedia Player doesn’t set off any security protocols the Apple user has in place, which is a rare thing indeed.Fortunately, the company providing the software, Eltima, announced the infection publicly and have already fixed the downloads. They have also reported the specific directories that will be present on infected Apple devices that is as follows: /Library/.rand/updateragent.app/ is one directory and /tmp/Updater.app/,/Library/LaunchAgents/com.Eltima.UpdaterAgent.plist,/Library/.rand/ is another.Eltima also stated that the malware doesn’t affect the player’s ability to update so the problem can be easily fixed by updating with the now available clean download. Researchers continue to investigate this latest breach in order to prevent a similar future attack.Cyber attacks can occur in many forms and while most companies work tirelessly to prevent such attacks, it’s not always possible to do so. Keep your security software updated often so that your devices will be able to defend against recent breaches with provided patches and available solutions."}, {"topics": ["Cyber Attack", "Hacking News"], "date": "November 6, 2017", "authur": "Mandee", "title": "New Ransomware DoubleLocker Targets Android Phones", "body": "Cyber criminals have once again launched a ransomware attack on android based phones. Look out for a compromised Adobe Flash Player app going around that actually contains DoubleLocker. It is a ransomware program that has been designed to take over your phone and even changes your PIN, which allows the app to be in complete control.The fraudulent app has been found on several websites. Avoid downloading anything outside of a trusted source such as the Google Play Store. DoubleLocker also encrypts the user’s data making it nearly impossible to regain control of their own device without paying a ransom. If you happen to become infected with it, experts recommend taking your phone to a professional for servicing and to never give in to paying the ransom.While the ransom itself isn’t super expensive, it’s still a ransom nonetheless. With DoubleLocker, the creators also designed it to give the fake app administrative privileges. If any app that isn’t legitimately related to device security or protection/location, it should be an instant red flag to the user if it’s asking to be granted any kind of administrator permissions. In other words, an app for viewing videos doesn’t need that kind of access to a device no matter what.The fake app, once downloaded and installed, remains inactive but not for long. As soon as you tap the “home” button on the infected device, DoubleLocker becomes instantly activated and the process begins. It proceeds to lock down the phone and because it was granted administrative permissions, the attackers have the ability to change passwords, change ring tones and ring behavior. They can also wipe all data from the device and even locate it if they wish. Paying the ransom is not a guaranteed fix either so again, avoid giving in to doing that."}, {"topics": ["Hacking News"], "date": "November 6, 2017", "authur": "Eslam Medhat", "title": "VerticalScope has been hacked again!", "body": "In June 2016 the well-known Toronto, Canada-based Internet Media firm VerticalScope has been hacked, hackers have compromised Verticalscope.com, the company chose to keep this information secret from users instead of requiring them to change their passwords.Alex Holden (security researcher) has told Krebs last week that attackers were selling access to Verticalscope.com and a number of other websites served by the company.The researcher said that he suspected someone was attempting to resell data stolen in the 2016 breach. Holden reached one of the hackers selling the data and was given screenshots showing that Verticalscope.com and many other services were truly compromised with a backdoor known as a “Web shell.”According to Krebs :\n“Holden said the intruders obfuscated certain details in the screenshots that gave away exactly where the Web shells were hidden on Verticalscope.com, but that they forgot to blur out a few critical details — allowing him to locate at least two backdoors on Veriticalscope’s Web site. ”The researcher also was able to use a second screenshot the hackers shared which gave the same backdoor web shell on Toyotanation.com, one of Verticalscope’s most-visited forums.Verticalscope said that the company had discovered an intrusion on six 6 of its Web sites, including Toyotanation.com."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "November 6, 2017", "authur": "Harikrishna Mekala", "title": "Student has been Hacking his grades from the past 21-Months at University of Iowa", "body": "The FBI apprehended the suspect Trevor Graves, age 22 at the close of October, in Denver, his hometown. According to an FBI arrest warrant, the teen planted device keyloggers on several school computers.Graves had help from other classmates. One would plant the keylogger, while the another would attend class and verify a teacher had logged into his school account.They would then recover the keylogger and extract the login credentials. The University of Iowa did not perform two-factor authentication for its undergraduate management system, so the login credentials recognized Graves access to teachers’ accounts.This took a position for a period of 21 months, between March of 2015 to November of 2016.The scheme discovered when a teacher saw in mid-December 2016 that some of Graves’ grades had improved without her knowledge. The professor notified the University’s IT staff, who reviewed and found the keyloggers. The FBI was asked in to aid the investigation.All in all, they determined that Graves changed grades more than 90 times, for him and five classmates. They also discovered that he regularly stole exams and shared tests with other students.On December 29, 2016, the FBI and University of Iowa Police performed a search warrant at Graves’ home, an off-campus apartment in Iowa City.Investigators obtained keyloggers, phones, and thumb drives with compromising information. The phones included records of past conversations among graves and his co-conspirators, while the thumb drives included copies of stolen exams. Graves referred to the keyloggers using the term “pineapple.”The FBI reviewed and searched other students’ houses, but only imposed Graves.In communications with co-conspirators, Graves told them he could not adjust grades too significantly. Last spring, Kansas University suspended a student for a similar scheme. The unnamed student not charged used a related hardware keylogger to steal professors’ login credentials and modify grades. That student changed F upgrades to A grades and was caught almost immediately, a reason why Graves’ scheme lasted for 21 months.Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "November 5, 2017", "authur": "Eslam Medhat", "title": "Fake WhatsApp On Google Play With Over 1 Million Downloads", "body": "Attackers were able to fool over 1 million Android users into installing a fake version of the popular messaging application WhatsApp acting to be the official one. The application has been deleted from Google Play Store.It was called “Update WhatsApp Messenger”, created by a developer who acted to be the actual WhatsApp service with the developer title “WhatsApp Inc.”, which is the same title the original WhatsApp messenger uses on Google Play store.The fake app was found by Redditors, and the app looks very much like the real one. But, when opened, it seems to download and run the real WhatsApp Android client albeit with ads wrapped around it.One Redditor said:\n“I’ve also installed the app and decompiled it, the app itself has minimal permissions (internet access) but it’s basically an ad-loaded wrapper which has some code to download a second apk, also called ‘whatsapp.apk.’ The app also tries to hide itself by not having a title and having a blank icon.”The fake app has been removed from the official Play Store, it is unclear if this app infected users with a malware or only show ads.Users are recommended to be more careful while installing apps not only from the third-party app store but also from the official Play Store in order to secure themselves."}, {"topics": ["Hacking News"], "date": "November 3, 2017", "authur": "Eslam Medhat", "title": "Hackers are using Google search results to spread banking Trojan", "body": "Cybercriminals decided to use the Search Engine Optimization (SEO) to make their malicious links more widespread in the search results, allowing them to gain more victims with the Zeus Panda banking Trojan.This Zeus Panda group determined to use a group of hacked websites to insert keywords in new pages or hide the keywords inside existing pages.SEO-malvertising Zeus Panda distribution campaign has been discovered by Cisco Talos, the company also released a report with technical details about the distribution campaign.According to Cisco Talos:\n“The overall configuration and operation of the infrastructure used to distribute this malware was interesting as it did not rely on distribution methods that Talos regularly sees being used for the distribution of malware,”The attackers are using compromised business websites that have earned ratings and reviews, they could make the results appear more legitimate to users (victims), as can be seen by the star/rating presented beside the results in the search engine result pages.Victims clicking on these links in the results would arrive on the compromised website, then a malicious JavaScript code would execute in the background and forwarded the victim through a list of websites until he reached a website that offers a Microsoft Word document for download."}, {"topics": ["Hacking News"], "date": "November 2, 2017", "authur": "Eslam Medhat", "title": "Hackers Hijack Ethereum OS Miners Using Default SSH Credentials", "body": "Bogdan Botezatu (security researcher from Bitdefender) has identified that their SSH (Secure Shell) honeypots detected a bot trying to modify the system configuration to hijack funds from Ethereum mining equipment.If you are in the business, I assume that you know of an operating system called EthOS that is optimized for Ethereum mining. EthOS operating system can mine Ethereum, Zcash, Monero and other crypto-currencies that use GPU power. According to its developers, EthOS runs on more than 38,000 mining rigs over the world.Honeypot logs showed massive scans for the entire IPv4 range that are looking for open SSH connections. If detected, it tries to log in using the default username and password to the EthOS operating system: ethos:live and root:live.According to Bitdefender:\nIf the login succeeds, it tries to change the existing configuration for Ethereum to hijack the mining process to the attacker’s Ethereum address. The wallet in this case (0xb4ada014279d9049707e9A51F022313290Ca1276) shows 10 transactions over the past days worth a total of $611 in Ether.If you are using a cryptocurrency miner based on EthOS OS, make sure you have changed the default login credentials."}, {"topics": ["Hacking News"], "date": "November 2, 2017", "authur": "Eslam Medhat", "title": "CryptoShuffler malware made over $150,000 worth of Bitcoin", "body": "The CryptoShuffler malware has been discovered by security researchers from Kaspersky Lab, cybercriminals are using this malware to steal cryptocurrencies from the victim’s wallet by replacing their address with its own in the devices.The malware remains idly on victims’ machines, waiting for a Bitcoin transaction then substitute any string that seems like a Bitcoin wallet with the attackers’ address.As a result of this, the victim transfers the funds directly to the cybercriminals, unless a mindful user detects the sudden replacement.According to the researchers:\n“The Trojan begins by monitoring the infected device’s clipboard. Users utilize this software facility when making a payment: they copy a recipient’s walled ID number and paste it into the “destination address” line in the software they are using to make their transaction. What they don’t know is that the Trojan then replaces the user’s wallet address with one owned by the malware creator”The malware’s ability to substitute a destination actually takes milliseconds because it’s very simple to search for wallet addresses, cryptocurrency wallet addresses have the same start and a specific number of characters.Kaspersky Lab recommends users to give close attention to transactions, and always check the wallet address listed in the ‘destination address’."}, {"topics": ["Hacking News"], "date": "October 31, 2017", "authur": "Eslam Medhat", "title": "A new Facebook phishing targeted iOS and Android users", "body": "A new Facebook spam campaign has been detected by F-Secure security researchers, the campaign attracting users to phishing pages that attempt to fool users into giving over Facebook or YouTube credentials. The spam campaign has been going on for 14 days and has slowly moved from one country to the other.The hackers posted shortened links on Facebook pages using the user’s account, but they also spammed the victim’s friends via direct Facebook Messenger messages.According to the researcher:\n“Based on the data from the links, the campaign began last October 15th when it targeted mostly Swedish users. On the 17th, it moved to targeting Finnish users. Then from 19th onwards, it mostly went after German users.”The entire number of clicks for the whole campaign reached about 200,000, and about 80% of the users were from Germany, Sweden, and Finland.The spammed content seemed to be a link to a YouTube video, the hackers tricked Facebook’s URL previewing system into displaying the wrong link info by forging metadata. The complete technique has been explained by a security researcher Barak Tawily in a blog post here.Android users and iOS users were redirected to a phishing page, and other users were redirected to a website that loaded ads.F-Secure researchers highly recommend the affected users to change their passwords as soon as possible, also change their passwords on other systems and services where the same compromised password was used."}, {"topics": ["Hacking News"], "date": "October 30, 2017", "authur": "Eslam Medhat", "title": "Trend Micro researchers found miners in Android Apps on Google Play", "body": "Trend Micro researchers have discovered that there are some applications with malicious cryptocurrency mining abilities on Google Play. These apps used dynamic JavaScript loading and native code injection to evade detection. They identified these apps as ANDROIDOS_JSMINER and ANDROIDOS_CPUMINER.Two apps have been discovered; one seemingly helps users pray the rosary, while the other app gives discounts of various kinds. Both apps are now removed from the official Play Store, and are named “Recitiamo Santo Rosario Free” and “SafetyNet Wireless App.” The two applications use a copy of the Coinhive miner inside a hidden WebView browser.According to TrendMicro:\n“Both of these samples do the same thing once they are started: they will load the JavaScript library code from Coinhive and start mining with the attacker’s own site key. This JavaScript code runs within the app’s webview, but this is not visible to the user because the webview is set to run in invisible mode by default.”The main issue here is that these applications do not request permission to do so, and cryptocurrency mining operation will definitely lead to the device overheating, a shortened battery life, reduced performance, and a common wear and tear on the device’s physical state.In fact, these threats show us how even mobile devices can be targeted for cryptocurrency mining activities."}, {"topics": ["Cyber Attack", "Hacking News", "SPY"], "date": "October 29, 2017", "authur": "Mandee", "title": "Famous Dark Web Thief Phishkingz Threatened to Finally Be Unmasked", "body": "It was recently discovered through a Reddit post that the notorious Phishkingz Dark Web user has finally had a taste of his own medicine. Another fellow user, who goes by the online pseudonym InsanityDRM, has made a Reddit post claiming to know the true identity of the ultimate scammer Phishkingz.Known for his boasting on Reddit, Phishkingz has proudly been stealing and humiliating Dark Web marketplace users for a number of years. He operates by creating copies of well known Dark Web marketplaces in order to trick users of the original websites into logging into the site to obtain their usernames and passwords.After obtaining their info, Phishkingz then goes to the original Dark Web marketplace where the user has their true account and proceeds to log in so that he can empty their account of any and all currency. This thief has bragged about the claim that he has been able to steal at least one million dollars through his phishing operation.Up until now Phishkingz has been operating very successfully and constantly posts on Reddit in order to boast about his activities. “He” even goes as far as to humiliate those he has stolen from using his Reddit posts as a platform. InsanityDRM has an obvious vendetta against Phishkingz and has somehow, presumably, acquired his personal information in order to unmask the phisher once and for all.It is unknown whether this is a true threat or not and no one knows how Phishkingz is truly reacting to the current situation. However, it is quite obvious that there are many current and former Dark Web users that will be very interested in the unmasking of this intelligent phisher. Hopefully, there will be legal action on some part in the process."}, {"topics": ["Hacking News"], "date": "October 29, 2017", "authur": "Eslam Medhat", "title": "The Matrix Ransomware has risen again!", "body": "Security researcher (Jérôme Segura) from Malwarebytes has found that Matrix Ransomware has risen again and it is now being distributed through the RIG exploit kit.The Matrix Ransomware was first spotted in 2016 by Palo Alto Networks researchers, since then the malware had slowly faded until these days.The Matrix Ransomware exploit vulnerabilities in Internet Explorer (CVE-2016-0189) and flash (CVE-2015-8651). For the user to become infected, the user only requires to visit a website that includes malvertisements using a vulnerable machine and they will become infected with the ransomware.When a machine is infected with the latest version of the Matrix Ransomware, the malware will encrypt all the files on the user’s computer, change the file names, and add the [email protected] extension to the file name.Then the ransomware will leave ransom notes named “#_#WhatWrongWithMyFiles#_#.rtf” in with the encrypted files. In the end, it will present a ransom screen that provides data on what has occurred to the files.Users are recommended to install all available security updates for their installed programs and operating system to become secure."}, {"topics": ["Cyber Attack", "Did you know ?", "Hacking Challenges", "Hacking News", "Vulnerabilities"], "date": "October 27, 2017", "authur": "Mandee", "title": "Major Botnet ‘Reaper’ Discovered: Huge Cyber Shut Down is Coming", "body": "Experts have recently discovered a major new botnet hackers have created and named Reaper. Similar to another event that took place in 2016, hackers created and initiated a major cyber shut down of the internet using a botnet called Mirai. When hackers activated the Mirai botnet, they were able to quickly shut down the internet on the entire east coast.Since botnets have been successful in the past, the discovery of this new, much larger Reaper botnet, is a very real threat indeed. Experts immediately sent out official statements warning the public of the possibility that this botnet has the ability to wipe out the internet on a much larger scale than it’s predecessor. All of the data collected on the discovery backs up their claims immensely.A botnet is a series of devices that have been hacked and remain hacked but unknown to the owner as nothing has happened in order to bring it to their attention. Devices mainly include smart webcams, WI-FI routers and other smart devices in both the home and at businesses.Experts warn the public that it is imperative that they keep their smart devices and routers fully updated and patched in order to avoid being hacked and effectively controlled. Many believe that this is the “calm before the storm” and the hackers are currently up and running with enough hacked devices to be very successful.Through researching, an Israel based cyber security company called Check Point and their IPS (Intrusion Prevention System), started noticing a huge increase in hacking attempts. Notable smart devices and routers include Synology, GoAhead, Linksys, AVTECH, D-Link, MikroTik, TP-Link and NETGEAR, among others.Check Point made many suggestions: businesses should take certain devices offline and to prepare for DDoS attacks. Owners of residential smart devices will benefit from the same suggestions as well."}, {"topics": ["Hacking News"], "date": "October 27, 2017", "authur": "Eslam Medhat", "title": "LokiBot trojan turns itself into ransomware if you decide to remove it", "body": "Security researchers from SfyLabs have detected an Android banking trojan dubbed LokiBot that transforms itself into a complete ransomware once the targeted user attempts to uninstall it from the infected device.LokiBot malware has been in the news since June and its makers have been pushing out new features almost every week.Once the malware infects an Android device, it begins displaying overlay screens on top of banking and other common applications in an attempt to fool users into handing over their data. The malware targets about 100 banking apps and popular applications such as WhatsApp, Skype and Outlook.According to researchers:\nLokiBot, which works on Android 4.0 and higher, has pretty standard malware capabilities, such as the well-known overlay attack all bankers have. It can also steal the victim’s contacts and read and send SMS messages. It has a specific command to spam all contacts with SMS messages as a means to spread the infection.The researchers also said that the malware has an option to lock the phone preventing the user from accessing it. It does that by locking the infected device, encrypting all of its files and asking for a ransom of $70 – $100 in Bitcoin within 48 hours.Users are recommended not to install third-party apps or useless apps on their device."}, {"topics": ["Hacking News"], "date": "October 25, 2017", "authur": "Eslam Medhat", "title": "Ethereum phishing attack that earns $15K in two hours", "body": "Wesley Neelen (security researcher) has received a phishing email that seems to be from the legal online Ethereum wallet site Myetherwallet.com.Cybercriminals are trying to get the login credentials for all type of accounts through phishing emails. By tricking possible victims to enter their username and password on a fake website (legitimate-looking), the attackers are able to obtain to confidential data and/ or financials for their personal gain.According to the phishing e-mail:\n“We have pushed an update that allows smooth sailing for all the MyEtherWallet users in the process of the upcoming hard fork. To make use of this update we request all users to sign in to their MyEtherWallet accounts and synchronize their wallets for continuous undisturbed use of our services.”This scam states that Myetherwallet implemented an update and that they want users to click on an embedded link, unlock their account, and confirm their balances.If someone clicked on the link they would be taken to a website that seemed identical to the legitimate Myetherwallet.com site. Users also may have seen something strange, which is a small comma underneath the letter “t” in the address bar. The attackers used a Unicode trick that enables them to register domains that contain Unicode characters that look very similar to Latin characters.If someone wrote their wallet password, the attackers would use this password to access the victim’s wallet and send the coins to their own wallet."}, {"topics": ["Hacking News"], "date": "October 25, 2017", "authur": "Eslam Medhat", "title": "An unknown hacker was able to hijacks CoinHive’s DNS to mine Cryptocurrency", "body": "An unknown hacker has hijacked Coinhive’s DNS server and modified the legitimate Coinhive JavaScript in-browser miner with a malicious one that mined Monero currency for the hacker’s wallet.Many users were frustrated that The Pirate Bay had combined the Javascript-based Monero cryptocurrency miner without their approval. But, it didn’t take long for users to see the possible benefits, with many other sites that have added the miner in the hope of creating extra revenue.Coinhive said that on Monday night its DNS records maintained at Cloudflare were accessed by an unknown hacker, providing the hacker to redirect user mining traffic to a server they controlled.Acccording to Coinhive:\n“Tonight, Oct. 23th at around 22:00 GMT our account for our DNS provider (Cloudflare) has been accessed by an attacker. The DNS records for coinhive.com have been manipulated to redirect requests for the coinhive.min.js to a third party server.”The company said that no user account data was leaked and that the website and the database servers were uncompromised.Coinhive is a web service that started in mid-September and enables website owners to load a JavaScript file on their websites and mine Monero coin using the users’ CPU."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Vulnerabilities"], "date": "October 24, 2017", "authur": "Mandee", "title": "Cyber Crime is on the Rise in Australia", "body": "The Australian Cyber Security Center has released a report that shows just how much more cyber crimes are being committed than in previous years. Australian authorities have found that there has been an increase of 16% in 2017 when compared to 2016. Cyber criminals are taking advantage of the digital era and their methods are getting extremely sophisticated.While people are more aware of would-be scams and phishing attacks than ever before, the criminals have taken it to a new level. Saying that they’ve changed the game would be an understatement. Many criminals have taken to targeting businesses instead of individuals. Several occasions, according to the ACSC, cyber criminals were able to scam businesses via email fraud.Companies received fraudulent invoices from what they thought were other companies they currently do business with. Not knowing it was a fake, they followed through with paying the fraudulent invoice, thus completing the scam. They never even know that they were successfully scammed until they are notified of an unpaid invoice by the other, actual business.There are tons of different ways to suffer a cyber attack and the professionals are working tirelessly to combat the crimes. Australian authorities have formed numerous task forces over the years that are dedicated to cyber security. Some focus on the online drug and weapons trades, while others target scam attacks and hackers.Businesses throughout Australia continue to report attacks they experience to authorities but many are beginning to complain that not much is being done about them. In many cases, companies file their complaint with authorities and never hear anything back. This doesn’t actually mean authorities are ignoring the cases as they are most likely using the information from the incidents in a different manner to catch said criminals."}, {"topics": ["Hacking News"], "date": "October 21, 2017", "authur": "Eslam Medhat", "title": "Eltima Website Has Been Hacked!", "body": "ESET security researchers found that the website of Eltima, the makers of the Elmedia Player software, has been hacked and spreading a version of their application trojanized with the OSX/Proton malware on their official website. The malware research company (ESET) informed Eltima as soon as the situation was confirmed.Elmedia Player is a very popular media player that reached the 1 million users milestone this summer.According to Eltima:\n“On the 19th of October 2017 we were informed by a malware research company ESET that our servers have been hacked and our apps namely Folx and Elmedia Player DMG files are distributed with a malware.”An attacker can use Proton which is a very powerful malware to collect different data from infected hosts, such as operating system details, browser passwords, cookies, history, data on cryptocurrency wallets, SSH private keys, macOS keychain data, VPN configs, GnuPG data, 1Password data, and much more.ESET security researchers advise users who downloaded Elmedia Player or Folx software lately to check if their system is compromised by testing the existence of any of the following file or directory:\n– /tmp/Updater.app/\n– /Library/LaunchAgents/com.Eltima.UpdaterAgent.plist\n– /Library/.rand/\n– /Library/.rand/updateragent.app/If any of them exists, that means the trojanized Elmedia Player or Folx app was executed and that OSX/Proton is most likely running.“If you have downloaded that software on October 19th before 3:15pm EDT and run it, you are likely compromised.”"}, {"topics": ["Cyber Attack", "Hacking News"], "date": "October 21, 2017", "authur": "Eslam Medhat", "title": "Attackers are mass-scanning websites for directories holding SSH private keys", "body": "Attackers are mass-scanning websites for directories holding SSH private keys so they can hack into websites with any unintentionally exposed credentials.SSH (Secure Socket Shell) is a program created to allow users to log into another computer over a network, to execute commands on that computer and to move files to and from that computer.The SSH authentication could depend on login credentials (username and password), or on a “key-based” authentication. When using key-based auth method, users generate an encryption key combination, a public and private key. The public key is stored on the server that users want to connect to it. The private key is stored by the users in a local SSH configuration directory on the server.According to Wordfence:\n“In the past 24 hours, we have seen a new attacker start mass-scanning websites for private SSH keys,”\n“If your private SSH key ever gets out, anyone can use it to sign in to a server where you have set up key-based authentication. It is very important to keep your private key safe.”Cybercriminals are mass-scanning the web searching for web directories holding the words, or mixtures of words, such as “root,” “ssh,” or “id_rsa.”Server administrators are recommended to check if they haven’t unintentionally uploaded their SSH private key on their public servers."}, {"topics": ["Hacking Challenges", "Hacking News", "News", "Vulnerabilities"], "date": "October 18, 2017", "authur": "Mandee", "title": "Cyber Crime Group Charges Man for Major Identity Theft and Fraud Crimes", "body": "Queensland Cyber Crime Police made a major arrest of a 25 year old man and has charged him with more than 100 identity theft and fraud crimes. It was found that the Pine Rivers man had opened numerous bank accounts, 42 to be exact, and was able to steal 54 TFNs in order to file income tax returns and receive the subsequent tax refunds.Authorities found that the man had used an online, self preparation tax service called myTax. The tax preparation service is still considered secure to it’s users because law enforcement doesn’t believe the Pine Rivers man acquired any of the stolen information from the website itself.As the investigation continues, authorities hope to uncover how, or at least where, the man came to obtain the stolen information but for now they aren’t quite sure. Australia has been working tirelessly to combat cyber crime through various methods including the organizing of task forces and implementing better security features.The ATO, or the Australian Taxation Office, issued a statement condemning criminals of this nature. Not only does identity theft and fraud of this nature affect government departments but it also hurts the public because it is tax payer money after all. The ATO continued to inform the public to always keep their PIN numbers and other sensitive information as secure as possible in order to avoid having it stolen.Tax fraud is a very serious crime and it is believed that the courts will not go easy on this guy. He will get his day in court later this month on October 23, 2017 but the odds are certainly not in his favor. The public hopes to see more arrests like this arise from dedicated task force operations in the future and authorities are confident they will see plenty."}, {"topics": ["Hacking News", "News", "SPY", "Vulnerabilities"], "date": "October 18, 2017", "authur": "Mandee", "title": "Popular Adult Website found Infected with Malvertising Software", "body": "It’s hard to keep track of the slew of malware, scams, phishing, and other deceptive internet practices in the world we know today. Cyber security researchers from the firm called Proofpoint have recently discovered malicious advertising activities on Pornhub.Pornhub did take immediate action upon Proofpoint’s finding of the malware and has since taken measures to better protect against future attacks. Users experienced a pop-up saying they needed to download a required update in order to continue their current browsing. Sadly, millions of users took the pop-up as legitimate and became infected after the download.It affected the very popular browsers including Microsoft Edge, Internet Explorer, Firefox and Chrome. The distributing of the malvertising software was complete once the user downloaded and installed the fake update, oblivious to what it was about to do to their system.Similar malvertising infections have been operating on various other websites and continues to infect users today. Word to the wise: don’t download and install software just because an official looking window pops up telling you to. The group responsible for initiating the malware into the website’s coding calls themselves KovCoreG.KovCoreG has been hacking sites and distributing malicious ad campaigns for quite some time now. Their main goal seems to be gaining revenue through click fraud but the Kovter malware the group has been distributing has the potential to be far more dangerous to both online businesses and their users.It’s quite clear that the Kovter malware, if one were to modify it to do so, can become much more aggressive and able to steal personal data or even take control of one’s computer etc. The attackers were able to use various filters to cover their tracks and continue to remain active in the distributing of the Kovter malware."}, {"topics": ["Hacking News", "News", "Tech"], "date": "October 18, 2017", "authur": "Mandee", "title": "Federal Courts Rule that iPhone Cracking Secret can be kept by FBI", "body": "A final ruling has been handed down on a case that originated in 2015 and involved the FBI’s questionable tactics in the securing of information on the San Bernardino Shooter’s iPhone. The FBI had exhausted every method of trying to break the iPhone’s security but, even with Apple’s assistance, all methods were unsuccessful.Initially, the FBI ended up filing a lawsuit against Apple. They claimed that Apple should be forced to create a mandatory security update for iPhones that removed the security features keeping them from unlocking the phone. However, they suddenly dropped their claims due to the finding of an alternative method for the unlocking of the phone in question.In turn, the FBI had decided to reach out to other sources of a more debatable nature in order to solve the problem. This method was successful and the FBI finally had the iPhone “cracked” allowing them to review and retrieve the shooter’s iPhone activities.Since the iPhone was officially cracked for authorities, other entities of the media quickly became involved. Claiming that the FBI was in violation of the Freedom of Information Act by not allowing the public to see the shooter’s iPhone data, a lawsuit was filed against them. Media agencies headlining the lawsuit included Vice, USA Today and the Associated Press.Finally, in October of this year, a federal judge ruled in favor of the FBI and has allowed them to keep the recovered data, and the identity of the successful iPhone cracker, a secret.While it certainly is important to protect sources of a specific nature in all corners of the law, many are still shaking their heads. A good example would be the fact that a similar situation occurred in recent times during Operation Pacifier where a pedophile was allowed to go free on a technicality and no one was happy with that."}, {"topics": ["Hacking News"], "date": "October 17, 2017", "authur": "Eslam Medhat", "title": "ATM malware is being sold on Dark Web market that can make ATMs drain available cash", "body": "In May 2017, Kaspersky security researchers have noticed a forum post advertising ATM (Automated teller machine) malware that was targeting specific vendor ATMs.The malware has been sold on the AlphaBay Dark Web marketplace since May 2017, but today, its administrators started a new standalone website after US authorities had taken down AlphaBay in mid-July.The cost of the toolkit was 5000 USD at the time of the research. The AlphaBay description covers details such as the needed tools, targeted ATMs vendors, as well as tips and tricks for the malware’s operation.The list of crimeware contains in the toolkit includes:\n– Cutlet Maker—ATM malware which is the main component of the toolkit.\n– Stimulator—an app to gather cash cassette statuses of a targeted ATM\n– c0decalc—a simple terminal-based app to generate a pass for the malware.According to Kaspersky:\n“This type of malware does not affect bank customers directly, it is intended for the theft of cash from specific vendor ATMs. CUTLET MAKER and Stimulator show how criminals are using legitimate proprietary libraries and a small piece of code to dispense money from an ATM. “The Cutlet Maker malware has been written in Delphi, and its name originates from the Russian language."}, {"topics": ["Cyber Attack", "Did you know ?", "Hacking News", "Vulnerabilities"], "date": "October 16, 2017", "authur": "Mandee", "title": "Major Security Breach in India, Data being Sold on Dark Web", "body": "Recent reports have stated that India businesses and their National Internet Registry suffered a cyber attack resulting in the theft of more than 6000 pieces of sensitive information. Impacted by the cyber attack were roughly 6000 India based businesses and authorities are completely clueless as to who the attacker actually was.Quick Heal, an information technology security firm, and it’s subsidiary Seqrite, made the discovery of the breached information being found on the Dark Web up for sale. Information stolen included that from several businesses: banks, various service providers and government departments.The NIXI, National Internet Exchange of India, was also involved in the breach but data stolen from them was minor, if that. An official statement released by NIXI concluded that thanks to their security system and thorough anti-cyber attack protocols they were able to stop the attack before much damage was done.NIXI also stated that the breach is not considered major and the only data stolen by the hacker was basic, at best, such as non-sensitive contact information of a few individuals involved with NIXI administrators. The hacker was unable to steal any data of real value thanks to the security protocols in place.All appropriate government and law enforcement departments were quickly contacted as soon as the breach was detected. The sale of the information on the Dark Web is being handled by professionals in order to stop any of it from being sold. If sold to an individual with devious intentions, the involved businesses may, in fact, suffer.Many are calling into question India’s ability to protect their own systems from cyber attacks such as this. Subsequently, all appropriate departments are working tirelessly to find the bugs and fill the gaps in security to better combat any future hacking attempts. In a digitized world, we need to start being on top of things. "}, {"topics": ["Did you know ?", "Hacking News", "Tips And Tricks", "Vulnerabilities"], "date": "October 16, 2017", "authur": "Mandee", "title": "Latest Facebook Scam: Know How to Keep Your Account Safe", "body": "Facebook hacking isn’t anything new but the hackers are always one step ahead of the game with their ever-changing methods. The newest way hackers have been compromising accounts and even outright stealing them is to claim you are a “Trusted Contact” and that they need your help getting back into their own account.Attackers are essentially abusing Facebook’s “Trusted Contact” feature in order to take control of your account. An actual friend can attempt the scam themselves as well but the majority of the hacks have come from accounts that were previously hacked.While the “Trusted Contact” feature has many great qualities to it when you truly lose access to your own account, you can protect yourself from the scam with a few simple tips. It is suggested that if you receive such a request, make sure to contact the friend directly: either face to face or on the phone.Doing so will help you to be sure it truly is the real person making the request or not. No one wants to have their Facebook account compromised for fairly obvious reasons so protecting yourself and your account is pretty important. Another way to avoid this latest Facebook scam is to stay on your game and pay attention. Don’t just blindly go along with a “Trusted Contact” request without being absolutely sure it’s the real deal.So far, the majority of those experiencing these hacks have been located in North Africa and the Middle East. Also, the scams seem to be targeting well known people involved with human rights defense and alike but that certainly doesn’t mean it can’t affect you.In the end, simply pay attention and don’t follow through with any “Trusted Contact” request if you aren’t completely sure it’s really your friend sending it. Your account will remain secure and everyone’s happy, except for the would-be hacker of course!"}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "date": "October 16, 2017", "authur": "Harikrishna Mekala", "title": "WPA2 Encryption Can Now be hacked With New KRACKS method", "body": "Security Researcher Mathy Vanhoef of Imec-DistiNet discovered a weakness within the WPA2 protocol, potentially affecting all the wireless routers supporting WPA2, An attacker can take advantage of this vulnerability by using key re-installation attacks (KRACKS).The attack can be used to intercept passwords, Emails, chat messages and even your credit card Information. Consider if your network is not configured properly the attacker can inject ransomware and other malware into the Web sites you visit.He says that the weakness is in the Wi-Fi Standard itself even though if your router is perfectly configured you will be affected by this attack. Mathy suggests updating the Router’s Firmware when the Vendor issues the Updates to your Router.“Note that if your device supports Wi-Fi, it is common that it is affected. During our initial research, we learned ourselves that Android, Linux, Apple, Windows, OpenBSD, MediaTek, Linksys, and others, are all affected by some modification of the attacks. For more data about specific products, consult the database of CERT/CC, or contact your vendor.”In the research paper, he explains the attack as “exceptionally destructive” against Android 6.0.“Because Android uses wpa_supplicant, Android 6.0 and above further contains this vulnerability. This presents it trivial to hijack and manipulate traffic sent by these Linux and Android devices,” he addresses on the Krackattacks site explaining the flaw. “Note that currently, 41% of Android devices are exposed to this exceptionally devastating variant of our attack.”He also says that attacks on MacOS and OpenBSD are easier to execute although we agree that some of the attack scenarios in the paper are rather impractical, do not let this fool you into believing key re-installation attacks cannot be abused in practice.Vanhoef further explains how the attack can still work against Web Apps and native Apps that are using HTTPS, explaining how this added encryption layer can be avoided in what he describes as a worrying number of conditions he flags multiple prior instances of HTTPS being avoided “in non-browser software, in Apple’s iOS and OS X, in Android apps, in Android apps again, in financial apps, and even in VPN apps.He also made a Proof-Concept-Video of the Attack. Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "October 15, 2017", "authur": "Eslam Medhat", "title": "Over 500 million people have been affected by Cryptocurrency mining without their knowledge", "body": "According to a report published by Adguard, some websites had been making money by mining cryptocurrencies in their users’ browsers since the disclosure about The Pirate Bay.Bitcoin or Ethereum are some examples of cryptocurrencies that can be mined and collected through computation. When a website that is mining cryptocurrency is visited, there is an unusual surge in the CPU usage, which can show to be profitable for website owners because when a huge number of computers donates their powers, the mining is successful in earning profits.JSEcoin and CoinHive are the two most popular and common libraries that are used to mine cryptocurrency using user’s PCs.According to Adguard:\nWe found 220 sites that launch mining when a user opens their main page, with an aggregated audience of 500 million people. These people live all over the world; there are sites with users from the USA, China, South American and European countries, Russia, India, Iran… and the list goes on. 220 sites may not seem like a lot. But CoinHive was launched less than one month ago, on the 14th of September.Adguard said that the websites made a joint profit at over US $43,000. Yes, it’s not millions, but this money has been made in three weeks at almost zero cost."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "date": "October 15, 2017", "authur": "Harikrishna Mekala", "title": "Most of the ships connected to the Internet are Hackable", "body": "A convention in Athens, Greece, Munro detailed some of the appalling security lapses Pen Test Partners found while investigating naval ships that had things exposed online.His study focused on using basic tools, known by all intelligent security researchers, but also threat actors alike.Just by using Shodan, a search engine that recognizes anything connected to the Internet, Munro obtained ship equipment all over the world, but sadly, not all of it was correctly configured.Some of the most delicate equipment he found were satellite antennas positioned on ships to provide throughout the clock radio, Internet, GSM, and other communications.One such design was the Cobham Sailor 900, for which exists a known exploit that makes hacking it a child’s play for any knowledgeable attacker.In many cases, the exploit wouldn’t even be required, as the equipment used the same default password admin/1234 as both Munro and French security researcher X0rz have led out.The bad story is that these antennas aren’t only located on ships, but also helicopters and airplanes. In extension, you won’t only see these wires on container and passenger ships, but also on navy and private security boats.Some things failed harder than othersOther things that Munro found incorrectly configured and displayed online include Globe Wireless satellite antennas or KVH CommBox private network terminals.Both handled logins via HTTP, but effective was CommBox, which also dripped the vessel’s name on the login page, and even had a switch that listed all active users, providing an attacker access to the titles of all of the ship’s crew.Furthermore, an intruder could get in-depth aspects of the private system just by hovering the mouse over some elements on the login page. Such items should have been located behind the login page, and not on it.There have been no recorded incidents of ship satcom hacking until now, but this is only a circumstance of time.So far, some obscure malware authors didn’t apprehend what they were doing and ended up establishing remote access trojans on some satcom systems.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "October 15, 2017", "authur": "Harikrishna Mekala", "title": "TransUnion a company similar to Equifax is also redirecting it’s users to Fake Website", "body": "As News reported late Wednesday night, a division of Equifax’s website was redirecting guests to a page that was passing fraudulent Adobe Flash updates. When clicked, the files affected visitors’ machines with adware that was recognized by only three of 65 antivirus providers. On Thursday afternoon, Equifax executives said the mishap was the result of a third-party service Equifax was using to get website-performance data and that the “vendor’s code working on an Equifax website was accepting malicious content.” Equifax originally shut down the affected portion of its site, but the organization has since restored it after eliminating the malicious content.Now, Malwarebytes security researcher Jérôme Segura says he was capable to repeatedly generate a similar chain of fraudulent redirects when he showed his browser to the transunioncentroamerica.com site. On some events, the final link in the chain would push a fake Flash update. In other examples, it delivered an exploit kit that decided to infect computers with unpatched browsers or browser plugins. The attack series remained active at the time this post was going live.“TransUnion is aware that our Central America website was briefly redirecting users to download malicious software. The issue has happened to be fixed and we are browsing our other websites. TransUnion has not known any unauthorized access to its systems as a result of this issue.”The general thread tying the affected Equifax and TransUnion pages is that both entertained fireclick.js, a JavaScript file that appears to request the service serving the malicious content. When called, fireclick.js pulls content from a long chain of pages, beginning with those hosted by akamai.com, sitestats.com, and ostats.net. Depending on the visitors’ IP address, browsers ultimately wind up attending pages that deliver a fake survey, a fake Flash update, or an exploit kit.Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "October 14, 2017", "authur": "Eslam Medhat", "title": "Equifax website has been hacked and redirected users to fake flash update!", "body": "A security researcher (Randy Abrams) found newly that an Equifax service (aa.econsumer.equifax.com) created for getting free and discounted credit reports had been redirecting users to sites offering a fake Flash Player installer to serve adware and scams.According to the researcher:“As I tried to find my credit report on the Equifax website I clicked on an Equifax link and was redirected to a malicious URL. The URL brought up one of the ubiquitous fake Flash Player Update screens.”Equifax has suffered a breach of huge proportions before this cyber incident when an attacker was able to get access to the company’s servers through an unpatched Apache Struts installation and was able to steal over 145 million user records and other data.Attackers were redirecting customers depending on the kind of device and their geographic location, for instance, Android and iOS devices were served with false updates, premium SMS services, and other false websites.The company confirmed the issue and said that the IT and security teams are looking into this matter, and out of an abundance of caution have temporarily taken this page offline."}, {"topics": ["Hacking News"], "date": "October 13, 2017", "authur": "Eslam Medhat", "title": "Be careful! They can hack your Facebook account through new phishing scam", "body": "Security researchers from AccessNow have discovered a new Facebook phishing scam that can also fool a professional technical user into falling victim to this scam and helping attackers to get access to your Facebook account.The new scam is using a Facebook account recovery feature called “Trusted Contact”— which sends secret codes to some of your close friends in order to help you recover your Facebook account in case you forget your password or it has been hacked.According to researchers:\nHere’s how the attacker attempts to exploit your trust in order to extract the information needed to steal your account:– You get a message from an attacker on Facebook Messenger, who is using the compromised account of someone on your Friends list.\n– The attacker asks for your help recovering their account, explaining that you are listed as one of their Trusted Contacts on Facebook, and tells you that you will receive a code for recovering their account.\n– Then the attacker triggers the “I forgot my password” feature for your Facebook account and requests a recovery code.\nIn an effort to help, you send the code you’ve just received to your “friend.”\n– Using the code, the attacker can now steal your account from you, and use it to victimize other people.This new scam targets Facebook users and relies on your lack of knowledge about the “Trusted Contacts” option.To secure your Facebook account, you are always recommended to be careful to each recovery emails you get, and read the recovery message or email correctly, even if it is sent by one of your real friends."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "October 13, 2017", "authur": "Harikrishna Mekala", "title": "Equifax’s Website got Hacked Again", "body": "Randy Abrams, an independent security analyst by day, followed to visit the site Wednesday night to check what he said was false report he had just found on his credit report.He was naturally incredulous. The site that earlier gave up personal data for practically every US person with a credit history was once repeatedly under the influence of attackers, this point trying to trick Equifax visitors into installing crapware Symantec calls Adware.Eorezo. Understanding a thing or two about drive-by campaigns, Abrams figured the possibilities were slim he’d see the download on follow-on visits. To fly below the radar, attackers frequently serve the downloads to only a select amount of visitors, and then only once.Abrams tried anyway, and to his surprise, he encountered the bogus Flash download links on at least three subsequent visits. The picture above this post is the higher-resolution screenshot he captured during one visit. He also posted a video. It shows an Equifax page redirecting the browser to at least four links before finally beginning the Flash download at the same centerbluray.info page.The file that got saved when Abrams clicked through is called MediaDownloaderIron.exe. This VirusTotal entry shows only Panda, Symantec, and Webroot showing the file as adware. This separate malware study from Payload Security dispenses the code is extremely obfuscated and takes pains to hide from reverse engineering. Malwarebytes hailed the centerbluray.info site as one that promotes malware, while both Eset and Avira provided similar malware alerts for one of the intermediate websites, newcyclevaults.com.It’s not yet clear exactly how the Flash download page got displayed. The group-sourced study here and this autonomous assessment from researcher Kevin Beaumont both offered in the hours, make a strong case that Equifax was operating with a third-party ad network or analytics provider that’s bound for the redirects.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "October 13, 2017", "authur": "Harikrishna Mekala", "title": "The Design of F-35 Joint Strike Fighter has been stolen by the Hackers", "body": "The hackers obtained “full and unfettered access” to the data for four months last year, before the Australian Signals Directorate was known about the breach in November.Christopher Pyne, the defense enterprise minister, has revealed he has no idea who the hackers were but has emphasized the stolen information was commercially sensible rather than “classified” military information.“It could be one of a many of different Hackers,” Pyne told the ABC on Thursday. “It could be a state Hacker, a non-state Hacker.”Mitchell Clarke, the Australian Signals Directorate conflict response manager, told the audience in Sydney on Wednesday the hackers had targeted a small “mum and dad type business”, an aerospace manufacturing company with about 50 employees, in July last year.He said the firm was subcontracted four levels down from defense contracts.“The bargaining was extensive and extreme,” he told the Australian Information Security Association national conference in audio received by a freelance journalist called Stilgherrian.“It included data on the F-35 joint strike fighter, C130 Hercules aircraft, the P-8 Poseidon surveillance aircraft, joint direct charge munition JDAM smart bomb kits and a few naval vessels.”He said the data hacked on the new navy ships involved a diagram in which you could zoom in down to the captain’s chair and see that it was one meter apart from the navigation chair.Clarke explained the security breach as “sloppy admin”. The organization targeted was a small aerospace manufacturing firm with dozens of employees. It had a number of defense contracts, but only one IT staff member.The organization heard the hackers could have been state-sponsored or a criminal group. The hackers had used a tool called China Chopper, favored by Chinese hackers.The Australian Signals Directorate dubbed the hacker “Alf”, after a role in TV soap opera Home and Away.Alastair MacGibbon, the special adviser to the prime minister on cybersecurity, also emphasized the stolen information was only commercially sensitive."}, {"topics": ["Cyber Attack", "Hacking Challenges", "Hacking News", "News", "Vulnerabilities"], "date": "October 12, 2017", "authur": "Mandee", "title": "Hackers from Israel Stumble upon Spies Hacking Spies", "body": "In a surprising turn of events, Israel hackers ended up catching American spies being hacked by Russian spies. The discovery occurred while the Israelite hackers were successfully hacking Kaspersky, a popular internet security software. If this isn’t confusing enough for you, just wait because the tale only goes deeper.At first glance, it would seem Kaspersky was a victim in this cyber scandal but that is so far from the suspected truth. Instead, Kaspersky was possibly actively playing the most evil of all the roles: helping American spies, who are directly employed by the U.S. Federal government, to use their system to spy on the users themselves.That’s right: the very software meant to protect you and your privacy was said to be allowing government entities to illegally spy on those using the software. Or at least that is what it seems to look like. Several official statements from all parties have denied any wrongdoing including Kaspersky as they continue to claim their innocence in the matter.While this event originally occurred in 2015, for one reason or another, has only just now surfaced in the public forum for us “regular” folks to read about. Nothing about hacking, spying or government entities and their questionable tactics is new including the smokescreens surrounding them every time a new story surfaces.Between all of the twists and turns, denials and statements, we are left with having to judge the event for ourselves. But, of course, it would be wise to accept the fact early on that a straight answer will never be given, not to the general public at least. In the end, our need for a trusted internet security provider is absolutely necessary and for that trust to be compromised is nothing short of terrifying. We need to seriously strengthen our security online in the upcoming months in order to avoid the threats that lurk online. "}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "date": "October 12, 2017", "authur": "Harikrishna Mekala", "title": "More than 10 Million Driving licenses have been leaked in Equifax Breach", "body": "According to a new article by News. In addition, News has reported that the intruders got a hold of 15.2 million UK customers’ records, though only 693,665 amongst them had enough info in the system for the violation to be a real threat to their privacy. Affected consumers provided most of the driver’s permits on file to verify their connections when they discussed their credit-report data through an Equifax web page. That page was one of the entrance points the attackers used to gain admission into the credit reporting agency’s system.While leaked SSNs and group details are definitely worse, driver’s licenses include some info that could make it simpler to steal someone’s identity, including people’s height and eye color. A bad player could use the name, address and physical characteristics in those stolen licenses as a verification of someone else’s identity or carry out scams in someone else’s name. If you checked your identity using your license by Equifax’s website in the past and want to guarantee your security, it’s probably best to get a new license number.In case you’re in the UK and are more concerned about the stolen UK consumer info, though, Equifax said it will talk with the 693,665 affected individuals. The rest of the releases only contain people’s names and birthdates, which aren’t thought sensitive information.Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "October 11, 2017", "authur": "Eslam Medhat", "title": "Hackers were able to steal $60 million from Taiwanese bank!", "body": "Last week, a hacking group was able to abuse the SWIFT (the Society for Worldwide Interbank Financial Telecommunications) banking network to steal $60 million after installing malware on a Taiwanese bank’s servers.The Far Eastern International Bank has admitted that malware had been found on its machine systems, affecting PCs and servers, as well as its SWIFT terminal.SWIFT is the system that enables banks to send money securely to each other around the world. It provides a network that allows financial organizations worldwide to send and receive data about financial transactions in a secure, standardized and reliable environment.Most of the stolen funds have now been recovered, and the loss incurred by the bank due to the hacking incident is less than 500,000 US dollars, the governments have made two arrests in connection with the bank cyber-heist.According to banking department deputy director Sherri Chuang, the Bank was able to recover $57 million that had been wired to Cambodia, $1 million sent to the United States, and $1.6 million sent to Sri Lanka.‘Two suspects were arrested last week in Sri Lanka when they tried to withdraw the money, and police were looking for a third person.”"}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "October 11, 2017", "authur": "Harikrishna Mekala", "title": "Kaspersky was hacked by Israel and the government has also notified the NSA about the Anti-Virus Spying activities", "body": "Israel told the NSA, where frightened officials quickly began a hunt for the gap, according to users familiar with the subject, who said an inquiry by the agency revealed that the tools were in the territory of the Russian government.Israeli spies had discovered the hacking stuff on the network of Kaspersky Lab, the global anti-virus firm beneath a spotlight in the United States because of doubts that its results facilitate Russian espionage.Last month, the Department of Homeland Security notified federal civilian agencies to identify Kaspersky Lab software on their systems and remove it on the grounds that “the risk that the Russian government, whether playing on its own or in collaboration with Kaspersky, could benefit from access provided by Kaspersky results to settle federal information and information systems directly implicates U.S. national security.” The directive developed a decision by the General Services Administration to eliminate Kaspersky from its list of recommended vendors. And lawmakers on Capitol Hill are considering a governmentwide ban.The NSA rejected to comment on the Israeli discovery, which was first described by the News.Kaspersky said in a declaration that “as a private company, Kaspersky Lab does not have improper ties to any government, including Russia, and the only result seems to be that Kaspersky Lab is caught in the midst of a geopolitical fight.” The company said it “does not maintain any knowledge” of Israel’s hack.The firm’s originator, Eugene Kaspersky, said in a blog post last week that his anti-virus software is deemed to find malware from all quarters.“We definitely and aggressively detect and clean malware diseases no matter the source,” he wrote, suggesting that the NSA hacking tools could have been plucked up as malware by the anti-virus program.In the 2015 case, prosecutors at the NSA examining how the Russians took the material eventually narrowed their search to an employee in the agency’s elite Tailored Access Operations division, which comprises hackers who collect intelligence about foreign targets. The operator was using Kaspersky anti-virus software on his home computer, according to the people familiar with the matter.Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "October 10, 2017", "authur": "Eslam Medhat", "title": "Be careful! They can steal your Apple ID password using new un-detected phishing attack", "body": "iOS asks the users to write their Apple ID password for many reasons, the most popular thing is when installing operating system updates, or iOS apps that are stuck during installation. As a result, users are trained to just enter their Apple ID password whenever iOS asks you to do so.But, these popups are not only displayed on the lock screen, and the home screen, but also inside random apps, e.g. when they want to access iCloud, GameCenter or In-App-Purchases.Attackers can easily trick users just by showing an UIAlertController, that seems exactly like the system dialog.According to an alarming blog post published by Krause:\nDo you want the user’s Apple ID password, to get access to their Apple account, or to try the same email/password combination on different web services? Just ask your users politely, they’ll probably just hand over their credentials, as they’re trained to do so ?You can protect yourself by hitting the home button, and see if the application quits, If it quitting the app, and with it the dialog, then this was a phishing attack. But If the popup and the application are still visible, then it’s a system popup. The reason for that is that the system dialogs run in a separate process, and not as a component of any iOS app.You can also avoid entering your credentials into a popup, alternatively, dismiss it, and open the Settings app manually."}, {"topics": ["Hacking News"], "date": "October 10, 2017", "authur": "Eslam Medhat", "title": "Fake AdBlock Plus with over 37,000 installs", "body": "Google has removed a fake extension named AdBlock Plus from the Chrome Web Store that was downloaded 37,000 times by users around the world. It’s posed as the popular AdBlock Plus ad blocker but forcibly opened new tabs to display ads to users.The main issue here is that Google let another developer to trick 37,000 Chrome users by uploading an extension using the same name as AdBlock Plus, which is a very common ad blocker for Chrome.According to one of the fake extension’s reviewers, the user started receiving invasive ads that open lots of tabs after he installed fake AdBlock Plus. Sadly, it’s unclear what else it can do or if it has even more damaging effects that we still don’t know of.Google is working seriously attempting to stop fake Chrome extensions appearing in the store, but it still has a long way to go. Although it can be hard if not impossible to detect every one, Google has to improve the verification process to further minimize the risks of malicious extension making its way to the Chrome Web Store."}, {"topics": ["Hacking News"], "date": "October 10, 2017", "authur": "Eslam Medhat", "title": "ATMii Malware can make ATMs drain available cash", "body": "Security researchers from Kaspersky have detected a new ATM malware called ATMii that targets only ATMs operating on Microsoft Windows 7 and Windows Vista.The malware was first detected in April 2017 when one of the affected banks shared the malware with Kaspersky security researchers. The malware consists of two files, the exe.exe file, and the dll.dll file. In order to install the ATMii on ATMs, the attacker needs direct access to the target ATM (either over the network or physically) to install it.According to Kaspersky:\n“ATMii was first brought to our attention in April 2017, when a partner from the financial industry shared some samples with us. The malware turned out to be fairly straightforward, consisting of only two modules: an injector module (exe.exe, 3fddbf20b41e335b6b1615536b8e1292) and the module to be injected (dll.dll, dc42ed8e1de55185c9240f33863a6aa4). To use this malware, criminals need direct access to the target ATM, either over the network or physically (e.g. over USB). ATMii, if it is successful, allows criminals to dispense all the cash from the ATM.”ATMii is yet another instance of how crooks can use legitimate proprietary libraries and a small piece of code to drain cash from an ATM. Some appropriate countermeasures against such attacks are default-deny policies and device control."}, {"topics": ["Hacking News"], "date": "October 9, 2017", "authur": "Eslam Medhat", "title": "A new type of brute-force attack called KnockKnock", "body": "Security researchers from Skyhigh networks have discovered a clever new botnet attack against Office 365 accounts, called ‘KnockKnock’ because attackers are trying to knock on backdoor system accounts to infiltrate the whole O365 environments.KnockKnock has been going on since May 2017, it was created to essentially attack system accounts that are not assigned to any one individual user, making them particularly vulnerable.According to Skyhigh researchers:\n“First, it should be noted that KnockKnock is not a brute force attack for two reasons. First, it targets a very small proportion (typically <2%) of the O365 account base. Second, it is devoid of any bursts in hacking activity, and averages only 3-5 attempts per account in order to try and fly under the radar of traditional defenses.”The attackers tried to guess the passwords for these accounts because these accounts do not use two-factor authentication (2FA) and have higher access and privileges than regular employee accounts.Accounts such as service accounts (like the ones used for user provisioning in larger enterprises), automation accounts (used to automate data and system backups), machine accounts (used for applications within data centers), marketing automation accounts (like the ones used for marketing and customer communication), internal tools accounts (like the ones used with JIRA, Jenkins, GitHub etc.)According to Skyhigh, the best way to fight against KnockKnock is to enable 2FA for accounts, and to use powerful and unique passwords for both employee and system email accounts."}, {"topics": ["Hacking News"], "date": "October 8, 2017", "authur": "Eslam Medhat", "title": "A technique called FreeMilk has been used by hackers to hijack email conversations", "body": "Security researchers from Palo Alto Networks Unit 42 have discovered a new complex technique that has been used by hackers to hijack on-going email conversations to inject malicious documents that seem to be originating from a legal source and affect other targets sharing the same conversational thread.The campaign has been called FreeMilk and the researchers have claimed that it is a “limited spear-phishing campaign,” which the Palo Alto researchers found in May 2017. The extent of this campaign is wide enough as it is targeting users around the world.According to researchers:\n“The threat actor leveraged the CVE-2017-0199 Microsoft Word Office/WordPad Remote Code Execution Vulnerability with carefully crafted decoy content customized for each target recipient. Our research showed that the spear phishing emails came from multiple compromised email accounts tied to a legitimate domain in North East Asia.”The main goal of FreeMilk is to execute Freenki downloader while Freenki performs two separate tasks; firstly, it collects data about the host, and also, it plays the role of a second stage downloader. The malware collects MAC address, username, active processes and machine name apart from taking screenshots of the targeted system. The data is then sent to a C&C server where the hackers receive it and exploit it further to download other malicious software.Security researchers from Palo Alto Networks Unit 42 have discovered a new complex technique that has been used by hackers to hijack on-going email conversations to inject malicious documents that seem to be originating from a legal source and affect other targets sharing the same conversational thread.The campaign has been called FreeMilk and the researchers have claimed that it is a “limited spear-phishing campaign,” which the Palo Alto researchers found in May 2017. The extent of this campaign is wide enough as it is targeting users around the world.According to researchers:\n“The threat actor leveraged the CVE-2017-0199 Microsoft Word Office/WordPad Remote Code Execution Vulnerability with carefully crafted decoy content customized for each target recipient. Our research showed that the spear phishing emails came from multiple compromised email accounts tied to a legitimate domain in North East Asia.”The main goal of FreeMilk is to execute Freenki downloader while Freenki performs two separate tasks; firstly, it collects data about the host, and also, it plays the role of a second stage downloader. The malware collects MAC address, username, active processes and machine name apart from taking screenshots of the targeted system. The data is then sent to a C&C server where the hackers receive it and exploit it further to download other malicious software."}, {"topics": ["Hacking News"], "date": "October 7, 2017", "authur": "Eslam Medhat", "title": "Disqus has been hacked in 2012 and the company confirmed the issue", "body": "Disqus is a global blog comment hosting service for websites and online communities that use a networked platform. Disqus’s platform combines several features, such as social integration, social networking, user profiles, spam tools, analytics, email notifications, and mobile commenting.Disqus has confirmed a data breach that seems to have taken place in the July 2012 (5 years ago), an unknown hacker was able to expose a snapshot of the user’s database from 2012, including data dating back to 2007. The snapshot contains email addresses, Disqus usernames, sign-up dates, and last login dates in plain text for 17.5 million users.According to Disqus:\n“Yesterday, on October 5th, we were alerted to a security breach that impacted a database from 2012. While we are still investigating the incident, we believe that it is best to share what we know now.”“No plain text passwords were exposed, but it is possible for this data to be decrypted (even if unlikely). As a security precaution, we have reset the passwords for all affected users. We recommend that all users change passwords on other services if they are shared,”The company became aware of the breach from Aussie security researcher Troy Hunt, who come into the possession of a copy of the stolen data and notified Disqus on October 5th.The team is still actively investigating the breach and will share all relevant information as soon as possible."}, {"topics": ["Hacking News", "News", "SPY", "Uncategorized"], "date": "October 6, 2017", "authur": "Harikrishna Mekala", "title": "Uber App Can Record iPhone Screens accessing Core Functionality in Apple’s iOS", "body": "The presence of Uber’s access to exclusive iPhone functions is not published in any consumer-facing data included with Uber’s app, notwithstanding giving the corporation direct access to features so powerful that Apple nearly always keeps them off-limits to outside companies.Although there is no proof that Uber used this way to take advantage of the iPhone features, the sign of the app’s access to exempt Apple code raises important problems for a company already under investigation for a kind of controversial business practices.Uber told News that the code was not currently being utilized and was basically a vestige from an earlier variant of its Apple Watch app, but it set off alarm bells amongst experts.“Granting such a sensible entitlement to a third-party is uncommon as far as I can tell, no other app developers have signified able to convince Apple to grant them entitlements they’ve wanted to let their apps utilize positive privileged system functionality,”  Will Strafach, a security researcher who found the situation, told News.Nearly every iPhone app uses what is proclaimed an “entitlement” basically a way for software to enable characteristics like the camera or Apple Pay on iPhones and iPads. Most of these can be easily located and officially turned on by outside app developers.But there are certain entitlements that are only managed by Apple, giving the company’s own software tight alliance with the iPhone. These bits are designated with names that start with “com.apple.private,” and they are being considered so delicate that any third-party app found working them is rejected from the App Store.After digging round in the code for Uber’s app, Strafach saw that it uses an entitlement called “com.apple.private.allow-explicit-graphics-priority.”“It is very odd to see Uber as the just the app I checked tens of thousands of different apps using my organization internal dataset derived from the App Store besides Apple’s personal apps granted access to this sensitive entitlement,” Strafach said in an email. Another personality said that no other of the 200 top free apps use private Apple entitlements.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "SPY", "Uncategorized"], "date": "October 6, 2017", "authur": "Harikrishna Mekala", "title": "Hackers of Russia Stole NSA’s Secrets using Kaspersky antivirus", "body": "The report may well be valid, but, for now, there’s no way to individually confirm it. The statement is based on unnamed personalities the publication says had an understanding of the matter, and it provides no data to back its claim. What’s more, the lack of particular leaves opens the possibility that, even if Kaspersky’s AV did help Russia home in on the extremely sensitive code and documents, the exposure was the inadvertent result of a software bug and that no one from Kaspersky Lab encouraged with the attackers in any way. Also lost in the focus on Kaspersky Lab is the startling apocalypse that yet another NSA insider accomplished to sneak classified material outside of the NSA’s system and put it on an unsecured computer. More of this analysis will follow.First, here’s a rundown of what the News reported.The unnamed architect removed the material from the NSA and saved it on a home computer that ran a variant of Kaspersky AV. The material, according to the unnamed sources, included “details about how the NSA filters foreign computer networks, the computer code it uses for before-mentioned spying, and how it maintains networks inside the US.” Sometime in 2015, the material was stolen by Russia-sponsored hackers who “seem to have targeted the contractor after recognizing the files through the contractor’s use” of the Kaspersky AV. The breach was detected in the first three months of 2016.US investigators believe the contractor’s use of the software warned Russian hackers to the residence of files that may have been taken from the NSA, according to people with the awareness of the investigation. Experts said the software, in seeking for malicious code, may have discovered samples of it in the data the builder removed from the NSA.But how the antivirus order made that determination is unclear, such as whether Kaspersky engineers programmed the software to look for specific parameters that symbolized NSA material. Also unclear is whether Kaspersky representatives alerted the Russian government to the finding.Investigators did determine that armed with the awareness that Kaspersky’s software given of what files were doubted on the contractor’s computer, hackers operating for Russia homed in on the machine and took a large amount of information, according to the characters familiar with the matter.Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News"], "date": "October 5, 2017", "authur": "Eslam Medhat", "title": "FormBook data stealer sold on hacking forums is used in targeted attacks", "body": "Security researchers from Arbor Networks and FireEye, have found a series of malware (dubbed FormBook) attacks primarily targeting aerospace, defense contractors, and manufacturing in many countries, including the USA, Thailand and South Korea. They found that the PDF and DOC/XLS documents were largely used to target organizations.FormBook malware was created to steal data from the infected computers, including keystrokes, clipboard contents, HTTP/HTTPS/SPDY/HTTP2 web forms and network requests, passwords from web browsers and email clients, and screenshots, and transfer it to the attacker server.According to FireEye researchers:\n“We observed several high-volume FormBook malware distribution campaigns primarily taking aim at Aerospace, Defense Contractor, and Manufacturing sectors within the U.S. and South Korea during the past few months. The attackers involved in these email campaigns leveraged a variety of distribution mechanisms to deliver the information stealing FormBook malware, including:– PDFs with download links\n– DOC and XLS files with malicious macros\n– Archive files (ZIP, RAR, ACE, and ISOs) containing EXE payloads”Anyone on the internet can rent FormBook malware for only $29 per 7 days or $59 per 30 days, which gives a variety of advanced spying abilities on target computers, including a keylogger, password stealer, network sniffer, taking the screenshots, web form data stealer and much more.FormBook is a data stealer and form grabber that has been sold in many hacking forums since early 2016. It was seen downloading other malware families such as NanoCore. The credentials and other information collected by successful FormBook infections could be used for additional cybercrime activities."}, {"topics": ["Hacking News"], "date": "October 5, 2017", "authur": "Eslam Medhat", "title": "Millions of Sonic customers have been hacked!", "body": "Sonic Drive-In, is an American drive-in fast-food restaurant chain based in Oklahoma City, Oklahoma. It has more than 3,500 locations across the United States.The company has confirmed on Wednesday that hackers may have stolen users’ credit card data using a piece of malware.Sonic said that it’s working with the law enforcement and third-party forensics experts to investigate the hack. It also said that it delayed informing users of the intrusion at the request of law enforcement.It’s unclear how many users are impacted, that’s mean that any user used his payment card at Sonic Drive-In restaurants seems to be eligible. Also, users who used their payment details at Sonic Drive-In restaurants this year are being offered 2 years of free fraud detection and identity theft protection services via Experian.According to the company:\n“Sonic Drive-In has discovered that credit and debit card numbers may have been acquired without authorization as part of a malware attack experienced at certain Sonic Drive-In locations. Your trust in Sonic is important to us and we sincerely regret any inconvenience this may cause. We have provided here more information about this situation, including an offer of free identity theft protection for affected customers”"}, {"topics": ["Cyber Attack", "Hacking News"], "date": "October 4, 2017", "authur": "Eslam Medhat", "title": "The 2013 Data Breach Hit All Yahoo Accounts (3 Billion Accounts)", "body": "Yahoo! is a web services provider, that’s taken by Verizon this year through Oath Inc., the company now believes the total amount of accounts hacked in the August 2013 data breach, which was published in December last year, was not just 1 billion, but it was 3 Billion accounts.The number has been tripled down on what was already the largest data breach in history, the stolen data included names, email addresses, phone numbers, birthdates and security questions and answers. Yahoo said that it got new intelligence while investigating the breach with help from external forensic specialists. It also said that the stolen user’s data did not include passwords in plain text, payment card data.The company had already asked users to change their passwords and cancel security questions so they couldn’t be used to break into accounts.Yahoo said:\n“Subsequent to Yahoo’s acquisition by Verizon, and during integration, the company recently obtained new intelligence and now believes, following an investigation with the assistance of outside forensic experts, that all Yahoo user accounts were affected by the August 2013 theft. While this is not a new security issue, Yahoo is sending email notifications to the additional affected user accounts.”Yahoo already notified all users affected by the 2013 security breach (just one billion). The company promised to notify other users."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "October 3, 2017", "authur": "Harikrishna Mekala", "title": "Equifax has announced that 2.5 Million More Users might have been affected by the Hack", "body": "Equifax published Monday that cybersecurity firm Mandiant developed the forensic portion of its investigation of the hack.The firm said in the statement that 145.5 million consumers might now probably have been impacted by the data breach, 2.5 million more than previously estimated.In September, Equifax proclaimed a massive data breach, saying hackers may have obtained the personal details, including names and Social Security numbers, of more than 143 million consumers from mid-May to July. Equifax, which said it read of the breach in late July, said credit-card numbers for about 209,000 people and certain records for another 182,000 were also accessed.The exposure was swiftly met with critique because of the delay in informing the public to the hack, as well as problems with the website that Equifax set up for people to check whether their credit card details were at risk.The hack is being reviewed by the Federal Trade Commission and has implied promises for inquiries in both the Senate and House of Representatives.Several Equifax officials have left the business since the hack’s disclosure. Richard Smith stepped down as chairman of the board and CEO last Tuesday. And before that, the organization announced that the consumer-data firm’s CIO, David Webb, and its chief security officer, Susan Mauldin, were also withdrawing. Webb will be replaced by Mark Rohrwasser, who joined the company last year, Equifax said in an emailed statement. Mauldin will be compensated by Russ Ayres. Both Rohrwasser and Ayers have earlier worked in Equifax’s IT division.Equifax officials are also reportedly being reviewed by the US Justice Department after selling the stock before the company revealed a data breach that revealed the personal information of millions of Americans.According to News, the department is looking at sales by Equifax’s CFO, John Gamble; president of US information solutions, Joseph Loughran; and president of workforce solutions, Rodolfo Ploder. The three senior officials dumped almost $2 million worth of stock days after the business learned of the breach, Securities and Exchange Commission filings show. An emailed announcement from the credit-monitoring agency said the executives “had no knowledge” of the breach beforehand.Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "October 2, 2017", "authur": "Eslam Medhat", "title": "Etherparty Ethereum ICO has been hijacked!", "body": "Etherparty is a smart contract creation tool that enables users to create smart contracts on the blockchain. It’s a user-friendly tool. Etherparty said that its ICO (Initial Coin Offering) website has been hacked and the address for sending funds was modified to reroute the funds to the hackers.The company detected the attack in just 15 minutes and shut down its website immediately to stop users from sending money to the hackers. They investigated the hack and recovered the website after 95 minutes, letting the ICO continue as scheduled. The blockchain company has promised to compensate any affected contributors, with its proprietary FUEL token, prior to the temporary website shutdown.According to the founder of Etherparty:\n“Our team has been consistently and successfully thwarting potential security issues to avoid further escalation. However, we do acknowledge and apologize for the temporary disruption to our otherwise successful launch day. Etherparty is eager and committed to compensating all affected contributors for the inconvenience.”Despite all this, ICOs are insanely popular, allowing companies to raise large sums of money. they got off to a positive start, selling over 10,000,000 FUEL tokens in the first hour. The smart contract company sold over 400,000,000 FUEL tokens before the official launch in the pre-sale."}, {"topics": ["Hacking News"], "date": "October 2, 2017", "authur": "Eslam Medhat", "title": "Gaming Service (R6DB) has been hacked and the database has been deleted by hackers!", "body": "R6DB is an online gaming service that gives statistics for Rainbow Six Siege players. It went down this weekend and the database removed by the hackers and asked for a Ransom.The hack took down the service on Saturday (September 30) and the company said that automated bot accessed their servers and deleted the database. They kept the remote connection open from Development machine to Postgress Database server.According to the company:\nToday someone deleted our databases. We still had remote connections enabled from development and a bot jumped at it. They left a nice ransom message, but we have no reason to believe that they kept any data. On top of that our backups are useless, since they didn’t work on the postgres codebase yet. Due to the hectical and unplanned September-migration we didn’t have everything locked down yet, which led to this situation.The company also said that they don’t collect any personal data, so users don’t have to be concerned about any privacy problems. They said that some profiles are gone and they can re-index them when searched for, but that’s a step they can’t do individually.R6DB determined to fully deploy a new server because the old one has been compromised, they made the new server online but the database recovery is still in progress."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "October 2, 2017", "authur": "Harikrishna Mekala", "title": "Whole Foods might have been affected in a possible credit card breach", "body": "In reply to News inquiry on Thursday, Whole Foods refused to say how many of its stores may have been affected or where they were located. The organization did not respond Friday when asked how long it was informed of the breach before alerting the public.In its only announcement so far, Whole Foods said it was informed of a potential breach after it “received data regarding unauthorized access of payment card information.” That grammar appears to imply that Whole Foods did not detect the Hack itself, but was notified by a third party instead.Rep. Diana DeGette of Colorado, a constant and vocal proponent of post-breach customer protection, told News on Friday that Whole Foods must promote its disclosure process if it means to help consumers protect themselves from possible fraud. Timeliness with regard to breach exposure is key in determining whether a corporation is reacting appropriately Equifax was thoroughly criticized, for instance, for being too slow to notify consumers.“Whole Foods needs to tell the complete truth about this incident, and soon,” said DeGette, the ranking Democrat on the House subcommittee on overlooking and investigations. “Customers need to know whether and how they were touched, when, and in what way. How many people, and in which areas of the country, are at risk? How long ago did Whole Foods hear of it, and what steps have been taken to lessen the damage?”Whole Foods has been fast to disclose information about systems it says were clearly not compromised; for instance, it said the obvious breach did not impact Amazon, which acquired the supermarket chain last month.What’s more, Whole Foods claims only consumers of bars and table-service restaurants located inside its stores could be moved. And while the company noted that not every store has a tap room or in-store restaurant, there are a notable number of them spread across the country: As of November, 180 of Whole Foods’ 464 stores had bars or taprooms, according to News.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "October 2, 2017", "authur": "Harikrishna Mekala", "title": "Hackers have brought down The Rainbow Six Siege Online gaming service and wiped it’s Database", "body": "The attack led down the setting Saturday, September 30. In a comment released on Sunday, the firm said an automatic bot accessed their server, cleared the database, and left a ransom note behind. The database seems to be a PostgreSQL instance.Company left server exposed onlineThe attacker’s bot was capable to access the database because the corporation engineers left remote connections allowed for the database server from the development phase.“Due to the hectic and unplanned September migration, we didn’t have everything bolted down yet, which led to this situation,” an R6DB spokesperson said. “They left a nice ransom message, but we have no understanding to believe that they kept any data. On top of that our reserves are useless since they didn’t work on the Postgres codebase yet.”R6DB said the intruder only entered the database, but they chose to wipe and reinstall the entire machine, just to be safe.Company technicians are working to restore as greatly of the data as possible, but R6DB expects some data to be lost for good.Staff says they nevermore stored any personal data on Rainbow Six Siege players, so setting users don’t have anything to worry about.All that was lost is player statistics. Gamers used R6DB specifically for this purpose, to keep track of their growth across time, and get the different perspective on their stats, besides to what the game gives.“We basically lost all our traditional data,” said R6DB. “Some profiles are gone. We can re-index them while searched for, but that’s a step we can’t-do ourselves.”“Progressions are They’ll fill up again over time, but the past is gone,” R6DB said. “aliases are half-REDACTED. We still have some older data, but about a weeks worth of aliases is lost.”At the time of reporting, the R6DB is up and running, but the company is still operating on restoring player data. Staff expects to close the restoration process by Monday.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "October 1, 2017", "authur": "Harikrishna Mekala", "title": "A huge Number of Macs are vulnerable to EFI Firmware Attack", "body": "Duo examined what is understood as firmware in the Mac computers. Firmware is an in-built kind of software that is even extra basic than an operating system like Microsoft Windows or macOS.When a machine is first powered on before the operating system has even booted up firmware controls to make sure that basic elements like a hard disk and processor are present and tells them what to do. That makes malicious code stored in it hard to spot.In most cases, the firmware is an annoyance to update with the latest security patches. Updates have to be stocked out separately from the operating system updates that are more commonplace.In 2015, Apple began bundling firmware updates along including operating system updates for Mac computers in an effort to ensure firmware on them stayed up to date.But Duo surveyed 73,000 Mac machines operating in the real world and found that 4.2 percent of them were not rolling the firmware they should have been based on their operating system. In some models such as the 21.5-inch iMac cleared in late 2015 – 43 percent of machines had out-of-date firmware.That left many Macs open to hacks like the “Thunderstrike” attack, where hackers can manage a Mac after plugging an Ethernet adapter into the machine’s so-called thunderbolt port.Paradoxically, it was only possible to find the possibly vulnerable machines because Apple is the only computer producer that has sought to make firmware updates part of its regular software updates, making it both more trackable and the best in the enterprise for firmware updates, Rich Smith, director of research and development at Duo, told News in an interview.Duo said that it had notified Apple of its findings before getting the public announcement on Friday. In a statement, Apple said it was conscious of the issue and is moving to address it.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "October 1, 2017", "authur": "Harikrishna Mekala", "title": "There is enough voter’s Database leaked out there to Alter Voting Registration Information", "body": "The study, which studied official state voter record websites, determined that in 35 states plus the District of Columbia, voter registration websites support users to log on and modify information such as home addresses, party alliance, and gender. While this gives a convenient way for voters to update their enrollment information, it also gives malicious actors an easy way to represent voters and submit address changes, delete voter registrations, or ask absentee ballots. With a simple swap of address, hackers could even designate voters to an entirely separate precinct.Later on, when the voter presents up to the polls on election day, he or she may be incapable to cast a ballot because the name or address on their ID doesn’t resemble the state’s records, or because poll workers think the voter has conferred up to vote in the wrong precinct. Voters may be utilized away from the polls or asked to file provisional ballots but sometimes those ballots aren’t even included, said the study’s co-author Latanya Sweeney, Professor of Government and Technology at Harvard University.The fear is that this vulnerability could be used both to undermine confidence in elections and discourage voter turnout, or even to swing the results in favor of a particular candidate.“If the goal is to ruin any belief in the electoral system, then they force very well want to target a distinct community at large…because that could cause a kind of hysteria,” Sweeney said. “People will say what sort of system is this? We didn’t get a turn to vote, our whole community didn’t get a chance to vote.”This appears to be precisely what happened in Riverside County, California’s principal election in June 2016, when a lot of voters had their party affiliations changed without their knowledge or consent. According to a report by News, “the changes had been made by hackers who had used secret information, like Social Security or driver’s-license numbers, to obtain the central voter-registration database for the entire state of California.”Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "September 29, 2017", "authur": "Eslam Medhat", "title": "A cyber-criminal injects a PHP backdoor inside fake WordPress plugin", "body": "A PHP backdoor has been injected by a hacker inside the source code of a WordPress plugin named “X-WP-SPAM-SHIELD-PRO”. WordPress is the most popular CMS with largest market share by far (more than 27% of the internet). The fake plugin has been discovered by Sucuri researchers, the plugin was not available on the official WordPress Plugins repository, victims installed it through other sources.According to Sucuri:\n“Recently, a fake WordPress security plugin called X-WP-SPAM-SHIELD-PRO got our attention. Fake plugins often have a few folders and plugin names that appear legitimate, but the contents include a malicious file that contains a backdoor or similar malware.”Users who installed the fake security plugin (X-WP-SPAM-SHIELD-PRO) were shocked because the backdoor enabled the attacker to generate his own admin account on the affected site, upload malicious files on the victim’s servers, disable other plugins, and much more.Remember that not all security plugins are secure. By downloading fake plugins from untrusted sources or leaving your website vulnerable, you are placing your website at a great risk."}, {"topics": ["Hacking News"], "date": "September 28, 2017", "authur": "Eslam Medhat", "title": "Newly discovered malware made $63,000 from mining cryptocurrency on Windows Servers", "body": "Security researchers from ESET have detected a new malware that infected thousands of Windows web servers with a malicious Monero (XMR) miner and helps cybercriminals made more than $63,000 in just three months.Attackers infecting unpatched Windows web servers with a malicious cryptocurrency miner. Their purpose is to use the servers’ computing power (CPU) to mine Monero (XMR), which is one of the newest cryptocurrency alternatives to Bitcoin and one of the most anonymous cryptocurrencies.According to ESET:\n“attackers modified legitimate open source Monero mining software and exploited a known vulnerability in Microsoft IIS 6.0 to covertly install the miner on unpatched servers. Over the course of three months, the crooks behind the campaign have created a botnet of several hundred infected servers and made over USD 63,000 worth of Monero.”The distribution of the miner to victims’ computers is the hardest part of this operation, but attackers used a vulnerability (CVE-2017-7269) that was discovered in March 2017 to distribute the miner. It is a vulnerability in the WebDAV service that is a component of Microsoft IIS version 6.0, the web server in Windows Server 2003 R2.Overall, the compromised machines were generating about XMR 5.5 daily by the end of August and have made over XMR 420 in total over the course of three months."}, {"topics": ["Hacking News"], "date": "September 26, 2017", "authur": "Eslam Medhat", "title": "First Android Malware Detected Using Dirty COW vulnerability", "body": "It’s the first time to see threat actors have combined the Dirty Cow Android vulnerability to malware created to compromise users’ devices.ZNIU is the name of the first malware sample to include an exploit for the Dirty COW vulnerability to infect users.Security researchers from Trend Micro announced the vulnerability, tracked as CVE-2016-5195, has been found in a malware sample of ZNIU, the malware is identified as “AndroidOS_ZNIU” and this is the first malware sample to include an exploit for the Dirty COW flaw.Dirty COW has been discovered by David Manouchehri in October 2016, which is a privilege escalation Linux flaw that enables an attacker to elevate the privilege of attack code to “root” level and carry out malicious operations.According to Trend Micro researchers:\n“The Linux vulnerability called Dirty COW (CVE-2016-5195) was first disclosed to the public in 2016. The vulnerability was discovered in upstream Linux platforms such as Redhat, and Android, which kernel is based on Linux. It was categorized as a serious privilege escalation flaw that allows an attacker to gain root access on the targeted system.”Actually, the ZNIU malware usually looks as a porn application downloaded from malicious websites, where victims are fooled into clicking on a malicious link that installs the malware app on their device. Attackers use this malware to collect data on the infected devicesUsers are recommended to install apps only from the Google store or trusted third-party app stores and use mobile security solutions to prevent threats."}, {"topics": ["Hacking News"], "date": "September 25, 2017", "authur": "Eslam Medhat", "title": "Showtime websites are using Coinhive to mine Monero!", "body": "Two Showtime domains are currently using Coinhive to mine Monero using users’ CPU. Coinhive, as a tool, is a JavaScript library that website masters can load on their site. When users access the site, the Coinhive JavaScript code library executes and mines for Monero for the site owner, but using the user’s CPU resources.According to a report from bleeping computer:\nThe two domains are showtime.com and showtimeanytime.com, the latter being the official URL for the company’s online video streaming service.\nThe main Showtime domain name, sho.com, does not include the Coinhive Monero mining script.”The cryptocurrency miner has first found by a Twitter user called SkensNet.The cryptocurrency miner has first found by a Twitter user called SkensNet.Should Showtime be sued for that or is it cybercriminals? The Showtime website is now using users’ CPUs to mine Monero which is one of the most anonymous cryptocurrencies. Because the responsible parties used Monero it will be very difficult if not difficult to ever track it back to the source.Two weeks ago, users found that the Pirate Bay was testing out a cryptocurrency miner to make revenue from users using Coinhive library, but users response was different, with the majority not wanting the idea that the website is hijacking their CPUs and slowing down their PCs.A new report has estimated that a site like The Pirate Bay could make about $12,000 per month by mining Monero in the background."}, {"topics": ["Hacking News"], "date": "September 25, 2017", "authur": "Eslam Medhat", "title": "TV broadcasts in California were interrupted with an “end of the world” alert", "body": "Some Orange County citizens were surprised Thursday, Sept. 21, when TV programming was suddenly interrupted for around a minute with an ominous message prophesying the end of the world.These ominous warning messages displayed on mainstream TV channels and affected Spectrum and Cox cable users. Some of the warning videos have been uploaded on YouTube.Some of the warning videos have been uploaded on YouTube contains a terrified, breathless voice saying: “The space program made contact with… They are not what they claim to be. They have infiltrated a lot of, uh, a lot of aspects of military establishment, particularly Area 51. The disasters that are coming—the military—I’m sorry the government knows about them…”Erin Mireles (viewer), said that the message gave her a fear because it displayed at a higher volume than the program she was watching, however, she thought it was a hoax so she wasn’t too concerned.Engineers reportedly shut down the alert as soon as they became informed of it, a spokesperson for cable TV company Cox said.“We have confirmed that we were fed an incorrect audio file,”Cox and Spectrum are both investigating who was responsible for the warning and whether it was broadcast inadvertently or on purpose.This is not the first time when TV shows have been hacked to display unrelated footage."}, {"topics": ["Hacking News"], "date": "September 25, 2017", "authur": "Eslam Medhat", "title": "Deloitte has been hacked!", "body": "Deloitte, is a multinational professional services firm with operational headquarters in New York City in the USA. It is one of the large 4 accounting firms and the biggest professional services network in the world by income and number of professionals.Deloitte has confirmed that the organization had suffered a cyber attack that ended with the stealing of confidential data, containing the private emails and documents of some of its clients.The attackers were able to compromise the company’s global email server through an administrator’s account that, theoretically, gave them privileged, unrestricted access to all parts. The account needed only a single password and did not have “two-step“ authentication.According to the company:“In response to a cyber incident, Deloitte implemented its comprehensive security protocol and began an intensive and thorough review including mobilising a team of cybersecurity and confidentiality experts inside and outside of Deloitte,”“As part of the review, Deloitte has been in contact with the very few clients impacted and notified governmental authorities and regulators.”ِِAlthough all main organizations are targeted by attackers, the hack is a deep embarrassment for Deloitte, which allows potential clients advice on how to handle the risks posed by sophisticated cyber security attacks."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "date": "September 25, 2017", "authur": "Harikrishna Mekala", "title": "A huge flaw has been noticed in Google’s Accelerated Mobile Pages and Hackers are taking advantage of it", "body": "The security bug extends within Google’s implementation of a new internet rule it has been trying to sell called Accelerated Mobile Pages (AMP). Google has marketed AMP as a process of optimizing web pages for smartphones. Started in late 2015, AMP is intended to provide simpler versions of websites that can load quicker on the often slower data links and microprocessors used by mobile devices.To further advance things up for smartphone users, Google preloads examples of AMP pages listed in search results so they can be immediately loaded if they are finally clicked. The only way this past loading of pages can be performed is to give the cached pages Google.com URLs.Such pre-rendered AMP pages designed by Google show the generated domain at the top of the web page content area. But within a mobile web browser’s address bar at the very top of the screen, they nevertheless appear to be from Google’s website. Furthermore, the disclaimer telling where the page actually starts will disappear as the user scrolls down the page, while the Google address will not.Russian hacktivist group Fancy Bear (also pointed to as APT28, Sofacy, and Strontium) has been using a flaw in Google’s caching of Accelerated Mobile Pages (AMP) to phish targets, Salon reports. To create matters worse, Google has been informed of the bug for almost a year but has refused to fix it. The vulnerability affects how Google delivers google.com URLs for AMP pages to its search users in an attempt to speed up mobile browsing. This presents Google products more vulnerable to phishing attacks.Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "September 24, 2017", "authur": "Eslam Medhat", "title": "New Ransomware demands nude photos as Payment", "body": "Most ransomware request money to unlock files, regularly in the form of bitcoins, but this is the first time to see a malware requiring nude photos in return to getting access to their machine back.Called nRansomware, the ransomware was recognized by a security researcher MalwareHunterTeam who published the screenshot of the ransom notes asking users for their private photos. The notes also showed a short message explaining how a victim can forward their photos to the hackers behind this malware.“Your computer has been locked. You can only unlock it with the special unlock code, go to protonmail.com and create an account. Send an email to [email protected] We will not respond immediatly. After we reply, you must send at least 10 nude pictures of you. After that we will have to verify that the nudes belong to you. Once you are verified, we will give you your unlock code and sell your nudes on the deep web”Once the malware (nRansom.exe) is executed, it will display a stupid lock screen with a tiled Thomas & Friends background that asks for private pictures and then plays the your-mom-gay.mp3 MP3. In fact, this is not a ransomware and simply a locker. You just need to enter a code to unlock the screenTo terminate this locker, you can manually minimize the screen and just kill the nRansom.exe process."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "September 24, 2017", "authur": "Harikrishna Mekala", "title": "The SEC hack resulted in illegal Stock Trades", "body": "The agency discovered the breach last year but didn’t get until last month that it could have obtained used for inappropriate trading. The event was briefly discussed in an unusual eight-page statement on cybersecurity issued by SEC Chairman Jay Clayton late Wednesday. The report didn’t explain the delay in the release, the exact date the operation was breached and whether data about any particular company was targeted.“Notwithstanding our forces to protect our operations and manage cybersecurity risk, in certain circumstances cyber threat actors have succeeded to access or misuse our systems,” Clayton said in the announcement.The system that was breached, known as EDGAR, is a favorite way for investors to obtain the detailed financial records corporations that sell stock to the public must regularly release. It had a “software vulnerability” that was “used and resulted in access to nonpublic information,” Clayton said in the report.The breach didn’t start to the release of individually identifiable information, but “may have given the basis for illicit gain through speculation,” Clayton said. An inquiry into the matter is ongoing, he said.This is not the first time EDGAR has been agreed. The system receives thousands of reports a day and in 2015, fraudsters posted fake data on the site about the takeover of Avon Products, driving the company’s stock value up significantly before it was detected. And in 2014, several researchers found that data submitted was accessible to some users for 30 seconds before it displayed publicly available, possibly giving some traders an unfair advantage. High-speed traders, for example, can make thousands of contracts in a blink of an eye.“Effective management of internal cybersecurity risk is important to the SEC achieving its purpose and to protecting the nonpublic data that is entrusted to this agency,” SEC Commissioner Michael S. Piwowar said in a statement.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "September 23, 2017", "authur": "Harikrishna Mekala", "title": "More than 500,000 Passwords of Car Tracking Devices are Hacked", "body": "The Kromtech Security Center lately got over half a million reports belonging to SVR Tracking, an organization that concentrates in “vehicle recovery,” openly accessible online. SVR presents its clients with throughout-the-clock surveillance of cars and trucks, just in the cause, those vehicles are pulled or stolen. To do “constant” and “live” updates of a vehicle’s position, a tracking device is connected in a discreet location, about a prescribed driver isn’t likely to notice it.According to SVR’s website, the tracking unit provides “continuous channel tracking, every two minutes when moving” and a “four-hour moment when stopped.” Basically, throughout the car has been in the past 120 days should be available, so long as you have the correct login credentials for SVR’s app, which is downloadable for desktops, laptops, and most any mobile device.Kromtech discovered SVR’s data in an openly accessible Amazon S3 bucket. It included data on roughly 540,000 SVR accounts, including email addresses and keys, as well as some license plates and vehicle license numbers (VIN). There were half a million works overall, Kromtech said, “but in some cases, credentials were presented for a record with several vehicles connected with it.”The SVR keys were stored using a cryptographic hash use SHA-1, though one that’s 20 years old and with known defects. Simple passwords saved using this function are likely to be answered with ease. The CynoSure team, for instance, recently announced having broken all but 116SHA-1 hashes from a group of over 319 million passwords published in hash form by Troy Hunt, founder of the website Have I been pwned?As usual, it’s hard to say for how long precisely the data was actually displayed. In the case of Amazon S3 buckets, only Amazon and the bucket’s master can say for sure, and usually, that’s not information either is willing or eager to share.“The overall amount of devices could be much higher given the fact that many of the resellers or customers had large numbers of machines for tracking,” said Kromtech’s Bob Diachenko. “In the age where crime and technology go aid in aid, imagine the possible danger if cybercriminals could find out where a car is by logging in with the data that were openly available online and steal that car?”Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "September 21, 2017", "authur": "Eslam Medhat", "title": "ISPs may be involved in latest FinFisher campaigns", "body": "Security researchers from ESET have discovered a malware campaign utilizing new variants of FinFisher in seven countries, which arrives bundled with a legitimate application.Researchers assume that ISPs used their ability to control user traffic and redirect users trying to download some software to a different link offering the same software, but infected with the FinFisher spyware. Many products such as WhatsApp, Skype, Avast, WinRAR, VLC Player and others have been infected with the malware.According to ESET:\n“New surveillance campaigns utilizing FinFisher, infamous spyware known also as FinSpy and sold to governments and their agencies worldwide, are in the wild. Besides featuring technical improvements, some of these variants have been using a cunning, previously-unseen infection vector with strong indicators of major internet service provider (ISP) involvement.”In fact, The attack begins with the user seeking for one of the modified applications (infected) on legitimate websites. After the victim clicks on the download link, their browser is served a malicious link and therefore redirected to an infected installation software hosted on the attacker’s server.ESET said that this was the first time it saw FinFisher delivered at an ISP level."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "date": "September 21, 2017", "authur": "Harikrishna Mekala", "title": "Bluetooth and WiFi are not actually getting turned off even though user switches them off in iOS 11", "body": "When the user toggles Bluetooth and Wi-Fi off of the iPhone’s Control Center the slightly complex menu that appears when you swipe up from the base of the phone it really doesn’t completely turn them off. While that might appear like a bug, that’s really what Apple expected in the new operating system. But safety researchers suggest that users might not understand this and, as a consequence could leave Bluetooth and Wi-Fi on externally noticing.“It is stupid,” Collin Mulliner, a security researcher who’s studied Bluetooth for years, told News on Twitter. “It is not bright for the user.”To be fair, and to be clear, this response is exactly what Apple wants. In its own documentation, the organization says that “in iOS 11 and later, when you toggle the Wi-Fi or Bluetooth switches in Control Center, your device will instantly disconnect from Wi-Fi and Bluetooth accessories. Both Wi-Fi and Bluetooth will remain to be available.” That is because Apple needs the iPhone to be able to stay using AirDrop, AirPlay, Apple Pencil, Apple Watch, Location Services, and different features, according to the documentation.Experts examined this behavior on an iPhone with iOS 11 connected and verified that Bluetooth and Wi-Fi wait on in the settings after setting them off in the Control Center, as some users have begun to notice.Andrea Barisani, a security researcher and one of the first person to see this change, said in a Twitter that the new user interface is not accessible at all and makes the user experience more “difficult.”Turning off Bluetooth and Wi-Fi decreases your exposure to potential advances in hardware, firmware, and software, so “it’s good practice,” Barisani told me. Just last week, security researchers announced the existence of a series of bugs in the way any operating systems performed Bluetooth that allowed hackers to take over victim’s machines as long as the Bluetooth was on without wanting to trick the user into ticking a malicious link or do anything at all.Take your time to comment on this article."}, {"topics": ["Hacking News", "News"], "date": "September 20, 2017", "authur": "Eslam Medhat", "title": "Viacom’s sensitive data left exposed on unsecured Amazon server", "body": "Viacom is an American popular multinational media company with concerns primarily in cinema and cable television.On August 30th, 2017, a security researcher from California-based cyber resiliency firm UpGuard has found a publicly downloadable Amazon Web Services S3 cloud storage bucket, found at the subdomain “mcs-puppet” and containing about a gigabyte’s worth of credentials and configuration files (72 .tgz files) for the backend of dozens of Viacom properties.The researcher said that each of the .tgz files, an extension usually used for compressing backup data, had been created since June 2017 at irregular intervals.According to researchers:\n“Perhaps most damaging among the exposed data are Viacom’s secret cloud keys, an exposure that, in the most damaging circumstances, could put the international media conglomerate’s cloud-based servers in the hands of hackers. Such a scenario could enable malicious actors to launch a host of damaging attacks, using the IT infrastructure of one of the world’s largest broadcast and media companies.”it is unclear whether attackers were capable of exploiting this data to access critical files belonging to Viacom and the firms it owns, the company said that there’s no evidence anyone had abused its data.The researchers have contacted Viacom privately and now all the credentials have been changed."}, {"topics": ["Cyber Attack", "Hacking News"], "date": "September 19, 2017", "authur": "Eslam Medhat", "title": "A new Android banking Trojan has been discovered", "body": "Security researchers from SfyLabs have discovered a new Android trojan called “Red Alert 2.0” that has been created and distributed over the past several months by a new threat actor. The capabilities of the malware are similar to those of other Android banking Trojans, such as the use of overlays to steal login credentials, or SMS control and contact list harvesting.The Red Alert trojan has many new features to ensure that it still effective. The malware can block and log incoming calls of banks, which could affect the process of fraud operation departments at financials that are calling victims on their infected smartphone about a possible malicious activity.The trojan also uses Twitter to evade losing bots when the C2 server is taken offline. If the bot fails to connect to the hardcoded C2 it will recover a new C2 from a Twitter account. We have noticed this feature before in the desktop banking trojans, but it’s the first time to see it occurring in an Android trojan.According to SfyLabs:\n“The shift of malware campaigns from desktop (Windows) to mobile (Android) seems largely related to the fact that these days most transactions are initiated from mobile devices instead of the desktop. This motivates actors to invest in developing solutions that target Android and have the same capabilities as the malware variants that have been evolving on the desktop for years. “"}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "September 17, 2017", "authur": "Harikrishna Mekala", "title": "After Robots.txt, The Security.txt is going to be the new standard", "body": "The record is similar to robots.txt, a model used by websites to describe and establish policies for web and search engine crawlers.The difference among security.txt and robots.txt is that security.txt will be used to reach a company’s security practices only, and is expected to be read by humans, preferably than automated scanners.For example, if a security researcher discovers a security vulnerability on a website, he can enter the site’s security.txt file for data on how to contact the company and securely report the issue.According to the popular IETF draft, website proprietors would be able to create security.txt files that look like this:Speaking to News, Foudil says he developed up with the idea after visiting the DEF CON security discussion and the H1702 CTF event in the US at the start of August.“During that interval, I was thinking on the amazing offerings some of the people from the events in Las Vegas make to the security business and our community as a whole,” Foudil told News. “This prompted me to stop putting my ideas to myself and start working on designs and sharing my ideas.”Projects like SECURITY.md and BUG-BOUNTY.md files attached to GitHub containers to describe security policies were also a significant inspiration.This is when Foudil put together a first variant of the security.txt designation that he later published on GitHub. Early feedback from the IT security industry changed the researcher to go on.“When x0rz well-known security researcher tweeted about my project I realized that this was something users really needed and that it was a chance to start writing up an RFC draft,” Foudil said.The researcher had lots of guidance from people in the industry. Foudil says feedback from HackerOne, Bugcrowd, Google, and others helped him develop his IETF proposal.The modern IETF draft of security.txt only introduces support for four directives (Contact, Encryption, Disclosure, and Acknowledgement). The security.txt GitHub repo lists many more directives, such as In-scope, Out-of-scope-vuln, Rate-limit, Platform, Reward, Payment-method, Currency, Donate, and Disallow.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "September 16, 2017", "authur": "Harikrishna Mekala", "title": "Data of 200K credit cards was stolen from Equifax Database by Hackers", "body": "Brian Krebs states that the credit bureau reported all this credit card data was obtained as the result of a single attack that got the advantage of a months-old exploit of the Apache Foundation’s Struts framework for Java-based Web applications. Visa and MasterCard both written confidential alerts to banks in their systems this week about the card exposure. Both explicitly blamed Equifax, and Visa linked to Equifax’s press statement on the breach. The events that may have been shown took place in a period crossing November 10, 2016, to July 6, 2017, according to the Visa notification.According to Equifax, the violation began in mid-May and was discovered on July 29. “The attacker entered a storage table that included historical credit card transaction related information,” an Equifax spokesperson told Krebs. The organization did not respond to questions from Krebs about how the data was being cached.The exposure implies that Equifax was both not encrypting stored credit card data or that some element of the company’s Java-based software gave the intruders the ability to access decrypted data. The memory of that data would have been in breach of the standards of the PCI Standards Security Council, which wants all stored data to be encrypted.For consumers, Equifax’s credit card data was expected the least damaging of the displayed information.But it does have an influence on banks, which are among Equifax’s most important consumers for customer credit data. So, ironically, mishandling of credit card data could end up becoming more of a negative impact on Equifax than the vulnerability of critical information.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "date": "September 16, 2017", "authur": "Harikrishna Mekala", "title": "A database containing more than half-million voters data is now exposed because of a misconfigured CouchDB instance", "body": "Records looked to be a part of the voter base, one of the market’s managing national voter file, comprising the contact and voting information of over 191 million voters, and 58 million unregistered, voting age consumers, compiled and produced by TargetSmart, The head provider of political data and technology.Shortly after News got the story with the initial events on that breach and a few examples for verification, the database has been individually secured. In order to explain more details as of who was behind the exposure and for how long files for further than half a million US citizens been online.STATEMENT BY TARGETSMARTWe’ve read that Equals3, an AI software firm based in Minnesota, seems to have failed to secure any of their data and some data they permit from TargetSmart, and that a database of nearly 593,000 Alaska voters seems to have been accidentally exposed, but not obtained by anyone other than the security researchers on our team and the team that knew the exposure.  None of the exposed TargetSmart data added any personally-identifiable non-public financial data. And to be clear, TargetSmart’s database and operations are secure and have not been breached.  TargetSmart forces strict contractual duties on its clients regarding how TargetSmart data must be stored and secured and takes these responsibilities seriously.Equals3 has verified that the file was never obtained by anyone other than the security researcher who took the exposure to our attention, and our team as they studied the exposure. Equals3 assures us that although the data was left open for a time, it has since been taken offline and secured.We are grateful to the Kromtech security researchers for putting this issue with us.How did The Breach happen?It looks that a misconfigured CouchDB situation is once again the culprit. When the database was configured, officials bypassed important security environments that were set to “public” instead of “private”, enabling anyone with an internet connection to gain access the repository. Those who follow cybersecurity news may learn that in early 2017 an estimated 10% of CouchDB servers were victims of ransomware because of the very misconfiguration.Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "September 15, 2017", "authur": "Eslam Medhat", "title": "Vevo Has Been Hacked by OurMine", "body": "OurMine group have hacked Vevo, which is a video hosting service and published 3.2TB of internal files from Vevo’s internal network.“OurMine offers companies security against hacking, charging up to $5,000 for a “scan” of their social media accounts, site security holes, and other security vulnerabilities, and advertises its commercial services by breaking into famous accounts.”The group of hackers (OurMine) said that it published company’s files after one of the Vevo’s employees was rude to an OurMine member on LinkedIn.The group of hackers (OurMine) said that it published company’s files after one of the Vevo’s employees was rude to an OurMine member on LinkedIn.The company’s data were published on the hacker group’s website, it contained links to several data, giving 3.12TB of data for download. These links were made publicly accessible several hours ago, but by that time most of the files were removed. Now, most of the download links redirect to a Vevo Box.com login page. A notice on the website stating that the OurMine group “deleted the files because of a request from VEVO.”Vevo has confirmed the hack and said:\n“We can confirm that Vevo experienced a data breach as a result of a phishing scam via Linkedin. We have addressed the issue and are investigating the extent of exposure.”OurMine has earlier hacked the social media accounts of Facebook co-founder Mark Zuckerberg, Spotify co-founder Daniel Ek, and many other popular accounts."}, {"topics": ["Hacking News", "Vulnerabilities"], "date": "September 14, 2017", "authur": "Eslam Medhat", "title": "Equifax confirm MASSIVE data breach through unpatched Apache Struts Vulnerability", "body": "Equifax has confirmed that a web server vulnerability in Apache Struts that it failed to fix months ago was to blame for the data breach. The company said that attackers used an Apache Struts security flaw to hack its servers.Equifax said:\n“Equifax has been intensely investigating the scope of the intrusion with the assistance of a leading, independent cybersecurity firm to determine what information was accessed and who has been impacted. We know that criminals exploited a U.S. website application vulnerability. The vulnerability was Apache Struts CVE-2017-5638. We continue to work with law enforcement as part of our criminal investigation, and have shared indicators of compromise with law enforcement.”Apache Struts is a free open-source MVC framework for developing web applications in the Java programming language that run both front-end and back-end Web servers.Apache Struts is a free open-source MVC framework for developing web applications in the Java programming language that run both front-end and back-end Web servers.This particular vulnerability enables a remote attacker to execute arbitrary code on any server running an application built using the Struts framework and the popular REST communication plugin. The weakness is caused by the way Struts deserializes untrusted data.The company is currently giving free credit-monitoring and identity theft security services for users who are affected by the massive data breach and has also enabled a security freeze for access to people’s data."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "September 14, 2017", "authur": "Harikrishna Mekala", "title": "US should present an evidence regarding election hacking said by Edward Snowden", "body": "“Everybody is currently calling at the Russians,” Mr. Snowden, 33, told Germany’s, Der Spiegel. “They apparently did hack the operations of Hillary Clinton’s Democratic Party, but we should have evidence of that.”The U.S. Office of the Director of National Intelligence has decided that Russia hindered in last year’s election race by applying state-sponsored hackers and propagandists to target Mrs. Clinton’s campaign in an effort to cut her odds of winning the White House.But Mr. Snowden, a network expert who beforehand worked for the National Security Agency and CIA, said the U.S. administration isn’t being expected with respect to supporting its claims, especially when linked to another recent security breach associated with state actors.“In the case of the hacking intrusion on Sony, the FBI gave evidence that North Korea was behind it. In this case, they didn’t, although I am persuaded that they do have evidence. The question is why?” Mr. Snowden asked.“I think the NSA almost absolutely saw who the invaders were. Why wouldn’t they? But I am also satisfied that they saw a lot of other attackers on there, too,” Mr. Snowden added.As usual, as six or seven separate actors may have infiltrated the DNC, Mr. Snowden proposed, calling it a “big target” with seemingly lax security.“I think the fact here was the historical shaping about the Russians,” added Mr. Snowden, who obtained political asylum from Moscow in 2013 and currently lives in the country as a lawful permanent resident.Russian President Vladimir Putin clearly agrees with Mr. Snowden’s last point on the statement of previously labeling charges of election hacking “hysteria” lashed up by Washington.“Does anyone seriously think Russia can anyhow influence the choice of the U.S. people? Is the U.S. some kind of banana republic?” Mr. Putin said last year. “The United States is a great power. Please change me if I’m wrong.”Mr. Snowden admittedly dripped a trove of classified intelligence in 2013 concerning the NSA and its global surveillance operations. He was consequently charged with violations of the U.S. Espionage Act and theft by the Justice Department but has escaped prosecutions by residing in Russia ever since.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "date": "September 14, 2017", "authur": "Harikrishna Mekala", "title": "Security Blogger reveals that Equifax has username and password as admin", "body": "Krebs said that an online employee tool employed in the nation could be entered by typing “admin” as both a login and password.He continued that this gave admittance to records that involved thousands of customers’ national identity numbers.Last week, the firm announced a separate attack affecting millions in the US.After being informed of the latest breach, Equifax momentarily shut the affected website.“We heard of a potential vulnerability in an inner portal in Argentina which did not in any way connected to the cyber-security incident that happened in the United States last week,” an Equifax spokeswoman told the News.“We quickly acted to remediate the condition, which affected a limited number of information strictly related to Equifax employees.“We have no indication at this time that any users have been negatively hit, and we will proceed to test and update all security measures in the region.”The development came less than a week after Equifax reported that a separate violation meant about 143 million US customers and an undisclosed amount of British and Canadian residents might have had private details exposed.The firm took six weeks to get the discovery public after first knowledge of a problem.On Tuesday, 36 US senators called for a federal inquiry into how three company officials came to sell nearly $2m (£1.5m) value of shares in the business in the interim.Mr. Krebs composed that the Argentine subject involved Equifax’s local business Veraz.Specifically, a web application related to as Ayuda, the Spanish for “help” seems to have been weakly defended.“It was wide open, defended by perhaps the most easy-to-guess phrase combination ever: admin/admin,” wrote Mr. Krebs.The finding was made by the US cyber-security firm Hold Security, which Mr. Krebs advises.Its researchers examined the portal and within obtained a list of more 100 Argentina-based employees, the blogger disclosed.Take your time to comment on this article."}, {"topics": ["Hacking News"], "date": "September 11, 2017", "authur": "Eslam Medhat", "title": "Hackers use Facebook CDN servers to bypass security solutions", "body": "A group of hackers was able to use Facebook CDN (Content Delivery Network) servers to distribute malware and evade detection.“A content delivery network or content distribution network (CDN) is a geographically distributed network of proxy servers and their data centers. The goal is to distribute service spatially relative to end-users to provide high availability and high performance. CDNs serve a large portion of the Internet content today, including web objects (text, graphics and scripts), downloadable objects (media files, software, documents), applications (e-commerce, portals), live streaming media, on-demand streaming media, and social networks.”Security researchers from MalwareHunter team discovered many campaigns leveraging Facebook CDN (Content Delivery Network) servers in the last two weeks to bypass security solutions, earlier, the same malware group used Dropbox and Google’s cloud storage services to store the same payloads.Security researchers from MalwareHunter team discovered many campaigns leveraging Facebook CDN (Content Delivery Network) servers in the last two weeks to bypass security solutions, earlier, the same malware group used Dropbox and Google’s cloud storage services to store the same payloads.The distribution process begins with victims receiving a fake email from the hackers. The emails act as official communications from local authorities and contain a link.They use the Facebook CDN because it enables them to avoid security solutions because the domain is trusted by them and the relevant traffic is not blocked. The links point to Facebook’s CDN (Content Delivery Network). The group upload files in groups or different sections, take the file’s URL, and send it to the victims.The link is something like that:\nhttps://cdn.fbsbx.com/v/t59.2708-21/20952350_119595195431306_4546532236425428992_n.rar/NF-DANFE_FICAL-N-5639000.rar?oh=9bb40a7aaf566c6d72fff781d027e11c&oe=59AABE4D&dl=1When the victim clicks on the link, a compressed file will be downloaded and once the shortcut executed, it invokes a legitimate application (Command Prompt (CMD)) installed on most windows PC to run an encoded PowerShell script."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "September 11, 2017", "authur": "Harikrishna Mekala", "title": "Google is adding a new security measure to Chrome that protects users from MitM Attacks", "body": "A MitM attack is if an app placed on a user’s machine or a local network hinders the user’s web traffic.For the party conducting the MitM attack, the difficult part is trading with encrypted HTTPS traffic. Most MitM toolkits fail to accurately rewrite the user’s encrypted links, causing SSL errors that Chrome will detect.Chrome will display on error when it suspects MitM attacksThe new Chrome 63 feature is in the design of a new warning screen. This new failure will appear whenever Chrome identifies a large number of SSL link errors in a short timespan, a sign that someone is attempting and failing to prevent the user’s web traffic.This involves both malware and certain applications, such as antivirus and firewall purposes. The new Chrome error won’t give up for all antivirus and firewall software, but simply for those that do not edit SSL links in a proper way, following in SSL errors.Sasha Perigo, a Standford student, produced this new security feature while serving as a Google intern.Feature ready for testing in Chrome CanaryAccording to the Chromium Development Calendar, Google will deliver Chrome 63 on December 5, bar any unexpected events.In the meantime, users can view it via the Google Chrome dev branch, also identified as Google Canary.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "date": "September 11, 2017", "authur": "Harikrishna Mekala", "title": "Equifax is trying to influence and remove the law that protects the victims of data breach", "body": "On Friday, social media users spotlighted fine print on Equifax’s website that looks to require users to agree to dismiss their class action claims if they use the company’s website to see if their personal data was revealed by the recent hack. It is accurately the kind of arbitration requirement that a pending Consumer Financial Protection Bureau (CFPB) rule is intended to outlaw if Republicans and the Trump government allow it to go into effect as listed later this month.Federal documents examined by International Business Times show that in answer to that 2016 rule, the Consumer Data Industry Association (CDIA) which says it is “the business association which serves Equifax” pressed governors to back off the stated bans, saying the laws would subject data organizations to tough penalties if through a class action suit they were found to have violated the law.In one part of the letter, CDIA says that federal regulators “should release from its agreement rule class interest claims against providers of credit monitoring products.” The report asserted that allowing consumers to sue companies “would not help the public interest or the public good” because it could reduce the companies to “extraordinary and draconian civil liability provisions” under current law. In a different section of the letter, Equifax’s lobbying group states that a rule blocking organizations from forcing their consumers to waive class action rights would show credit agencies “to unruly class action liability that could result in full disgorgement of revenues” if organizations are found to have illegally hurt their customers.Equifax’s lobbying group held against the ban even as it acknowledged that a 2015 government study found “that credit writing constituted one of the four largest product areas for class action relief” for customers. Customer groups countered the allegations of CDIA and other rule players by saying the ability to file suit is needed to preserve Americans’ legal rights.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "September 11, 2017", "authur": "Harikrishna Mekala", "title": "Five years of jail time imposed on this Hacker for harassing the director CIA and FBI", "body": "Justin Liverman, 23, was a member of a club dubbed “Crackas With Attitude” that showed the private online records of many top law enforcement leaders, including then-CIA chief John Brennan and James R. Clapper Jr., the executive of national intelligence at the time.It was a British teenager, identified as “Cracka,” who really broke into those records by mimicking the officials or employees of their cooperation providers. Liverman and Andrew Otto Boggs, also 23, helped Cracka’s exploits and used the presented information to harass the victims.“These are no pranks,” Judge Gerald Bruce Lee said in sentencing Liverman on Friday in federal court in Alexandria, Va. “This network hacking, Crackas With Attitude, caused chaos. Your intention was clear, and that was to wreak havoc.”It was expressly “despicable,” Lee continued, that Liverman harassed the wives and threatened the kids of several targets.Liverman, of North Carolina, chose any of the victims and drove the harassment operations against them. He paid for an hourly, month-long “phone bombing” campaign going threatening and explicit letters for former FBI deputy director Mark Giuliano. Liverman also texted Giuliano’s phone, asking about his “slut wife” and suggesting that he would “keep a close eye on your family, especially your son!”Giuliano and other victims are not identified in court papers, but their names have been confirmed by officials familiar with the details of the case.Through Giuliano’s credentials, Cracka got into the Law Enforcement Enterprise Portal, a network system that gives firms around the world access to unknown but sensitive law enforcement information. Liverman asked personal details on Miami police officers, which he then posted online.“Liverman leveraged Cracka’s superior social engineering skills to his own ends namely, to create disruption despair through harassment and to advance to perform his online fraud of being an administrator of a hacking group and a successful hacker himself,” Special Assistant U.S. Attorney Joseph Longobardo composed in his sentencing memorandum.According to Liverman’s attorneys, Boggs was undeviatingly involved in cracking into the law enforcement databases and exhibiting the personal information of 20,000 people.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Vulnerabilities"], "date": "September 10, 2017", "authur": "Harikrishna Mekala", "title": "Microsoft won’t fix a 10 year-old Windows Kernel Bug which causes security issues", "body": "The flaw affects a low-level interface, identified as PsSetLoadImageNotifyRoutine, that states when a module has been placed into the Windows kernel. The flaw can allow an intruder to forge the name of a full module, a way that can lure third-party security products, and provide malicious actions without any notice.Omri Misgav, a safety researcher at enSilo, who also composed a blog post on the bug, said that the flaw appears to be a “programming error” in the kernel.All variants of Windows are affected.PsSetLoadImageNotifyRoutine was first introduced in Windows 2000 to notify drivers, such as those powering safety products, when a module is placed into a process and the module’s address in memory, providing security products to track modules.But the researchers noticed that Windows doesn’t ever return the correct result, determining security products such as anti-malware doesn’t recognize which malicious file to scan.“Any security vendor that relies on the data supplied by this information routine may be tricked into looking at the corrupt module at load time,” Misgav told News. He continued that enSilo had not examined any specific security products.The researchers probed Microsoft’s own documentation, which has “no mention” of void paths.Misgav wrote that in order to replicate the bug, a user would have to make a series of simple file operations. “Once these actions are performed the information routine will receive an incorrect path,” he said.But Microsoft “did not consider it as a security issue,” said Misgav.When contacted, a Microsoft spokesperson said: “Our technicians reviewed the data and determined this does not pose a safety threat and we do not plan to address it with a security update.”Take your time to comment on this article."}, {"topics": ["Cyber Attack", "Hacking News", "News", "Uncategorized"], "date": "September 10, 2017", "authur": "Harikrishna Mekala", "title": "Equifax can be sued if you have suffered from Data Breach according to the Class Action Lawyers", "body": "Now, predictably, the state action lawsuits are starting to flow in. One class will seek “as substantial as $70 billion in losses nationally,” according to News. Whether those lawsuits will continue up in court, however, is less certain.But many users on social media must be dug into the terms of service for TrustedID, Equifax’s own identification protection product, and have increased fears that by simply telling to see if you were a part of a hack, you may be sacrificing your right to sue.TrustedID’s terms have “a waiver of the capacity to bring or join in a class action, class arbitration, or other characteristic action,” or “to share in any class performance awards.” Some worry this may keep them from a class operation lawsuit, but lawyers tell News that this clause will be difficult for Equifax to enforce in court.Anyone hoping to discover whether their data had been stolen has been proposed to TrustedID. By presenting their last name, and the last six digits of their social security number, people are thought to be able to learn if they were hit though there are reports that TrustedID’s answers have changed for certain people.In a statement, Equifax verified to Yahoo Finance that TrustedID’s adjustment clause doesn’t apply to “the cyber security incident.” But that doesn’t mean the corporation can’t try to use that clause in a potential legal proceeding.“In the past, parent companies have tried to enforce the arbitration requirements of their subsidiaries, but are typically useless. There are some other opportunities for Equifax if they try to force the case into adjustment,” Joseph Sauder, a partner at McCune Wright Arevalo, LLP, which is currently investigating the hack, told News.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized", "Vulnerabilities"], "date": "September 10, 2017", "authur": "Harikrishna Mekala", "title": "A Serious Security Flaw has been found in Vote Counting Software in Germany", "body": "A part of the group, Martin Tschirsich, an IT senior from Darmstadt, said he was surprised to come across the gaps in the 30-year old system.Voting in Germany is made with pen and paper, and the results are calculated by hand and then adjusted by computer. The hackers said while final decisions could not be changed, a false early result could quickly be sent out, indicating chaos and confusion.“First of all I imagined this can’t be possible,” Tschirsich told hessenschau.de. “Trust in the voting process could be damaged if the real result was to differ significantly from the preceding ones.”He said he did out of the need to protect the constitutional process by notifying the authorities of the vulnerabilities, which he thought could have been spotted by “even the utmost average” IT student.The organization that runs the software, vote iT, said it was managing to fix the problems.Tschirsich told he had gone to the media with his conclusions after being rejected by both vote iT and the electoral offices. “They were very deprecatory towards me,” he said.The hacker collective Chaos Computer Club (CCC) said it had found a series of defects in the software that made it “highly vulnerable” to manipulation.Security analysts have long suggested that certain German authorities must take a sincere approach to election security, with leaders often stating that a hand-counted result could not be shaped. But the high-profile incidents of hacking in the US and France in which the secret documents of Hillary Clinton and Emmanuel Macron have been circulated have agreed as a wake-up call.A widespread approval of Russian interference in both the US and France, as well as a hack attack on the Bundestag in 2015 which is supposed to have had all the signs of Russian involvement, have provoked the German government to heighten both its voting technology and election security, though few particular details of actions taken have been released.Take your time to comment on this article."}, {"topics": ["Hacking News", "News", "Uncategorized"], "date": "September 9, 2017", "authur": "Harikrishna Mekala", "title": "600 BTC is being demanded by Hackers who hacked Equifax as a Ransom for not releasing the Data", "body": "That’s is the information according to an onion site, whose writers require that if Equifax forks over 600 Bitcoin roughly $2.66 million at the moment of this writing then erase all the stolen data. Oh, and Equifax rightly decide quickly, because if the payment isn’t paid, the self-identified hackers say they’ll drop all the data on September 15th.Well, about all of the data. The thought hackers wrote that they won’t openly post credit card numbers implying an aim to get some illegal use out of those.“We are two persons attempting to solve our lives and those of our families,” the site explains. “We did not anticipate to get as much data as we did, nor do we want to attack any citizen. But we need to monetize the data as soon as possible.”Now, you’d be wise to be skeptical of these cases, after all, it’s pretty simple to throw commonly a website and pretend to be a hacker. But, there’s a twist: In a letter directed to Equifax, the authors say they can prove they’re legit.“Request a particular part or a specific data from an email that answers to Equifax and we will send it to you,” the group explains.News reached out both to Equifax and the body or persons behind the onion site, but haven’t got a reply from either as of press time. We’ll renew the article this when and if we hear back.The purported hackers, while, appear to not be outwardly a sense of humor albeit, a puzzling one. That 600 BTC payment equalling roughly $2.6 million? Here’s how they pretend to have arrived at the number.“Equifax officials sold 3 million bucks in shares taking advantage of their insider data after the attack,” notes the site. “We think that 600 BTC is a fair amount.”Take your time to comment on this article."}]