[{"navigation": "Government_Defense", "news_list": [{"news_name": "War documents, including assassination plan, stolen by North Korean hackers", "news_link": "https://www.scmagazine.com/war-documents-including-assassination-plan-stolen-by-north-korean-hackers/article/699112/", "title": "War documents, including assassination plan, stolen by North Korean hackers", "author": "Tony  Morbin", "author_link": "https://www.scmagazine.com/tony--morbin/author/3963/", "date": "October 10, 2017", "body": "North Korean hackers have stolen joint South Korean-US plans for war with the north, including plans to assassinate North Korean leader Kim Jung Un, according to an FT report quoting Lee Cheol-hee, a member of South Korea's Democratic party.\n\nA defence data centre was apparently broken into in September last year, with some 235 gigabytes of data stolen, including Operational plan 5015, the latest plan for war with North Korea, though 80 percent of the documents are yet to be identified said Lee. They believed to include information on significant power plants and military facilities in the South, reports to the allies' senior commanders, and details on special forces,  but the South Korean military have not given any confirmation of these reports.\n\nNorth Korea's cyber-warfare units have been blamed for various state attacks, with GCHQ suggesting the country may have been responsible for WannaCry,  while FireEye says it has been attempting to steal bitcoin from South Korean exchanges, and the North Korean Lazarus group is thought by some to be behind the hack of the Swift banking system, as well as the Sony hacks which were believed in revenge for The Interview film ridiculing North Korea's  leader.\n\n \n\nChris Doman, security researcher at AlienVault, who is investigating hacking groups in North Korea, emailed SC Media UK to comment, \"The recent North Korea cyber hack may relate to the reported August 2016 compromise of the South Korean ministry of defence,\" going on to suggest that: \"The group behind those attacks are named Andariel and likely a sub-group of the attackers behind the Sony attacks, WannaCry and SWIFT bank hacks. They are very active and we continue to see new malware samples from them every week.\"\n\nThe FT reports how Seoul's military online network was breached in May with state-run Yonhap news agency reporting Shin Jong-woo, a researcher at the Korea Defense and Security Forum as saying at that time,  “This is a total failure of management and monitoring [of classified information].”\n\nIt also offers another possible scenario,  quoting Kim Tae-woo, former president of the Korea Institute for National Unification, a South Korean think-tank, as saying,  “Part of my mind hopes the South Korean military intentionally leaked the classified documents to the North with the intention of having a second strategy.” \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybecrime/topic/50062/", "topic_name": "Cybecrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}]}, {"news_name": "Kaspersky Labs denies report its software was used to hack NSA", "news_link": "https://www.scmagazine.com/kaspersky-labs-denies-report-its-software-was-used-to-hack-nsa/article/698447/", "title": "Kaspersky Labs denies report its software was used to hack NSA", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "October 05, 2017", "body": "Russian hackers used a Kaspersky Labs antivirus product to steal hacking tools from the National Security Agency (NSA), The Wall Street Journal reported Thursday.\n\nCiting unnamed sources the WSJ said the Russians targeted a U.S. government contractor that was using the Kaspersky product using it to identify documents being held on the contractor's system. The hack reportedly took place in 2015 and was only discovered this spring. \n\nKaspersky Labs' CEO Eugene Kaspersky immediately took to Twitter to refute the claim.\n\nDissecting the recent WSJ story: С-movie script and yes, we're proud of aggressively protecting our users ⇒ https://t.co/qg6ZkHCkvV\n\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n“With big power comes big responsibility. We never betray the trust that our users put into our hands. If we would do that a single time that would be immediately spotted by the industry and our business would be done,” he said in a company blog addressing the article.\n\nIn September the U.S. Department of Homeland Security banned the use of any Kaspersky product on a government computer citing concern over ties between certain Kaspersky officials and Russian intelligence and other government agencies, and requirements under Russian law that allow Russian intelligence agencies to request or compel assistance from Kaspersky and to intercept communications transiting Russian network.”\n\nKaspersky went on to say that even if there were a few unethical people at his firm they would be countered by the “dozens” of internal technological and organizational barriers in place that would mitigate the situation, along with all the other employees, some of whom would be bound to see such nefarious moves and take action. \n\nSen. Jeanne Sheehan, D-NH, tweeted “This should serve as a stark warning to all. Trump admin should declassify info on Kaspersky Lab to raise awareness.”\n\nSen. Ben Sasse, R-Neb., called on the NSA to figure out its contractor problem. Edward Snowden was a contractor when he released reams of data from the NSA in 2013. He is currently wanted by the U.S. and is living under asylum in Russia.\n\n“Russia is a clear adversary in cyberspace and we can't afford these self-inflicted injuries,” Sasse said in a written statement.\n\nA treasure trove of government hacking tools have been released, and then put to use by cybercriminals, by Wikileaks and The Shadow Brokers, during the last year. The huge WannaCry and NotPetya attacks that took place earlier this year were based on vulnerabilities discovered by U.S. government agencies.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/hacking/topic/47220/", "topic_name": "Hacking"}]}, {"news_name": "Senate intel committee still probing Russian collusion, calls for social media transparency", "news_link": "https://www.scmagazine.com/senate-intel-committee-still-probing-russian-collusion-calls-for-social-media-transparency/article/698089/", "title": "Senate intel committee still probing Russian collusion, calls for social media transparency", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 04, 2017", "body": "While the Senate Intelligence Committee still “has more work to do” in its probe of collusion between Russian operatives and the Trump campaign, according to Chairman Richard Burr, R-N.C., the panel's vice chairman, Mark Warner, D-Va., called for social media companies like Facebook to be more transparent.\n\n\"The committee continues to look into all evidence to see if there was any hint of collusion,\" Burr told reporters on Capitol Hill, noting that his “aspirational goal” was to bring the investigation to a close by year's end.\n\nLawmakers are in agreement, though, that Russia meddled in the 2016 U.S. presidential election. \"We have not come to any determination on collusion or Russia's preferences,\" said Burr. \"It seems that the overall theme of the Russian involvement in the U.S. elections was to create chaos at every level. And I would tell you the fact that we're sitting here nine months later investigating it, they have been pretty darn successful.\"\n\nThus far, the committee has conducted more than 100 interviews, Burr said, speaking with members of the intelligence community, seven people who attended an event in April 2016 at Washington's Mayflower Hotel, those who altered the Republican stance on Ukraine, former Trump Campaign Manager Paul Manafort, the president's son-in-law, Jared Kushner, and former FBI director James Comey.\n\nFormer MI6 Agent Christopher Steele, who put together at times lurid details on Donald Trump in the now infamous dossier, has eluded the committee's probe, rebuffing entreaties by both Warner and Burr and hampering the lawmakers' ability to “decide the credibility\" of the file.\n\nThe committee chairman called the probe of Comey's memos on a series of uncomfortable meetings with Trump as having reached “a logical end as it relates to the Russia investigation.”\n\nOther persons of interest to the committee, including Tump attorney Michael Cohen, whose closed door meeting was canceled after he released a statement in preface of his appearance, is expected before the panel.\n\nBurr warned future witnesses that if they don't bring information of value to the committee “I will assure you today you will be compelled to do it.”\n\nWarner told reporters that he wanted to see social media companies make key changes that would help mitigate the threat of ads placed by foreign entities, including cluing Americans in on the source of ads and whether “likes” that make a story trend come from real users or bots. \n\n“If you see an ad on a social media site, Americans should know whether the source of that ad was a foreign entity and if you see something trending, you should know whether that trending is generated by real individuals or bots or falsely identified accounts,” he said, noting that his initial concerns that some social media companies did not take the threat \"seriously enough\" have been allayed. “I believe they are taking it seriously now.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}]}, {"news_name": "Equifax snags $7.25M no-bid IRS ID verification, fraud prevention contract", "news_link": "https://www.scmagazine.com/equifax-snags-725m-no-bid-irs-id-verification-fraud-prevention-contract/article/697825/", "title": "Equifax snags $7.25M no-bid IRS ID verification, fraud prevention contract", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 04, 2017", "body": "The Internal Revenue Service handed breach-beleaguered Equifax a $7.25 million for identity verification and fraud prevention. \n\nThe sole source, no-bid contract was awarded at the end of September, even after the credit reporting company disclosed a breach that exposed the information of 145.5 million U.S. consumers and prompted the abrupt retirement of three executives as well as congressional and regulatory probes.\n\n\"This action was to establish an order for third party data services from Equifax to verify taxpayer identity and to assist in ongoing identity verification and validations needs of the Service,\" according to a notice posted on the Federal Business Opportunities website, which said \"a sole source order is required to cover the timeframe needed to resolve the protest\" on a contract. \"This is considered a critical service that cannot lapse.\"\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/data-breach/topic/47235/", "topic_name": "Data Breach"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}]}, {"news_name": "Facebook discloses content of Russian-placed ads", "news_link": "https://www.scmagazine.com/facebook-discloses-content-of-russian-placed-ads/article/697707/", "title": "Facebook discloses content of Russian-placed ads", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "October 03, 2017", "body": "Facebook gave a broad overview of the content contained in the 3,000 ads that were placed on the social media site Russian Internet Research Agency during and after the 2016 election cycle and that were turned over to House and Senate intelligence committees in early September.\n\nOn its blog Facebook's Vice President of Policy and Communications Elliot Schrage said about 10 million people in the United States saw at least one of the ads with 44 percent of the ads being served before the November 8, 2016 election and the remainder afterward. Some of the ads were not seen at all as the algorithm's designed to match the ad to the right person simply did not find a proper audience. Less than $1,000 was spent to promote 99 percent of the ads.\n\nSchrage said the process the company undertook gave it a better understanding of how it was abused.\n\nThe ads were delivered using Facebook's ad targeting technology, something it knows can be abused so the company is introducing ways to keep this from happening.\n\n“These are worthwhile uses of ad targeting because they enable people to connect with the things they care about. But we know ad targeting can be abused, and we aim to prevent abusive ads from running on our platform. To begin, ads containing certain types of targeting will now require additional human review and approval,” Schrage wrote.\n\nSchrage said some of the ads were paid for using Russian currency, but that is not a good enough reason to raise suspicion about an ad.\n\n“In looking for such abuses, we examine all of the components of an ad: who created it, who it's intended for, and what its message is. Sometimes a combination of an ad's message and its targeting can be pernicious. If we find any ad — including those targeting a cultural affinity interest group — that contains a message spreading hate or violence, it will be rejected or removed,” he wrote.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/social-media/topic/47245/", "topic_name": "Social Media"}]}, {"news_name": "Equifax twice missed finding Apache Struts vulnerability allowing breach to happen", "news_link": "https://www.scmagazine.com/equifax-twice-missed-finding-apache-struts-vulnerability-allowing-breach-to-happen/article/697693/", "title": "Equifax twice missed finding Apache Struts vulnerability allowing breach to happen", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "October 03, 2017", "body": "Former Equifax CEO and Chairman Richard Smith sat before a house committee today where he was taken to task for his actions during the period when his company exposed the personal information of 145.5 million people.\n\nThe most eye-opening testimony he gave before the House Energy and Commerce Committee Subcommittee on Digital Commerce and Consumer Protection surrounded the fact that Equifax learned of the Apache Struts vulnerability from U.S. CERT and then twice searched for any issues in its networks coming up empty each time and thus allowing the flaw to remain unpatched in its Consumer Dispute Portal. Smith also claimed to have no knowledge of the total extent of the problem until July 31 when the issue was brought to him by his cybersecurity team.\n\nIn Smith's prepared remarks he said U.S. CERT notified Equifax of the problem on March 8 and the following day the news was given to the security team. As per company policy these workers had 48 hours to search for and then patch any problems.\n\n“Apache Struts within Equifax was not identified or patched in response to the internal March 9 notification to information technology personnel,” Smith said.\n\nAdditional scans were run on March 15 again searching for the Apache Struts vulnerability, but came up empty.\n\n“Equifax's efforts undertaken in March 2017 did not identify any versions of Apache Struts that were subject to this vulnerability, and the vulnerability remained in an Equifax web application much longer than it should have,” he said.\n\nPravin Kothari, Founder and CEO of CipherCloud, called the CERT notification something that should have triggered an all hands on deck response, but he believes the company's focus was elsewhere and not on cybersecurity.\n\n\"A good security process would have identified vulnerable systems within 24 hours and patch must have been applied. But the Equifax process was “weak and broken” because it failed to identify the vulnerable systems. This process is supposed to run every day; not only did they not identify the vulnerability immediately, it went unidentified until they found the breach. It was too late,\" he told SC Media.\n\nIn a bipartisan reaction none of the committee members were satisfied with Smith's comments and raked him over the coals with Rep. Greg Walden, R-Ore., saying it would be hard to pass legislation that would prevent this from happening in the future.\n\n“I don't think we can pass a law that, excuse me for saying this, fixes stupid,\" said Walden.\n\nIt also came out in Smith's testimony that if the Equifax information security team had found the vulnerability in March the entire incident could have been avoided. The recently completed forensic investigation revealed that the hackers did not access any sensitive information until May 13 and that between that date and July 30 the hackers continued to have access to the system exploiting the Apache Struts vulnerability all while Equifax remained in the dark.\n\nThe first clue that something was amiss, Smith said, took place on July 29 when the IT staffers noted suspicious activity in the Consumer Dispute Portal. That day the illegal traffic was blocked, but it was again spotted on July 30 when the application was taken offline.\n\nSmith said he was first informed of the problem on July 31 by Equifax's, now former, CIO David Webb, but he claimed at that time he was unaware “that personal identifying information had been stolen, or have any indication of the scope of this attack.”\n\nOn August 2 Equifax retained the cybersecurity group at the law firm of King & Spalding to handle the investigation and provide legal advice and the company contacted the FBI. By August 11 it was known that the hackers may have accessed a data table containing  customer personal information, and then revealed on August 15 that the information was not only accessed but stolen.\n\n“On August 17, I held a senior leadership team meeting to receive the detailed briefing on the investigation. At that point, the forensic investigation had determined that there were large volumes of consumer data that had been compromised. Learning this information was deeply concerning to me, although the team needed to continue their analysis to understand the scope and specific consumers potentially affected,” Smith testified.\n\nThe first member of the company's board of directors was not notified until August 22 and the full board not for another two days. The board met for the first time to discuss the matter on September 1. \n\nRep. Leonard Lance, R-N.J., asked Smith why he took so long to loop in the board. Smith replied that the situation was fluid and he wanted it to settle down first.\n\nOne of the reasons Smith cited for holding off on going public was the fear that once the news broke it would open the company to further cyber intrusions and the need to further harden their systems.\n\nThe news was released on September 7.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/data-breach/topic/47235/", "topic_name": "Data Breach"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/patch/topic/47236/", "topic_name": "Patch"}]}, {"news_name": "FBI does not have to reveal San Bernardino shooter iPhone hacking vendor", "news_link": "https://www.scmagazine.com/fbi-does-not-have-to-reveal-san-bernardino-shooter-iphone-hacking-vendor/article/697340/", "title": "FBI does not have to reveal San Bernardino shooter iPhone hacking vendor", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "October 02, 2017", "body": "A federal judge has ruled that the Federal Bureau of Investigation does not have to reveal the vendor it hired nor the price paid to access data on the iPhone 5C used by San Bernardino shooter Syed Rizwan Malik and his wife Tashfeen.\n\nThe Associated Press, USA Today and Vice Media in September 2016 filed a Freedom of Information Act lawsuit  to press the FBI to reveal the third-party vendorit contracted with that was able to access the iPhone. The FBI released the majority of the information required, but withheld the vendor name and price citing exemptions 1, 3, and 7(E) for the vendor and 4 for the price paid.\n\nThe FBI stated that that exposing the vendor's name could expose the company and the information it holds to cyberattack as it may be less capable than the FBI of protecting itself.\n\n“The court therefore finds that the FBI has shown that the release of the vendor's identity could be reasonably expected to cause harm to national security interests by limiting the FBI's present and future ability to gain access to suspected terrorists' phones,” said Judge Tanya S. Chutkan.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/hacking/topic/47220/", "topic_name": "Hacking"}, {"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}]}, {"news_name": "Twitter's disclosure on election influence peddling insufficient: Sen. Warner", "news_link": "https://www.scmagazine.com/twitters-disclosure-on-election-influence-peddling-insufficient-sen-warner/article/696806/", "title": "Twitter's disclosure on election influence peddling insufficient: Sen. Warner", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "September 29, 2017", "body": "Twitter's revelation that it had identified about 200 accounts that may have broken the social media giant's terms of service and were possibly linked to nefarious activity geared toward influencing the 2016 U.S. election did not impress certain members of the Senate Select Committee on Intelligence and House Permanent Select Committee.\n\nIn a blog post, Twitter said that Colin Crowell, the company's vice president for public policy, met on Sept. 28 with the Senate and House committees to disclose what has so far been discovered in its investigation into possible trolling and tweets designed to influence the election. Crowell said Twitter looked at the 450 accounts Facebook had discovered to be problematic and found 22 of those had a corresponding Twitter account. The company then used those 20 accounts to track down another 179 that were linked or related and took action against those that violated Twitter's terms of service. \n\nSen. Mark Warner (D-Va.) took exception to Twitter's explanation, calling it inadequate, ABC News reported.\n\n“Their response was frankly inadequate on almost every level,” Warner said. “I'm more than a bit surprised that anyone from the Twitter team would think that the presentation they made to the Senate staff today even began to answer the kind of questions we'd asked. So there is a lot more work they need to do,” Warner said, according to ABC News.\n\nHowever, Chris Olson, CEO of The Media Trust said digging out this type of information is no simple task even for a massive tech firm like Twitter or Facebook.\n\n “The ability for Twitter and Facebook to completely disclose content planted by Russia isn't as easy as it sounds. There are two issues that need to be addressed: posts and advertising. Posts are content contributed by individuals and there's no incentive—or law—to verify the identity of these individuals, especially for a free service. The advertising front is different. An ad-supported website is incentivized to attract users, as user volume drives the value of advertising inventory.\n\n\n\nContinue Reading Below\n\nFacebook has already committed to sharing more than 3,000 Russia-linked political ads – placed on the social network by a group called the Internet Research Agency during and after the 2016 presidential campaign – with intelligence committees in both the Senate and the House that are probing Russian meddling in the election. \n\nTwitter also revealed to the committees that Russia Today (RT), which U.S. intelligence believes to have ties to the Russian government, placed ads that were targeted at the American market by three RT accounts. Details on the ads were not given, but Twitter said RT spent $274,100 in U.S. ads in 2016 and that Twitter handles @RT_com, @RT_America, and @ActualidadRT promoted 1,823 tweets that definitely or potentially targeted the U.S. market.\n\nTwitter reported that during the course of 2016 it came across and removed posts that tried to confuse voters or passed along incorrect information. This included a tweet that misleadingly said you could vote for Democratic presidential candidate Hillary Clinton via text. \n\n“We have not found accounts associated with this activity to have obvious Russian origin, but some of the accounts appear to have been automated. We have shared examples of the content of these removed Tweets with congressional investigators,” Twitter wrote.\n\n", "topics": []}, {"news_name": "DHS tells Calif., Wis., Russians targeted networks other than election systems", "news_link": "https://www.scmagazine.com/dhs-tells-calif-wis-russians-targeted-networks-other-than-election-systems/article/696520/", "title": "DHS tells Calif., Wis., Russians targeted networks other than election  systems", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 28, 2017", "body": "After alerting officials in 21 states that hackers affiliated with the Russian government targeted their election systems during the 2016 presidential election, the Department of Homeland Security (DHS) Wednesday told California and Wisconsin that instead the hackers actually had aimed at other networks in their systems.\n\n“Our notification from DHS last Friday was not only a year late, it also turned out to be bad information,” California Secretary of State Alex Padilla said in a statement.\n\nThe states had pressed DHS for official confirmation that their systems were targeted but the agency had been slow to respond.\n\n\n\nContinue Reading Below\n\nSen. Mark Warner, D-Va., had called the delay “unacceptable” and pledged that the Senate Intelligence Committee on which he's the vice chairman would press on in its investigation of activities during the 2016 election.\n\n“We heard feedback from the secretaries of state that this was an important piece of information,” DHS Deputy Undersecretary for the National Protection and Programs Directorate Bob Kolasky said after the 21 states were alerted, according to the Washington Post.\n\nHackers still could have targeted the systems in California and Wisconsin, the Associated Press cited DHS spokesperson Scott McConnell as saying, since “discussions of specific IP addresses do not provide a complete picture of potential targeting activity.”\n\n", "topics": []}, {"news_name": "U.S. to collect immigrants' social media info", "news_link": "https://www.scmagazine.com/us-to-collect-immigrants-social-media-info/article/695869/", "title": "U.S. to collect immigrants' social media info", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 26, 2017", "body": "The Department of Homeland Security (DHS) will expand the categories of records it collects on immigrants to include social media data.\n\nIn a new rule listed in the Federal Register and set to go into effect October 18, DHS will make “social media handles, aliases, associated identifiable information, and search results” part of an immigrant's official record. The rule will apply to new immigrants as well as naturalized citizens and permanent residents.\n\nIn what it said was an attempt to spot terrorists, Customs and Border Patrol (CBP) had already amended Electronic System for Travel Authorization (ESTA) form to request information on immigrants' online personas.\n\nThe current “Privacy Act notice makes clear that the government intends to retain the social media information of people who have immigrated to this country, singling out a huge group of people to maintain files on what they say,” the American Civil Liberties Union (ACLU) said in a statement. “This would undoubtedly have a chilling effect on the free speech that's expressed every day on social media.”\n\nThe rights organization said the “collect-it-all approach is ineffective to protect national security and is one more example of the Trump administration's anti-immigrant agenda.”\n\nContinue Reading Below\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/social-media/topic/47245/", "topic_name": "Social Media"}]}, {"news_name": "Bannon, Priebus among additional Trump staffers found using personal email", "news_link": "https://www.scmagazine.com/bannon-priebus-among-additional-trump-staffers-found-using-personal-email/article/695663/", "title": "Bannon, Priebus among additional Trump staffers found using personal email", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "September 26, 2017", "body": "In the wake of the revelation that presidential advisor Jared Kushner used a private email account during the early portion of the Trump administration, reports have been published citing five additional White House staffers with the same activity.\n\nThe New York Times listed former White House Strategist Stephen Bannon and former Chief of Staff Reince Priebus as occasionally having used private email addresses with advisers Gary Cohn and Stephen Miller each having sent a handful of emails through their personal email accounts. In addition, the Times, citing an unnamed source, said President Trump's daughter Ivanka also used her account for government business a few times.\n\nWhite House Press Secretary Sarah Huckabee Sanders said on Monday at a press conference that all staffers have been told to use their government accounts or if they receive an official email in their personal email account to then forward it to the proper email system. According to the Times, this is the proper procedure for handling emails.\n\nThe Trump campaign consistently battered Democratic candidate Hillary Clinton for her use of a private email server while serving as Secretary of State. \n\nNone of the emails in question have been released to the public.\n\nContinue Reading Below\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/email-security/topic/47206/", "topic_name": "Email Security"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}]}, {"news_name": "Report: Jared Kushner, White House officials have communicated using personal email accounts", "news_link": "https://www.scmagazine.com/report-jared-kushner-white-house-officials-have-communicated-using-personal-email-accounts/article/695334/", "title": "Report: Jared Kushner, White House officials have communicated using personal email accounts", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "September 25, 2017", "body": "Presidential senior adviser Jared Kushner has reportedly communicated with members of the White House administration using a private email account instead of his official government account, despite President Donald Trump's frequent claims that Hillary Clinton threatened national security by doing the same thing while serving as Secretary of State.\n\nA Politico report has confirmed approximately two dozen emails in which Kushner uses the private account, established last December during the presidential transition, to discuss matters such as media coverage and event planning with various individuals, including former chief of staff Reince Priebus, former chief strategist Steve Bannon, and National Economic Council director Gary Cohn. In some cases, Bannon, Priebus, and other White House officials also used their own private email accounts, the report continues.\n\nIn a statement on Sunday, Abbe Lowell, a lawyer for Kushner, acknowledged his client's use of the private account, Politico reported. “Mr. Kushner uses his White House email address to conduct White House business,\" said Lowell. \"Fewer than 100 emails from January through August were either sent to or returned by Mr. Kushner to colleagues in the White House from his personal email account. These usually forwarded news articles or political commentary and most often occurred when someone initiated the exchange by sending an email to his personal rather than his White House address.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/email-security/topic/47206/", "topic_name": "Email Security"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}]}, {"news_name": "DHS notifies 21 states they were targets of Russian hackers", "news_link": "https://www.scmagazine.com/dhs-notifies-21-states-they-were-targets-of-russian-hackers/article/695328/", "title": "DHS notifies 21 states they were targets of Russian hackers ", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 25, 2017", "body": "Oklahoma, Alabama, Colorado, Virginia, Connecticut, Washington, Iowa, Wisconsin, Maryland, Pennsylvania, Minnesota and Ohio, appear to be among the 21 states whose officials were told by The Department of Homeland Security Friday that their election systems had been the targets of hackers representing the Russian government. \n\nThe states had pressed for confirmation that their systems had been in the crosshairs of Russian hackers. \n\n\"We heard feedback from the secretaries of state that this was an important piece of information,\" the Washington Post quoted Bob Kolasky, acting DHS deputy undersecretary for the National Protection and Programs Directorate, as saying. \"We agreed that this information would help election officials make security decisions.\"\n\n\n\nContinue Reading Below\n\nCalling the delay in notification \"unacceptable,\" Senate Select Committee on Intelligence Vice Chairman Sen. Mark R. Warner, D-Va., said in a statement that he was \"relieved that DHS has acted upon our numerous requests and is finally informing the top elections officials in all 21 affected states that Russian hackers tried to breach their systems in the run up to the 2016 election.\"\n\nPledging that his committee would continue its \"bipartisan investigation into what happened in 2016\" and \"determine what steps we need to take to stop the next attack on our democracy,\" Warner stressed that “All 50 states need to be proactively strengthening the security of their election systems in the face of this threat.\"\n\nDHS did not initially release the names of those states affected but the Associated Press and others have offered a partial tally.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}]}, {"news_name": "D.C. appeals court overturns conviction in warrantless stingray case", "news_link": "https://www.scmagazine.com/dc-appeals-court-rules-warrantless-stingray-use-unconstitutional/article/695127/", "title": "D.C. appeals court overturns conviction in warrantless stingray case", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "September 22, 2017", "body": "D.C. Court of Appeals ruled the use of stingrays, or cell-site simulators, without a warrant is unconstitutional on the grounds of violating the Fourth Amendment resulting in the overturning of the conviction of a robbery and sexual assault suspect.\n\nThe courts once again determined the use of the device \"to locate a person through his or her cellphone invades the person's actual, legitimate and reasonable expectation of privacy in his or her location information and is a search,\" officials said in court documents dated Sept. 21, 2017.  \n\nThe court further concluded that under ordinary circumstances the use of the devices to locate a through his or her cellphone invades the person's actual, legitimate and reasonable expectation of privacy in his or her location information and is a search.\n\nThe Electronic Frontier Foundation said the decision should serve as yet another warning to law enforcement that new technologies do not mean investigators can bypass the Constitution.\n\n“If police want data from our devices, they should come back with a warrant,” the EFF said in a Sept 21. blog post. \n\nThe House Oversight and Government Reform Committee found U.S. between 2010 and 2014, taxpayers spent $95 million on 434 cell-site simulator devices averaging $500,000 per device.  \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/legal-action/topic/47242/", "topic_name": "Legal Action"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Senate passes OPEN Government Data Act provisions as part of NDAA", "news_link": "https://www.scmagazine.com/senate-passes-open-government-data-act-provisions-as-part-of-ndaa/article/689997/", "title": "Senate passes OPEN Government Data Act provisions as part of NDAA", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 20, 2017", "body": "By passing the National Defense Authorization Act (NDAA), the Senate gave the go-ahead to the provisions of the Open, Permanent, Electronic and Necessary (OPEN) Government Data Act, which are included as an amendment to the NDAA.\n\n “After two years of bipartisan efforts to pass legislation codifying open data requirements for the federal government, it looks like the United States will finally have a law declaring the publication of open data as an official responsibility of the federal government,” according to Center for Data Innovation Director Daniel Castro,\n\nHe added that federal policy built on executive actions has long-needed to be replaced by enforceable law that compels federal agencies to publish open data. “Without legal requirements for open data the public has no guarantee that the government will maintain this valuable commitment to transparency, and the countless businesses that rely on open data have no guarantee that this valuable resource will be available in the years to come.”\n\n\n\nContinue Reading Below\n\nSince the House version of the NDAA does not include a similar OPEN Government Data Act amendment, “a conference committee will reconcile the two versions of the legislation before sending it to the president,” said Castro. “Given the apolitical nature of open data and its bipartisan support, as well as recent support from the Office of Management and Budget, there is every reason to believe that the open data requirements in NDAA will soon become law.”\n\nSen. Brian Schatz, D.-Hawaii, who, along with Sen. Ben Sasse, R.-Neb., sponsored of the OPEN Government Data Act introduced more than a year ago, hailed its passage in the Senate. “Public data must be public, and it's the government's job to make sure that it's online, easy to find, and easy to use,” Schatz, ranking member of the Commerce Subcommittee on Communications, Technology, Innovation and the Internet, said in a release. “In today's ever-changing digital world, data should be available to anyone who wants to learn from it and improve the world.”\n\nSasse, who said he and Schatz had labored for more than a year “to drag Washington into the 21st century when it comes to data,” called the OPEN Government Data Act “simple: government data should be made public unless an administration can make a compelling reason to keep it under wraps. This legislation passed the Senate last Congress and, with last night's passage, I'm glad to carry the momentum forward.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}]}, {"news_name": "Sens. Graham, Gillibrand look to establish a committee to examine 2016 election hacking", "news_link": "https://www.scmagazine.com/sens-graham-gillibrand-look-to-establish-a-committee-to-examine-2016-election-hacking/article/689349/", "title": "Sens. Graham, Gillibrand look to establish a committee to examine 2016 election hacking ", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "September 18, 2017", "body": "Sens. Kirsten Gillibrand, D-NY, and Lindsay Graham, R-SC, introduced legislation that would create a 9/11-style commission that would investigate the cyberattack that took place during the 2016 election.\n\nThe bill would create the National Commission on the Cybersecurity of the United States Election Systems. This committee would not only look back at the last election cycle, but make recommendations going forward on how to best secure the election process, Graham said in a statement.\n\nThe committee will also document any harm or attempted harm that took place in 2016, look at foreign cyber interference in other nation's elections and identify emerging threats.\n\n\n\nContinue Reading Below\n\nWe need to ensure we fully understand the threat they pose and the best practices to protect ourselves from future attacks. This issue should be beyond partisan politics as it strikes at the heart of our democracy.  We must take steps to ensure that we protect the integrity of our elections from hostile, outside, and foreign influences,” Graham said.\n\nGillibrand noted the committee's information is needed to protected that nation as another election in on the horizon.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/hacking/topic/47220/", "topic_name": "Hacking"}]}, {"news_name": "Report: Congressman seeks pardon for Assange in exchange for docs vindicating Russian hackers", "news_link": "https://www.scmagazine.com/report-congressman-seeks-pardon-for-assange-in-exchange-for-docs-vindicating-russian-hackers/article/689357/", "title": "Report: Congressman seeks pardon for Assange in exchange for docs vindicating Russian hackers", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "September 18, 2017", "body": "GOP Congressman Dana Rohrabacher (R-Calif.) took steps last week to broker a deal between the White House and Julian Assange, in which the WikiLeaks founder would turn over materials that he claims exonerates Russia from hacking prominent Democratic officials in the lead-up to the 2016 U.S. election, in exchange for a pardon or some other form of clemency, the Wall Street Journal has reported.\n\nWidely known for taking a heavily pro-Russia stance within the U.S. government, Rohrabacher reportedly engaged directly with White House chief of staff John Kelly last Wednesday to discuss the terms of the deal. According to the WSJ, Assange would specifically supply the U.S. with a storage device containing supposed evidence \n\nDuring his call with Kelly, Rohrabacher also reportedly suggested arranging a meeting between Assange and a representative of Donald Trump who has direct communication with the president.\n\n\n\nContinue Reading Below\n\nIn August, Rohrabacher privately traveled to London to personally meet with Assange, who continues to avoidarrest and possible extradition by staying within the Ecuadorean embassy. The meeting was not considered an official congressional trip, notes The Hill.\n\nTrump's own CIA director Mike Pompeo has declared WikiLeaks \"a non-state hostile intelligence service often abetted by state actors like Russia.\" Moreover, U.S. intelligence services unanimously blame Russia for hacks against the Democratic National Committee and Hillary Clinton's campaign manager Paul Podesta, whose stolen emails and documentation were subsequently published by WikiLeaks.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/apt/topic/47229/", "topic_name": "APT"}, {"topic_link": "https://www.scmagazine.com/cyber-espionage/topic/47234/", "topic_name": "Cyber Espionage"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}]}, {"news_name": "Bill creating an Office of Cyber Issues in the State Department proposed", "news_link": "https://www.scmagazine.com/bill-creating-an-office-of-cyber-issues-in-the-state-department-proposed/article/689195/", "title": "Bill creating an Office of Cyber Issues in the State Department proposed", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "September 15, 2017", "body": "A bipartisan group of Representatives has introduced the Cyber Diplomacy Act of 2017 that if passed would establish a high-level Office of Cyber Issues at the State Department.\n\nThe bill, HR 3776, was brought forth by Rep. Ed Royce, R-CA, Eliot Engel, D-NY, and Ted Liue, D-CA, that along with the creation of the office at the State Department along with require the federal government to develop a public international cyberspace strategy with Congressional oversight over international cyber agreements.\n\n“The U.S. cannot lead on international cyber issues if we don't have anyone sitting at the negotiating table or a clearly-defined strategy to guide them. As cyber issues continue to permeate every region and issue area – from intellectual property to human rights – setting international norms to guide states' behavior and developing international agreements to enforce them will be more important than ever,” Lieu said, while decrying what he called the Trump Administration's decision to “wind-down the already limited work the State Department conducts on cyber issues.”\n\nIn July the State Department shuttered its Office of the Coordinator for Cyber Issues and folded it into the Bureau of Economic and Business Affairs. This office was responsible for actions like negotiating the U.S.-China cyber agreement.\n\nThe Office of Cyber Issues would be headed by a person with the rank and status of ambassador and be appointed by the president and confirmed by the Senate. The positions duties would include:\n\nThe bill calls for any person appointed to head the office as having a demonstrated competency in cybersecurity and related cyber fields, along with being skilled at international diplomacy.\n\nIt also states that one year after the bill's passage the Secretary of State, working with other federal departments, will produce a strategy relating to United States international policy with regard to cyberspace. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybersecurity/topic/47223/", "topic_name": "Cybersecurity"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}]}, {"news_name": "Kaspersky ban raises concerns among cyber pros, consumers; draws Kremlin rebuke", "news_link": "https://www.scmagazine.com/kaspersky-ban-raises-concerns-among-cyber-pros-consumers-draws-kremlin-rebuke/article/688897/", "title": "Kaspersky ban raises concerns among cyber pros, consumers; draws Kremlin rebuke", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 15, 2017", "body": "The U.S. government's decision to ban Kaspersky Lab security software prompted both criticism and praise from the security industry, ignited a flurry of concern from consumers over their own Kaspersky purchases and drew a sharp rebuke from the Kremlin.\n\nThe directive weighed on an already strained relationship with Moscow, including allegations that Russia interfered in the U.S. presidential election. Kremlin Press Secretary Dmitry Peskov said the decision in general throws “a shadow “over the image of our American counterparts as reliable partners,\" the TASS news agency reported.  \n\n“The Department is concerned about the ties between certain Kaspersky officials and Russian intelligence and other government agencies, and requirements under Russian law that allow Russian intelligence agencies to request or compel assistance from Kaspersky and to intercept communications transiting Russian networks,” according to a DHS statement issued Wednesday.\n\nCalling the U.S. government's action “a pity,” Peskov said it \"centers around unfair competition, violation of all international trade rules and, of course, aims to undermine the positions of the Russian companies that are competitive on the world scene.\"\n\n\nBut Eric O'Neill, national security strategist at Carbon Black, noted that “Unlike the United States, Russian intelligence services can presumably compel a Russian company to provide information that will assist Russian espionage efforts.”\n\nCalling Kaspersky “an upstanding cybersecurity company” that hasn't been shown to have “ever complied with any such request” or even received such a request, O'Neill maintained “our heightened level of concern against Russian attacks drives many of these decisions.” \n\nWhile O'Neill said he didn't place the fault with either Kaspersky or the U.S. government for the directive, which “may appear extreme,” he said the blame “should be laid directly at the feet of Russian Intelligence,” which “doesn't play by any rule book” and whose spies employ brazen tactics. \n\n“The Russia government has waged a silent war against the United States for years, most recently in attempting to influence our 2016 election,” said O'Neill. “As traditional spies have evolved into hackers and spy agencies have focused on cyber penetrations, Russian intelligence has led the charge.”\n\nAlthough he would like “to think that Kaspersky would take the same stand against a Russian request for information that Apple did when the FBI asked them to break encryption,” the former FBI agent said he didn't “fault the United States government for their lack of trust in a company that survives in a political culture much different from ours.”\n\n\n\nContinue Reading Below\n\n\n\nApple spurned attempts by the federal government pressure the company to include what amounted to a backdoor in its products. U.S. software companies might find themselves in the same boat as Kaspersky abroad, though, if those attempts are successful in the future. “It is not even controversial to know that other governments will taking the same steps against US software manufacturers if they are forced to include encryption backdoors,” said Venafi CEO Jeff Hudson. \n\n“U.S. government officials are pressuring software companies to implement encryption backdoors because they think it will help them catch potential terrorists.  At the same time, they banned security software from a Russian company for use in the U.S. government because they are concerned about security backdoors. They want to have it both ways which is understandable.”\n\nBut the net result, he said, “is that the entire internet will become completely untrustable --  there will be back doors everywhere and  governments and bad guys will use them at will. We have to hold ourselves to a higher standard and lead the way to show the rest of the world the right way to secure the internet.”\n\nAs news of the government's ban spread, concern grew among consumers who have purchased the software, particularly after reports that Best Buy had scratched Kaspersky from its offerings.\n\nIn a statement released after the ban was announced, Kaspersky Lab said Russian laws and policies, which it said were being misinterpreted, applied to telecom companies and internet service providers (ISPs) and not to Kaspersky since it didn't offer communication services. \n\n“Kaspersky Lab has never helped, nor will help, any government in the world with its cyberespionage or offensive cyber efforts, and it's disconcerting that a private company can be considered guilty until proven innocent, due to geopolitical issues,” the statement said. “The company looks forward to working with DHS, as Kaspersky Lab ardently believes a deeper examination of the company will substantiate that these allegations are without merit.”\n\nEarlier in September as demands for a ban intensified, the company noted that Kaspersky wanted the chance to plead its case with Congress. \"CEO Eugene Kaspersky has repeatedly offered to meet with government officials, testify before the U.S. Congress and provide the company's source code for an official audit to help address any questions the U.S. government has about the company, but Kaspersky Lab has only received a general reply from one agency at this time,” the firm said at the time. “The company simply wants the opportunity to answer any questions and assist all concerned government organizations with any investigations, as Kaspersky Lab ardently believes a deeper examination of the company will confirm that these allegations are completely unfounded.” \n\nIt looks like the company will get that opportunity. Eugene Kaspersky has accepted an invitation to testify before the House Science, Space and Technology Committee on Sept. 27.\n\n“I appreciate and accept the invitation to testify before the U.S. House of Representatives Committee on Science, Space, and Technology, and if I can get an expedited visa, I look forward to publicly addressing the allegations about my company and its products,” Kaspersky told Reuters, though in July he expressed concern to NBC News \"about some unexpected problems” if he visited the U.S.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}]}, {"news_name": "Trump associates unmasked in probe of UAE prince's NYC trip", "news_link": "https://www.scmagazine.com/trump-associates-unmasked-in-probe-of-uae-princes-nyc-trip/article/688715/", "title": "Trump associates unmasked in probe of UAE prince's NYC trip", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 14, 2017", "body": "The prince, who arrived in New York in December after the presidential election, but before Donald Trump took office, met with former National Security Advisor Michael Flynn, Jared Kushner, Steve Bannon, who recently resigned as the president's adviser and other Trump officials, Rice reportedly told the House Intelligence Committee. The meeting was a precursor to another gathering in the Seychelles Islands that allegedly sought to establish a back channel between Russia and the new administration.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "U.S. bans use of Kaspersky Labs software on government systems", "news_link": "https://www.scmagazine.com/us-bans-use-of-kaspersky-labs-software-on-government-systems/article/688572/", "title": "U.S. bans use of Kaspersky Labs software on government systems", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 13, 2017", "body": "The agency said, \"The risk that the Russian government, whether acting on its own or in collaboration with Kaspersky, could capitalize on access provided by Kaspersky products to compromise federal information and information systems directly implicates U.S. national security.”\n\nCompany founder Eugene Kaspersky pinned the ban on politics. \"When politics use the news to shape facts, no one wins,\" he tweeted.\n\nKaspersky Lab issued a statement expressing disappointment with the directive. “Given that Kaspersky Lab doesn't have inappropriate ties with any government, the company is disappointed with the decision by the U.S. Department of Homeland Security (DHS), but also is grateful for the opportunity to provide additional information to the agency in order to confirm that these allegations are completely unfounded.\" \n\nThe statement said, \"No credible evidence has been presented publicly by anyone or any organization as the accusations are based on false allegations and inaccurate assumptions, including claims about the impact of Russian regulations and policies on the company. Kaspersky Lab has always acknowledged that it provides appropriate products and services to governments around the world to protect those organizations from cyberthreats, but it does not have unethical ties or affiliations with any government, including Russia.\"\n\n\"But hopefully cooler heads will prevail before this becomes a Cold War-style commercial sanctions battle,\" said Leichter. \"Further Balkanizing the internet runs contrary to the global cooperation needed to make cyber security successful.\"\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cyber-espionage/topic/47234/", "topic_name": "Cyber Espionage"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}]}, {"news_name": "Sessions, Coats call for reauthorization of FISA", "news_link": "https://www.scmagazine.com/sessions-coats-call-for-reauthorization-of-fisa/article/688378/", "title": "Sessions, Coats call for reauthorization of FISA", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "September 13, 2017", "body": "The U.S. Attorney General and the Director of National Intelligence penned a letter to the Congressional majority and minority leadership urging them to permanently reauthorize Title VII of the Foreign Intelligence Surveillance Act (FISA), which is set to expire at the end of this year.\n\nAG Jeff Sessions and DNI Daniel Coats specifically cited Section 702 stating it produces significant foreign intelligence needed to protect the nation against various foreign threats, including terrorism. adding FISA is necessary as it gives their departments the ability to “collect vital information about international terrorists, cyber actors, individuals and entities engaged in the proliferation of weapons of mass destruction and other important foreign intelligence targets located outside the United States.” All while under the oversight of all three branches of the government, the letter stated.\n\nHowever, members of Congress and privacy advocates have fought against the powers included in Section 702 as it allows for the warrantless incidental gathering of data on Americans.\n\nIn July Sen. Chuck Grassley, R-Iowa, during a Senate Judiciary Committee hearing praised the data collected under 702, but noted “Still, the unknown scope of this incidental collection is concerning to many.  Some are also concerned with the way in which the FBI is permitted to search already-collected 702 material.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Energy Dept. to invest up to $50M in infrastructure cybersecurity, resilience", "news_link": "https://www.scmagazine.com/energy-dept-to-invest-up-to-50m-in-infrastructure-cybersecurity-resilience/article/688245/", "title": "Energy Dept. to invest up to $50M in infrastructure cybersecurity, resilience", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 12, 2017", "body": "The U.S. Energy Department will sink up to $50 million in multiple projects, 20 of them cybersecurity-related, under the umbrella of its National Laboratories to boost the resilience and security of the U.S. critical energy infrastructure.\n\n“A resilient, reliable, and secure power grid is essential to the Nation's security, economy, and the vital services that Americans depend on every day,” Secretary of Energy Rick Perry said in a release, noting that back-to-back Hurricanes Harvey and Irma, and the ongoing recovery efforts, have emphasized the need to boost the nation's electricity delivery system to accommodate and recover from disruptions. \n\n“By leveraging the world-class innovation of the National Laboratories and their partners, this investment will keep us moving forward to create yet more real-world capabilities that the energy sector can put into practice to continue improving the resilience and security of the country's critical energy infrastructure,” he said.  \n\nThe awards for 20 cybersecurity projects, which include next-generation attack-resilient electricity distribution systems, malware operational mitigation, and keyless infrastructure security solution, are aimed at improving reliability and strength of the electric grid as well as the oil and gas infrastructure will center around six topic areas: \n\nIn addition, seven Resilient Distribution Systems projects were awarded through the Energy Department's Grid Modernization Laboratory Consortium (GMLC).\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}]}, {"news_name": "Virginia decertifies certain voting machines over hacking, integrity concerns", "news_link": "https://www.scmagazine.com/virginia-decertifies-certain-voting-machines-over-hacking-integrity-concerns/article/687946/", "title": "Virginia decertifies certain voting machines over hacking, integrity concerns", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "September 12, 2017", "body": "Twenty-two localities in Virginia have roughly two months to replace their election technology after the state's board of elections decertified all Direct Recording Electronic (DRE) voting devices over hacking concerns.\n\nThe DRE devices, which generally operate via touchscreens, were deemed insecure by the Virginia Information Technology Agency (VITA), which was tasked to evaluate the machines following reports of researchers compromising certain models at the 2017 DEF CON hacking conference.\n\nThe unanimous 3-0 vote followed an official recommendation for decertification by Edgardo Cortes, commissioner of Virginia's Department of Elections. Among devices that have been decertified are the AccuVote TSX and AccuVote TSR6 from Premier/Diebold, the Edge and AVC Advantage from Sequoia Voting Systems, the eSlate from Hart Intercivic, the iVotronic from Election Systems and Software, and the Patriot from UniLect. Another DRE device, the WINVote, was banned by Virginia in 2015.\n\nThe Edge, TSX and ES7S iVotronic were among the machines featured at DEF CON's Voting Machine Hacking Village. Cortes partially attributed his decertification recommendation to reports of DEF CON hackers gaining access to DRE devices, as well as revealing their passwords. Citing VITA's findings, Cortes also cautioned that DRE devices in Virginia lack a voter-verifiable paper audit trail that can help election officials confirm vote counts or uncover possible errors or tampering.\n\n\"Each device analyzed exhibited material risks to the integrity or availability of the election process,\" the VITA report states, according to the Cortes recommendation. Moreover, \"In each of the systems, the potential for loss of vote is significant, as none of the machines appear to produce paper audit trails during the voting process.\"\n\nOn Nov. 7, 2017, Virginians will be electing their new governor, choosing primarily between Republican Ed Gillespie and Democrat Ralph Northam. It will be the first Election Day following widespread reports of Russian interference in the 2016 presidential campaign -- making this an important test for state election systems leading up to the 2018 House and Senate elections.\n\nThe Cortes recommendation letter states that while 22 Virginian localities currently use DRE devices in their elections, nine of them have either already contracted with companies to obtain new equipment by the upcoming election, or have pending procurements. Still, that leaves 13 additional affected areas, which comprise 140 of Virginia's 2,439 voting precincts and about 3.77 percent of the state's approximately 5 million active voters.\n\nVirginian localities were already under orders to replace their DRE devices by 2020. In letters sent prior to the election board's official resolution, some localities urged the board not to decertify the machines, expressing concerns over the accelerated timetable.\n\nFor instance, one day prior to the election board's resolution, the Office of the County Attorney of Culpepper County, Va. stated in a letter that purchasing approved replacement equipment would cost approximately $250,000, creating budgetary difficulties. \"Premature decertification merely days before an election period...imposes a substantial burden and is fiscally unfair to the county and its residents,\" the letter states.\n\nAnother letter from the Virginia Association of Counties stated that \"obtaining the machines in time to train staff and election officers in advance of the absentee voting period could be challenging.\"\n\nHowever, Cortes pointed out in his recommendation that localities actually had less time to replace their machines in 2015 when election officials decertified the WINVote devices. He also noted that Virginia's General Assembly had previously voted down a December 2014 proposal from current governor Terry McAuliffe to add $28 million to the state budget for the purpose of purchasing new voting equipment for all localities.\n\nOther organizations praised the Department of Election's recommendation and encouraged the board to decertify the machines. \"There have [been] countless studies and security reviews over the years which have found the DREs in use in Virginia to have multiple insecurities making them vulnerable to manipulation and tampering,\" wrote Barbara Simons, president of Verified Voting, and Alex Blakemore, co-founder of Virginia Verified Voting, in a letter. \"The universally accepted evidence that DREs are insecure and untrustworthy drove the legislature to pass a measure to eliminate them by 2020. But there is an imminent threat to the security of our elections that must be faced now.\"\n\nWhether other states take similar measures remains to be seen.\n\n\"While Virginia is at a point where we feel it's necessary to have new equipment in place to reduce potential risks in our elections, each state has to make those decisions based on their individual circumstances,\" Cortes stated in his recommendation.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}]}, {"news_name": "Severe flaws in voting software threaten integrity of German elections, hacking collective reports", "news_link": "https://www.scmagazine.com/severe-flaws-in-voting-software-threaten-integrity-of-german-elections-hacking-collective-reports/article/687625/", "title": "Severe flaws in voting software threaten integrity of German elections, hacking collective reports", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "September 08, 2017", "body": "A European hacker association on Thursday warned that software being used to tabulate and transmit vote totals in Germany's upcoming parliamentary elections contains major vulnerabilities that could threaten the integrity of the outcome and undermine voter confidence.\n\nThe Germany-based Chaos Computer Club is claiming in an organizational blog post and technical report that the software, PC-Wahl version 10, is susceptible to various external attacks, including those that could secretly modify vote totals before they are reported to electoral officials. To further back up its assertions, the group also published proof-of-concept attack tools on GitHub, including source code.\n\nIn its release, the CCC said its findings amount to a \"total loss\" for PC-Wahl, as the software allegedly does not even adhere even basic principles of IT security.\n\n\"The amount of vulnerabilities and their severity exceeded our worst expectations,\" said Linus Neumann, a speaker for the CCC, in the blog post. \"A whole chain of serious flaws, from the update server, via the software itself through to the election results to be exported allows for us to demonstrate three practical attack scenarios in one,\" Neumann continues.\" The technical report, written in German, elaborates on these scenarios.\n\nAmong the key vulnerabilities, the CCC warns, are a broken software update mechanism that \"allows for one-click compromise,\" and insufficient security measures on the update server that could allow attackers to take it over and distribute malicious updates to users.\n\n\"It is simply not the right millennium to quietly ignore IT-security problems in voting,\" said Neumann in the blog post. \"Effective protective measures have been available for decades, there is no conceivable reason not to use them.\"\n\nSC Media contacted PC-Wahl's via email for a response, and also reached out to the offices of Dieter Sarreither, Germany's Federal Returning Officer, who is responsible for overseeing federal elections (known in local terms as Bundestagswahl), including September 24's parliamentary elections. The latter inquiry was responded to by Germany's Federal Statistical Office, which referred SC Media to a press release from Sarreither's office.\n\n\"For me as a federal election leader, the prevention of manipulation possibilities of the election results for the coming Bundestag election is of the highest priority,\" said Sarreither in the release. The press statement also says Sarreither has asked regional election leaders to install the latest security updates for PC-Wahl software (including those introduced in response to the CCC's findings) and take steps to ensure the authenticity of electronic election results. Additionally, Sarreither has asked PC-Wahl to address any remaining vulnerabilities by taking into account the recommendations of Germany's Federal Office for Information Security (BSI).\n\nIn November 2016, German Chancellor Angela Merkel expressed concern that Russia-sponsored hackers could attempt to interfere with her country's electoral process, much as they are accused of doing during the 2016 U.S. presidential election.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/vulnerabilities/topic/47222/", "topic_name": "Vulnerabilities"}]}, {"news_name": "Trump, Jr., Kushner Russian connections questioned", "news_link": "https://www.scmagazine.com/trump-jr-kushner-russian-connections-questioned/article/687417/", "title": "Trump, Jr., Kushner Russian connections questioned", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 08, 2017", "body": "Facebook came forward earlier this week and reported that a Russian troll farm had bought ads on Facebook, some of them targeted to specific regions to sow disinformation and influence voters, which certainly piqued lawmakers' interests, but if the social media company and others like it aren't forthcoming in handing over information and records to those probing possible Russian collusion, they will could face subpoenas.  \n\n“To the extent that Facebook and other social media companies don't voluntarily cooperate, I would expect subpoenas to be issued and other legal avenues to be pursued,\" McClatchey News cited Jennifer Rodgers, head of the Columbia University law school's Center for the Advancement of Public Integrity and a former assistant U.S. attorney, as saying.\n\nCalling the Facebook disclosure \"the tip of the iceberg,\" Sen. Mark Warner, D-Va.), the Senate Intelligence Committee's ranking Democrat, said he wasn't surprised that “the very social media sites that we rely on for virtually everything – the Facebooks, Googles and Twitters … to intervene in our elections.”\n\nAs Facebook's revelations broke, speculation again rose that Trump's son-in-law Jared Kushner may have played a role in the Russia disinformation campaign.\n\n“'There appears to have been significant cooperation between Russia's online propaganda machine and individuals in the United States who were knowledgeable about where to target the disinformation,'” MSNBC's Rachel Maddow read on-air Thursday from a McClatchy News report in July that also said “'investigators at the House and Senate Intelligence committees and the Justice Department are examining whether the Trump campaign's digital operation, overseen by Jared Kushner, helped guide Russia's sophisticated voter targeting and fake news attacks on Hillary Clinton in 2016.'”\n\n“To the extent they had information concerning the fitness, character or qualifications of a presidential candidate, I believed that I should at least hear them out,” Trump said in his prepared remarks. “Depending on what, if any, information they had, I could then consult with counsel to make an informed decision as to whether to give it further consideration.”\n\nThe younger Trump has said previously that the meeting amounted to nothing and devolved into a discussion of Russian adoptions and the Magnitsky Act, assertions he repeated Thursday before the committee. \n\nSaying his initial skepticism about taking the meeting was justified, Trump said, “The meeting provided no meaningful information and turned out not to be about what had been represented.”\n\nHe also said he didn't have real knowledge of a statement drafted on Air Force One in reply to a New York Times request for comments about the meeting with Natalia Veselnitskaya. Reports have contended that President Donald Trump had a hand in crafting the response, something that lawmakers also are probing.\n\n", "topics": []}, {"news_name": "WikiLeaks reveals the CIA's Protego missile control system", "news_link": "https://www.scmagazine.com/wikileaks-reveals-the-cias-protego-missile-control-system/article/687128/", "title": "WikiLeaks reveals the CIA's Protego missile control system", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "September 07, 2017", "body": "WikiLeaks took a break from posting CIA hacking tools as it has done for the last six months to instead publish four hardware/software manuals along with 37 additional documents, purportedly from the processor maker Microchip Technology, that discuss a missile control system.\n\nThe documents are part of what WikiLeaks said the CIA calls the Protego project and contain schematics and written instructions for what it says is a Raytheon-developed missile control system that uses PIC microcontrollers made by Microchip Technology. The whistleblower group said the manuals were contained in the CIA's Vault 7 documents dump that it has mined for hacking tools, but it did not know why the manuals were included.\n\n“Indeed there is no explicit indication why it is part of the project repositories of the CIA/EDG at all,” WikiLeaks said on its site.\n\nWikiLeaks gave very little description of what it was revealing and some of the interpretation it did offer may be inaccurate as it states the system in question is for use on Pratt & Whitney aircraft. That company only manufactures commercial and military engines, not the actual airplane.\n\nWikiLeaks has been steadily releasing information from Vault 7 since March.\n\nRaytheon and Microchip Technology were both contacted for comment, but have not yet responded.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/hacktivism/topic/47227/", "topic_name": "Hacktivism"}]}, {"news_name": "Election hacking might be more widespread than previously thought", "news_link": "https://www.scmagazine.com/election-hacking-might-be-more-widespread-than-previously-thought/article/686386/", "title": "Election hacking might be more widespread than previously thought", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 04, 2017", "body": "Noting that investigators have been so focused on Russian meddling in the presidential campaign that they haven't conducted a thorough probe of the state election systems that Russia targeted and that the hacking of those systems might be more expansive than originally thought.\n\nCiting problems at the polls and puzzled poll workers on Election Day, the New York Times reported the concerns of observers, like Susan Greenhalgh, who was monitoring polls in Durham, N.C., for nonpartisan group Verified Voting. \n\n“It felt like tampering, or some kind of cyberattack,” the Times quoted Greenhalgh -- who was aware that e-pollbook vendor VR Systems, which provided Durham's software, had been hacked by Russians -- as saying. \n\nBut that and similar incidents in at least 21 states have not yet be subjected to a thorough digital forensics probe, the Times reported.\n\nThe election director in Durham, Derek Bowens, told the Times, \"We do not believe, and evidence does not suggest, that hacking occurred on Election Day.\"\n\nBut Sen. Mark Warner, D-Va., and the ranking Democrat on the Senate Intelligence Committee,called for greater scrutiny. “We must harden our cyberdefenses, and thoroughly educate the American public about the danger posed by attacks,” the Times quoted him as saying. “In other words: we are not making our elections any safer by withholding information about the scope and scale of the threat.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/hacking/topic/47220/", "topic_name": "Hacking"}]}, {"news_name": "Justice Dept. says no evidence that Obama 'wiretapped' Trump", "news_link": "https://www.scmagazine.com/justice-dept-says-no-evidence-that-obama-wiretapped-trump/article/686385/", "title": "Justice Dept. says no evidence that Obama 'wiretapped' Trump", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 04, 2017", "body": "Months after former FBI director James Comey said as much, court documents filed by the Justice Department show it has found no evidence that the Obama administration wiretapped Trump Tower, as President Donald Trump had claimed in a flurry of tweets early this year.\n\nThe revelations, found in a motion for summary judgment, came as part of a response to a Freedom of Information Act (FOIA) suit to obtain Trump Tower surveillance documents filed by American Oversight. \n\nAfter asking for a deadline extension, the Justice Department In mid-March said it handed over information to congressional committees looking into Trump's allegations that Obama had put him under surveillance during the 2016 presidential campaign.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}]}, {"news_name": "Trump Energy appointee Bradford steps down amid hacking claims controversy", "news_link": "https://www.scmagazine.com/trump-energy-appointee-bradford-steps-down-amid-hacking-claims-controversy/article/685850/", "title": "Trump Energy appointee Bradford steps down amid hacking claims controversy", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 01, 2017", "body": "Just two days after Sen. Ron Wyden, D-Ore., asked the FBI and the Department of Energy to provide information on supposed investigations into claims by Energy Department appointee William Bradford that unseemly remarks attributed to him on social media were posted by hackers, Bradford has resigned.\n\n\"I cannot comment on an ongoing federal investigation into multiple cyber attacks and Internet crimes committed against me over the past several years, to include email intrusions, hacking and impostors in social media,” Bradford had told CNN about the incendiary comments posted on Disqus, which mirrored remarks that he had publicly made.\n\nBradford expressed contrition for earlier tweets that disparaged Facebook founder Mark Zuckerberg and President Barack Obama. “As a minority and member of the Jewish faith, I sincerely apologize for my disrespectful and offensive comments,” he said in an email to the Washington Post earlier in the summer. “These comments are inexcusable and I do not stand by them. Now, as a public servant, I hold myself to a higher standard, and I will work every day to better the lives of all Americans.”\n\nOn Thursday, Bradford stepped down. “Bradford tendered his resignation this afternoon and is no longer with the Department of Energy,” the Post cited Energy Department Spokeswoman Shaylyn Hynes as writing in an email.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/hacking/topic/47220/", "topic_name": "Hacking"}]}, {"news_name": "Navy admiral says no evidence of cyberattack in ship collisions", "news_link": "https://www.scmagazine.com/navy-admiral-says-no-evidence-of-cyberattack-in-ship-collisions/article/685845/", "title": "Navy admiral says no evidence of cyberattack in ship collisions", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 01, 2017", "body": "An investigation into the separate recent collisions between two Navy warships from the Seventh Fleet and commercial vessels has so far shown no evidence of cyberattacks, according to Admiral John Richardson, chief of naval operations.\n\nSpeaking during a livestream on Facebook Wednesday, Richardson said that “to date, the inspections we've done show that there's no evidence of any kind of a cyberintrusion.”\n\nThe admiral said it has become “sort of a reality of our current situation that part of any kind of investigation or inspection is going to have to take a look at the computer, the cyber — you know, the informational warfare aspect — of our business,” adding that “We're doing that with these inspections as well.”\n\nSpeculation arose that the USS John S. McCain could have been the target of a cyberattack after CNN cited an anonymous source as saying the ship had experienced a steering failure that caused it to collide with a Liberian-flagged commercial tanker as it headed into the Strait of Malacca.\n\nNoting that the incident was the second of its kind in the Pacific theater – the USS Fitzgerald collided with a container ship near Japan in June, killing 10 sailors – Richardson at the time ordered an “operational pause.” This was so that fleet commanders could convene “with their leaders and their commands to ensure that we're taking all immediate action to ensure safe and effective operations around the world,\" he said in a statement on Facebook and other social media. “I am also directing a comprehensive review into all potential factors contributing to these incidents.”\n\nThe Navy's probe, of course, has not been completed and investigators will continue to explore all options. “We'll continue to look deeper and deeper, but I just want to assure you that to date, there's been nothing that we've found to point to that,” said Richardson.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}]}, {"news_name": "NIAC members resign, saying president has under-prioritized cybersecurity", "news_link": "https://www.scmagazine.com/niac-members-resign-saying-president-has-under-prioritized-cybersecurity/article/684537/", "title": "NIAC members resign, saying president has under-prioritized cybersecurity", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 28, 2017", "body": "", "topics": [{"topic_link": "https://www.scmagazine.com/critical-infrastructure/topic/47217/", "topic_name": "Critical Infrastructure"}, {"topic_link": "https://www.scmagazine.com/cybersecurity/topic/47223/", "topic_name": "Cybersecurity"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}]}, {"news_name": "Blumenthal: Committee should release transcript of testimony on Trump dossier", "news_link": "https://www.scmagazine.com/blumenthal-committee-should-release-transcript-of-testimony-on-trump-dossier/article/684006/", "title": "Blumenthal: Committee should release transcript of testimony on Trump dossier", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 24, 2017", "body": "Sen. Richard Blumenthal (D-Conn.) called for the Senate Judiciary Committee investigating Russian interference in the U.S. presidential election to make public recent and lengthy testimony by Glenn Simpson about the now infamous dossier on Donald Trump that his research firm drafted from information gathered by former British intelligence officer Christopher Steele.\n\n“I believe they will be. I certainly will vote to make them public.” Blumenthal told MSNBC in reference to the transcript of Simpson's 10-hour testimony. “They should be made public, but even more important Glenn Simpson should testify before the committee in the open, under oath, and so should the others who have been subpoenaed to do so as well. Donald Trump Jr. and the person who – anyone involved in that meeting in early June that involved apparently Jared Kushner and others.”\n\nSimpson, a former reporter for the Wall Street Journal and the co-founder of Fusion GPS, a firm hired by a group of Republicans in 2015 to gather opposition research on Trump, met privately Tuesday with committee staff and said afterwards that he stood by the contents of the dossier – some of it salacious – which indicated potential collusion between members of the Trump campaign and Russian operatives.\n\n\"Mr. Simpson told Congress the truth and cleared the record on many matters of interest to congressional investigators,” ABC News quoted Simpson's attorney Josh Levy as saying, noting that the committee had “the right to disclose the transcript” of Simpson's testimony if it so desired. The Judiciary Committee's probe is one of several exploring possible collusion between the Trump team and Russia, while trying to steer clear of interference with an investigation by Robert S. Mueller, who was made special counsel after Trump fired former FBI Director James Comey, ostensibly to put an end to his investigation of members of Trump's inner circle.\n\nSimpson “has potentially knowledge about matters relating to Trump collusion with the Russian meddling as well as possible obstruction of justice, and we're going to proceed with our investigation, but as you well know, the special counsel is proceeding as well,” said Blumenthal. “And we want to make sure, whether it's the release of the transcript or anything else, that we in no way conflict with the special counsel's role.”\n\nHouse Intelligence Committee staffers drew fire for seeking the elusive Steele in an unannounced visit to his attorneys' U.K. office this summer. The unusual trip was reportedly sanctioned by committee Staff Director Damon Nelson and made without informing either the Republican in charge of the committee's investigation into Russian interference in the U.S. presidential election or its ranking Democrat.\n\nSteele allegedly has already met with the FBI and has turned over the sources he used to compile the dossier, ABC News reported.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Justice agrees to narrow DreamHost warrant for disruptj20.org data", "news_link": "https://www.scmagazine.com/justice-agrees-to-narrow-dreamhost-warrant-for-disruptj20org-data/article/683914/", "title": "Justice agrees to narrow DreamHost warrant for disruptj20.org data ", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 23, 2017", "body": "After web hosting provider DreamHost pressed the U.S. government in superior court over a warrant to access more than 1.3 million IP records of a website, the Justice Department backed off its request and modified the warrant to narrow its scope.\n\n“The Warrant – like the criminal investigation – is singularly focused on criminal activity,” according to a brief filed with the court by the U.S. Attorney's Office in Washington and published by The Hill. “It will not be used for any other purpose.” \n\nDreamHost had argued last week in a blog post that the data requested by the government in its investigation of disruptj20.org, a site that was used to coordinate the massive anti-Trump protest that occurred on Inauguration Day, \"could be used to identify any individuals who used this site to exercise and express political speech protected under the Constitution's First Amendment. That should be enough to set alarm bells off in anyone's mind.\"\n\nAfter its bid that the government narrow the scope of its request was rebuffed, DreamHost petitioned a superior court in D.C. to deny the government's motion because it violates both the Fourth Amendment and the Privacy Protection Act (PPA).\n\nAccording to the Justice Department brief filed Monday, “what the government did not know when it obtained the Warrant – what it could not have reasonably known – was the extent of visitor data maintained by DreamHost that extends beyond the government's singular locus in this case of investigating the planning, organization, and participation in the January 20, 2017 riot.”\n\nDreamHost called the government's concession, “a huge win for internet privacy,” saying it “absolutely appreciate[s] the DOJ's willingness to look at and reconsider both the scope and the depth of their original request for records. That's all we asked them to do in the first place, honestly.”\n\nBut, the company said, the matter is not settled. “We're not done,” a Tuesday blog post read. “Much of the DOJ's original demand for information is still in place, and there are still a few issues that we consider to be problematic for a number of reasons.”\n\nThe company said it is “moving forward with a filing to address the remaining First and Fourth Amendment issues raised by this warrant,” which it will voice during a Thursday hearing in superior court.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Proposed legislation discourages Russia-U.S. cyber pact, while prioritizing election security", "news_link": "https://www.scmagazine.com/proposed-legislation-discourages-russia-us-cyber-pact-while-prioritizing-election-security/article/683724/", "title": "Proposed legislation discourages Russia-U.S. cyber pact, while prioritizing election security", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "August 23, 2017", "body": "A U.S. intelligence bill that recently passed committee in the Senate contains key provisions designed to defend the electoral process from Russian meddling and other foreign interference, as well as curtail any possible White House effort to form a joint cybersecurity unit with the Kremlin.\n\nPassed in the Senate Intelligence Committee by a 14-1 margin this past July and made public just days ago, the Intelligence Authorization Act for Fiscal year 2018 explicitly forbids the U.S. government from using federal resources to form a cyber partnership with Russia, unless the U.S. Director of National Intelligence (DNI) first submits a report that congressional intelligence committee members can review 30 days in advance of such an agreement. This key clause is a blatant rebuke of President Donald Trump, who fleetingly announced a U.S.-Russian cyber unit in July before backing off the idea amidst backlash.\n\nUnder the terms of the bill, which is sponsored by Intelligence Committee Chairman Sen. Richard Burr (R-N.C.), any report submitted by the DNI would need to explain the purpose of forming such a joint cyber unit, specify what cyber intelligence would be shared, communicate the value of such an alliance to national security, express any counterintelligence concerns arising from such an arrangement, and recommend steps to mitigate these concerns.\n\nThe proposed act also directs key executive branch officials to submit a series of reports, assessments and recommendations regarding election security in the recent past, present and future.\n\nSpecifically, the bill states that within 90 days of the legislation's passage, the DNI must coordinate with other relevant officials and agencies to develop \"a whole-of-government strategy for countering the threat of Russian cyberattacks and attempted cyberattacks against electoral systems and processes in the United States, including federal, state, and local election systems, voter registration databases, voting tabulation equipment, and equipment and processes for the secure transmission of election results.\"\n\nThis comprehensive strategic plan would include suggested measures for securing voting machines and related electoral technologies, detecting threats, improving attack attribution, deterring future threats, and communicating with state and local election officials.\n\nThe DNI (who is currently Dan Coats) would also be tasked with conducting a postmortem assessment of the U.S. intelligence community's ability to adequately analyze Russia's interference in the 2016 elections, including whether intel resources were properly aligned to detect and respond to the threat, and the effectiveness of information sharing efforts. This report would be due one year after the bill's passage.\n\nStarting one year before any regularly scheduled federal election, the DNI, along with other key intelligence community members, would be required to evaluate the vulnerabilities of state election systems and send Congressional leaders the results of this assessment within 180 days of the official vote.\n\nWithin 60 days of the bill's enactment, the Under Secretary of Homeland Security for Intelligence and Analysis would be expected to submit to Congress a report describing cyberattacks attempted or perpetrated by any foreign government on the 2016 elections, as well as any anticipated future attacks. Separately, this same official would be required to submit within 180 days a plan for implementing bug bounty programs at various U.S. agencies and departments, much like the Department of Defense recently did.\n\nFinally, the DNI, in coordination with the Secretary of Homeland Security and directors of the CIA, NSA and FBI, would be asked to submit a report on any foreign government's attempts to conduct surveillance on Americans by exploiting cybersecurity vulnerabilities in U.S. telecommunications networks, including SS7.\n\n\"...We continue the Committee's inquiry into Russian interference in the 2016 U.S. elections,\" said Sen. Burr in an official press release. \"The overwhelming bipartisan support for this bill shows that we all understand the gravity of the threats and how vital our intelligence community is to combating them.  We are holding the intelligence community to account for every dollar they spend, and we are committed to giving them the resources they need to continue to be the best in the world.\"\n\n\"This Intelligence Authorization Act will provide the women and men of the Intelligence Community with the resources they need to do their jobs, which is to collect and analyze intelligence and present their best assessment to the nation's leadership,\" said Sen. Mark Warner (D-Va.), vice chairman of the Intelligence Committee, also in the press release. \"This bill... includes important measures to protect election systems and improve information sharing with states to ensure the integrity of the election process.”\n\nThis Intelligence Authorization Act is next scheduled for a vote by the full Senate.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cyber-espionage/topic/47234/", "topic_name": "Cyber Espionage"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/legislation/topic/47221/", "topic_name": "Legislation"}]}, {"news_name": "Cyber Command elevated to Unified Combatant Command", "news_link": "https://www.scmagazine.com/cyber-command-elevated-to-unified-combatant-command/article/682924/", "title": "Cyber Command elevated to Unified Combatant Command ", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "August 18, 2017", "body": "United States Cyber Command will become one of 10 Unified Combatant Commands that will focus on cyberspace operations.\n\nThe move places Cyber Command, which is headed by Adm. Mike Rogers, on par with other combat commands, each of which is responsible for handling military operations in different parts of the world along with more specialized operations like transportation and special operations. A combat command contains members from all branches of the armed forces and is assigned added components as needed to complete specific missions.    \n\n “United States Cyber Command's elevation will also help streamline command and control of time-sensitive cyberspace operations by consolidating them under a single commander with authorities commensurate with the importance of such operations.  Elevation will also ensure that critical cyberspace operations are adequately funded,” President Donald Trump said in a White House statement.\n\nThe move does not separate Cyber Command from the National Security Agency, but this is currently under consideration by Secretary of Defense James Mattis.\n\n", "topics": []}, {"news_name": "State Dept. new Cyber and Technology Security directorate falls under diplomatic security", "news_link": "https://www.scmagazine.com/state-dept-new-cyber-and-technology-security-directorate-falls-under-diplomatic-security/article/681836/", "title": "State Dept. new Cyber and Technology Security directorate falls under diplomatic security", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 15, 2017", "body": "After saying it would shutter and fold the Office of the Coordinator for Cyber Issues into the Bureau of Economic and Business Affairs, raising concerns that cybersecurity would be on a backburner, the State Department has confirmed that it established a Cyber and Technology Security (CTS) directorate last May 28,\n\n“CTS facilitates the conduct of global diplomacy by protecting life, property, and information with advanced cybersecurity programs and risk-managed technology innovation,” a State Department spokeswoman told Federal News Radio. “CTS provides advanced cyber threat analysis, incident detection and response, cyber investigative support and emerging technology solutions.”\n\nThe directorate, currently under the leadership of interim director Lonnie Price, falls under the State Department's Diplomatic Security Service and represents a single “belly button” for diplomatic interests to push to stay abreast of vulnerabilities and attacks, Federal News Radio cited a government official as saying.\n\n“The responsibility for cyber always was shared by the State CIO's office and diplomatic security. It goes back to a memo from former Secretary of State Colin Powell, who split up operational cyber, which falls under the CIO and is responsible for things like patching, firewalls and making sure operational systems are up to speed,” the official reportedly said. “Diplomatic security is watching for intrusions, doing white-hat activity on the network. So in some ways, the CTS is part of a natural evolution. Diplomatic Security is a large bureau and this is part of a realignment to put resources under one group. It may be part of a larger internal reorganization in Diplomatic Security. But either way, it's great because it gives the CIO one point of contact. We will wait to see if another shoe drops about long-term consolidation of cyber efforts across the department.”\n\nThe reshuffling that displaced the Office of the Coordinator for Cyber Issues, which was instrumental in establishing the U.S.'s pact with China, was seen as lowering the priority of cybersecurity. “It's taking an issue that's preeminent and putting it inside a backwater within the State Department,” said Council on Foreign Relations Senior Fellow Robert Knake, formerly the director of cybersecurity policy at the National Security Council under President Barack Obama, who established the Office of the Coordinator for Cyber Issues in 2011. “Position to power matters both within the U.S. government and within the international community.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/vulnerabilities/topic/47222/", "topic_name": "Vulnerabilities"}]}, {"news_name": "Mueller probe sends FBI to Manafort's home in predawn raid", "news_link": "https://www.scmagazine.com/mueller-probe-sends-fbi-to-manaforts-home-in-predawn-raid/article/680842/", "title": "Mueller probe sends FBI to Manafort's home in predawn raid", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 09, 2017", "body": "A predawn, unannounced raid by the FBI in late July at the home of former Trump Campaign Manager Paul Manafort the day after he met with Senate Intelligence Committee staff reportedly yielded a trove of documents, apparently including some that the former campaign manager for President Donald Trump had provided to Congress.  \n\n\"Mr. Manafort has consistently cooperated with law enforcement and other serious inquiries and did so on this occasion as well,\" the Washington Post reported Manafort spokesperson Jason Maloni as saying. \n\nThe FBI agents were working at the behest of special prosecutor Robert S. Mueller III who is investigating Russian interference in the U.S. presidential election, including possible collusion between Trump campaign team members and Russian operatives.\n\nManafort and former National Security Adviser Michael Flynn, who was forced out after he allegedly lied to Vice President Mike Pence about the nature of his phone conversations with Russian Ambassador Sergey Kislyak, have been in the crosshairs of a probe that that involves ever-broadening cast of characters, including the president's eldest son Donald Trump, Jr., and his son-in-law, Jared Kushner, who have had relationships with Russian organizations and officials.\n\nLawmakers most recently questioned Manafort as well as Kushner and the younger Trump about a 2016 meeting with a Russian lawyer at Trump Tower, billed in an email from the Russian liaison and Trump family friend who set it up as an opportunity to get dirt on then Trump rival Hillary Clinton. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}]}, {"news_name": "House intel staff director signed off on staffers' U.K. quest to find Steele", "news_link": "https://www.scmagazine.com/house-intel-staff-director-signed-off-on-staffers-uk-quest-to-find-steele/article/680681/", "title": "House intel staff director signed off on staffers' U.K. quest to find Steele", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 09, 2017", "body": "An unannounced visit by two House Intelligence Committee staffers to the London offices of the attorneys for former British MI6 officer Christopher Steele, who compiled the infamous – and potentially embarrassing – dossier on President Donald Trump, was reportedly sanctioned by committee Staff Director Damon Nelson and made without informing either the Republican in charge of the committee's investigation into Russian interference in the U.S. presidential election or its ranking Democrat.\n\n“I wasn't aware of it, and I don't think Mr. Conaway was either,” ranking Democrat Adam Schiff, D-Calif., said on CNN, referring to Rep. Mike Conaway, R-Texas, who took the lead in the committee's probe after Chairman Devon Nunes, R-Calif., was forced to recuse himself following a mysterious late-night trip to the White House to view classified information and then report back House Speaker Paul Ryan, R-Wis., and Trump. Nunes stepped down after an ethics complaint was lodged against him.\n\nThe Guardian cited a congressional official as saying such a trip would not be unusual for staffers, though another Adam Blickstein, who previously was a Democratic spokesman for the committee, claimed otherwise. \n\n“In this specific scenario, I can't imagine a staff director sending two staffers on this trip without the chairman knowing about it,” Blickstein was quoted as saying. “That wouldn't pass the smell test.”\n\nNelson is a former long-time deputy chief of staff for Nunes, raising concern that the California lawmaker continues to try to rule from the sidelines. \n\nStill, the committee would like to have a chance to question Steele. “The reality is we do want to meet with Mr. Steele, would like him to come before the committee,” Schiff told CNN. “If he's not willing to do that, we'd be happy – Mr. Conaway and myself – to go to London to sit down with him. He does have, certainly, very relevant information that would assist our investigation.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}]}, {"news_name": "Kenyan presidential candidate alleges election fraud, sparking protests", "news_link": "https://www.scmagazine.com/kenyan-presidential-candidate-alleges-election-fraud-sparking-protests/article/680680/", "title": "Kenyan presidential candidate alleges election fraud, sparking protests", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "August 09, 2017", "body": "The Kenyan presidential election was plunged into controversy on Aug. 9 after opposition candidate and former Prime Minister Raila Odinga reportedly accused hackers of using a murdered voting official's credentials to infiltrate the electoral commission's servers and help give incumbent Uhuru Kenyatta a fraudulent victory.\n\nAccording to the New York Times as well as Kenya's The Standard, Odinga produced logs that he said backs his claims that hackers used the credentials of Christopher Msando, a senior voting technology official who was murdered last month, to load an algorithm into the election servers in order to give Kenyatta a decisive lead. in Nairobi, “The 2017 general election was a fraud,” said Odinga, the Times reported.\n\nDue to growing concerns of a rigged election in the days and weeks leading up to the Aug. 8 election, former U.S. President Barack Obama on Monday urged Kenyan leaders to keep the peace, while accepting the will of the people. Odinga, who is reportedly trailing in the vote count, also urged calm in light of his accusations, yet there have already been reports of violent protests follow his accusations.\n\nIn response to Odinga's comments, Kenya's Independent Electoral and Boundaries Commission chairman Wafula Chebukati said the commission was taking the matter seriously, but could not yet determine if the system was hacked or not, The Standard reported. Meanwhile, Raphael Tuju, secretary general of the Jubilee political party, of which President Kenyatta is a member, accused Odinga and his National Super Alliance party of spreading rumors, the report continues.\n\nOn Thursday, Aug. 10, multiple news organizations including CNN reported that former U.S. Secretary of State John Kerry, who is co-leading a group of election observers from the Carter Center, said he was confident that the Kenyan presidential contest has been handled with integrity and transparency.\n\nOdinga's accusations are vaguely reminiscent of claims by Donald Trump during the 2016 U.S. presidential campaign that the outcome of the election might be rigged. While there is still no evidence that any votes were altered, cybersecurity experts have expressed concern that hackers could potentially manipulate future U.S. vote counts.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}]}, {"news_name": "Venezuelan government websites hacked in support of military base attack", "news_link": "https://www.scmagazine.com/venezuelan-government-websites-hacked-in-support-of-military-base-attack/article/680538/", "title": "Venezuelan government websites hacked in support of military base attack", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "August 08, 2017", "body": "Digital rebels hacked into dozens of Venezuelan government websites to oppose the regime of President Nicolás Maduro, multiple news outlets have reported.\n\n\nAccording to multiple accounts, a group calling itself \"The Binary Guardians\" defaced approximately 40 state-run websites, including ones representing the federal Venezuelan government, its National Electoral Council (NEC) and the South American country's navy.\n\nThe messaging on the defaced sites expressed support for Operation David, an armed assault that attackers carried out against a military base in Valencia, Venezuela on Sunday.\n\nThe attack came after weeks of political turmoil and deadly protests by citizens seeking to oust Maduro after he created a new legislative body that further strengthens his governmental control. Two attackers were reportedly killed in the operation, and several more were captured.\n\nThe defacement message posted on the main governmental website warned that \"This dictatorship has its days numbered,\" the BBC reported, while the defacement of the NEC website included a video clip from the Charlie Chapin film, \"The Great Dictator,\" Reuters noted in its report.\n\nIn late July, the U.S. imposed sanctions on Maduro, calling him a dictator.\n\nThe Reuters report also included an account from a representative of the Binary Guardians, who said he did not take part in Operation David, but supports it as a Venezuelan national.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/hacktivism/topic/47227/", "topic_name": "Hacktivism"}, {"topic_link": "https://www.scmagazine.com/web-security/topic/47254/", "topic_name": "Web Security"}]}, {"news_name": "OPM makes strides, falls short, GAO says", "news_link": "https://www.scmagazine.com/opm-makes-strides-falls-short-gao-says/article/680046/", "title": "OPM makes strides, falls short, GAO says", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 04, 2017", "body": "A Government Accountability Office (GAO) audit report that scolded the Office of Personnel Management (OPM) for falling short of meeting recommendations made after the agency experienced serious breaches in 2015 received pushback from OPM CIO David DeVries, who said the GAO auditors didn't take into the account the whole of his agency's efforts to strengthen its cybersecurity posture. \n\n“OPM did not consistently update completion dates for outstanding recommendations and did not validate corrective actions taken to ensure that the actions effectively addressed the recommendations,” said the report, which was penned by GAO Chief Technologist Nabajyoti Barkakati and Gregory Wilshusen, its information security issues director. \"Until OPM completes implementation of government-wide requirements, its systems are at greater risk than they need be.\"\n\nBut DeVries fired back, writing that \"GAO does not fully acknowledge OPM's defense-in-depth strategy and compensation controls” and noting that “OPM has applied a defense-in-depth strategy to efforts to enhance OPM's cybersecurity posture, meaning there are many layers and aspects to OPM's defensive strategy.\"\n\nThe audit report, however, was not wholly critical of OPM's efforts, acknowledging that the agency had “implemented or made progress towards implementing 19 recommendations made by the United States Computer Emergency Readiness Team (US-CERT) to bolster OPM's information security practices and controls.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/data-breach/topic/47235/", "topic_name": "Data Breach"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}]}, {"news_name": "Sessions says Rosenstein, Wray will lead Justice crackdown on leaks", "news_link": "https://www.scmagazine.com/sessions-says-rosenstein-wray-will-lead-justice-crackdown-on-leaks/article/679898/", "title": "Sessions says Rosenstein, Wray will lead Justice crackdown on leaks", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 04, 2017", "body": "Calling for an end to what he characterized as the nation's “culture of leaks,” U.S. Attorney General Jeff Sessions on Friday said the Justice Department would crack down on leakers, giving top priority to unauthorized disclosure investigations, which he said have tripled since January, prompting the creation of a new counterintelligence unit.\n\nDeputy Attorney General Rod Rosenstein and newly confirmed FBI Director Christopher Wray will “oversee all classified leak investigations and actively monitor the progress of each and every case,\" Sessions said. “The Department will not hesitate to bring lawful and appropriate criminal charges against those who abuse the nation's trust.\" \n\nPersistent leaks from the White House and intelligence agencies ever since Donald Trump took office have repeatedly irked, frustrated and embarrassed the Trump administration, with the president publicly excoriating Sessions for not taking stronger action to put an end to the steady unauthorized flow of information making its way public.\n\nThe crackdown comes just a day after the Washington Post released transcripts of Donald Trump's initial phone calls with other world leaders -- Australian Prime Minister Malcolm Turnbull and Enrique Peña Nieto, president of Mexico. \n\n\"I want the attorney general to be much tougher,\" Trump said last week in what was widely seen as a preface to possibly firing Sessions, who raised the president's hackles by recusing himself from the investigation of Russian interference in the presidential election and potential collusion between members of the president's campaign team and Russia. \"I want the leaks from intelligence agencies, which are leaking like rarely have they ever leaked before, at a very important level. These are intelligence agencies we cannot have that happen.\"\n\nOn Friday, Sessions took a tougher stance, vowing to crack down on “rogue [players] with security clearance” whom he believes “sell out our nation” by funneling classified information onto the public stage.\n\nNoting that he “strongly” agreed with the president in condemning a “staggering number of leaks,” Sessions said, \"I have this warning for would-be leakers: Don't do it.\" \n\nThe attorney general also levied harsh words at the press, which he said could not continue to “place lives at risk with impunity.” Claiming to “respect the important role that the press has,” Sessions said “it is not unlimited.\" \n\nHe called for balancing the press' role \"with protecting our national security and the lives of those who serve in our intelligence community, the armed forces, and all law abiding Americans.\"\n\nNew York Times White House correspondent Maggie Haberman immediately tweeted that the crackdown was “ A way for Sessions to demonstrate loyalty/purpose to Trump - increase the leak hunts/blame the press.”\n\nWikiLeaks founder Julian Assange assailed the initiative and Sessions' words, noting that transparency takes the teeth out of unauthorized disclosures. “AG Sessions today stated ‘This culture of leaking must stop,'. No the culture of secrecy must stop. Tell the public 1st and leaks do nothing,” he tweeted, adding, “AG Sessions today stated ‘This culture of leaking must stop,' but complaining about the public knowing the truth will get you nowhere.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}]}, {"news_name": "Betty Elliot, James McJunkin join NTSC board of directors", "news_link": "https://www.scmagazine.com/betty-elliot-james-mcjunkin-join-ntsc-board-of-directors/article/679217/", "title": "Betty Elliot, James McJunkin join NTSC board of directors", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "August 01, 2017", "body": "MoneyGram International CISO Betty Elliot and James W. McJunkin, vice president & CISO for Discover Financial Services have been named to the National Technology Security Coalition's (NTSC) Board of Directors.\n\nPrior to his tenure at Discover, McJunkin (left) held a leadership position with the FBI's counterterrorism division and he currently is responsible for second-line risk management of information security to include governance of the enterprise-wide information security program, internal and external investigations; third-party vendor compliance for information security, business continuity, and executive protection.\n\n“The NTSC gives CISOs an important platform to help influence legislation and policy around critical issues such as data breach notification, public-private information sharing, and encryption,” he said\n\nElliot (right) leads the MoneyGram information security team where she helps manage security risk, security governance, forensics, security awareness, identity and access management, vulnerability management, security operations, security engineering, security architecture, internal fraud, and agent victim fraud.\n\n“After serving as a CISO in a variety of industries and leading security teams at Fortune 500 companies, I've seen the effects that national cybersecurity legislation and policies can have on business. As a member of the NTSC board, I look forward to working with CISOs from a variety of backgrounds to offer my insights and engage in dialogue with policymakers on Capitol Hill,” she said.\n\nThe NTSC helps CISOs advocate for legislative and regulatory policy changes, create and continue a dialog on the cybersecurity issues, laws and regulations and engage with elected officials on all other topics confronting the industry.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/legislation/topic/47221/", "topic_name": "Legislation"}]}, {"news_name": "Former DoD official recommends single overarching bug bounty program for all U.S. agencies", "news_link": "https://www.scmagazine.com/former-dod-official-recommends-single-overarching-bug-bounty-program-for-all-us-agencies/article/678452/", "title": "Former DoD official recommends single overarching bug bounty program for all U.S. agencies", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "July 29, 2017", "body": "The woman who spearheaded development of the Department of Defense's “Hack the Pentagon” bug bounty program recommended that all federal agencies looking to implement a similar initiative do so under one single umbrella program.\n\n“If we were in a position as a government to have one consolidated organization that could do such a thing, it would make great sense. I think that's absolutely the world in which we're moving, said Lisa Wiswell, former digital security lead with the DoD, at DEF CON 25 on Friday.\n\nWiswell noted that the DOD developed one bug bounty contract, applying to all individual departments within the agency, which collectively comprise roughly 3.2 million members. “I do think that that model can and should can be pushed to a more federalized government place to make sure there's a certain amount of consistency,” especially in how the government interacts with the researcher community.\n\nNo longer representing the U.S. government, Wiswell is now a principal at security engineering and consulting services firm GRIMM, but she is credited with launching the Hack the Pentagon program in April 2016. Around 1,400 researchers and hackers participated in the highly successful pilot program, which ultimately resulted in the discovery of 138 vulnerabilities, while spawning additional bug bounties and later an official DoD vulnerability disclosure policy.\n\nSpeaking as part of a larger “Meet the Feds” panel that also featured active members of the Department of Justice, the Food and Drug Administration, and the Federal Trade Commission, Wiswell addressed the challenges surrounding the creation of the first federal bug bounty program.\n\nCertainly one of the biggest issues, if not the biggest, was gaining the trust of hackers, convincing them that the agency was not looking to unearth and track them. Likewise, some members of the DOD were uncomfortable with the lack of control they experienced while outside researchers combed through their code.\n\n\"Some of us on the government side have been skeptical of our engagements with you; some of you have been skeptical with you engagements with us. And we keep kind of pushing the envelope a little bit, and it's getting better every single engagement…” said Wiswell.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/vulnerabilities/topic/47222/", "topic_name": "Vulnerabilities"}]}, {"news_name": "Clinton, Romney campaign managers join forces to fight election hacking", "news_link": "https://www.scmagazine.com/clinton-romney-campaign-managers-join-forces-to-fight-election-hacking/article/675666/", "title": "Clinton, Romney campaign managers join forces to fight election hacking", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "July 18, 2017", "body": "A bipartisan project to fight election hacking has been launched at the Belfer Center for Science and International Affairs at Harvard University's John F. Kennedy School of Government, with Mitt Romney's and Hillary Clinton's former campaign managers playing major leadership roles.\n\nThe Defending Digital Democracy (DDD) project will feature a troika of prominent leaders: senior fellow Robby Mook, Clinton's 2016 campaign manager; senior fellow Matt Rhoades, Romney's 2012 campaign manager; and Belfer Center Co-Director Eric Rosenbach, who will serve as project director. Other experts from national security and technology organizations, including Facebook and Google, will also serve in key roles.\n\nThe DDD's stated goal is to “identify and recommend strategies, tools, and technology to protect democratic processes and systems from cyber and information attacks,” the project organizers said in a statement.\n\nRhoades and Mook called cyberattacks by foreign entities a major threat to the U.S. electoral process that requires a joint effort by both parties to combat effectively.\n\n“Over the last two years, nearly every election on both sides of the Atlantic has been affected by foreign cyber attacks, including Hillary Clinton's in 2016,” said Mook, with Rhoades adding, “This project will bring together not just different parties and ideologies, but subject matter experts from cybersecurity, national security, technology, and election administration to make a difference.” \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "150K attempts on S.C. voting system points to widespread hacking", "news_link": "https://www.scmagazine.com/150k-attempts-on-sc-voting-system-points-to-widespread-hacking/article/675337/", "title": "150K attempts on S.C. voting system points to widespread hacking ", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "July 17, 2017", "body": "“Security has been a top priority for the [State Election Commission] since implementing the statewide voting system in 2004,” the Journal cited Chris Whitmire, director of public information and training at the South Carolina State Election Commission, as saying. “However, events leading up to the 2016 General Election, including the breaches of other states' voter-registration systems, created an election-security environment that was very different.\"\n\nIn comparison, 113,372 hacking attempts were reported  a month later and by April 11, 2017, had dropped to just under 45,000, the Journal reported. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/hacking/topic/47220/", "topic_name": "Hacking"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Wikileaks publishes Vault 7: Highrise tool for Android devices", "news_link": "https://www.scmagazine.com/wikileaks-highrise-aka-tidrcheck-manual-published/article/675054/", "title": "Wikileaks publishes Vault 7: Highrise tool for Android devices", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "July 14, 2017", "body": "WikiLeaks Thursday published the manual of another CIA hacking tool “Highrise,” aka “TideCheck,” which is used to intercept and redirect text messages to a remote web server.\n\nThe manual, dated Dec. 16, 2013, was part of the Vault 7 leak series and the tool was designed to work on mobile devices running Android 4.0 to 4.3 though it has likely been updated to work on more recent versions. \n\nFeatures at a glance include proxy “incoming” SMS messages received by HighRise host to an internet LP, send “outgoing” SMS messages via the HighRise host, provide a communications channel between the HighRise field operator & the LP, and TLS/SSL secured internet communications.\n\nThe last two features suggest Highrise isn't a tool for installing on a targets phone but an app that can be installed on  the phones of CIA field operatives and provide a secondary, encrypted communications channel between operatives and supervisors, Bleeping Computer researchers said. \n\nWhen starting the tool for the first time, CIA operatives must enter the special code \"inshallah,\" which is the Arabic word for \"God willing\" in order to access its settings. Agents are then given the options to Initialize, Show Configuration, or Send Messages.  \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cyber-espionage/topic/47234/", "topic_name": "Cyber Espionage"}, {"topic_link": "https://www.scmagazine.com/cybersecurity/topic/47223/", "topic_name": "Cybersecurity"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/surveillance/topic/50685/", "topic_name": "Surveillance"}]}, {"news_name": "GSA removes Kaspersky Labs from its approved vendors list", "news_link": "https://www.scmagazine.com/gsa-removes-kaspersky-labs-from-its-approved-vendors-list/article/675052/", "title": "GSA removes Kaspersky Labs from its approved vendors list", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "July 14, 2017", "body": "The General Services Administration (GSA) has removed Kaspersky Labs from its list of approved vendors over fears the Russian-owned cybersecurity company represents an undue risk to U.S. interests.\n\nA GSA spokesman told Politico the move was made to “ensure the integrity and security of U.S. government systems and networks.” Federal agencies can still buy and use Kaspersky products that are not part of a GSA contract and the GSA's move is a leading indicator that the Trump administration is not in favor of using Kaspersky products.\n\nThis follows a move made by the U.S. Senate Armed Services Committee on June 29 that saw its annual defense spending bill containing a provision prohibiting the Department of Defense from using any products from Moscow-based cybersecurity firm Kaspersky Lab. \n\n“Kaspersky Lab has no ties to any government, and the company has never helped, nor will help, any government in the world with its cyberespionage efforts. The company has a 20 year history in the IT security industry of always abiding by the highest ethical business practices and trustworthy development of technologies, and Kaspersky Lab believes it is completely unacceptable that the company is being unjustly accused without any hard evidence to back up these false allegations,\" Kaspersky Labs said in a statement to SC Media.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}]}, {"news_name": "Trump crosses fingers while creation of Russia/US cyber-unit announced", "news_link": "https://www.scmagazine.com/trump-crosses-fingers-while-creation-of-russiaus-cyber-unit-announced/article/673950/", "title": "Trump crosses fingers while creation of Russia/US cyber-unit announced", "author": "Max Metzger", "author_link": "https://www.scmagazine.com/max-metzger/author/3966/", "date": "July 10, 2017", "body": "Vladimir Putin and Donald Trump will work together to create a bilateral committee to investigate election hacking. Or maybe they won't. They probably wont. \n\nRex Tillerson, the US secretary of state, recounted their meeting at this year's G20 in a recent press briefing. The two world leaders met for just over two hours in an encounter which was brimming with “positive chemistry”, according to Tillerson. \n\nTrump reportedly led by asking, \"I'm going to get this out of the way: Did you do this?\" referring to the widespread allegations that Russia hacked the 2016 general election. Over a “robust and lengthy exchange,” Putin denied the charge, as he always has done. Trump later backed this up in his own press conference he holds with the entire world at all times.\n\nI strongly pressed President Putin twice about Russian meddling in our election. He vehemently denied it. I've already given my opinion.....\n\nThey also made their way through a salad of topics currently facing the world, including the current situation in Syria and the threats to nearby Jordan. \n\nStill, Tillerson mentioned that neither wanted to remain stuck in the mire that surrounded Donald Trump's unforeseen rise to power, nor the incriminating evidence that suggest Russia interfered in the democratic process of one of the world's most powerful democracies.  Which is why, he told press, “we've agreed to continue engagement and discussion around how do we secure a commitment that the Russian government has no intention of and will not interfere in our affairs in the future.”\n\nOn the back of that, Trump and Putin have apparently begun exploring a joint framework, around which international state cyber-operations could be defended against and its perpetrators held accountable. \n\nIt was agreed that a “working-level group” would be set up to explore the matter.  Sergey Lavrov, the Russian foreign minister, later corroborated that in his own report to press. \n\nTrump personally expanded upon the idea a short while later, through a portal directly into his mind.\n\nPutin & I discussed forming an impenetrable Cyber Security unit    so that election hacking, & many other negative things, will be guarded..\n\nEwan Lawson, senior fellow for military influence at the Royal United Services Institute is sceptical. It would be “difficult to see how this would work in reality”, he told SC Media UK. \n\nFurthermore, “any US involvement in elections, however anodyne, is unlikely to be exposed by their agencies either. The Microsoft proposal for a UN agency to undertake 'neutral attribution' whilst hugely challenging would perhaps be more effective.”\n\n\nThe meeting has been a long time coming. During the campaign, Donald Trump spoke of their compatibility as well as their shared interests, suspicion of NATO and dislike of former president Barack Obama.\nStill, the meeting may not have been quite as romantic as its participants might have hoped. After the idea faced a tide of criticism, saying that such a framework would be meaningless considering the partial forces which which it is fundamentally bound, Trump is now backing away.\nIn fact, it appears as though he never meant for the idea to ever be realised. He tweeted earlier today:\n\n\nThe fact that President Putin and I discussed a Cyber Security unit  doesn't mean I think it can happen. It can't-but a ceasefire can,& did!\n\n", "topics": []}, {"news_name": "WikiLeaks drops new CIA tools, BothanSpy and Gyrfalcon", "news_link": "https://www.scmagazine.com/wikileaks-drops-new-cia-tools-bothanspy-and-gyrfalcon/article/673646/", "title": "WikiLeaks drops new CIA tools, BothanSpy and Gyrfalcon", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "July 07, 2017", "body": "WikiLeaks latest Vault7 offering includes two CIA hacking tools, BothanSpy and Gyrfalcon 2.0, which can swipe SSH credentials.\n\nBothanSpy and Gyrfalcon target the Windows and Linux operating systems, respectively, reported Bleeping Computer. \n\nAccording to the BothanSpy user manual, posted by Wikileaks and dating from 2015, this malware will “is a tool that targets the SSH client program Xshell and steals user credentials for all active SSH sessions. BothanSpy will exfiltrate the stolen credentials through the Fire and Collect (F&C) channel and out to disk on the attacker-side. By using F&C, BothanSpy never touches disk.”\n\nThe even older Gyrfalcon manual states “The application compresses, encrypts, and stores the collected data into a collection file kept on the Linux platform's file system. Gyrfalcon is capable of collecting full or partial OpenSSH session traffic including user name and passwords of OpenSSH users.\n\nBleeping Computer noted that WikiLeaks has previously released 13 pieces of malware the hacktivist group claims has been pulled from the CIA.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/malware/topic/47215/", "topic_name": "Malware"}]}, {"news_name": "Legislation bars DoD from using Kaspersky; FBI agents visit employees of Russian cyber firm", "news_link": "https://www.scmagazine.com/legislation-bars-dod-from-using-kaspersky-fbi-agents-visit-employees-of-russian-cyber-firm/article/672237/", "title": "Legislation bars DoD from using Kaspersky; FBI agents visit employees of Russian cyber firm", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "June 29, 2017", "body": "The U.S. Senate Armed Services Committee on Wednesday released its annual defense spending bill, which reportedly contains a provision prohibiting the Department of Defense from using any products from Moscow-based cybersecurity firm Kaspersky Lab.\n\nAccording to multiple news outlets, Sen. Jeanne Shaheen (D-NH), who is credited with adding the Kaspersky amendment to the bill, said in a statement that \"ties between Kaspersky Lab and the Kremlin are very alarming.\"\n\nNews of this key stipulation in the legislation came one day after numerous U.S.-based employees of Kaspersky reportedly received visits from FBI agents conducting an investigation, the details of which are not known. According to Reuters, Kaspersky acknowledged \"brief interactions\" between the FBI and certain employees, describing these meetings as \"due diligence\" discussions. Reportedly, no warrants were served.\n\nDespite its status as a leading cybersecurity research and software company, Kaspersky has come under scrutiny for its alleged close relationship with Kremlin officials, prompting fear that the company could assisting Russia with cyber campaigns such as Moscow's interference with the U.S. presidential election.\n\nIn a May 11 hearing before the U.S. Senate Intelligence Committee, four intelligence and justice officials testified that they would not be comfortable with Kaspersky software on their computers. Kaspersky has repeatedly denied that it has any connection to the Russian government.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cyber-espionage/topic/47234/", "topic_name": "Cyber Espionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/legislation/topic/47221/", "topic_name": "Legislation"}]}, {"news_name": "Rep. Lieu asks NSA to stop Petya, WannaCry if it can", "news_link": "https://www.scmagazine.com/rep-lieu-asks-nsa-to-stop-petya-wannacry-if-it-can/article/672073/", "title": "Rep. Lieu asks NSA to stop Petya, WannaCry if it can ", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "June 29, 2017", "body": "Rep. Ted Lieu, D-Calif., has called on the National Security Agency (NSA) to release any kill switches or protective services that could help mitigate the cyberattacks launched using NSA-created malicious tools that are in the wild.\n\nThe request was sent in a letter to NSA Director Admiral Michael S. Rogers  the day after a second major ransomware attack was launched that utilized the NSA tools, which were released publicly by the hacktivist group the Shadow  Brokers.\n\n“My first and urgent request is that if the NSA knows how to stop this global malware attack, or has information that can help stop the attack, then NSA should immediately disclose it.  If the NSA has a kill switch for this new malware attack, the NSA should deploy it now,” Lieu wrote.\n\nHe also requested that the NSA tell companies like Microsoft when they spot a major vulnerability in one of their products.\n\nWhile WannaCry specifically leveraged the exploit known as EternalBlue, Petya (or NotPetya) takes advantage of both EternalBlue and EternalRomance, a separate remote code execution Windows exploit.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/ransomware/topic/47247/", "topic_name": "Ransomware"}]}, {"news_name": "Don't repeal net neutrality, ISPs tell FCC", "news_link": "https://www.scmagazine.com/dont-repeal-net-neutrality-isps-tell-fcc/article/671741/", "title": "Don't repeal net neutrality, ISPs tell FCC", "author": "Greg Masters", "author_link": "https://www.scmagazine.com/greg-masters/author/3591/", "date": "June 28, 2017", "body": "The battle over control of the internet pathways – and who has rights to customer data – rages on.\n\nYesterday, a letter signed by more than 40 internet service providers (ISPs) was delivered to Ajit Pai, the chairman of the Federal Communications Commission (FCC). In contrast to the argument the FCC chairman has been making – namely that open internet rules harm ISPs – the message expressed support for the Open Internet Order and its underlying legal foundation under Title II of the Communications Act.\n\nIn the letter, the ISPs also assert they \"have long supported network neutrality as a core principle for the deployment of networks for the American public to access the internet.\"\n\nThe conflict stems from a Congressional ruling last March that repealed broadband policy rules, according to a post on the blog of the Electronic Frontier Foundation (EFF), written by Ernesto Falcon, legislative counsel at the nonprofit whose stated purpose is to defend civil liberties in the digital world. At that moment, the classification of broadband services shifted to \"common carrier service,\" regulated by Title II of the Communications Act, rather than an \"information service,\" regulated by Title I of the same Act.\n\nA furor arose from those opposing the change, who argued that small players were being put at an unfair advantage from the bigger players, like Comcast, AT&T and Verizon. Reversing the 2015 decision – reclassifying broadband as a \"common carrier\" service – eliminates protections provided by Title II, the message to the FCC chairman stated.\n\n\"If [Chairman Pai] succeeds, not only are Section 201 and Section 202 – the core provisions that support network neutrality – on the chopping block, but also a whole host of other active provisions that protect competition in the broadband market,\" Falcon wrote. \n\nAnother issue he pointed to is the fact that ISPs can't determine their legal obligations with consumer data. While he surmises that the larger players plied Congress with millions of dollars in order to win access to the vast trove of customer data the providers retain in their databases, the smaller players are not interested in selling their customers' personal information to third parties for profit, at least not without their permission.\n\nIn fact, he wrote, almost all of these players were vehemently opposed to Congress repealing the privacy rules. The plan by the FCC chairman would remove the Section 222 privacy obligations for all broadband companies. \"In essence, Chairman Pai's plan would be the nail in the coffin for broadband privacy that Congress started with its privacy repeal earlier this year,\" Falcon asserted.\n\n\"Network neutrality – the idea that ISPs should treat all data that travels over their networks fairly, without improper discrimination in favor of particular apps, sites or services – is a principle that must be upheld to protect the future of our open Internet,\" a spokesperson from the EFF said in a statement sent to SC Media on Wednesday. \"It's a principle that's faced many threats over the years, such as ISPs forging packets to tamper with certain kinds of traffic or slowing down or even outright blocking protocols or applications.\"\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Senators grill intel community on 702 incidental collection", "news_link": "https://www.scmagazine.com/senators-grill-intel-community-on-702-incidental-collection/article/671938/", "title": "Senators grill intel community on 702 incidental collection", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "June 28, 2017", "body": "Even under sometimes intense grilling by the Senate Judiciary Committee, members of the intelligence community (IC) Tuesday continued to advocate for reauthorization of Section 702 of the FISA Amendments Act, but widely refused to yield any details on to what extent that surveillance authority scoops up data on Americans. \n\nCommittee Chairman Sen. Chuck Grassley, R-Iowa, repeatedly asked representatives from the Office of the Director of National Intelligence, the Federal Bureau of Investigation, the Justice Department and the National Security Agency (NSA) to answer senators' questions regarding the number of Americans incidentally caught up in IC surveillance.\n\n“…what about the privacy of those not in this room?” Sen. Dick Durbin, D-Ill., asked to ODNI Acting General Counsel Bradley Brooker, noting that it would be difficult to “believe transparency is really the guiding principle” if the intelligence community couldn't identify  “how many Americans have been innocently swept up” in surveillance under Section 702 authorization. “How are we supposed to have confidence you're being careful not to involve more people than necessary to keep America safe?”\n\nSection 702 expires December 31 and Congress is mulling whether to reauthorize it. \n\nIn a statement issued the day before the hearing, Grassley contended that Section 702 “has proven highly valuable in helping to protect the United States,” but called the “unknown scope” of incidental collection “concerning,” as is “the way in which the FBI is permitted to search already-collected 702 material.”\n\nHe also referenced “troubling” allegations of unmasking of American citizens for “partisan political purposes,” though he acknowledged that the accusations “haven't been directed at Section 702 specifically.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/apt/topic/47229/", "topic_name": "APT"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}]}, {"news_name": "\"Anonymous\" cites public docs in claim alien life will soon be discovered", "news_link": "https://www.scmagazine.com/anonymous-cites-public-docs-in-claim-alien-life-will-soon-be-discovered/article/671210/", "title": "\"Anonymous\" cites public docs in claim alien life will soon be discovered", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "June 26, 2017", "body": "A person using the name of the loosely-organized hacktivist group Anonymous has posted a rather unusual video on YouTube claiming NASA has the ability to discover life existing on other planets.\n\nIn a major break from Anonymous' tradition of revealing information derived from hacking, whistle blowers or for taking responsibility for attacking a website, this video, hosted by a Guy Fawkes mask-wearing image, simply cited several unclassified U.S. government documents along with the recent public statement by Thomas Zurbuchen, associate administrator, NASA Science Mission Directorate before the U.S. House of Representatives Committee on Science, Space and Technology to draw the conclusion that alien life might soon be spotted.\n\nThe video did not say NASA would soon disclose state alien life has been discovered nor was it posted on Anonymous Official, but on Anonymous Global.\n\nZurbuchen tweeted out a message to assure everyone that NASA had not plans to disclose contact with, or the discovery of, alien life.\n\nContrary to some reports, there's no pending announcement from NASA regarding extraterrestrial life.\n\n", "topics": []}, {"news_name": "UK Parliament records \"unauthorised attempts\" to access MP accounts", "news_link": "https://www.scmagazine.com/uk-parliament-records-unauthorised-attempts-to-access-mp-accounts/article/671008/", "title": "UK Parliament records \"unauthorised attempts\" to access MP accounts ", "author": "Staff Report", "author_link": "https://www.scmagazine.com/staff-report/author/3603/", "date": "June 26, 2017", "body": "The House of Commons has confirmed in a statement that it has logged “unauthorised attempts” to access the accounts of 9,000 Members of Parliament, peers and parliamentary staff on the parliamentary network.\n\nParliament's email system and remote access tools were switched off during the weekend as a precautionary measure.\n\nThe incident follows on from Friday's report in The Times that a list containing login details of MPs, peers and parliamentary staff was being offered for sale on Russian-speaking websites.\n\nA Parliament press statement said, “We have systems in place to protect member and staff accounts and are taking the necessary steps to protect our systems.”\n\nHowever, the Parliamentary Digital Service (PDS) has been criticized by cybersecurity experts for failing to provide other means of protection for email accounts.\n\nA Parliamentary spokesman told the BBC, “The parliamentary network was compromised due to weak passwords which did not conform to guidance from the Parliamentary Digital Service.”\n\nThe spokesman added: \"As they are identified, the individuals whose accounts have been compromised have been contacted and investigations to determine whether any data has been lost are under way.\"\n\nParliament said that “significantly fewer than 1 percent of the 9,000 accounts on the parliamentary network have been compromised.\"\n\n \n\nSpencer Young, RVP of EMEA at Imperva, said that while exactly what the attackers were after is not known, the general thought is email login credentials have been compromised.\n\n\"Passwords continue to be an Achilles Heel in the fight against cybercrime as improper user behavior – such as weak passwords or use of the same password across different sites continues. This is an outcome of a continual lack of understanding and investment from the Government in security strategies that enterprise Britain adopt as standard operating procedures. This attack was unfortunately just a matter of time,\" he said.\n\nThe Guardian's “security source” has already attributed the attack to Russia. No further explanation had been given as to how it had reached this conclusion apart from the fact that the credentials were being offered for sale on Russian-speaking forums.\n\nParliament described the incident as “ongoing” and said it is working with the National Cyber Security Centre (NCSC) to identify the culprits.\n\nParliament says the NCSC is working to “to identify the method of the attack and have made changes to prevent the attackers gaining access”.\n\nSC has contacted the NCSC for comment.\n\nNeil Larkins, co-founder and COO of Egress Software Technologies said in a statement: “There are technical measures that could have been put in place to stop this attack. For example, access can be restricted to known IP addresses, which would mean that anyone on an unknown external device trying to get access – even with the correct password – would be denied in the first instance.”\n\nHowever, the reason why cybercriminals assaulted the MP's email system, instead of another area of the government's network, is totally logical Adam Laub, senior VP of product marketing at STEALTHbits Technologies, told SC Media. \n\n\"cWhile the body content of an email and the conversations themselves have their own distinct value, email quietly maintains a high ranking position as one of the largest file repositories within any organization.  The amount of files contained within email inboxes is staggering.  It's also a given that a substantial portion of those files will contain sensitive information that could be just as (if not more) damning as the off-color comment that accompanied it in its initial delivery,\" he said.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/hacking/topic/47220/", "topic_name": "Hacking"}]}]}]