[{"navigation": "Privacy_and_compliance", "news_list": [{"news_name": "Software vendor found placing malware in its own product", "news_link": "https://www.scmagazine.com/software-vendor-found-placing-malware-in-its-own-product/article/745469/", "title": "Software vendor found placing malware in its own product", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "February 20, 2018", "body": "The company FlightSimLabs found itself in the odd position of having to remove malware it had installed on some versions of its software as part of the digital rights management package after it was discovered by a Redditor.\n\nRedditor crankyrecursion found that FlightSimLabs Airbus A320 software came with a Chrome password dumping tool included that was capable of removing user names and passwords from any system on which it is running. The malware file was labeled Test.exe in the code.\n\nThe company not only did not deny this report, but its CEO Lefteris Kalamaras admitted that the malware was in place, but was needed to combat piracy.\n\n“While the majority of our customers understand that the fight against piracy is a difficult and ongoing battle that sometimes requires drastic measures, we realize that a few of you were uncomfortable with this particular method which might be considered to be a bit heavy handed on our part,” he said.\n\nKalamaras also reiterated that the password finder was intended only to find out who was running pirated versions of its software titles and was never under any circumstances used in legitimate copies of the product.\n\n“There is a specific method used against specific serial numbers that have been identified as pirate copies and have been making the rounds on ThePirateBay, RuTracker and other such malicious sites. If such a specific serial number is used by a pirate (a person who has illegally obtained our software) and the installer verifies this against the pirate serial numbers stored in our server database, it takes specific measures to alert us,” Kalamaras said in a blog post.\n\nFlightSimLabs has since posted a version of Airbus A320 without the malware.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/malware/topic/47215/", "topic_name": "Malware"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "New York Times asks FISA court to disclose Carter Page surveillance documents", "news_link": "https://www.scmagazine.com/new-york-times-asks-fisa-court-to-disclose-carter-page-surveillance-documents/article/742454/", "title": "New York Times asks FISA court to disclose Carter Page surveillance documents", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "February 06, 2018", "body": "If the Foreign Intelligence Surveillance Court grants a New York Times request to unseal documents surrounding federal Russian probe investigators' surveillance of former Trump Campaign adviser Carter Page, it will be the first time such material has been released since the Foreign Intelligence Surveillance Act was signed into law 40 years ago.\n\nThe surveillance of Page by FBI investigators looking into Russia's interference in the U.S. presidential election and possible collusion by members of the Trump campaign team has become a flashpoint in recent weeks as some GOP lawmakers contend that the government relied on a dossier of oppositional research paid by Hillary Clinton's campaign to secure the FISA warrant on Page.\n\nBut Democrats have countered that the warrant on Page, who'd been on the intelligence community's radar for at least five years for his associations with Russian operatives, was obtained legally and ethically.\n\nIntelligence wiretap records are typically tightly guarded, but the Times argued that President Trump opened the door to releasing the FISA documents by declassifying the contents of a four-page memo from House Intelligence Committee Chairman Devin Nunes, R-Calif., that summarized material found in the application to spy on Page.\n\nThere's no reason “for the Page warrant orders and application materials to be withheld in their entirety,” the Times contended, noting that “disclosure would serve the public interest.” The media outlet asked for the released with “limited redactions as may be essential to preserve information that remains properly classified notwithstanding the declassification and dissemination of the Nunes memorandum.\"\n\n“Given the overwhelming public interest in assessing the accuracy of the Nunes memorandum and knowing the actual basis for the Page surveillance orders,” The Times's motion says, the court should direct the publication of its orders and the application materials \"with only such limited redactions as may be essential to preserve information that remains properly classified notwithstanding the declassification and dissemination of the Nunes memorandum.\"\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "UK's Snoopers' Charter 'inconsistent with EU law' says Court of Appeal", "news_link": "https://www.scmagazine.com/uks-snoopers-charter-inconsistent-with-eu-law-says-court-of-appeal/article/741570/", "title": "UK's Snoopers' Charter 'inconsistent with EU law' says Court of Appeal", "author": "", "author_link": "", "date": "February 02, 2018", "body": "", "topics": []}, {"news_name": "Justice, FBI reviewing Dem rebuttal to Nunes memo alleging FISA abuse", "news_link": "https://www.scmagazine.com/justice-fbi-reviewing-dem-rebuttal-to-nunes-memo-alleging-fisa-abuse/article/740883/", "title": "Justice, FBI reviewing Dem rebuttal to Nunes memo alleging FISA abuse", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 31, 2018", "body": "As President Trump considers whether to release a memo penned by House Intelligence Committee Chairman Devin Nunes's staff alleging that the FBI abused its surveillance authority when it targeted one of his campaign advisors, a memo generated by committee Democrats refuting the Nunes memo's conclusions is being vetted by the FBI and the Justice Department. \n\n\"I think that what we see in the Republican memo is a terrible mischaracterization of the events. So, we sent out the proper events in their context in our own memoranda,\" Rep. Adam Schiff, D-Calif., author of the Democrats' memo, told CNN. \"Even when their memo is made public, we can point out, OK, this is wrong. And this is misleading. And this is distorting.\"\n\nSchiff said the Committee Democrats don't have plans to read the memo, which the committee voted on Monday to block, on the House floor to get its contents into the record. \"That's not an option. Our memo is classified just as theirs is -- the only difference is we are vetting ours through the FBI and the Justice Department,\" Schiff said, who believes that Nunes and his supporters are attempting to derail or undermine Special Counsel Robert Mueller's investigation into Russia's meddling in the U.S. presidential election and potential collusion with members of Trump's team.\n\nThe Committee did agree to let the whole of the House review Schiff's memo.\n\nThe Nunes memo is now on the president's desk – he has five days to decide whether to reveal the contents, something the Boston Globe reported Trump was overheard telling Rep. Jeff Duncan, R-S.C., after the State of the Union address Tuesday that he was “100 percent” behind. The report cited White House Chief of Staff John Kelly as saying Wednesday that the memo would be released “pretty quick.”\n\nThe Justice Department, which had already referred to the release of the Nunes memo without proper vetting as “extreme recklessness,” and the FBI renewed their calls for Trump and the House committee to reconsider making public the contents of the document.\n\n\"With regard to the House Intelligence Committee's memorandum, the FBI was provided a limited opportunity to review this memo the day before the committee voted to release it,\" an FBI statement said, noting that \"as expressed during our initial review, we have grave concerns about material omissions of fact that fundamentally impact the memo's accuracy.\"\n\nThe memo reportedly may contend that investigators used the contents of the controversial Steele dossier to renew a warrant to conduct surveillance on Trump campaign adviser Carter Page. \n\n“I doubt they based it on a single source of information,” former House Intelligence Committee Chairman Mike Rogers told CNN.\n\n“I can't imagine that the dossier was the centerpiece of a FISA application,” Talking Points Memo quoted Robert Litt, a former Office of the Director of National Intelligence general counsel and a former Justice Department employee, as saying.\n\n“Number one, I don't think the Department of Justice would have allowed that to go forward as the sole basis. Number two, I don't think a judge would have approved probable cause on that basis alone,” he said. “And number three, everything I read has suggested that there was considerable other information about Page before this dossier came in.”\n\nCalling on colleagues not to \"let the politics of the moment cloud our judgment,\" Sen. John Kennedy, R-La., told CNN's \"New Day\" that “if there's classified information in that memo, it shouldn't be released. If they release it anyway, to be fair, the Democrats ought to be allowed to release their memo.\"\n\nWhile Committee Democrats may have been blocked from sharing their memo publicly, they potentially could release a non-classified version. \"My strong preference would be not to have either side put spin on it, go through the original material and try to take out all the classified information,\" Kennedy said. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Data from soldiers' fitness trackers reveal sensitive locations, routines", "news_link": "https://www.scmagazine.com/data-from-soldiers-fitness-trackers-reveal-sensitive-locations-routines/article/740245/", "title": "Data from soldiers' fitness trackers reveal sensitive locations, routines", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 29, 2018", "body": "A heatmap of two years' worth of fitness tracker Strava's global data, released last November but discovered more recently by an Australian student, inadvertently revealed the location of U.S. military facilities in war zones.\n\nAlthough the data collected – more than 3 trillion coordinates from more than 27 million users of fitness trackers like Fitbit and Jawbone – by the GPS tracking firm was anonymized, it ultimately revealed not only sensitive troop locations but routes walked along the Mexican border by U.S. border patrols. The military is reassessing how fitness trackers are used.\n\n“The rapid development of new and innovative information technologies enhances the quality of our lives, but also poses potential challenges to operational security and force protection,” the Central Command press office in Kuwait said in a statement to the Washington Post. “The Coalition is in the process of implementing refined guidance on privacy settings for wireless technologies and applications, and such technologies are forbidden at certain Coalition sites and during certain activities.” \n\nTom Bonner, senior manager of threat research, EMEA, at Cylance, said the \"incident serves to highlight a distinct lack of operational security employed by various government organizations around the world.”\n\nSaying the breach matters “only because these personal Internet of Things... devices collected data that was generally ignored by IT and the organizations as a whole,” Imperva CTO Terry Ray pointed out that “the privacy issues around this breach wouldn't likely have been considered when thinking about such devices.”\n\nMany secret locations “ban the use of mobile phones when on premise, which is common for military, intelligence and other government private sites,” since they can “collect and transmit data outside of the environment,” said Ray. However, the fitness tracker devices “do the same thing, albeit on a much smaller scale.”\n\nBonner called for “access to personal communication devices with geolocation services [to] be banned in sensitive/restricted locations, and broader assessments and awareness training undertaken by employers to understand and mitigate the potential risk posed by these types of services.\"\n\nPointing to “some bizarre arguments on this in the past with people asking why we should care about hacking devices for location, arguing what could actually be done with the information,” Oliver Pinson-Roxburgh, EMEA director at Alert Logic, said “the military issues associated with this are alarming, and the military should be regularly testing these issues much like businesses should.” He, too, called for a ban. “There should really be no personal equipment or devices allowed during military operations, and military issued devices should be put through much more rigorous testing to look for different types of threats and risks to that of a commercial product,\" said Pinson-Roxburgh.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/gps/topic/53707/", "topic_name": "GPS"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "EC issues GDPR guidance", "news_link": "https://www.scmagazine.com/ec-issues-gdpr-guidance/article/740003/", "title": "EC issues GDPR guidance", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 28, 2018", "body": "With just under four months to go before the General Data Protection Regulation (GDPR) takes effect, the European Commission (EC) published guidance Thursday meant to help organizations apply the new rules to their businesses.\n\n“The guidance from the Commission makes it clear that the GDPR is a high priority at the highest levels of EU government” Sam Pfeifle, content director at the International Association of Privacy Professionals (IAPP). \n\nNoting that “no entity in the privacy and data protection universe - from national regulator to the smallest data processor - will be unaffected by the GDPR and the Commission is doing everything in its power to ensure no one is caught unawares,” Pfeife said, the guidance “also implies, however, that there will be an expectation of compliance on day one and ignorance will not be a defense.”\n\nIndeed, the EC directed the EU governments should accelerate their adoption of national legislation that aligns with GDPR and provide the resources that their data protection authorities, which the EC will fund with EUR 1.7 million, need to be effective. \n\nWe need modern rules to respond to new risks, so we call on EU governments, authorities and businesses to use the remaining time efficiently and fulfill their roles in the preparations for the big day,\" Vĕra Jourová, Commissioner for Justice, Consumers and Gender Equality, said in a release. \n\nThe EC will provide another EUR 2 million to fund those authorities' efforts to reach businesses.\n\nThe Commission particularly encouraged outreach to smaller and medium-sized businesses, announcing that it was launching a “practical online tool” aimed at aiding SMEs in their compliance efforts and in benefiting from the new regulation.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Report: Number of cyber incidents doubled in 2017, yet 93% could easily have been prevented", "news_link": "https://www.scmagazine.com/report-number-of-cyber-incidents-doubled-in-2017-yet-93-percent-could-easily-have-been-prevented/article/739932/", "title": "Report: Number of cyber incidents doubled in 2017, yet 93 percent could easily have been prevented", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "January 28, 2018", "body": "Out of nearly 160,000 reported cyber incidents affecting businesses in 2017, 93 percent could have been prevented by following basic security measures such as regularly updating software, blocking fake email messages, using email authentication, and training employees, a new report claims.\n\nThe overall number of reported incidents nearly doubled 2016's total of 82,000 incidents, according to the Online Trust Alliance (OTA), an Internet Society initiative, which released its 2017 Cyber Incident & Breach Trend Report on Jan. 25, in advance of Data Privacy Day. For the purposes of its research, OTA defines an incident as any unauthorized action resulting in system or device access, data extraction or manipulation, business disruption, or financial/reputational harm.\n\nBasing its findings on threat intelligence data gleaned from various sources, OTA reports that the majority of data breaches, 52 percent, were reportedly the result of actual malicious hacking. The next most common causes included an absence of proper security software (15 percent), credit card skimming (11 percent), a lack of internal controls (11 percent), and phishing attacks (eight percent).\n\nOTA also found that there were 134,000 ransomware attacks on businesses in 2017, compared to roughly half that amount in 2016.\n\n“Regular patching has always been a best practice and neglecting it is a known cause of many breaches, but this received special attention in 2017 in light of the Equifax breach,” said Jeff Wilbur, director of the OTA initiative at the Internet Society, in a press release. “In 2018 we expect patches to play an even more integral role due to the recently discovered Spectre and Meltdown vulnerabilities where nearly every computer chip manufactured in the last 20 years was found to contain fundamental security flaws.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/data-breaches/topic/47250/", "topic_name": "Data Breaches"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/ransomware/topic/47247/", "topic_name": "Ransomware"}]}, {"news_name": "National Cyber Security Alliance Data Privacy Day", "news_link": "https://www.scmagazine.com/national-cyber-security-alliance-data-privacy-day/article/739905/", "title": "National Cyber Security Alliance Data Privacy Day ", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "January 28, 2018", "body": "The National Cyber Security Alliance's annual Data Privacy Day kick off event took place on January 25, three days before the actual event day, and featured several events including a conference that was livestreamed from San Francisco.\n\nThe day-long event centered on a series of Ted-Talk style meetings with participants coming from almost every major tech company, the government and academia. Some of those on hand were: Kent Wada Chief Privacy Officer and Director, Policy and Governance University of California, Los Angeles, Karen McGee, Privacy & Security, Legal, Intel, Marc M. Groman, Principal, Groman Consulting, Former Senior Advisor for Privacy, White House , Michelle Dennedy, Chief Privacy Officer, Cisco, Kalinda Raina, Head of Global Privacy, Senior Director, LinkedIn and Kristian Lum, PhD, Lead Statistician, Human Rights Data Analysis Group.\n\nThe entire event can be viewed by clicking on the image below.\n\n\n\n10:30 – 10:35 a.m. Opening Remarks\n\n10:35 – 11:00 a.m. Looking into a Crystal Ball: What Your Data Says About You\n\n11:05 – 11:15 a.m. Five Things You Can Do to Manage Your Privacy Now\n\n11:20 – 11:40 a.m. What You Should Know About The Internet of Me and Your Privacy\n\n11:45 a.m. – 12:00 p.m. Tracking My Location – Business Uses and Consumer Choices\n\n12:00 – 1:00 p.m. Livestream Break\n\n1:05 – 1:30 p.m. Staying Competitive – Why Privacy is Good for Your Business\n\n1:35 – 1:50 p.m. The Problem with Your Online Privacy\n\n1:55 – 2:15 p.m. Balancing Act: Privacy and Innovation\n\n2:20 – 2:35 p.m. What's an Algorithm Got to Do With It?\n\n", "topics": []}, {"news_name": "Florida makes info on 1K Kansas voters public, lawmakers ask DHS to clarify role regarding election integrity commission", "news_link": "https://www.scmagazine.com/florida-makes-info-on-1k-kansas-voters-public-lawmakers-ask-dhs-to-clarify-role-regarding-election-integrity-commission/article/738989/", "title": "Florida makes info on 1K Kansas voters public, lawmakers ask DHS to clarify role regarding election integrity commission", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 23, 2018", "body": "Florida released partial social security numbers for close to 1,000 Kansas voters after receiving data from Kansas Secretary of State Kris Kobach as part of the Crosscheck program that identifies double voter registration.\n\n“It is absolutely essential,” Kobach said of the program after the calling the exposed data unfortunate, according to a report by The Kansas City Star. “The Crosscheck provides the first piece of evidence that a person may have voted twice.”\n\nKobach, who most recently co-chaired, along with Vice President Mike Pence, the now-defunct President's Commission on Election Integrity, said “if the Crosscheck program were to go away, then we would be unable to catch virtually all of the double voters,” of which, he claimed, “there are thousands” nationwide.\n\nThe Kansas AG, who is running for governor, was tapped by President Trump last year to investigate voter fraud after he lost the popular vote in the presidential election by nearly three million votes to his rival, former Secretary of State Hillary Clinton.\n\nThe commission was disbanded in early January after it faced resistance from states fearing privacy concerns and voter suppression as well as a wide array of lawsuits. Alarmed by the breadth of voter data requested by the commission, many states had resisted its overtures, leading the White House to concede it was fighting an uphill battle.\n\n“Rather than engage in endless legal battles at taxpayer expense, today President Donald J. Trump signed an executive order to dissolve the Commission, and he has asked the Department of Homeland Security to review its initial findings and determine next courses of action,” White House Press Secretary Sarah Huckabee Sanders said in a statement at the time.  \n\nOn Tuesday, House Homeland Security Committee Ranking Member Bennie Thompson (D-Miss.) and Committee on House Administration Ranking Member Robert Brady (D-Pa.), who co-chair the Congressional Task Force on Election Security, asked DHS Secretary Kristjen Nielsen to clarify her department's role in following up on the commission's efforts.\n\n“It is unclear how the Department will carry out this charge given that the Commission never produced any findings,” Thompson and Brady wrote in a letter to Nielsen. “We are concerned that directing DHS essentially to take over where the Commission left off could distract the Department from its pressing obligation to protect U.S. election systems from foreign interference and may undermine the burgeoning relationships DHS is building with state election officials.”\n\nThey asked DHS for documents and files received from the commission, to detail the activities it will undertake to meet the president's directive and what resources it will use, and the steps DHS will take “to avoid undermining the cooperative relationship between DHS and states necessary to secure our nation's elections.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "House chairs mull releasing classified info behind Nunes FISA abuse memo", "news_link": "https://www.scmagazine.com/house-chairs-mull-releasing-classified-info-behind-nunes-fisa-abuse-memo/article/738432/", "title": "House chairs mull releasing classified info behind Nunes FISA abuse memo", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 22, 2018", "body": "", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Not-so-super Sonic? Sega apps leak data to suspicious servers, says research lab", "news_link": "https://www.scmagazine.com/not-so-super-sonic-sega-apps-leak-data-to-suspicious-servers-says-research-lab/article/738304/", "title": "Not-so-super Sonic? Sega apps leak data to suspicious servers, says research lab", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "January 19, 2018", "body": "Three Sonic the Hedgehog games for Android devices that collectively have been downloaded well over a hundred million times are leaking users' geolocation and device data to uncertified servers, thereby posing a privacy threat to mobile gamers, according to researchers.\n\nA Jan. 18 blog post from the research lab of mobile security company Pradeo states that the apps \"geolocate users and relay their position,\" \"leak device data,\" and \"send data to an average of 11 distant servers, including three uncertified ones.\" While most of the distant servers are used for legit tracking and marketing purposes, two of the three uncertified servers are linked to a variant of Android/Inmobi.D, which Symantec Corporation recognizes as a potential unwanted library app that is found bundled with certain Android applications.\n\nIn addition to geolocation data, the apps reportedly also can leak mobile network information such as service provider name and network type, and device information including manufacturer, commercial name, battery level, maximum level of battery, and operating system version number.\n\nThe three games are Sonic Dash, which has been downloaded from Google Play 100 to 500 million times and Sonic the Hedgehog Classic and Sonic Dash 2: Sonic Book, both of which have been installed via the Play Store 10 to 50 million times.\n\nMoreover, Pradeo reports that the three apps contain an average of 15 OWASP (Open Web Application Security Project) vulnerabilities. This includes two critical flaws, X.509TrustManager and PotentiallyByPassSslConnection, that make device owners susceptible to man-in-the-middle attacks, as a result of unsafe implementations that ignore SSL certificate validation errors when establishing an HTTPS connection to a remote host. \"An attacker could read transmitted data (such as login credentials) and even change the data transmitted on the HTTPS connection,\" explains Pradeo in the company blog post.\n\nOthers can be exploited to cause a denial of service conditions, leaks of sensitive data, and weak encryption, the blog post continues.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/malware/topic/47215/", "topic_name": "Malware"}, {"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/vulnerabilities/topic/47222/", "topic_name": "Vulnerabilities"}]}, {"news_name": "Senate passes FISA Amendments Reauthorization Act", "news_link": "https://www.scmagazine.com/senate-passes-fisa-amendments-reauthorization-act/article/737972/", "title": "Senate passes  FISA Amendments Reauthorization Act", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 18, 2018", "body": "A six-year extension to the much-debated Section 702 of the Foreign Intelligence Surveillance Act (FISA) will soon be on its way to the White House for the president to sign after the Senate gave it a nod by a vote of 65 to 34. \n\nThe House passed the bill on Jan. 11, even after a pair of contradictory tweets from President Trump over his take on the proposed legislation momentarily threw lawmakers into confusion over his position.\n\n\"We're disappointed with the passage of the FISA Amendments Reauthorization Act and the misleading statements supporters of the bill made about the collection of communications, the process by which these records are obtained by the FBI, and the alternatives offered by privacy-minded members of the House and Senate like Justin Amash, Mike Lee, Rand Paul, and others,” FreedomWorks Vice President of Legislative Affairs Jason Pye said in a statement. \n\nWhile Pye said no one opposes the reauthorization, those “who actually believe that the Fourth Amendment means what it says wanted to ensure that Americans' privacy was protected.”\n\nCalling the way the bill was passed “a disgrace,” Pye added, “when the Bill of Rights is at stake, there should open debate and an open process” that didn't happen with this legislation.\n\n“The American people deserve better,” said Pye. \"We urge President Trump to go with his gut and veto this bill.\"\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Former Fox hosts Twitter accounts hacked, peppered with Turkish propaganda", "news_link": "https://www.scmagazine.com/former-fox-hosts-twitter-accounts-hacked-peppered-with-turkish-propaganda/article/737436/", "title": "Former Fox hosts Twitter accounts hacked, peppered with Turkish propaganda", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 17, 2018", "body": "Self-proclaimed Turkish hackers gained control of Twitter accounts belonging to former Fox News hosts, Greta Van Susteren and Eric Bolling, using them to tweet out propaganda and send direct messages to the President Trump. Van Susteren and Bolling are among the 45 accounts followed by the president.\n\n“@realDonaldTrump follows both Greta Van Susteren and Eric Bolling — The hackers are now DMing the president!!!,” Jonathan Levine, media editor at The Wrap, tweeted.\n\n“We love the Turks and Muslims in the world,” the hackers posted from Van Susteren's account. “We condemn those who persecute them, especially in the United States, and we share their suffering . We love turkish soldiers, we love Erdogan, we love Turkey.”\n\nThe hackers also posted screenshots of Bolling's direct messages.\n\nVan Susteren tweeted early Wednesday that the incident might be the optimal time to talk about her book, “Everything You Needed to Know About Social Media (Without Having to Call a Kid),” noting “Sony hacked etc...DNC....etc. no one is protected even w/ all best efforts.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}, {"topic_link": "https://www.scmagazine.com/social-media/topic/47245/", "topic_name": "Social Media"}]}, {"news_name": "In a pair of contradictory tweets, Trump blasts, praises FISA", "news_link": "https://www.scmagazine.com/in-a-pair-of-contradictory-tweets-trump-blasts-praises-fisa/article/736429/", "title": "In a pair of contradictory tweets, Trump blasts, praises FISA", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 11, 2018", "body": "Just hours before the House was set to vote on reauthorization of the Foreign Intelligence Surveillance Act (FISA), and the morning after a White House statement had voiced support for the legislation, President Trump took to Twitter to assail the act, which he said may have been used during the Obama administration to surveil members of the Trump campaign.\n\n“House votes on controversial FISA ACT today,” he tweeted. “This is the act that may have been used, with the help of the discredited and phony Dossier, to so badly surveil and abuse the Trump Campaign by the previous administration and others?”\n\nAs former FBI Director James Comey's investigation into Russian interference in the U.S. presidential election heated up last spring, Trump lashed out, accusing former President Obama of illegally “wiretapping” Trump Tower. \n\nThe president's claims were unsubstantiated and prompted members of the intelligence communities in the U.S. and abroad to issue denials.\n\nIn an uncharacteristic public statement last spring, the Government Communications Headquarters (GCHQ), the British equivalent of the NSA, responded to claims by former White House Press Secretary Sean Spicer that it was involved in surveillance of Trump at Obama's behest.\n\nDuring the course of the Russian collusion probe, however, investigators seemed to acknowledge that some people in the president's orbit had been under surveillance for their suspicious dealings with Russia and other countries.\n\nThe Senate Judiciary Committee in the spring asked the Justice Department and the FBI to hand over any FISA-related material related to the investigation of Russian meddling in the U.S. presidential election – and the probe of potential collusion between the Trump campaign and Russian operatives, including Foreign Intelligence Surveillance Court (FISC) applications and responses.\n\nThe hotly debated Section 702 authorizations of the act were set to expire at the end of 2017, but with Congress divided on how much authority to give government and rights groups challenging proposed legislation, the deadline was extended to give Congress time to hammer out an agreement. Opponents have slapped at the current House bill for allowing warrantless surveillance.\n\n“We strongly oppose this legislation,” Neema Singh Guliani, ACLU legislative counsel, said in a statement earlier in the week. “This bill is not reform by any stretch of the imagination. It leaves the door wide open to abusive surveillance practices that allow the government to search the intimate emails, text messages, and other sensitive data of Americans without a warrant of any kind.” \n\nCongress also will vote Thursday on a bipartisan amendment intended to set parameters on spying. A White House statement released late Wednesday spurned the amendment and called for Congress to \"reject this amendment and preserve the useful role of FISA's Section 702 authority plays in protecting American lives,\" according to White House Press Secretary Sarah Huckabee Sanders.\n\n\"This amendment would re-establish the walls between intelligence and law enforcement that our country knocked down following the attacks of 9/11 in order to increase information sharing and improve our national security,\" said Sanders. \n\nTrump tweeted his seeming reservations about FISA after “Fox & Friends” ran a piece on the upcoming House vote that had shown contributor Judge Andrew Napolitano, saying, \"Mr. President, this is not the way to go. Spying is valid to find the foreign agents among us. But it's got to be based on suspicion and not an area code.\" \n\nShortly after his first tweet, Trump followed up with a clarification. \"With that being said, I have personally directed the fix to the unmasking process since taking office and today's vote is about foreign surveillance of foreign bad guys on foreign land,” he tweeted. “We need it! Get smart!”\n\nThe president's contradictory tweets and divergence from the White House's messaging prompted Rep. Adam Schiff, D-Calif., to take to the House floor to “reluctantly” push back the vote until lawmakers could further divine what the president's posture is.\n\n\"In light of the significant concerns that have been raised by members of our caucus, and in light of the irresponsible and inherently contradictory messages coming out of the White House today,” Schiff said, “I would recommend that we withdraw consideration of the bill today, to give us more time to address the privacy questions that have been raised, as well as to get a clear statement from the administration about their position on the bill.\"\n\nBut later in the morning, the House went on to pass the bill. “As a former federal prosecutor who used foreign intelligence surveillance to bring terrorists to justice, I'm grateful we were able to renew this critical law enforcement tool for six more years,\" Rep. John Ratcliffe, R-Texas, said in a statement. \"While this bill contains some changes I did not feel were necessary, I recognize that it's the culmination of an extensive and transparent legislative process that included input from legislators all across the political spectrum and from the White House and Executive Branch alike.\"\n\nSaying that \"the tools we just reauthorized are critical for the safety of our homeland,\" Ratcliffe claimed \"they have successfully stopped terrorists like Hajji Iman and thwarted planned attacks like the 2009 attempted New York City Subway bombing.\"\n\nHe urged the Senate \"not to play politics with national security and to send this bill to the president's desk as quickly as possible.”\n\nThe ACLU said the bill expands the administration's surveillance authority. “The House voted today to give President Trump and his administration more spying powers,\" said Singh Giuliani. \"The government will use this bill to continue warrantless intrusions into Americans' private emails, text messages, and other communications.\"\n\nShe noted that “no president should have this power,\" particularly the Trump administration, which \"has labeled individuals as threats based merely on their religion, nationality, or viewpoints.\" \n\nContending that “mass government surveillance makes all of us less safe” and a reauthorization of “ineffective and illegal spying powers,” Evan Greer, campaign director of Fight for the Future, said the act is “a nightmare for all those who believe in basic liberty, due process, and freedom of expression.”\n\nSingh Giuliani called on the Senate to \"reject this bill and rein in government surveillance powers to bring Section 702 in line with the Constitution.”\n\nAnd Greer echoed the sentiment, calling for \"the Senate to listen to security experts, civil liberties advocates, and the majority of voters from both parties, and vote to stop these illegal and dangerous government spying programs.”\n\nBut the Senate took its first steps Thursday toward passing the bill and will likely vote on it next week.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Mole on Trump team fed FBI info, Steele worried about political influence on FBI, Fusion GPS head says", "news_link": "https://www.scmagazine.com/mole-on-trump-team-fed-fbi-info-steele-worried-about-political-influence-on-fbi-fusion-gps-head-says/article/735967/", "title": "Mole on Trump team fed FBI info, Steele worried about political influence on FBI, Fusion GPS head says", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 09, 2018", "body": "A “walk-in” whistleblower inside the Trump campaign fed information to the FBI, according testimony before the Senate Judiciary Committee by Glenn Simpson, CEO of Fusion GPS, the firm that hired former British spy Christopher Steele, author of the controversial Trump dossier, to conduct oppositional research on the then presidential candidate. \n\nSteele, allegedly concerned that his research was uncovering unsavory and illegal activities involving foreign interests, reported his findings to the FBI. \n\n“My understanding was that they believed Chris at this point — that they believed Chris might be credible because they had other intelligence that indicated the same thing and one of those pieces of intelligence was a human source from inside the Trump organization,” Simpson told the committee, according to a transcript of his testimony released by Sen. Dianne Feinstein, who defied GOP lawmakers to make the testimony public. \n\nThe dossier, containing sometimes salacious allegations about Trump, became a flashpoint for his critics who said the findings pointed to inappropriate contact between members of the campaign and Russian operatives and his supporters who have questioned the veracity of the file because it was funded as oppositional research by Hillary Clinton's campaign. \n\nMore recently Steele has come under fire for his role in creating the dossier with Judiciary Committee Chairman Sen. Chuck Grassley, R-Iowa, and committee member Sen. Lindsey Graham, R-S.C., sending the Justice Department a recommendation to open a criminal investigation of Steele and any potential bias against the president. \n\n“I want a special counsel to look not only at how Mr. Steele conducted himself, what the FBI did with the dossier,” Graham said Sunday on NBC's Meet the Press. He also questioned “what involvement” the Justice Department's Bruce Ohr might have had in the dossier, noting that Ohr's wife worked at Fusion GPS.  \n\nFeinstein expressed frustration with the recommendation from Graham and Grassley last Friday. “I wasn't consulted about this referral nor were any of my Democratic colleagues,” said in a statement. “I think this referral is unfortunate as it's clearly another effort to deflect attention from what should be the committee's top priority: determining whether there was collusion between the Trump campaign and Russia to influence the election and whether there was subsequent obstruction of justice.”\n\nTrump proponents have contended that Steele's dossier had prompted the FBI probe into potential collusion between the Trump and Russia, implying that he had worked with the FBI to smear derail Trump's campaign.\n\nBut right before the New Year, the New York Times reported that drunken boasting to an Australian diplomat in the U.K. by George Papadopoulos, a volunteer tapped by the Trump campaign as a foreign policy advisor, likely prompted the investigation into the campaign's potential collusion with Russian operatives.\n\nDuring a night at London's Kensington Wine Rooms in May 2016, Papadopoulos, who has pleaded guilty to lying to the FBI in the investigation being run by special counsel Robert S. Mueller, revealed to Australian Alexander Downer that Russia had damaging information on Trump opponent Hillary Clinton.\n\nAfter WikiLeaks began leaking emails pilfered from the Democratic National Committee (DNC) and others affiliated with Clinton, Australia officials reported Papadopoulos's revelations to U.S. intelligence, prompting the FBI to open a probe into Russian meddling into the U.S. presidential election. \n\nAnd Simpson said in his testimony that Steele “severed his relationship with the FBI” after becoming concerned “that the FBI was being manipulated for political ends by the Trump people and that we didn't really understand what was going on.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/apt/topic/47229/", "topic_name": "APT"}, {"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "FTC fines VTech toy firm over data breach", "news_link": "https://www.scmagazine.com/vtech-fined-650000-as-part-of-a-settlement-for-violating-a-us-childrens-privacy-law/article/735932/", "title": "FTC fines VTech toy firm over data breach", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "January 09, 2018", "body": "The Federal Trade Commission (FTC) fined toy firm VTech $650,000 as part of a settlement for violating a U.S. children's privacy laws.\n\nThe FTC alleged the toy company violated (COPPA) Children's Online Privacy Protection Rule by collecting personal information from hundreds of thousands of children without providing direct notice, without obtaining their parent's consent, and failing to take reasonable steps to secure the data it collected.\n\nVTech allegedly collected personal information from parents on its Learning Lodge Navigator online platform and through a now-defunct web-based platform called Planet VTech. Parents were also required to register and provide personal information including their name, email address as well as their children's name, date of birth and gender in order to use VTech's Kid Connect or Planet VTech services.\n\n“As connected toys become increasingly popular, it's more important than ever that companies let parents know how their kids' data is collected and used and that they take reasonable steps to secure that data,” Acting FTC Chairman Maureen K. Ohlhausen said in a Jan. 8 press release. “Unfortunately, VTech fell short in both of these areas.”\n\nVTech is also permanently prohibited from violating COPPA in the future and from misrepresenting its security and privacy practices as part of the proposed settlement and is required to implement a comprehensive data security program\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cyber-attack/topic/49488/", "topic_name": "Cyber Attack"}, {"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/data-breach/topic/47235/", "topic_name": "Data Breach"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "NYPD requests Google turn over teen's digital history", "news_link": "https://www.scmagazine.com/nypd-requests-google-turn-over-teens-digital-history/article/735596/", "title": "NYPD requests Google turn over teen's digital history", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "January 08, 2018", "body": "The New York City Police Department has subpoenaed Google requesting the entire online history of a Staten Island teenager, according to a New York Post report. \n\nThe Post said the unnamed 17-year-old boy was informed by Google that in December the police had requested the company hand over contacts, e-mails, history and other digital documentation. Google said they only saw a redacted version of the subpoena so they did not know why the information was being requested. The teen's lawyers have requested that a Manhattan Supreme Court suppress the request citing federal law that requires a search warrant or court order.\n\nThe Post said Google refused the request and the teen's lawyer described the NYPD's actions as a broad over reach in his court filing. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "ACLU says House surveillance bill increases likelihood of abuse", "news_link": "https://www.scmagazine.com/aclu-says-house-surveillance-bill-increases-likelihood-of-abuse/article/735389/", "title": "ACLU says House surveillance bill increases likelihood of abuse ", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 08, 2018", "body": "The text of a House bill that would reauthorize Section 702 released Friday immediately drew opposition from the American Civil Liberties Union (ACLU).\n\nThe bill would let federal agencies, including the FBI, the broad authority to sift without a warrant through data gather under Section 702 for information about Americans, prior to opening an active investigation.\n\n“We strongly oppose this legislation,” Neema Singh Guliani, ACLU legislative counsel, said in a statement. “This bill is not reform by any stretch of the imagination. It leaves the door wide open to abusive surveillance practices that allow the government to search the intimate emails, text messages, and other sensitive data of Americans without a warrant of any kind.”\n\nThe language of the bill could be construed as expanding illegal government practices like gathering communications not generated by or sent to a surveillance target.\n\nAs a result, Section 702 could “be used as a tool to improperly target minorities, government critics, and marginalized communities,” Singh Giuliani explained.\n\nCalling on Congress to “abandon efforts to pass this legislation and reject the false assertion that this type of illegal surveillance power is needed to protect national security.“ Instead, she said, the government should be required “to get a warrant when searching through Section 702 data looking for information of American citizens and residents.”   \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "CBP directive would allow warrantless search, seizure of electronic devices at border", "news_link": "https://www.scmagazine.com/cbp-directive-would-allow-warrantless-search-seizure-of-electronic-devices-at-border/article/735390/", "title": "CBP directive would allow warrantless search, seizure of electronic devices at border ", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 08, 2018", "body": "The American Civil Liberties Union (ACLU) opposes irective that allows officers to search and seize - albeit with some restrictions - electronic devices at the border. \n\nCalling positive the policy's requirement that “have some level of suspicion before copying and using electronic methods to search a traveler's electronic device,” Neema Singh Guliani, legislative counsel at the ACLU said in a statement that it “still falls far short of what the Constitution requires — a search warrant based on probable cause.” \n\nUnder the directive border officers still could “manually sift through a traveler's photos, emails, documents, and other information stored on a device without individualized suspicion of any kind,” Singh Giuliani said. @Additionally, it fails to make clear that travelers should not be under any obligation to provide passcodes or other assistance to officers seeking to access their private information.”\n\nShe called for Congress to “continue to press CBP to improve its policy.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "India's 1.2 billion citizen national database reportedly breached", "news_link": "https://www.scmagazine.com/access-to-indias-national-citizen-database-reportedly-sold-for-8/article/735276/", "title": "India's 1.2 billion citizen national database reportedly breached", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "January 05, 2018", "body": "India's national ID database containing the information of nearly 1.2 billion people was breached with cybercriminals selling access to the information for $8, though officials deny the extent of the incident.\n\nOn Jan. 3, 2018, The Indian Tribune claimed to have purchased access to the stolen information containing the names, addresses, dates of birth, mobile numbers, all ten fingerprints, and iris scans of the country's citizens. India started collecting the information into a centralized government database called Aadhaar to create a voluntary identity system in 2010.\n\nThe publication was also able to purchase software” that could enable a user to print Aadhaar cards after entering the Aadhaar number of any individual.\n\nLast November UIDAI, the Unique Identification Authority of India, asserted the database is safe and secure and that no leak or breach had occurred. When the Tribune contacted the government agency about the breach, officials expressed shock and admitted it seemed to be a major national security breach before consulting UIDAI technical consultants.\n\nThe Tribune estimates that a racket may have started around six months ago when anonymous groups were created on WhatsApp to target more than 300,000 village-level enterprise (VLE) operators hired by the Ministry of Electronics and Information Technology (ME&IT) under the Common Service Centres Scheme (CSCS) across India. The operators would have had access to the UIDAI data and any compromised operators would have provided a potential entry point for the breach.\n\nMore than 100,000 village-level enterprise operators are suspected to have gained illegal access to UIDAI data to provide “Aadhaar services” to common people for a charge, including the printing of Aadhaar cards, the publication said.\n\nThe database was also vulnerable as anyone can access or become admins of the official Aadhaar database as long as they are invited by someone who is already an admin, according to The Quint.\n\nThe Tribune's report was dismissed as “fake news” by India's Narendra Modi-led Bharatiya Janata Party. UIDAI denied the Tribune report and told BuzzFeed “Aadhaar data including biometric information is fully safe and secure.”\n\nThe incident has since sparked a police probe into the incident. Even if the database wasn't breached, researchers advise against aggregated databases such as Aadhaar as they pose a risk to the privacy of citizens.\n\n\"Regardless of whether the Indian Government is correct and no biometric information was included in the database accessed by The Tribune of India, the opportunity for fraud stemming from this incident is immense,” Netskope Chief Executive Officer Sanjay Beri told SC Media. “Sure, criminals may not be able to create exact duplicates of an individual's Aadhaar ID card, but they still have all the data necessary to conduct highly targeted phishing attacks and other identity fraud.”\n\nEven if hackers only have access to the databases non-biometric information could easily imitate the agency in order to convince unsuspecting citizens to turn over additional data like their banking information, Beri added. Experts agree.\n\n“The UIDAI have suggested that no biometric data was accessed, but even so, the amount of PII that has been accessed provides a healthy pipeline for future cybercriminals,” Lisa Baergen, director at NuData Security told SC Media. “In future, organizations should take more stringent security measures in protecting PII, including passive biometrics and two factor authentication.”\n\nLast year a darknet trader was caught selling the Medicare patient details of any Australian on request by stealing them via an exploiting in a government system.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybersecurity/topic/47223/", "topic_name": "Cybersecurity"}, {"topic_link": "https://www.scmagazine.com/data-breach/topic/47235/", "topic_name": "Data Breach"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Two GOP lawmakers call for Sessions to step down amid leaks", "news_link": "https://www.scmagazine.com/two-gop-lawmakers-call-for-sessions-to-step-down-amid-leaks/article/734943/", "title": "Two GOP lawmakers call for Sessions to step down amid leaks", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 04, 2018", "body": "Two members of the House Freedom Caucus said that unless Attorney General Jeff Sessions can stem FBI and Justice Department leaks, he should step down. \n\n\"If Sessions can't address this issue immediately, then we have one final question needing an answer: When is it time for a new attorney general?\" Rep. Mark Meadows, R-N.C., and Rep. Jim Jordan, R-Ohio, wrote in a Thursday op-ed in The Washington Examiner, citing a story in the New York Times where a handful of anonymous former and current intelligence community members said that trigger for the FBI probe of potential collusion between the Trump administration and Russia was former campaign aide George Papadopoulos. \n\nNoting that an “alarming number of FBI agents and DOJ officials” share information with reporters, the lawmakers wrote, “It is time for Sessions to start managing in a spirit of transparency to bring all of this improper behavior to light and stop further violations.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "White House disbands election integrity commission", "news_link": "https://www.scmagazine.com/white-house-disbands-election-integrity-commission/article/734752/", "title": "White House disbands election integrity commission ", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "January 04, 2018", "body": "“We know there are very serious problems in our democracy that voters want addressed, such as foreign interference and voter suppression efforts, but this commission never planned on tackling any of those,” Danielle Lang, CAmpsigb Legal Center senior counsel, said in a statement. “Instead, the commission was nothing more than a partisan tool to implement an agenda that would make it harder for Americans to vote. Thus far, DHS has been focused on real election integrity issues related to hacking and security of our electoral infrastructure, as it should be. CLC will be watching closely to see if President Trump and former Kansas Secretary of State Kobach, vice-chair of the commission, will try to derail DHS's work in an effort to continue to push a partisan agenda that makes it more difficult for Americans to participate in the political process.”\n\nWith the exception of Arkansas, the states originally balked at proving the data requested by the commission, concerned that voter privacy would be compromised and that the information would be used to suppress votes. \n\nThe commission put its efforts on hold after the Electronic Privacy Information Center (EPIC), filed for a restraining order in a federal court in the District of Columbia, seeking to bar the commission from gathering data, prompting the commission to temporarily halt its efforts. But a judge denied the request saying EPIC hasn't proven harm. The American Civil Liberties Union (ACLU) has also filed a lawsuit against the commission, questioning the transparency of the commission chaired by Vice President Mike Pence. \n\nCo-Chairman Kris Kobach, the controversial Kansas Secretary of State, promised to preserve voter privacy and ensure the security of the data, allaying concerns of some lawmakers like Colorado Secretary of State Wayne Williams who called it \"a significant improvement\" that would hopefully lure back voters in the state who had unregistered in protest.\n\n“It's my hope that citizens who withdrew their registration will re-register, particularly once they realize that no confidential information will be provided and that the parties and presidential candidates already have the same publicly available information from the 2016 election cycle,” Williams said at the time. \n\nDemocrats on the commission, which only met twice during its short, turbulent tenure, contended they were being left out and the group was besieged by lawsuits. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Privacy of location tracking device owners threatened by ‘Trackmageddon’ flaws", "news_link": "https://www.scmagazine.com/privacy-of-location-tracking-device-owners-threatened-by-trackmageddon-flaws/article/734602/", "title": "Privacy of location tracking device owners threatened by 'Trackmageddon' flaws", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "January 03, 2018", "body": "A slew of online services used to manage GPS- and GSM-based location tracking devices have been found vulnerable to flaws that could allow attackers to hijack these devices and reveal their owners' past and current locations.\n\nIn an online post on Tuesday, security researchers Vangelis Stykas and Michael Gruhn detailed the vulnerabilities, collectively named Trackmageddon, in 103 online services that in totality manage millions of devices. By and large, these various services are reportedly using vulnerable tracking location software developed and licensed by ThinkRace, an Indian GPS tracker manufacturer, which also operates five of the affected services.\n\nAs of Jan. 2, four of the impacted websites have been confirmed fixed – https://www.one2trackgps.com (aka One2Track), http://kiddo-track.com, http://www.amber360.com, and http://tr.3g-elec.com (in this case, the subdomain was removed). Another 15 no longer appear vulnerable to the researchers' proof-of-concept exploit code, although it cannot be conclusively affirmed that they have been permanently patched.\n\nThe report states that ThinkRace also agreed to repair their own five affected websites by Jan. 2; however, the researchers claim the fixes so far are “incomplete.” SC Media has reached out to ThinkRace for comment and will update the story upon receiving a response.\n\nStykas and Gruhn's work updates and expands upon previous research conducted by fellow security researcher Lachlan Temple, aka @skoooch, who found similar or possibly identical issues back in 2015. According to the latest report as well as two accompanying technical advisories, the vulnerabilities, discovered in November, can be divided into two subsets.\n\nOne subset is a series of authorization bypasses in gpsui.net, a website that facilitates the master server for at least 615,000 GSM and GPS location tracking devices. When exploited, this flaw enables attackers to escalate their privileges until they can force disclosure of all location tracking information, as well as send commands to and take control of all connected devices.\n\nThe other subset of vulnerabilities consists of various information disclosures as well as exposed APIs in multiple websites that act as the web control panel server for roughly 6.3 million devices, comprised of an estimated 367 different product models. The report states that these coding errors can allow unauthenticated actors to “take full control of the exposed API features to control and manage the registered GPS tracking devices,” as well as “extract the locations as well as associated phone numbers (if set) and device model type[s] from the user database via the exposed API on each affected website.”\n\nIn some cases, attackers may also be able to access images and audio recordings uploaded by devices, as well as on-board diagnostics features on devices used by vehicles.\n\nStykas and Gruhn say they tried to give notified vendors sufficient time to fix the vulnerabilities before public disclosure, but also felt the need to come forward so that device owners could start to protect themselves, especially against the threat of having their live locations identified by malicious actors.\n\nThe researchers recommend that consumers stop using any location-tracking device that relies on an unpatched service, and remove as much data as possible from these vulnerable websites. Users are also advised to change their passwords for their device's online service, even if the site has been adequately patched.\n\nMark James, security specialist at ESET, told SC Media UK that data such as GPS location could enable bad actors to tailor an attack, both digital or physical, with optimum effectiveness. “With this type of information, it shows a very clear footprint of your every move – something that, if exploited, could be the difference between a failed or successful attack,” he said.\n\n“An attacker with access to the data could use this information to determine your whereabouts and tailor a specific attack either with you, or without you present, depending on the attack vector.”\n\nIn emailed comments, Lamar Bailey, director of security research and development at Tripwire, said that this report demonstrates how many small IoT device manufacturers and services providers “are very small and do not have adequate security practices, training, or staff to setup secure product and services, or they are more interested in getting products to market instead of spending the time and money to make sure the products are secure. Think of them like a new bank that just popped up and they are giving 10 percent interest on savings accounts to gain customers, but the bank branches are built like tents with no vault or security guards.”\n\nMoreover, added Bailey, many of these companies have no establish means for researchers to easily report security concerns or disclose vulnerabilities.\n\n\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/iot/topic/47241/", "topic_name": "IoT"}, {"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/patch/topic/47236/", "topic_name": "Patch"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/vulnerabilities/topic/47222/", "topic_name": "Vulnerabilities"}]}, {"news_name": "State Dept. releases Abedin emails found on Weiner laptop", "news_link": "https://www.scmagazine.com/state-dept-releases-abedin-emails-found-on-weiner-laptop/article/733757/", "title": "State Dept. releases Abedin emails found on Weiner laptop", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "December 30, 2017", "body": "But Comey defended his decision, saying that when faced with what he saw as two choices – speak or conceal – speaking out was the least damaging. “Lordy that would be really bad,” Comey recalled thinking when considering alerting Congress so close to an election that additional emails had been found on Weiner's computer. But to conceal renewed interest in Clinton's email, he said, would have been “catastrophic” to the bureau.\n\n\"It was a hard choice, I still believe in retrospect the right choice,\" Comey said.\n\nSome of the emails released by the State Department were heavily redacted, according to CNN.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/email-security/topic/47206/", "topic_name": "Email Security"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Letter submitted in lawsuit alleges Uber hacked competitors' networks", "news_link": "https://www.scmagazine.com/letter-submitted-in-lawsuit-alleges-uber-hacked-competitors-networks/article/719374/", "title": "Letter submitted in lawsuit alleges Uber hacked competitors' networks", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "December 18, 2017", "body": "A letter written on behalf of a former Uber employee contains allegations that the transportation company illegally hacked and surveilled its competitors.\n\nThe letter was reportedly submitted by the Department of Justice to a judge presiding over a legal battle between Uber and Waymo, an autonomous vehicle company owned by Alphabet (Google's parent company), which claims Uber conspired to steal and use its self-driving technology trade secrets. The letter, which prompted Judge William Alsup to delay the case, was subsequently made public last Friday in a court filing, although some information has been redacted.\n\nThe letter was written by an attorney on behalf of a Richard Jacobs, Uber's manager of global intelligence from March 2016 through February 2017, who had sued the company for unlawful termination. The document alleges that Jacobs “was aware of many instances where computer hacking tactics were deployed to obtain trade secrets and to infiltrate closed social media groups.”\n\nJacobs alleges in the letter that Uber accessed an unnamed competitor's protected computer database containing driver employee information, for the purpose of luring these drivers to Uber instead. Such an act violates the U.S. Computer Fraud and Abuse Act, the document asserts. In a second example, the letter alleges that Uber used SIM cards to hack into an unnamed company “to learn how [redacted] system operated, steal ideas, exploit any identifiable weaknesses and identify drivers in order to recruit them to Uber.”\n\nAdditionally, the letter contains allegations of unlawful phone surveillance, noting that the company's Strategic Service Group had gained the technical capability through a business operative to collect mobile phone metadata on opposition figures, politicians and government regulators. This was accomplished, the letter states, “either directly through signal-intercept equipment, hacked mobile devices, or through the mobile network itself.”\n\nIn a pre-trial hearing for the Waymo case, Jacobs reportedly backpedaled on the letter's claims that Uber stole trade secrets from Waymo, testifying that his attorney was mistaken in that specific regard.\n\nAccording to various  reports, Uber said in a statement: “While we haven't substantiated all the claims in this letter – and, importantly, any related to Waymo – our new leadership has made clear that going forward we will compete honestly and fairly, on the strength of our ideas and technology.”\n\nUber, which has been plagued by a series of business scandals, including a concealed data breach impacting 57 million customers and drivers, removed CEO Travis Kalanick earlier this year and replaced him with Dara Khosrowshahi.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/legal-action/topic/47242/", "topic_name": "Legal Action"}, {"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "FCC votes to repeal net neutrality, could increase cybersecurity threats", "news_link": "https://www.scmagazine.com/fcc-votes-to-repeal-net-neutrality-could-increase-cybersecurity-threats/article/718769/", "title": "FCC votes to repeal net neutrality, could increase cybersecurity threats", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "December 14, 2017", "body": "Despite calls for Federal Communications Commission (FCC) Chairman Ajit Pai to temporarily suspend the vote on net neutrality until an investigation into fake comments on the public docket could be completed, the commission decided today to repeal the regulations put in place under the Obama administration, prompting criticism that the move would not only choke freedom but would compromise security and privacy.\n\n“The removal of net neutrality is likely to decrease transparency on the Internet, and less transparency will increase cybersecurity threats,” Tim Erlin, vice president, product management and strategy at Tripwire, noting that ISPs will implement different behaviors to manage, filter and alter content, “we're going to develop towards a bunch of different internets,” rather than a single Internet. “It may not be at the forefront of the net neutrality debate, but these changes will ultimately increase the attack surface available to criminals. If ISPs are no longer required to pass traffic unaltered, they can simply stop end-to-end encryption entirely.”\n\nErlin explained that without net neutrality security could easily become a premium service. “Why wouldn't an ISP charge businesses and individuals more for supporting encrypted traffic?” he said. “It may not be the first impact, but losing net neutrality opens up the possibility of ISPs mining previously encrypted traffic for valuable data.”\n\nThe commission, which said in a statement that it “is returning to the traditional light-touch framework that was in place until 2015,” noted that it also had “adopted robust transparency requirements that will empower consumers as well as facilitate effective government oversight of broadband providers' conduct.”  The Federal Trade Commission (FTC) will once again have the jurisdiction “to act when broadband providers engage in anticompetitive, unfair, or deceptive acts or practices,” the FCC said.     \n\nBut critics viewed the move as political and expressed skepticism that promises of transparency and oversight can be met. Calling the FCC's move “a giant step backwards for the greater internet community,” Michael Patterson, CEO of Plixer, said it was “a prime example of lobbyists having too much power in Congress and U.S. representatives not understanding the ramifications that these decisions can lead to.”\n\nPatterson said most consumers only have one viable option for internet access – their broadband provider. “Creating choice and competition, as the FCC has said this will do, requires there to be consumer options,” he said. “Service providers now have the ability to take an a la carte approach to service delivery, which will result in higher consumer cost.”\n\nNoting that “since the end of the dial-up era, the FCC has enforced network neutrality principles and helped create the internet as we know it,” Jay Stanley, American Civil Liberties Union (ACLU) senior policy analyst, called the FCC action “misguided” and said it “represents a radical departure that risks erosion of the biggest free speech platform the world has ever known.”\n\nBut Comcast Senior Executive Vice President and Chief Diversity Officer David L. Cohen rejected the notion that net neutrality was coming to an end with the commission's vote. Commending Pai and the other two Republican commissioners for \"returning to a regulatory environment that allowed the Internet to thrive for decades by eliminating burdensome Title II regulations and opening the door for increased investment and digital innovation,\" Cohen said, \"today's action does not mark the ‘end of the Internet as we know it;' rather it heralds in a new era of light regulation\" of benefit to consumers.\n\nIn the wake of that discovery, 28 senators in a letter called on Pai to delay its vote on repealing net neutrality and investigate several unusual issues centered on the net neutrality docket's public comment record. And 18 state attorneys general led by New York AG Eric Schneiderman, also urged the FCC to hold off on its vote. But Pai pressed on, drawing the ire of critics.\n\n“Why did @FCC and @AjitPaiFCC rush this vote on #NetNeutrality despite known fraud & criminal activity in the public process?” tweeted Rep. Ted Lieu, D-Calif. “I look forward to Chairman Pai one day testifying under oath to Congress as to why he ignored 18 Attorneys General. Did Chairman Pai aid and abet fraud?”\n\nSchneiderman has pledged to lodge a multistate lawsuit against the agency and the ACLU and Fight for Freedom have all promised to challenge the decision. “The fight for network neutrality is not over by any means,” said Stanley. “The ACLU and our allies will be fighting back in every possible arena to restore these crucial protections.”\n\nFight for the Future issued a statement saying that a number of organizations behind BattleForTheNet.com and Team Internet would be launching an internet-wide campaign to get Congress to employ a Resolution of Disapproval under the Congressional Review Act to overturn the decision. \n\n“A CRA only requires a simple majority in the Senate and House, increasingly within reach given the unprecedented backlash, and Republican lawmakers already publicly criticizing the plan,” the statement said. “Now every member of Congress will have to go on the record and decide whether to stand up for the free and open Internet or face the political consequences of awakening its wrath in an election year.”  \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "EC amicus brief in Microsoft Irish server case to school SCOTUS on data protection laws", "news_link": "https://www.scmagazine.com/ec-amicus-brief-in-microsoft-irish-server-case-to-school-scotus-on-data-protection-laws/article/713067/", "title": "EC amicus brief in Microsoft Irish server case to school SCOTUS on data protection laws", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "December 08, 2017", "body": "The European Commission has said it will file an amicus brief with the U.S. Supreme Court in the U.S. vs. Microsoft case on behalf of the European Union (EU).\n\n“Given that the transfer of personal data by Microsoft from the EU to the U.S. would fall under the EU data protection rules, the Commission considered it to be in the interest of the EU to make sure that EU data protection rules on international transfers are correctly understood and taken into account by the U.S. Supreme Court,” the commission said in a statement, noting that “the amicus brief will not be in support of either one of the parties.” \n\nThe U.S. Supreme Court in October decided to heed a Justice Department request and hear arguments about whether the federal government can use U.S. warrants to reach emails stored in servers overseas nearly a year after the Second Circuit Court of Appeals struck down a similar request.\n\nDuring an investigation of a drug case, the government in December 2013 had pressed Microsoft to turn over emails stored in the Irish server. Microsoft refused, claiming the government had no power to ask for data stored in another country and well outside of its jurisdiction. In April 2014, a federal judge ordered Microsoft to cough up those records. Microsoft again refused and was found in contempt of court. \n\nA three-judge panel from the Second Circuit in July 2016 ruled that warrants from the U.S. government issued under the Stored Communications Act (SCA) couldn't be used to force Microsoft to hand over emails stored in an Irish server. The government then petitioned the court for a rehearing before the full panel of judges, but a subsequent January 2017 split vote, 4-4, slapped down the government's request for a rehearing, meaning that the earlier ruling in Microsoft's favor would stand.\n\nBut the high court's decision to review the case means the justices “will now have to decide whether a warrant issued by a U.S. court can compel a communications provider to produce its users' content no matter where it's stored in the world,” Greg Nojeim, director of the Center for Democracy & Technology's Freedom, Security & Technology Project, said in a release at the time.. “This is something that Congress should be addressing, rather than the Court.” \n\nIn a brief filed with the Supreme Court this week, the Justice Department argued that Microsoft's compliance could be done “by undertaking acts entirely within the United States” and rebuffed the notion that an impetus behind Microsoft's resistance is that it “would be subject to liability “ under Irish or EU laws for disclosing stateside communications stored in the Irish server, noting that Microsoft had never made that claim when refusing to heed the order.\n\n“If an actual conflict of laws were to arise, our judicial system is equipped to handle that scenario,” the Justice Department brief said. “The government could exercise discretion to pursue alternate channels, where available.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Firefox tests in-browser breached site notifications", "news_link": "https://www.scmagazine.com/firefox-browser-tests-notifications-to-alert-users-when-visiting-breached-sites/article/710711/", "title": "Firefox tests in-browser breached site notifications", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "November 30, 2017", "body": "Firefox is testing out a warning system that will notify users when they visit breached sites and offer the option to be notified if a site they previously visited becomes breached in the future.\n\n The “Breach Alerts” will not prevent a user from visiting a site but will give them some sort of idea that the site's security features are less than optimal using data provided by Have I Been Pwned?.\n\n“Firefox is just looking at which sites have been breached and we're discussing other ways of using the data in the future,” Have I Been Pwned founder and independent researcher Troy Hunt told Engadget. “They've got a broad reach and surfacing this info via Firefox is a great way to get more exposure around data breaches.”\n\nNihanth Subramanya, a developer with Mozilla, wrote on his GitHub repository that the extension is going to be used as a vehicle for prototyping basic UI and interaction flow for upcoming Firefox Features. The extension also features an input field which allows users to subscribe their email addresses in order to receive alerts if a site they previously visited is affected in future breaches.\n\nSubramanya admitted the future notifications feature may raise some privacy concerns as it requires users to submit their emails to receive notifications. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybersecurity/topic/47223/", "topic_name": "Cybersecurity"}, {"topic_link": "https://www.scmagazine.com/data-breach/topic/47235/", "topic_name": "Data Breach"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Study: 90 percent of top cryptocurrency apps carry security and privacy risks", "news_link": "https://www.scmagazine.com/study-90-percent-of-top-cryptocurrency-apps-carry-security-and-privacy-risks/article/710383/", "title": "Study: 90 percent of top cryptocurrency apps carry security and privacy risks", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "November 29, 2017", "body": "A study of 90 cryptocurrency mobile applications available on Google Play found that 90 percent of them contain security vulnerabilities or privacy risks.\n\nWeb security company High-Tech Bridge conducted the research, using dynamic, static, and interactive testing to search mobile apps for weaknesses, including the top ten mobile flaws listed by the Open Web Application Security Project (OWASP).\n\n“We took the most popular cryptocurrency mobile applications from Google Play from the ‘Finance' category and tested them for security flaws and design weaknesses that can endanger the user, his or her data stored on the device or send/received via the network, or the mobile device itself,” High-Tech Bridge reported in a Nov. 29 blog post.\n\nThe company divided the apps into three groups of 30: the most popular apps with a maximum of 100,000 installations, the top apps with up to 500,000 installations, and the top apps with more than 500,000 installations.\n\nWhen combined together, 84.6 percent of the apps were determined to contain at least two high-risk vulnerabilities, while 84.3 percent were found with a minimum of three medium-risk bugs.\n\nNearly half of the apps, 47 percent, were deemed vulnerable to man-in-the-middle attacks, while 48 percent were found to contain hardcoded sensitive data such as passwords or API keys. And 46.6 percent were said to feature functionality that can endanger user privacy.\n\nMoreover, researchers observed that 80.3 of the apps lacked any kind of hardening or protection on their back-end APIs or web services, while 19.3 percent have back-ends that can be exploited with the POODLE vulnerability.\n\nMany of the apps have encryption weaknesses as well: 61 percent send data without any encryption over HTTP, while 37 percent were found to have insufficient encryption altogether.\n\nFinally, 100% of the applications don't have any reliable protection against reverse-engineering, the study reveals.\n\nThe three vulnerabilities from the OWASP that were found most frequently across all 90 cryptocurrency apps were improper platform usage, insecure data storage, and insufficient cryptography.\n\n“For many years, cybersecurity companies and independent experts were notifying mobile app developers about the risks of ‘agile' development that usually imply no framework to assure secure design, secure coding and hardening techniques or application security testing,” said Ilia Kolochenko, CEO and founder of High-Tech Bridge. “However, this is just the tip of the iceberg. A mobile app usually contains much less exploitable vulnerabilities than its backend. Weakness in a mobile application may lead to breach of the mobile device or its data, while a vulnerable API on the backend may allow attackers to steal the integrity of users' data.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cryptocurrency/topic/53434/", "topic_name": "Cryptocurrency"}, {"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/vulnerabilities/topic/47222/", "topic_name": "Vulnerabilities"}]}, {"news_name": "Cellphone tracking case in front of SCOTUS could have broad privacy implications", "news_link": "https://www.scmagazine.com/cellphone-tracking-case-in-front-of-scotus-could-have-broad-privacy-implications/article/709711/", "title": "Cellphone tracking case in front of SCOTUS could have broad privacy implications", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "November 27, 2017", "body": "When the Supreme Court takes up Carpenter vs. the United States Wednesday, the likely landmark case will clarify if law enforcement must obtain court-issued warrants to access location data from wireless providers rather than invoke the lower standard for access imposed by the 30-year-old Stored Communications Act.\n\nIn broader terms, the court's decision could codify Fourth Amendment rights in the digital era.\n\nCiting the third-party doctrine, government authorities believe they don't need a warrant, arguing that people \"have no reasonable expectation of privacy because they [voluntarily] gave the information over” to third-party providers, American Civil Liberties Union (ACLU) Attorney Nathan Freed Wessler, who will argue the case before the court, told reporters last week.\n\nBut in the digital era, where cell towers have proliferated, as has the amount of data collected from the likes of smartphones, Fitbits, Google searches, and opt-in websites like WebMD, “the implications are stunning,” said Wessler.\n\nCarpenter v. United States seeks to challenge what lawyers representing defendant Timothy Carpenter said was government overreach. Phone records – which covered 127 days and exposed 12,898 data location points – helped convict Carpenter, who then appealed to the Sixth Circuit Court of Appeals, which upheld the lower court decision and opined that a warrant was not needed under the Fourth Amendment.\n\nThe high court has grappled with similar questions of how the digital era is reshaping legal protections. \"More fundamentally, it may be necessary to reconsider the premise that an individual has no reasonable expectation of privacy in information voluntarily disclosed to third parties,” Supreme Court Associate Justice Sonia Sotomayor concurred in United States v. Jones, a case in which law enforcement put a GPS tracker on a suspect's vehicle without first obtaining a warrant – an act the court deemed a search under the Fourth Amendment. “This approach is ill-suited to the digital age, in which people reveal a great deal of information about themselves to third parties in the course of carrying out mundane tasks.\"\n\nNoting the rise in the types of electronic surveillance, Carpenter's attorney Harold Gurewitz, called for the Supreme Court to clarify Fourth Amendment protections for all. “The mere fact that we carry cellphones should not mean that our every location is trackable by the government at will,” said Gurewitz.\n\nIndeed, “cell phones have become part of the basic social infrastructure,” vital to public safety, job hunting, scheduling work, accessing information and socializing on the internet, Julia Ticona, postdoctoral scholar at the Data & Society Research Institute, told reporters, voicing concern that low income, more vulnerable people who rely heavily on smartphones for internet access might be more adversely affected by government overreach.\n\n“Searching people's phones without a warrant would go against the Fourth Amendment that protects from unreasonable searches,” said Marty P. Kamden, CMO of NordVPN. “Citizens' right to privacy is being eroded in many different forms, and this could only mean that with the disappearance of privacy, everyone will become more vulnerable to their private information, address and location falling into the wrong hands.”\n\nIt is that kind of privacy protection that the ACLU is seeking from the Court's decision.\n\nNoting that the organization is asking the court to “craft a rule to provide protection in the digital age and the basis to determine other data that should be protected,” Wessler said the ACLU wants clarity that “the third party doctrine isn't an on/off switch. You don't turn off Fourth Amendment rights.”\n\nThe rule we're asking for is quite narrow,” he explained.\n\nThe ACLU also has taken issue with the length of the time period during which authorities accessed Carpenter's data, saying 127 days was too long. In a “normal investigation,” law enforcement interviews witnesses at the scene of a crime and follow up. “Never before have they had the reach that they have here” via technology, said Wessler. “If government wants to draw a bright line, we say 24 hours” is a sufficient time period to access location data related to a crime. “It's important there should be some limits so we can provide guidance to the public,” he said.\n\nNordVPN's Kamden encouraged wireless carriers “to be more proactive in voicing their support for the privacy of their customers,” saying that it seems “ISPs are actively participating in the disappearance of customers' privacy rights.”\n\nTech companies Google, Microsoft, Twitter, Apple and Verizon are among those filing an amicus brief with the court, saying “Fourth Amendment doctrine must adapt to the changing realities of the digital era” and advocating for “consideration of reasonable expectations of privacy in the digital age.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Is Barton victim of revenge porn?", "news_link": "https://www.scmagazine.com/is-barton-victim-of-revenge-porn/article/709479/", "title": "Is Barton victim of revenge porn?", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "November 24, 2017", "body": "“Legally speaking, as far as I'm concerned, Congressman Barton is a victim,” Washington, D.C. lawyer Mark Zaid told the Huffington Post Thursday.\n\nThe photo as well as revealing texts and videos were sent to a woman with whom Barton had a consensual relationship. The woman has since denied publishing the photo but said she'd shown it to others, HuffPo reported. \n\nAction against revenge porn has been gaining momentum on the state and federal levels. Last year, Rep. Jackie Speier, D-Calif., introduced the Intimate Privacy Protection Act, or revenge porn bill, that would make it a crime to knowingly distribute sexually explicit images of someone without their consent.\n\n", "topics": []}, {"news_name": "Uber's delayed breach notification would run afoul of GDPR", "news_link": "https://www.scmagazine.com/ubers-delayed-breach-notification-would-run-afoul-of-gdpr/article/709361/", "title": "Uber's delayed breach notification would run afoul of GDPR ", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "November 22, 2017", "body": "If the Global Data Protection Rules (GDPR) had been in effect during the latest Uber hack, the ride-sharing company would have faced stiffed consequences – or maybe it would have chosen a more prudent, secure route by promptly revealing the attack that compromised the personal data of 57 million customers and drivers, and by taking bold steps to mitigate the damage.\n\nGDPR, which takes effect next May, is “designed specifically to deal with such occurrences. Under [GDPR], Uber would have had to notify the regulator within 72 hours of being aware of the hack (not the year or so in this case). And assuming the regulator found them in breach of the regulations, they would have to pay a fine of four percent of global annual turnover, or 20 million Euros, whichever is higher,” said Dean Armstrong QC, cyber law barrister at Setfords Solicitors. “As Uber hasn't released its figures, we can't speculate as to the potential final cost of the fine, but it is fair to say the regulator would come down hard, and under the regulations it would likely be in the tens of millions.”\n\nBut the company will likely feel the biggest impact on “reputation, which although harder to quantify than a fine could far outstrip any penalty handed to them by a regulator,” said Armstrong. “The U.K. and Europe are adopting stricter rules on personal data protection for precisely this kind of event.\"\n\nAttackers lifted a set of login credentials from a GitHub coding site that Uber software engineers used, then accessed an infrastructure account where computing tasks are handled, only to find a treasure trove of archived driver and rider data.  \n\n“The hack wasn't sophisticated – the digital thieves broke into the accounts of two Uber engineers on Github, where they found the passwords to some online data storage that contained the personal info, according to the report,” said Imperva CTO Terry Ray.\n\n“This appears to be a prime example of good intentions gone bad. Using an online collaboration and coding platform isn't necessarily wrong, and it isn't clear if getting your accounts hacked on these platforms is even uncommon,” said Ray, who flagged as problematic the use of live production data “in an online platform where credentials were accessible in Github. “Sadly, it's all too common that developers are allowed to copy live production data for use in development, testing and QA. This data is almost never monitored or secured, and as we can see here, it is often stored in various locations and is often easily accessed by nefarious actors.”\n\nContending that Uber “played a risky game” by concealing the incident and paying the hackers $100,000 to delete the purloined data, which will likely embolden bad actors to steal personal information from other organizations, Armstrong said GDPR's eminent arrival pointed to “a huge shift in thinking towards this issue.” \n\nNow Uber is left “to navigate a labyrinth of financial and state breach notification laws given a user base spanning the globe,” particularly GDPR, said Mark Sangster, vice president and industry security strategist at eSentire.\n\nSitting on the breach for a year could cause untold damage for the company, its employees and customers. “While comedians and senators are finding out that they can't keep sexual harassment under wraps, companies are learning that they can't bury the news when they get hacked,” said Jeff Williams, CTO and cofounder of Contrast Security. “In this case, Uber was legally required to disclose this breach, and I'm sure there will be repercussions.” \n\nWilliams called the breach likely “the tip of the iceberg.” While some incidents “don't legally require disclosure,” they “would outrage consumers if they knew,” he said. “And most organizations are sitting on mountains of unfixed vulnerabilities that don't require disclosure. Another outrage.”  \n\nSangster finds Uber's response baffling, after a series of mega-breaches that rocked organizations should have been wake-up calls. “It's fascinating that even in light of the mega-breaches of 2016 and 2017, companies consider non or delayed breach disclosure as an option,” he said. “The number of records compromised in the Uber hack far exceeds the entire population of Canada. We're not talking small beans, here.”\n\nMaintaining that “companies today have no excuse when it comes to cybersecurity controls,” since they have an abundance of tools and guidelines to choose from, Sangster said, “in Uber's case, you have a company already enduring a PR firestorm. Mix in a significant one-year-old, non-disclosed breach, and that storm suddenly becomes a hurricane.”\n\nSangster fully expects that the Uber breach “will set new precedents when it comes to regulatory compliance and disclosure mandates.”\n\nIndeed, after the GDPR takes effect in May, “‘doing an Uber' will be unacceptabl,e so organizations need to be working overtime now to get their technology, people and processes ready for compliance,” said Simon Townsend, chief technologist, EMEA, for Ivanti and an expert in GDPR best practices.\n\n\n\nThe decisions of the ride-sharing company to delay notification and pay hackers not only stands to sully Uber, but security organizations on whole. “While I suspect most will rest the blame squarely on Uber as a corporation and its well-known lack of leadership, it's the choices made by the Chief Security Officer [Joe Sullivan] and one of his deputies that are the most shocking part of this data breach,” said AsTech Chief Security Strategist Nathan Wenzler, who said that legitimate security professionals know better.\n\n“The community at large is built upon integrity in all matters,” said Wenzler. “When you act as the front line of defense for an organization, it is imperative that your security team operates in the most honest and forthright manner possible.”\n\nMark Orlando, CTO for cyber services at Raytheon, noted that “any time companies suffer a large data breach, they run the risk of making things worse, both for their customers and for the larger community.”\n\nSince “hackers talk to each other,” Uber in its silence “has empowered them for a year, where they could have brought this into the light, raised public awareness of the threat and made some good come of this,” said Orlando. “Instead, the company gave its attackers exactly what they wanted – a lot of money, and a reason to try this again and again.”​\n\nThe morality of paying the hackers might be up for debate, but “the lack of responsible disclosure in reporting the incident to regulators is something every security professional should consider to be an unforgivable crime,” Wenzler said. “We're here to protect people's identities and critical data, and when the worst happens, we must do all we can to mitigate the damage; inform people that their data may be compromised, so they can be more aware and vigilant of misuse; and ultimately, help educate them on what they can do to protect themselves.” \n\nUber must account for its actions, the pros said. “Some of the questions that should be answered include: Why did engineers have access to 57 million records of personally identifiable information? Did they go through an approval workflow to move that data online? Did Uber security have any monitoring in place to alert them when such vast amounts of data were accessed?,” said Ray. “Controls to alert on suspicious data access do exist, but my guess is that they were not used, which is all too typical in today's enterprises.”  \n\n\n\nUnfortunately, Uber is not alone in security foibles and its massive breach underscores the need for all organizations to be accountable and step up their security. “When a company places data in the public cloud, they are ultimately responsible for the security of that data. Reminiscent of when, in the movie The Blues Brothers, John Belushi yelled at Carrie Fisher, ‘It wasn't my fault,' it was in fact very much his fault,” explained Bob Noel, director of strategic relationships and marketing for Plixer. “Companies can no longer brush off responsibility for the loss of personally identifiable information (PII)” and should “begin to require documentation providing best practice security controls are in place” from their third-party cloud providers.  \n\n“Until businesses stop saying that they take security seriously and actually start doing it, we will continue to see the list of breaches grow,” said Wayne Reynolds, vice president of security at Armor, noting the low impact and ease of implementing basic blocking and tackling of security controls. “Threat actors are fully aware that development/engineering environments typically have the weakest security within a business. These malicious actors will continue to target these areas until we response by stepping up the game and start securing them as production assets.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybecrime/topic/50062/", "topic_name": "Cybecrime"}, {"topic_link": "https://www.scmagazine.com/data-breach/topic/47235/", "topic_name": "Data Breach"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Senators introduces USA Liberty Act of 2017", "news_link": "https://www.scmagazine.com/senators-introduces-usa-liberty-act-of-2017/article/708346/", "title": "Senators introduces USA Liberty Act of 2017", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "November 17, 2017", "body": "A bill designed to curb warrantless government surveillance as introduced in the Senate today is a marked improvement over a version that debuted in the House earlier this month, the American Civil Liberties Union (ACLU) said Friday. \n\nThe USA Liberty Act of 2017 (S. 2158), which takes aim at the overreach that rights groups have said the government justified under Section 702 of the Foreign Intelligence Surveillance Act (FISA), was ushered in by Sen. Patrick Leahy, D-Vt., and Sen. Mike Lee, R-Utah.\n\n“This bill is a dramatic improvement over the House version of this legislation. For years, the NSA, CIA, and FBI have engaged in illegal ‘backdoor' searches, deliberately looking for and accessing Americans' private information collected under Section 702 without a warrant,” ACLU Legislative Counsel Neema Singh Guliani said in a statement. “These searches are unconstitutional, inconsistent with Section 702 itself, and open the door to abusive spying focused on government critics, minorities, or even journalists.”\n\nNoting that the proposed legislation “does not address all constitutional concerns with Section 702, it represents an important step forward from the dismal status quo,” she said. “This bill would help to rein in these illegal searches by requiring the government to get a warrant when they deliberately search for and then subsequently seek to view Americans' private communications.”\n\nThe ACLU was similarly supportive of a bill proposed in the House in late-October by Sen. Ron Wyden, D-Ore., and Sen. Rand Paul, R-Ky., that sought to extend Section 702 of the Foreign Intelligence Surveillance Act (FISA) for another four years but with critical reforms aimed at curbing government surveillance.\n\nThat proposed legislation would require government to obtain a warrant to search for communications of people in the United States and alert targets when the information collected under Section 702 is being used against them. It would also require government authorities to report on Section 702 use to set the stage for its use in the future.\n\n“Importantly, it would close the so-called ‘backdoor search loophole' that allows the government to search Section 702 data for information about individuals in the U.S. without a warrant,” Singh Guliani said in a statement then, calling the bill a “significant step forward” in protecting the constitutional rights of Americans. “It would also put a stop to the illegal practice of collecting communications that are not to or from a surveillance target.”\n\nBut a coalition of rights organizations, including the ACLU, told the House Judiciary Committee in mid-October that it would not support its proposed version of the USA Liberty Act.\n\nIn a letter to the committee, the coalition of more than 40 organizations, including the NAACP and the Freedom of the Press Foundation, said the bill needed to be bolstered to address concerns over the backdoor search loophole.\n\n“The bill's most glaring deficiency is that it does not require a warrant to access content in cases where the primary purpose is to return foreign intelligence,” the group wrote, noting that “under this exception, the government would have free rein to search and access the content of religious organizations and civil society groups, Congressional staff, and other innocent Americans without a warrant simply if it asserted that the primary purpose was to gather information related to the policies of a foreign country.”\n\nThe coalition also took issue with the broad language of the bill, which it said “leaves room for the government to conduct queries and access content for law enforcement purposes without a warrant.”\n\nThe committee gave a thumbs up to its version of the bill anyway in early November.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Phishing kits meet $2,100 second hand iPhones on black market, study", "news_link": "https://www.scmagazine.com/cybercrime-meets-physical-crime-on-the-stolen-phone-black-market/article/707392/", "title": "Phishing kits meet $2,100 second hand iPhones on black market, study ", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "November 14, 2017", "body": "As Americans begin to worry more about cybercrime than the conventional kind, researchers warn users to remain cautious of both, as stolen iPhones are so valuable in criminal circles that they can go for as much as $2,100 in some countries. \n\nWhile a Gallup study found more Americans worry about hackers stealing their personal information and identity theft than having their vehicle stolen, new research by Trend Micro suggests Americans may want to reprioritize their fears as cybercriminals have found a new use for swiped iPhones.\n\nHowever, the bad guys are not interested in just obtaining an overpriced smartphone, but instead have in place an elaborate scam that will have the phone's former owner willingly giving up all the information needed to not only unlock the phone, but give the criminals access to their iCloud account.\n\nLast year alone 23,000 phones were stolen from the Miami International Airport and the demand for these devices is staggering with even long out of date stolen iPhones going for as much as $2,100 in Eastern European countries, according to a Nov 14 report. At retail Apple's most expensive phone costs $1,149 for the flagship iPhone X with 256 GB of storage in the U.S. to put the markups in perspective. \n\nCybercriminals are stealing the phones, waiting for victims to activate the Find My iPhone services and then sending a phishing email designed to spoof an Apple notification prompting the victim to log in to their iCloud accounts. The thieves then use this information to log into the victim's account and unlock the stolen device so that it can be reused and resold. \n\nResearchers found that thieves will often contract with third-party phishing services to unlock the devices and that they were using tools including MagicApp, Applekit, and Find My iPhone (FMI.php) framework to automate iCloud unlocks.\n\nMany of the providers also offer additional resale services and rent out servers for sending phishing messages. The phishing kits are actively advertised on social media and include full tutorials on how to use them. \n\nSome of the services offer the attackers email notifications which included the victim's IP, HTTP referral, browser user-agent and other information. Kits were also spotted with anti-crawler and AV scanner capabilities.\n\nTo combat these threats, the researchers said users should always apply best practices when securing their mobile devices, enable two factor authentication on iCloud accounts, and set up or enable the device's internal security features.\n\nUsers should also frequently back up their data to mitigate the impact of a device loss and report device's loss or theft to your carrier to deter fraudsters from reusing it. To combat phishing threats, researchers recommend users beware of unsolicited emails requesting iCloud and Apple ID credentials.\n\nThose purchasing second hands phones should also do their due diligence. \n\n“Do your research: if purchasing a secondhand device, verify with the vendor or carrier that they're not blacklisted,” researchers said in the report. “The Cellular Telecommunications Industry Association (CTIA) created a website that verifies the IMEI to help customers and law enforcement check if an iPhone has been blacklisted or stolen.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybecrime/topic/50062/", "topic_name": "Cybecrime"}, {"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/phishing/topic/47212/", "topic_name": "Phishing"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "FISA court allows NSA surveillance transparency lawsuit to continue", "news_link": "https://www.scmagazine.com/in-historic-decision-fisa-court-allows-nsa-surveillance-transparency-lawsuit-to-continue/article/707204/", "title": "In historic decision, FISA court allows NSA surveillance transparency lawsuit to continue", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "November 14, 2017", "body": "In a historic en banc decision, the U.S. Foreign Intelligence Surveillance Court ruled last week that there is sufficient standing to proceed with a lawsuit that could require the court to publicly disclose the secret justifications behind the NSA's electronic surveillance program that was exposed by Edward Snowden.\n\nNever before have all 11 FISC judges collectively heard a case in an en banc review. The 6-5 ruling reverses a previous FISA court decision by FISC Judge Rosemary Collyer, who had ruled that the ACLU and Yale Law School's Media Freedom and Information Access Clinic lacked the necessary standing to pursue their case in court.\n\nAccording to the majority opinion, Collyer's original ruling prematurely hinged on the merits of the movants' case, rather than their standing. \"As that is not what concerns us today, we hold that Movants have sufficiently alleged the invasion of a legally cognizable interest as necessary to establish an injury-in-fact,\" states the opinion, written by Judge James Boasberg. As to whether the not the movants' case has enough merit to entitle them to relief, that must still be determined.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/legal-action/topic/47242/", "topic_name": "Legal Action"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Legislation adding privacy protections to FISA passes through committee", "news_link": "https://www.scmagazine.com/legislation-adding-privacy-protections-to-fisa-passes-through-committee/article/706619/", "title": "Legislation adding privacy protections to FISA passes through committee", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "November 09, 2017", "body": "The U.S. House Judiciary Committee on Wednesday approved the USA Liberty Act, which reauthorizes Section 702 of the Foreign Intelligence Surveillance Act (FISA), but with new privacy protections.\n\nFISA allows U.S. government agencies to conduct surveillance on the communications of non-U.S. persons located on foreign soil. The bipartisan bill, which passed 27-8, clarifies that U.S. authorities may query “702” surveillance databases for communications content if it is for national security reasons, but need a probable cause-based order from the Foreign Intelligence Surveillance Court to view and disseminate such information for the purpose of finding criminal evidence (with two notable exceptions).\n\nThe proposed legislation also includes new provisions that require intelligence agencies to keep records of and periodically on instances in which a U.S. citizen's communications were incidentally collected during a surveillance operations, as well as instances in which a American citizen was unmasked.\n\nThe bill also increases the penalty for those who leak classified information from up to one year to a maximum of five years, making the act a felony.\n\n“The USA Liberty Act is a carefully drafted, bipartisan bill that protects Americans' lives and their civil liberties,” said House Judiciary Committee Chairman Bob Goodlatte (R-Va.), in an official press release. “This bill…contains more accountability, transparency, and oversight so that the American people have confidence that our cherished liberties continue to be protected as the intelligence community keeps us safe from foreign enemies wishing to harm our nation and citizens.”\n\nIn the same release, House Judiciary Committee Ranking Member John Conyers, Jr. (D-Mich.) added, “For months, we have examined Section 702 and have reached consensus that Section 702 should be reauthorized if it can be brought better in line with values like privacy, transparency, and due process. The USA Liberty Act does just that.”\n\nLast October, a coalition of rights organizations, including American Civil Liberties Union, announced that they would not support the USA Liberty Act.\n\n“Though this bill has positive elements, it must be improved as it moves forward. Disappointingly, the committee failed to adopt improvements that would help close the ‘backdoor search loophole,'” said Neema Singh Guliani, legislative counsel at the ACLU, in reaction to the bill's passage through committee. “The loophole has been used by the government to read and listen to Americans' emails, phone calls, and text messages collected under Section 702 without a warrant. As a result, the bill risks locking in current illegal practices into law without adequate limits to protect Americans' constitutional rights.”\n\n\n“Existing law provides no justification for allowing the government to search for Americans' communications for ‘foreign intelligence' purposes without a warrant. Yet, this is precisely what this bill would allow,” Guliani continued. “We urge Congress to remedy this problem as this bill advances.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/legislation/topic/47221/", "topic_name": "Legislation"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Former Yahoo Chief Executive Mayer testified before Congress, blamed Russia", "news_link": "https://www.scmagazine.com/former-yahoo-chief-executive-mayer-apologized-for-yahoo-breach/article/706464/", "title": "Former Yahoo Chief Executive Mayer testified before Congress, blamed Russia", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "November 09, 2017", "body": "Former Yahoo Chief Executive Marissa Mayer apologized on Wednesday for the two massive data breaches at Yahoo that occurred during her tenure and resulted in 3 billion credentials being stolen, blaming Russian agents for at least one of the breaches.\n\n“Unfortunately, while all our measures helped Yahoo successfully defend against the barrage of attacks by both private and state-sponsored hackers, Russian agents intruded on our systems and stole our users' data,” Mayer said in her testimony before a Senate Commerce, Science and Transportation hearing.\n\nShe went on to cite the 47-count indictment charging four individuals with crimes against Yahoo and its users brought forth by the U.S. Department of Justice and FBI.\n\nIt's important to note that Mayer testified that collaboration between public and private sector is necessary to properly defend U.S. companies from attacks, Jeff Dennis, Managing Partner at law firm Newmeyer & Dillion told SC Media.\n\n\"The biggest takeaway from Ms. Mayer's testimony yesterday was an admission that large companies (such as Yahoo) that tout a robust cybersecurity defense, are still vulnerable to cyber attacks from powerful nation states, such as Russia and/or China,\" Dennis said. \"Ms. Mayer correctly identified the cyber threat as “constantly evolving” and a “global challenge.”  At one point, Ms. Mayer described the evolution of cyber attacks and defense as an “arms race”  that was not a fair fight between nation states and private U.S. companies.\"\n\nEven though the attack appears to have come from a foreign state, Dennis said the testimony still leaves questions concerning how much responsibility Yahoo should have taken or at least if it should have been aware of the threat sooner. Dennis said he also would have liked to have known what kind of cyber insurance Yahoo had in place to handle risks associated with nation states.  \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybecrime/topic/50062/", "topic_name": "Cybecrime"}, {"topic_link": "https://www.scmagazine.com/data-breach/topic/47235/", "topic_name": "Data Breach"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Americans worry about cybercrime more than they worry about car theft", "news_link": "https://www.scmagazine.com/american-worry-about-cybercrime-more-than-conventional-crime-study/article/706341/", "title": "Americans worry about cybercrime more than they worry about car theft", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "November 08, 2017", "body": "American's are worrying more about becoming cybercrime victims far more so than becoming victims of conventional crimes.\n\nA recent Gallop poll study found 67 percent of Americans worry about hackers stealing their personal information and  66 percent worry about identity theft compared to just 38 percent who fear having their vehicle stolen. About 36 percent are agraid being a victim of terrorism.  \n\nThe poll, which conducted between October 5-11 this year, had results that were consistent with those found in during previous studies with the percentage of Americans who worry frequently or occasionally about being a victim of identity theft hovering between 66 and 70 percent since 2009. \n\nResearchers noted that respondents were more likely to report being a victim of a cybercrime than they were being a victim of another crime. \n\n“Since 2009, Americans' anxiety about identity theft has consistently topped their fears about other crimes by at least 19 percentage points,” researchers said. “This year's gap between fear of cybercrime and the next-greatest level of crime worry, having a car broken into, is a wide 28 percentage points.”\n\nResearchers also noted that Americans cybercrime concerns stem from the the fact that many have already been hit with such a crime. About 25 percent of those surveyed reported that they or a household member has had personal information stolen from them within the last 12 months. \n\nThis is almost double the number of people impacted by traditional crime. The study said stolen money or property were the most common conventional crimes to affect U.S. adults, with 12% saying they had been a victim of this activity within the same time period. \n\nThe general fear of cybercrime was pretty even across most age groups, but middle aged Americas were the more likely to experience both identity theft and loss of personal information to hackers than seniors or those who were 30 yeas old or less. \n\nTo make matters worse and help keep anxiety levels high, law enforcement is fighting an uphill battle to stop cybercrime, High-Tech Bridge Chief Information Officer Ilia Kolochenko told SC Media. \n\n“Even in developed countries, law enforcement agencies face paucity of financing, lack of competent personnel, reluctant international investigatory cooperation and skyrocketing number of cybercrime incidents,” Kolochenko said. “Thus, investigation of the overwhelming majority of digital crimes becomes virtually impossible.”\n\nHe added that cryptocurrencies and modern anonymization techniques, can effectively preclude almost any technical investigation by private companies with the necessary resources. Compared to conventional crime, if a car is stolen, one could call 911 and they would likely find, arrest and prosecute the hijacker.\n\n“There are no “silver bullet” recommendations to stay secure for home users,” he said. “However, keeping all your devices and any installed software up2date, usage of strong and unique passwords, installation of free security software from reputable vendors, and a basic cybersecurity awareness class – can definitely help.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cyber-attack/topic/49488/", "topic_name": "Cyber Attack"}, {"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "ONS watching thousands via their mobiles in 3 London boroughs for census", "news_link": "https://www.scmagazine.com/ons-watching-thousands-via-their-mobiles-in-3-london-boroughs-for-census/article/706139/", "title": "ONS watching thousands via their mobiles in 3 London boroughs for census", "author": "Tony  Morbin", "author_link": "https://www.scmagazine.com/tony--morbin/author/3963/", "date": "November 08, 2017", "body": "Statisticians at the Office for National Statistics (ONS) have been tracking the movements of thousands of people, albeit anonymised, in what was described as a ‘successful experiment' with Vodaphone that could eventually replace census questions in England and Wales.\n\nThe information would replace questions about where people live and work, and their daily commute, but the ONS on its website recognises that prior to taking such a move it would need to conduct \"extensive evaluation\" of \"privacy impacts.\"\n\nThe move is part of government plans for the 2021 census to be the last conducted  using the traditional paper-based questionnaire, with alternative sources of information currently being sought.\n\nNow the ONS is asking for feedback to decide whether the new system will be rolled out more widely.\n\nAmong those already expressing concerns is Simon Migliano, head of research at Top10VPN.com who described this government experiment in tracking people's movements using mobile phone data as a glimpse into a not-too-distant future where “tracking devices in everyone's pockets are routinely used to amass detailed data about our behaviour, privacy be damned.”\n\nIn an email to SC Media UK he added, “This creepy and intrusive tracking feels like a cost-cutting exercise combined with an opportunistic data grab. I'm very uncomfortable with the fact that Vodafone customers would have been unaware that they have been tracked in this way.\n\n“If this use of mobile phone data were to be rolled out further, we would certainly call for independent and transparent assessment of any anonymisation methods used to ensure that no personally identifiable information could be extracted from the data.\n\nMigliano concludes: “Even with that in place, there will be many people who are simply not comfortable with this kind of intrusive tracking, for whom there should be some kind of opt-out. What's worrying though is that this appears unlikely, if the current mandatory completion of the census is anything to go by.”\n\nThe experiment  took place in the London boroughs of Lambeth, Southwark and Croydon over a four week period in Spring last year, and did not include under-18s for pay-as-you-go phones, and the results showed a decline in people leaving their home borough to work compared to the 2011 census.\n\n", "topics": []}, {"news_name": "Texas National Guard spent $373,000 on stingray equipment", "news_link": "https://www.scmagazine.com/texas-national-guard-used-stingrays-on-surveillance-planes/article/705830/", "title": "Texas National Guard spent $373,000 on stingray equipment", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "November 07, 2017", "body": "The Texas National Guard last year spent more than $373,000 to install two of its DRT 1301C “portable receiver systems” in two RC-26 surveillance aircraft.  \n\nThe Texas Observer obtained a contract between Digital Receiver Technology Inc., or DRT, the manufacturers of the device, and the Texas National Guard stating the stingrays were for “investigative case analytical support” in counternarcotics operations and were purchased using state drug-asset forfeiture money.\n\nUnlike older stingray devices, the DRT 1301C are capable of capturing all of the content transferred from a user's device, Austin attorney Scott McCollough who serves on the board of the Austin chapter of Electronic Frontier Foundation told the publication.\n\nAt one point the surveillance planes reportedly operated under a front company named Air Cerberus, but have since been converted to military registrations. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/surveillance/topic/50685/", "topic_name": "Surveillance"}]}, {"news_name": "Celebgate 3.0? WWE stars Paige and Jojo nudes leaked", "news_link": "https://www.scmagazine.com/wwe-diva-paiges-private-photos-and-chats-leaked/article/705507/", "title": "Celebgate 3.0? WWE stars Paige and Jojo nudes leaked ", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "November 06, 2017", "body": "WWE diva Paige has once again had her intimate photos leaked just a few weeks after a third man plead guilty for hacking into celebrity accounts. \n\nIt is unclear if the leaks were carried out by the same perpetrators however, in addition to the leaking Paige's photos, the hackers also leaked WhatsApp conversations between her and WWE wrestler Xavier Woods, Hackread reported.\n\nExplicit photos of WWE ring announcer Jojo were also reportedly released by the same hackers that leaked Paige's photos in the most recent event. The group has threatened to leak more images in the coming days which may signal the beginning of the third wave of Celebgate hacks. \n\nLast month, 32-year-old Emilio Herrera of Chicago plead guilty to hacking into 550 Gmail and iCloud accounts, approximately 40 of which belonged to celebrities in order to obtain their nude photos and videos.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/data-breach/topic/47235/", "topic_name": "Data Breach"}, {"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Third-party contractor may have deactivated Trump's Twitter account", "news_link": "https://www.scmagazine.com/third-party-contractor-may-have-deactivated-trumps-twitter-account/article/705389/", "title": "Third-party contractor may have deactivated Trump's Twitter account", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "November 03, 2017", "body": "The person that deactivated President Donald Trump's Twitter account briefly Thursday, originally pegged by the company as human error by an employee, reportedly was instead a third-party contractor.\n\nThe account was down for 11 minutes. Twitter is investigating the incident but two sources told the New York Times the culprit is now believed to be a third party.\n\n“The fact that the person who disabled President Trump's Twitter account may have been a contractor is a powerful example that demonstrates that organizations are on the hook when any third party with access to their data makes a mistake, whether intentional or accidental,” said Fred Kneip, CEO, CyberGRX. “This contractor is likely one of tens of thousands of third parties Twitter interacts with, any one of whom has the ability to do high-profile and lasting damage to the company's brand value and bottom line.”\n\nKneip noted that “while even the most thorough risk assessment can't guarantee that one rogue contractor won't make a bad decision, it can uncover red flags that point to weak security controls, leaving the company vulnerable.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/social-media/topic/47245/", "topic_name": "Social Media"}]}, {"news_name": "Facebook asks users to send nudes to prevent revenge porn", "news_link": "https://www.scmagazine.com/facebook-share-your-nudes-to-prevent-revenge-porn/article/705177/", "title": "Facebook asks users to send nudes to prevent revenge porn", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "November 03, 2017", "body": "Facebook is asking users to submit their nudes in a preemptive strike to combat revenge porn. \n\nThe social media platform is running a pilot program in Australia in conjunction with a small government agency in which users send dirty images of themselves to \"hash it” or create a digital fingerprint of the image. \n\n\"They're not storing the image, they're storing the link and using artificial intelligence and other photo-matching technologies,\" Australian e-Safety Commissioner Julie Inman Grant told ABC Australia. \"So if somebody tried to upload that same image, which would have the same digital footprint or hash value, it will be prevented from being uploaded.\"\n\nThe idea is that the photo will never show up on Facebook if a hacker or disgruntled ex tries to upload the same photo because it has already been matched with the original hash. Grant says her agency considered several ways to carry out this program and that this is the safest way for users to share the digital footprints.  \n\nIt is unclear if the pilot program will be rolled out to all users. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/social-media/topic/47245/", "topic_name": "Social Media"}]}, {"news_name": "Bug in anti-malware defenses mistakenly blocks users' Google Docs files", "news_link": "https://www.scmagazine.com/bug-in-anti-malware-defenses-mistakenly-blocks-users-google-docs-files/article/705173/", "title": "Bug in anti-malware defenses mistakenly blocks users' Google Docs files", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "November 03, 2017", "body": "Google issued a public apology on Thursday after a bug mistakenly caused its defenses against malware, phishing, and spam to block some users' access to Google Docs files on Oct. 31.\n\nMark Risher, director of product management at Google, explained in a Nov. 2 blog post that the bug \"incorrectly flagged some files as violating our terms of service.\"\n\nVarious users complained via social media and the Google Docs help forum that the incident was impacting their productivity.\n\nAcknowledging that the incident \"raised questions\" in the user community, Risher further explained that Tuesday's bug \"caused the Google Docs and Drive services to misinterpret the response from [our] protection systems and erroneously mark some files as TOS violations, thus causing access denials for users of those files. As soon as our teams identified the problem, we removed the bug and worked to restore access to all affected files.\"\n\nRisher asserted that the blocked documents were the result of a purely automated process that compares files against known samples and indicators. \"The process does not involve human intervention,\" he stated.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/web-security/topic/47254/", "topic_name": "Web Security"}]}, {"news_name": "Russia bans non-compliant VPNs", "news_link": "https://www.scmagazine.com/russia-bans-non-compliant-vpns/article/704707/", "title": "Russia bans non-compliant VPNs", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "November 01, 2017", "body": "Russia's ban on virtual private network (VPN) services that do not comply with the country's new set of anti-privacy laws took effect Wednesday just a month after the country pledged to block Facebook if the company refuses to store Russian citizens' data on Russian servers.\n\nThe laws that went into effect October 1 enable faster blocking of all proxies and mirrors of banned websites – all without the sanction of the courts – and forbid search engines from advertising on the sites. \n\nIf the VPNs, all of whom must register with the government, fail to restrict access to blocked sites they will be shut down. \n\n“VPNs are central to online privacy, anonymity, and freedom of speech, so these restrictions represent an attack on digital rights,” ExpressVPN Vice President Harold Li said. “We hope and expect that most major VPN services will not bend to these new restrictions.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Apple's machine learning can spot bra pics", "news_link": "https://www.scmagazine.com/apples-machine-learning-identifiess-bra-pics-saved-to-users-device/article/704183/", "title": "Apple's machine learning can spot bra pics", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "October 31, 2017", "body": "A Twitter user is warning females that Apple's machine learning is capable of categorizing images of women in their intimate apparel that are saved to a device.\n\n“ATTENTION ALL GIRLS ALL GIRLS!!! Go to your photos and type in the ‘Brassiere' why are apple saving these and made it a folder!!?!!?,” a user with the hashtag ellieeewbu said in in an Oct. 30 tweet.\n\nWhile Apple isn't actually putting the images into a folder, its machine learning identifies and displays images meeting the criteria of the search.\n\nThe Photos app can recognize images of women in “bra,” “bras”, “brassiere,” “corset,” and “girdle” however the app doesn't categorizes searches for images containing \"nude\" or \"underwear\" - those searches will display “No Results Found.” Some users noted searches for images of men's briefs or boxers will also come up empty as well.\n\nThe feature was introduced in i0S 10 last year and allows users an easier way to search for specific photos by identifying images within the pictures. All of the images are stored locally on a user's devices.\n\n“So when you search your photos, for instance, all the face recognition and scene and object detection are done completely on your device,” and Apple spokesperson told Telegraph UK. \n\nThe app's ability still left some users uneasy, the report said.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybersecurity/topic/47223/", "topic_name": "Cybersecurity"}, {"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Senate intel committee votes behind closed doors bill to re-up Section 702", "news_link": "https://www.scmagazine.com/senate-intel-committee-votes-behind-closed-doors-bill-to-re-up-section-702/article/703601/", "title": "Senate intel committee votes behind closed doors bill to re-up Section 702", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 27, 2017", "body": "", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Facebook details ad transparency changes", "news_link": "https://www.scmagazine.com/facebook-details-ad-transparency-changes/article/703507/", "title": "Facebook details ad transparency changes", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 27, 2017", "body": "Making good on a recent promise by CEO Mark Zuckerberg and in preface for an appearance before lawmakers next week, Facebook has unveiled changes to its advertising platform to boost transparency and authenticity.\n\n“We're going to make advertising more transparent, and not just for political ads,” Facebook Vice President of Ads Rob Goldman wrote in a blog post, noting that transparency is critical to democracy.\n\nFacebook- along with other online platforms - came under fire after it revealed an internal investigation found that a Russian \"troll farm\" bought ads from the social media giant and apparently planted them, some in targeted markets, \"to focus on amplifying divisive social and political messages across the ideological spectrum — touching on topics from LGBT matters to race issues to immigration to gun rights,\" company CSO Alex Stamos wrote in a blog post at the time.\n\nThe revelations prompted the “Honest Ads Act,” sponsored by Sens. John McCain, R-Ariz.; Mark Warner, D-Va.; and Amy Klobuchar, D-Minn., and which presses online companies like Facebook and Google to make “reasonable efforts to ensure that foreign individuals and entities are not purchasing political advertisements in order to influence the American electorate\" and would amend “the Bipartisan Campaign Reform Act of 2002's definition of electioneering communication to include paid Internet and digital advertisements.”\n\nGoldman outlined said Facebook is striving to make all ads transparent to its users.\n\n“Starting next month, people will be able to click “View Ads” on a Page and view ads a Page is running on Facebook, Instagram and Messenger — whether or not the person viewing is in the intended target audience for the ad,” he wrote, noting that the company will roll out the features out in Canada first, then in the U.S. before the mid-term elections. “All Pages will be part of this effort, and we will require that all ads be associated with a Page as part of the ad creation process.” \n\nThe social media giant will build an federal election ad archive – all ads over a rolling four-year period will be searchable; total spends will be provided as will the number of impressions and demographics on the target audience. Political advertisers will also have to verify their identities.\n\n“For political advertisers that do not proactively disclose themselves, we are building machine learning tools that will help us find them and require them to verify their identity,” Goldman wrote.\n\nEarlier in the week, Twitter announced the steps it was taking to make political and issues-oriented advertising more transparent.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Cambridge Analytica CEO approached Assange about publishing missing Clinton emails", "news_link": "https://www.scmagazine.com/cambridge-analytica-ceo-approached-assange-about-publishing-missing-clinton-emails/article/702622/", "title": "Cambridge Analytica CEO approached Assange about publishing missing Clinton emails", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 25, 2017", "body": "The CEO of Cambridge Analytica, the data analytics firm in which Steve Bannon has a stake, approached Julian Assange last year offering to help WikiLeaks release emails deleted from Hillary Clinton's email server.\n\nAssange verified the contact by Alexander Nix to the Daily Beast, noting he rebuffed the offer. “We can confirm an approach by Cambridge Analytica and can confirm that it was rejected by WikiLeaks,” Assange said.\n\nWhile the hack of the missing 30,000 emails has never been confirmed, they were hotly debated during the 2016 presidential campaign with then-candidate Donald Trump famously saying, “Russia, if you're listening, I hope you'll be able to find the 30,000 emails that are missing.”\n\nCambridge Analytica, which has been widely credited with helping Trump gain the presidency, is handing over relevant documents to the House Permanent Select Committee on Intelligence as it probes potential collusion between Russia and members of the Trump team.\n\nThe company, whose investors include not only Bannon but also billionaire and Trump supporter Robert Mercer, amassed and analyzed data from numerous sources, including social media, to develop psychological profiles of voters. Since, more recently, Facebook and other social media firms have uncovered evidence that Russia used their platforms to spread propaganda and influence the 2016 presidential election, lawmakers are taking a closer look at Cambridge Analytica.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/email-security/topic/47206/", "topic_name": "Email Security"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Microsoft withdraws suit after Justice Dept. changes policy on surveillance gag orders", "news_link": "https://www.scmagazine.com/microsoft-withdraws-suit-after-justice-dept-changes-policy-on-surveillance-gag-orders/article/702496/", "title": "Microsoft withdraws suit after Justice Dept. changes policy on surveillance gag orders", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 24, 2017", "body": "Satisfied with a binding order issued Monday by Deputy Attorney General Rod Rosenstein that limits the use of gag orders that effectively silences companies that provide customers' personal data on the government's behest, Microsoft will withdraw a lawsuit it filed against the government in April 2016.\n\n“This new policy limits the overused practice of requiring providers to stay silent when the government accesses personal data stored in the cloud,” said Microsoft President and Legal Officer Brad Smith, who called the Justice Department move “an important step for both privacy and free expression.”\n\nThe order “helps ensure that secrecy orders are used only when necessary and for defined periods of time,” Smith wrote in a blog post. “It is an unequivocal win for our customers, and we're pleased the DOJ has taken these steps to protect the constitutional rights of all Americans.”\n\nThe Justice Department directive calls for prosecutors to “conduct an individualized and meaningful assessment regarding the need for protection from disclosure prior to seeking” an order “and only seek an order when circumstances require.”\n\nIn addition, prosecutors must “tailor the application to include the available facts of the specific and/or concerns attendant to the particular type of investigation,” the order said.  Since “the factors justifying protection from disclosure may be similar in many cases, particularly at the outset of an investigation,” prosecutors, as appropriate, “may state the extent to which the stage of the investigation limits the availability” of facts that justify the order. \n\nWhile Microsoft now will take steps to get its lawsuit dismissed, the Justice Department policy “doesn't address all of the problems with the Electronic Communications Privacy Act (ECPA) — the law at the heart of this issue” and doesn't mean the company is “done with our work to improve the use of secrecy orders,” Smith said, calling once again for Congress to amend the ECPA.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Wyden, Paul introduce bill to extend, reform Section 702 surveillance authorization", "news_link": "https://www.scmagazine.com/wyden-paul-introduce-bill-to-extend-reform-section-702-surveillance-authorization/article/702461/", "title": "Wyden, Paul introduce bill to extend, reform Section 702 surveillance authorization", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 24, 2017", "body": "A bill introduced today by Sen. Ron Wyden, D-Ore., and Sen. Rand Paul, R-Ky., seeks to extend Section 702 of the Foreign Intelligence Surveillance Act (FISA) for another four years but with critical reforms aimed at curbing government surveillance.\n\nThe proposed legislation would require government to obtain a warrant to search for communications of people in the United States and alert targets when the information collected under Section 702 is being used against them. It would also require government authorities to report on Section 702 use to set the stage for its use in the future.\n\n“Importantly, it would close the so-called ‘backdoor search loophole' that allows the government to search Section 702 data for information about individuals in the U.S. without a warrant,” American Civil Liberties Union Legislative Counsel Neema Singh Guliani said in a statement, calling the bill a “significant step forward” in protecting the constitutional rights of Americans. “It would also put a stop to the illegal practice of collecting communications that are not to or from a surveillance target.”\n\nOn Monday, a group of former national security officials beseeched members of Congress to extend Section 702, which is set to expire at the end of this year, noting in letters to lawmakers and obtained by Reuters, that “it is the most effect mechanism to protect the U.S. from the very large numbers of real threats that use American email and internet services.”\n\nMembers of the group, which included former National Security Agency (NSA) Director Gen. Keith Alexander and former CIA Director Michael Hayden, said they could “personally attest” to Section 702's usefulness and claimed that its “strong oversight and controls” protected Americans' civil rights and privacy, a view that differs greatly from those of privacy and rights organizations.\n\nUrging Congress to “quickly enact” the bipartisan bill, Singh contended that the government has abused Section 702, using it for warrantless spying on individuals. “This bill rightly recognizes that no president — Democrat or Republican ­— should have such power,” she said.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybecrime/topic/50062/", "topic_name": "Cybecrime"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Researchers surveil mobile users using just $1,000 worth of targeted ads", "news_link": "https://www.scmagazine.com/tracking-users-for-as-little-as-1000-worth-of-targeted-ads/article/701507/", "title": "Researchers surveil mobile users using just $1,000 worth of targeted ads", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "October 19, 2017", "body": "Using less than $1,000 worth of targeted advertising, University of Washington researchers were able to surveil individual users, determining location and habits.\n\nResearchers found that advertising can be used by the individuals buying ads to track a target's location in relative real-time and to determine which apps a target uses and when, for apps with ads, according to the ADINT: Using Targeted Advertising for Personal Surveillance report. \n\nThe goal of the project was to provide a new perspective in the advertising privacy debate and researchers found that as advertisers are incentivized to provide more highly targeted ads, each increase in targeting precision inherently increases ADINT, advertising intelligence, capabilities.\n\nMany of these capabilities were developed by advertisers for legitimate business purposes, but researchers said they could easily be exploited by someone with malicious intentions. A targeted individual need not click the ad to be targeted and by using a canonical demand-side provider (DSP), researchers were able to identify a target's, home, routes and place of work, and even which apps were on a user's phone.\n\n“Ads can be targeted in a wide variety of ways, as described in our survey in our paper, including things about a person like age or gender, and things about the device, like operating system, IP address, location, or Mobile Advertising ID (MAID),” researchers said in a press release. “Some of these are unique, like the MAID, but others are only semi-unique, like location or IP address, that might be shared by many individuals in some situations.”\n\nResearchers recommend users consider resetting their MAID on their devices and that advertising networks do more vetting of the parties that wish to purchase ads to prevent exploits like this in the wild. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybersecurity/topic/47223/", "topic_name": "Cybersecurity"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/surveillance/topic/50685/", "topic_name": "Surveillance"}]}, {"news_name": "Mueller interviewed security pro who claimed to be recruited by GOP operative for Russian collusion", "news_link": "https://www.scmagazine.com/mueller-interviewed-security-pro-who-claimed-to-be-recruited-by-gop-operative-for-russian-collusion/article/701019/", "title": "Mueller interviewed security pro who claimed to be recruited by GOP operative for Russian collusion", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 18, 2017", "body": "A former British government security specialist who said he was recruited by a GOP operative to collude with the Russians in the 2016 presidential election has met with special counsel Robert Mueller.\n\nThe investigator interviewed Matt Tait, who has maintained that the late Peter W. Smith solicited his help in locating deleted emails that he thought Russian hackers may have obtained from Hillary Clinton's private email server, according to a report from Business Insider.\n\nSmith, who also claimed to be connected to former White House Security Adviser Gen. Michael Flynn, told the Wall Street Journal that he believed \"the people who had these were probably around the Russian government\" and killed himself in May just days after the Journal's report came out.\n\nThe GOP operative said he acted independently and did not explicitly say he was working with Flynn. But apparently he left that impression. \"He said, 'I'm talking to Michael Flynn about this – if you find anything, can you let me know?'\" the Journal quoted computer expert Eric York, who checked out hacker forums for Smith, as saying. \n\nTait wrote in a June Lawfare.com article that Smith had given him a document about KLS Research, a company formed to \"conduct opposition research on behalf of the [Trump] campaign, but operating at a distance so as to avoid campaign reporting.\" \n\nIn the piece, \"The Time I Got Recruited to Collude with the Russians,\"  Tait said, \"The combination of Smith's deep knowledge of the inner workings of the campaign, this document naming him in the 'Trump campaign' group, and the multiple references to needing to avoid campaign reporting suggested to me that the group was formed with the blessing of the Trump campaign.\"\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "SSH privileged access has minimal control at most organisations", "news_link": "https://www.scmagazine.com/ssh-privileged-access-has-minimal-control-at-most-organisations/article/700883/", "title": "SSH privileged access has minimal control at most organisations", "author": "Tony  Morbin", "author_link": "https://www.scmagazine.com/tony--morbin/author/3963/", "date": "October 17, 2017", "body": "Although Secure Shell (SSH)  keys provide the highest levels of administrative access they are routinely untracked, unmanaged and poorly secured according to a recent report by Venafi. In the survey 63 percent of respondents admitted that they do not actively rotate keys, even when an administrator leaves their organisation, allowing them to have ongoing privileged access to critical systems. \n\nIt also found that  61 percent  don't limit or monitor the number of administrators who manage SSH, leaving their organisations blind to malicious insiders, and  90 percent don't have a complete and accurate inventory of SSH keys, and so have no way of knowing if keys have been stolen or misused.\n\nCyber-criminals can abuse SSH keys to secure and automate administrator-to-machine and machine-to-machine access to critical business functions. Management and correct implementation of SSH is particularly important its role in securing remote machine-to-machine communication. But the report findings show that SSH best practices are routinely disregarded.\n\n“A compromised SSH key in the wrong hands can be extremely dangerous,” said Nick Hunter, senior technical manager for Venafi. “Cyber-criminals can use them to access systems from remote locations, evade security tools, and often use the same key to access more systems. Based on these results, it's very clear that most organisations have not implemented SSH security policies and restricted SSH access configurations because they do not understand the risks of SSH and how it affects their security posture.”\n\nOnly 35 percent of the 411 IT security professionals from the United States, United Kingdom and Germany who participated in the study reported enforcing policies that prohibit SSH users from configuring their authorised keys leaving organisations blind to abuse from malicious insiders. Ninety percent of the respondents said they do not have a complete and accurate inventory of all SSH keys so there is no way to determine if keys have been stolen, misused or should not be trusted.\n\nOnly twenty-three percent of respondents rotate keys on a quarterly or more frequent basis. Forty percent said that they don't rotate keys at all or only do so occasionally. Attackers that gain access to SSH keys will have ongoing privileged access until keys are rotated.\n\nFifty-one percent of respondents said they do not enforce “no port forwarding” for SSH.  Port forwarding allows users to effectively bypass the firewalls between systems so a cybercriminal with SSH access can rapidly pivot across network segments. Fifty-four percent of respondents do not limit the locations from which SSH keys can be used.  For applications that don't move, restricting SSH use to a specific IP address can stop cyber-criminals from using a compromised SSH key remotely.\n\nThe study was conducted for Venafi by Dimensional Research and completed in July 2017. \n\n", "topics": []}, {"news_name": "DHS will order agencies to adopt DMARC, https", "news_link": "https://www.scmagazine.com/dhs-will-order-agencies-to-adopt-dmarc-https/article/700557/", "title": "DHS will order agencies to adopt DMARC, https ", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 16, 2017", "body": "The Department of Homeland Security (DHS) will require federal agencies to use the Domain-based Message Authentication, Reporting & Conformance (DMARC) standard and implement https to bolster their security postures.\n\nDHS Acting Secretary Elaine Duke, will release a binding order requiring agencies to comply with DMARC plan within 30 days and https within 120 days, Jeanette Manfra, DHS assistant secretary for cybersecurity and communications, told members of the press during a meeting in New York District Attorney Cy Vance, Jr.'s office orchestrated by the Global Cyber Alliance (GCA).\n\n“This directive is our way of showing that the federal government is a participant in the Internet, and we take our responsibility seriously,” said Manfra, calling the tenets of the order \"discrete steps that have scalable, broad impact.\"\n\nShe said “cybersecurity can be daunting,” explaining that DMARC, though, is not complicated and is easily adoptable. \n\nIn July, Sen. Ron Wyden, D-Ore., urged Manfra to mandate federal agencies adopt the DMARC email protocol to prevent hackers from sending emails that impersonate federal agencies. He gave today's DHS initiative a thumbs up. “I've been pushing federal agencies to take cybersecurity seriously, and today's new policy is a good, basic step,” Wyden said in a statement, noting that DMARC and STARTLLS encryption are both “cheap, effective ways to secure email from being intercepted or impersonated by bad guys.”\n\nManfra said while the current order is aimed at agencies, it could be expanded later to include third parties along agencies' supply chains.\n\nNew York State CISO Deborah Snyder said the state is adopting DMARC as well, making it a policy at the state level. Employing the protocol can make it easier for New York “to get understanding of where threats are coming from,” she said.\n\nVance, one of GCA's founders, hailed DMARC as an easy way to thwart cybercrime, noting that his “office has had to adapt to a world of cyber-related fraud.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/email-security/topic/47206/", "topic_name": "Email Security"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/phishing/topic/47212/", "topic_name": "Phishing"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Supreme Court to mull whether U.S. search warrants apply overseas", "news_link": "https://www.scmagazine.com/supreme-court-to-mull-whether-us-search-warrants-apply-overseas/article/700546/", "title": "Supreme Court to mull whether U.S. search warrants apply overseas", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 16, 2017", "body": "The U.S. Supreme Court will heed a Justice Department request and hear arguments about whether the federal government can use U.S. warrants to reach emails stored in servers overseas nearly a year after the Second Circuit Court of Appeals struck down a similar request.\n\nA three-judge panel from the Second Circuit in July 2016 ruled that warrants from the U.S. government issued under the Stored Communications Act couldn't be used to force Microsoft to hand over emails stored in an Irish server. The government then petitioned the court for a rehearing before the full panel of judges, but a subsequent January 2017 split vote, 4-4, slapped down the government's request for a rehearing, meaning that the earlier ruling in Microsoft's favor would stand.\n\n\"The opposite ruling could have resulted in chaos and a privacy disaster,\" Greg Nojeim, director of the Center for Democracy & Technology's Freedom, Security & Technology Project, said in a release at the time. \"Providers would have been subject to conflicting obligations to an even greater extent than is the case today, and users' communications privacy could become, over time, subject to the whims of not just the U.S. government, but also other countries seeking their data.\" \n\nBut the high court's decision to review the case means the justices “will now have to decide whether a warrant issued by a U.S. court can compel a communications provider to produce its users' content no matter where it's stored in the world,” Nojeim said in a release. “This is something that Congress should be addressing, rather than the Court.” \n\nIf the Supreme Court decides U.S. warrants have authority overseas, “it will open the floodgates to demands from other countries that their legal processes be able to compel other providers to disclose content that they hold in the U.S., including the content held by Americans,” he said. “This would create chaos.”\n\nInstead the court should stand by the Second Circuit decision that said government should “use the Mutual Legal Assistance Treaty between the U.S. and Ireland in order to gain access to the information in the case,” Nojeim contended, renewing the call for Congress to “resolve the issue of cross-border law enforcement data demands, with a clear focus on strong human rights protections for all internet users.” \n\n“The case pits the interests of law enforcement access to information against concerns over government overreach, and could have ramifications globally as other nations likely will adapt their policies regarding access to information stored in other countries based on what the U.S. Supreme Court decides,” said Robert Cattanach, a partner at Dorsey & Whitney law firm.  “Privacy advocates have decried the prospect of borderless search authority by governments across the world, while law enforcement have painted the specter of criminal activities being shielded by convenient placement of data.”\n\nThe case is drawing particular attention as major data privacy regulation is mulled in Europe. “All of this is being played out as the European Union continues its review of the Privacy Shield measure that allows the transfer of personal data of EU residents to the US under the presumption that it can be adequately protected,\" said Cattanach. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Twitter likely deleted info of interest to Russian collusion probe", "news_link": "https://www.scmagazine.com/twitter-likely-deleted-info-of-interest-to-russian-collusion-probe/article/700330/", "title": "Twitter likely deleted info of interest to Russian collusion probe", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 16, 2017", "body": "Twitter's privacy policy, which calls for tweets to be deleted from its system after a user deletes them, may have kept useful data out of the hands of investigators probing Russia's meddling in the 2016 presidential election. \n\nThe information could have been used to determine how Russian operatives “were trying to nudge the narrative in a certain direction,” according to a report by Politico, which cited unnamed cybersecurity pros. \n\n\"So if you have access to all this, you can basically see when botnets appeared and disappeared, and how they shaped narrative around certain events,” said the report, quoting an analyst.\n\nTwitter's practices mean it doesn't \"know who is on their platform, or how bad people are doing bad things,\" Politico quoted Clint Watts, a former FBI agent, as saying.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}, {"topic_link": "https://www.scmagazine.com/social-media/topic/47245/", "topic_name": "Social Media"}]}, {"news_name": "Coalition, including ACLU, write House committee to oppose USA Liberty Act", "news_link": "https://www.scmagazine.com/coalition-including-aclu-write-house-committee-to-oppose-usa-liberty-act/article/700226/", "title": "Coalition, including ACLU, write House committee to oppose USA Liberty Act", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 13, 2017", "body": "A coalition of rights organizations, including the American Civil Liberties Union (ACLU), told the House Judiciary Committee Friday that it will not support the USA Liberty Act, the latest version of a surveillance reform bill meant to extend the federal government's spying authority under Section 702 of the Foreign Intelligence Surveillance Act (FISA).\n\nIn a letter to the committee, the coalition of more than 40 organizations, including the NAACP and the Freedom of the Press Foundation, said the bill needed to be bolstered to address concerns over the “backdoor search loophole.” \n\n“The bill's most glaring deficiency is that it does not require a warrant to access content in cases where the primary purpose is to return foreign intelligence,” the group wrote, noting that “under this exception, the government would have free rein to search and access the content of religious organizations and civil society groups, Congressional staff, and other innocent Americans without a warrant simply if it asserted that the primary purpose was to gather information related to the policies of a foreign country.” \n\nThe coalition also took issue with the broad language of the bill, which it said “leaves room for the government to conduct queries and access content for law enforcement purposes without a warrant.”\n\nThe bill's consent and emergency exception are also overly broad. “For example, the emergency provision does not parallel analogous provisions in FISA and require imminence or that the government go back to the FISA court for a warrant after beginning the emergency surveillance,” the coalition said. “At the same time, the consent provision could be read to allow individuals who are not a party to a communication to consent to its access.”\n\nExpressing concern that “the bill fails to require any court approval to access what it terms ‘noncontents' information,” the rights groups said that made the proposed law “at odds with current law, including the reforms passed as part of the USA Freedom Act, which recognized the need for a court order to access metadata.”\n\nThe coalition urged Congress to bring the language of the bill in line with Title III provisions, to clarify that “an independent judge—not the government—must make a finding of probable cause as part of the warrant process.”  \n\nSaying that the bill falls short of protecting Americans, Neema Singh Guliani, legislative counsel with the ACLU, in a statement, noted “the bill still allows the government to read emails, text messages, and other communications of Americans without a probable cause warrant or even a shred of evidence suggesting that the person has information necessary to protect against an imminent threat” and called for lawmakers to improve it.\n\nSection 702 is set to expire at the end of 2017.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Former Congressional IT pro Awan wiped phone before FBI arrest", "news_link": "https://www.scmagazine.com/former-congressional-it-pro-awan-wiped-phone-before-fbi-arrest/article/699278/", "title": "Former Congressional IT pro Awan wiped phone before FBI arrest", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 10, 2017", "body": "An IT specialist formerly employed by Rep. Debbie Wasserman Schultz, D-Fla., who is now at the center of a loan fraud conspiracy, suspected of pilfering computer equipment and transferring copious amount of data from a House server wiped his iPhone of data shortly before his arrest at Dulles Airport in July.\n\nImran Awan was waiting to board a flight to Pakistan to join his wife, an alleged co-conspirator in the fraud plot, who had traveled to the country months earlier, when FBI agents nabbed him. At a hearing Friday, according to Forbes, Assistant U.S. Attorney Michael Mirando told the court that the phone “had been wiped clean just a few hours before” Awan's arrest in rebuttal to claims by the IT pro's attorney that “Awan had recently bought the phone, so of course it didn't have any data on it.” \n\nAwan, who had worked for more than 24 Democratic members of Congress over a 13-year period, stands accused of filing illegally for a home equity loan on rental property, which violates the Congressional Federal Credit Union rules. It was only after Awan was arrested at the airport that Wasserman Schultz fired him – other members of Congress had fired him in February when the probe was revealed and Awan's access to the House IT system was yanked. Wasserman Schultz has come under heavy criticism for keeping Awan onboard, raising the hackles of ethics watchdog groups and other critics.\n\n“For several months, Wasserman Schultz refused to remove Awan from house payroll even though he was barred from the House computer system which would presumably prevent him from performing any reasonable IT work,” Matthew G. Whitaker, executive director wrote of the right-leaning Foundation for Accountability and Civic Trust (FACT) wrote in a letter last summer to the Office of Congressional Ethics (OCE) Chairman Doc Hastings, calling it “contrary to the House Ethics Rules for Waserman Schultz to continue to pay Awan with taxpayer funds even after he was barred from the House computer system and could not perform his duties, and was also under criminal investigation.” \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/data-breach/topic/47235/", "topic_name": "Data Breach"}, {"topic_link": "https://www.scmagazine.com/email-security/topic/47206/", "topic_name": "Email Security"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/hacking/topic/47220/", "topic_name": "Hacking"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "NFL player personal data found on open Elasticsearch server", "news_link": "https://www.scmagazine.com/nfl-player-personal-data-found-on-open-elasticsearch-server/article/698541/", "title": "NFL player personal data found on open Elasticsearch server", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "October 06, 2017", "body": "NFL players may not mind having their views on social issues known, but they are probably not happy that a publicly accessible database has been found containing private information on about 1,100 players and their agents.\n\nKromtech Security Center researchers found on September 26 a misconfigured Elasticsearch database containing data collected from an Orchard Audit module, a free content management system, that tracked activity on several NFL related domains. This information was then sent back to Elasticsearch for analysis. Elasticsearch is anopen source RESTful search and analytics engine.\n\nAbout 387MB of information on 1,133 players containing 573,368 records was exposed, Kromtech reported. Some of the information included agent and player email addresses, email addresses from the NFL Players Association, agent and manger IP addresses, player's house address and mobile phone numbers.\n\n“Moreover, specific indices content are also viewable via browser, so anybody with Internet connection could have accessed the data (and, as ‘pleasereadthis' index says, somebody with malicious intents has already seen it),” Kromtech noted.\n\nKromtech noted that this is not the first time Elasticsearch databases have been found publicly available. Researchers estimated about 4,600 of these databases have been compromised and in at least one case accessed by a malicious actor when a ransom note was found in one of the files, not associated with the NFL.\n\nThe NFL has not yet responded to an SC Media request for further information.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Russian anti-privacy laws go into effect", "news_link": "https://www.scmagazine.com/russian-anti-privacy-laws-go-into-effect/article/697882/", "title": "Russian anti-privacy laws go into effect", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 04, 2017", "body": "Russia's anti-privacy laws began taking effect October 1 – with another deadline on November 1 – just as the country pledged to block Facebook if the company refuses to store Russian citizens' data on Russian servers.\n\nLaws under the earlier effective date enable faster blocking of all proxies and mirrors of banned websites – all without the sanction of the courts – and search engines won't be allowed to advertise the sites. \n\nAfter November 1, Russia will block VPN services, all of whom must register with the government, that are not in compliance with the laws.  If the VPNs fail to restrict access to blocked sites they will be shut down. \n\n“We stand for freedom of speech, and we feel it's our duty to provide Russian people with the access to thousands of websites that are currently blocked, including major sources of information. Reddit and Wikipedia have to remove the content that the government tells them to - or they will be blocked,” NordVPN said in a statement, noting that hundreds of thousands of people use the company's services to have “free and unrestricted access” to the Internet. “There are also websites of political dissent that are added to the blocked list, such as sites of Putin critics Gary Kasparov and Alexei Navalny. We believe that special targeting could be especially dangerous for political activists who are able to stay anonymous by using a VPN. We will continue to operate in Russia to the best of our technical abilities.”\n\nHuman Rights Watch quoted Russia's Internet Ombudsman Dmitry Marinichev as referring to the law as “madness” in an RBC interview. \"All this goes against common sense. The bill refers to technologies that allow you to bypass the lock. First of all, this is VPN and anonymizers,” said Marinichev. “How will they separate the VPN that is used for commercial purposes from the VPN that is used to bypass the locks? This cannot be determined.”\n\nFacebook has landed in the government's crosshairs as it's pressured to comply with a law signed by Russian President Vladmir Putin and which went into effect September of 2015. \"Everyone needs to abide by the law. There can't be any exceptions here,\" Roskomnadzor chief Alexander Zharov was quoted by Interfax as saying. \"In 2018, everything will be as it should be for sure.\"\n\nEarlier this week Facebook gave a broad overview of the content contained in the 3,000 ads that were placed on the social media site Russian Internet Research Agency during and after the 2016 election cycle and that were turned over to House and Senate intelligence committees in early September.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}, {"topic_link": "https://www.scmagazine.com/social-media/topic/47245/", "topic_name": "Social Media"}]}, {"news_name": "ISF guide walks through prep and implementation of GDPR compliance program", "news_link": "https://www.scmagazine.com/isf-guide-walks-through-prep-and-implementation-of-gdpr-compliance-program/article/697508/", "title": "ISF guide walks through prep and implementation of GDPR compliance program", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "October 03, 2017", "body": "Calling the General Data Protection Regulation (GDPR) “the biggest upheaval of global privacy law” in a couple of decades, the Information Security Forum (ISF) has released the GDPR Implementation Guide, which offers organizations a two-phase walkthrough to prepare for and implement a GDPR compliance program, ISF Executive Director Steve Durbin told SC Media.\n\nThe first phase covers preparing for the regulation, set to take effect May 25, 2018, starting with discovering personal data then determining compliance status and finally defining the parameters of a compliance program.\n\n“The first thing is preparation, organizations understanding their personal data” and that it “really is enterprisewide,” said Durbin, noting that the regulation will have tremendous effect on the wholesale marketing side of a business.\n\nOrganizations must then understand how they collect and process data before they talk compliance. “One danger that we run when we talk GDPR compliance is organizations might think” it's a one-time checkbox process, “but it's not,” said Durbin. Rather, it's an ongoing process as companies expand and change their data collection.\n\nGDPR compliance requires changing the “the processes and culture across an organization [as to] how information is used and processed,” he said. \n\nCompanies, too, must get a handle on how third-party partners and vendors handle data and comply with GDPR.\n\nThe second phase is actual implementation of a GDPR compliance program, which Durbin said will likely bump up individuals' understanding of how their data is collected, protected and used. Consumers likely assumed, for example, that a company like Equifax handled data much better, but got a rude awakening after the company's recent massive breach. That will change with GDPR.\n\n“Individuals will understand much better how to ask about data,” he said, adding that as a result, he expects “much more individual frustration” regarding breach notifications.\n\nDurbin urged companies not to simply view GDPR as a compliance issue but as a launching point for bringing real, positive change to their business operations.\n\n“Data protection and legal compliance should not be perceived solely as a burden. The GDPR provides organizations with an opportunity to move programs beyond risk reviews and data analysis to deliver tangible operational change, thereby securing competitive advantage,” he said in a release. “While every organization should judge the risks and rewards of its own data protection investments, the GDPR offers a unique opportunity to translate necessary compliance actions into tangible business benefit. Leading organizations are structuring GDPR compliance programs to exploit these opportunities and our GDPR Implementation Guide offers a method for doing just that.”\n\nThe threat of hefty fines – four percent of annual turnover  - and the potential hits to reputation should push even the stragglers to eventually comply, even if it means calling in outside help.\n\n“I don't think anyone wants to be the first one to fall afoul of GDPR,” said Durbin.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Trump lawyers hit Facebook with warrants for activists' account info", "news_link": "https://www.scmagazine.com/trump-lawyers-hit-facebook-with-warrants-for-activists-account-info/article/696608/", "title": "Trump lawyers hit Facebook with warrants for activists' account info ", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 29, 2017", "body": "Armed with search warrants, Trump administration lawyers have demanded Facebook turn over account information on three Facebook users who are anti-administration activists. \n\nOne of the users targeted is Emilio Talarico who ran the disruptj20 page that organized protests on Inauguration Day, according to a CNN report.\n\nThe Justice Department had previously tried to get web hosting provider DreamHost to hand over information on visitors to the disruptj20 website.\n\nAfter DreamHost pressed the U.S. government in superior court over a warrant to access more than 1.3 million IP records of a website, the Justice Department backed off its request and modified the warrant to narrow its scope.\n\nA superior judge subsequently ruled that the information must be handed over but ordered that the time period specified by the search warrant should be reduced.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "State surveillance tool uses ISP to deliver malware to privacy seekers", "news_link": "https://www.scmagazine.com/state-surveillance-tool-uses-isp-to-deliver-malware-to-privacy-seekers/article/694968/", "title": "State surveillance tool uses ISP to deliver malware to privacy seekers", "author": "", "author_link": "", "date": "September 22, 2017", "body": "Unnamed major internet providers are reported to be the distribution route for the spread of a new variant of government spyware FinFisher (also known as FinSpy) in two countries, with surveillance campaigns using the new malware variant detected in a total of seven unnamed countries.\n\nResearchers at ESET say these campaigns are the first where the probable involvement of a major internet provider in spreading malware has been publicly disclosed.\n\n“In two of the campaigns, the spyware has been spread via a man-in-the-middle attack and we believe that major internet providers have played the role of the man in the middle,” explains Filip Kafka, the ESET malware analyst who conducted the research.\n\nFinFisher describes itself as a law enforcement tool; it is known to be used by various oppressive regimes. It allows surveillance through keylogging, and exfiltration of files, as well as live surveillance through webcams and microphones. \n\nWhen a targeted user is about to download Skype, Whatsapp ,VLC Player, Avast or WinRAR, they are redirected to the attackers' server  where they are served a trojanised installation package infected with FinFisher.  \n\nWhen the requested software is downloaded and executed, it installs not only the intended legitimate application, but also the FinFisher spyware bundled with it. The malicious link is delivered to the user's browser via an HTTP 307 Temporary Redirect status response code indicating that the requested content has been temporarily moved to a new URL. The whole redirection process occurs without the user's knowledge and is invisible to the naked eye.\n\nKafka,adds,  “These FinFisher campaigns are sophisticated and stealthy surveillance projects, unprecedented in their combination of methods and reach.”\n\nESET takes the view that there is no such thing as good malware, as outlined in its  response to an open letter by Bits of Freedom, a digital rights activist group.\n\nFinFisher campaigns use various infection mechanisms, including spearphishing, manual installations with physical access to devices, 0-day exploits, and watering hole attacks – poisoning websites the targets are expected to visit (which ESET says it observed used to serve a mobile version of FinFisher).\n\nAmong the recent campaigns, FinFisher spyware was being targeted at people seeking stronger privacy as it masqueraded as an executable file named “Threema” which would provide secure instant messaging with end-to-end encryption. \n\nAnother  installation was a file of TrueCrypt – the once-very-popular disk encryption software – trojanised with FinFisher.\n\nESET explains that it would be technically possible for the “man” in these man-in-the-middle attacks to be situated at various positions along the route from the target's computer to the legitimate server (eg compromised Wi-Fi hotspots). However, the company says, “the geographical dispersion of ESET's detections of latest FinFisher variants suggests the MitM attack is happening at a higher level – an ISP arises as the most probable option.”\n\nIt says this assumption is supported by a number of facts: First, according to leaked internal materials that have been published by WikiLeaks, the FinFisher maker offered a solution called “FinFly ISP” to be deployed on ISP networks with capabilities matching those necessary for performing such a MitM attack. Second, the infection technique (using the HTTP 307 redirect) is implemented in the very same way in both of the affected countries, which is very unlikely unless it was developed and/or provided by the same source. Third, all affected targets within a country are using the same ISP. Finally, the very same redirection method and format have been used for internet content filtering by internet service providers in at least one of the affected countries.\n\nThe deployment of the ISP-level MitM attack technique mentioned in the leaked documents has never been revealed – until now. If confirmed, these FinFisher campaigns would represent a sophisticated and stealthy surveillance project unprecedented in its combination of methods and reach.\n\nESET has a free online scanner which allows users to check their computer for FinFisher and remove it if detected.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "D.C. appeals court overturns conviction in warrantless stingray case", "news_link": "https://www.scmagazine.com/dc-appeals-court-rules-warrantless-stingray-use-unconstitutional/article/695127/", "title": "D.C. appeals court overturns conviction in warrantless stingray case", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "September 22, 2017", "body": "D.C. Court of Appeals ruled the use of stingrays, or cell-site simulators, without a warrant is unconstitutional on the grounds of violating the Fourth Amendment resulting in the overturning of the conviction of a robbery and sexual assault suspect.\n\nThe courts once again determined the use of the device \"to locate a person through his or her cellphone invades the person's actual, legitimate and reasonable expectation of privacy in his or her location information and is a search,\" officials said in court documents dated Sept. 21, 2017.  \n\nThe court further concluded that under ordinary circumstances the use of the devices to locate a through his or her cellphone invades the person's actual, legitimate and reasonable expectation of privacy in his or her location information and is a search.\n\nThe Electronic Frontier Foundation said the decision should serve as yet another warning to law enforcement that new technologies do not mean investigators can bypass the Constitution.\n\n“If police want data from our devices, they should come back with a warrant,” the EFF said in a Sept 21. blog post. \n\nThe House Oversight and Government Reform Committee found U.S. between 2010 and 2014, taxpayers spent $95 million on 434 cell-site simulator devices averaging $500,000 per device.  \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/legal-action/topic/47242/", "topic_name": "Legal Action"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Security analyst calls for duress codes that can wipe confiscated phones", "news_link": "https://www.scmagazine.com/security-analyst-calls-for-duress-codes-that-can-wipe-confiscated-phones/article/694966/", "title": "Security analyst calls for duress codes that can wipe confiscated phones", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "September 22, 2017", "body": "The time has come for smartphones to come programmed with a duress code that wipes the device clean, in the event a border agent demands to search it, a veteran information security analyst has suggesed in an op-ed piece.\n\nBob Covello, an information security analyst with specialty insurance holding company Security Cove, contends in a Sept. 21 Tripwire \"State of Security\" blog post that the debate around adding a duress code for phones \"has gone disturbingly silent\" of late. Covello believes the issue deserves more attention, especially as reports surface of American citizens having their phones seized and searched upon re-entering the U.S.\n\nEarlier this month, the American Civil Liberties Union, Electronic Frontier Foundation (EFF), and ACLU of Massachusetts filed suit against the Department of Homeland Security (DHS) for searching the laptops and smartphones of travelers at the U.S. border without a warrant, claiming such acts violate the Constitution's Fourth Amendment.\n\nCovello said the technology would be similar to home alarm duress code, which homeowners can enter if an intruder is forcing them to disable their security, thereby alerting the monitoring agency that help is urgently needed.\n\nFor those worried that wiping a phone might result in an obstruction of justice charge, Covello suggests that owners back up their smart devices to the cloud or to a computer, thus preserving the data in case a judge later rules that they must turn over the requested data.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "ISO decides not to approve two NSA encryption algorithms, citing trust issues", "news_link": "https://www.scmagazine.com/iso-refuses-to-approve-nsa-encryption-algorithms-as-industry-standards/article/690470/", "title": "ISO decides not to approve two NSA encryption algorithms, citing trust issues ", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "September 21, 2017", "body": "The International Organization for Standardization (ISO) decided not to approve the NSA encryption algorithms Speck and Simon after expressing concerns that the NSA was able to crack the encryption techniques and would thus gain a back door into coded transmissions.\n\nThe decision follows a three year dispute behind closed doors around the world between academic and industry experts from countries including Germany, Japan and Israel about whether or not the two data encryption techniques would be set as global encryption standards, according to Reuters. \n\nMuch of the distrust stemmed from internal NSA documents disclosed by Snowden that showed the agency had previously plotted to manipulate standards and promote technology it could penetrate and budget documents showing the NSA sought funding to “insert vulnerabilities into commercial encryption systems.”\n\n“I don't trust the designers,” Israeli delegate Orr Dunkelman, a computer science professor at the University of Haifa, told Reuters, citing Snowden's papers. “There are quite a lot of people in NSA who think their job is to subvert standards. My job is to secure standards.”\n\nTo address these concerns, the NSA has agreed to drop all but the most powerful encryption version which are least likely to be vulnerable to attack.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/compliance/topic/47205/", "topic_name": "Compliance"}, {"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/encryption/topic/47214/", "topic_name": "Encryption"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}]}, {"news_name": "WhatsApp rebuffs U.K. government request for backdoor", "news_link": "https://www.scmagazine.com/whatsapp-rebuffs-uk-government-request-for-backdoor/article/690003/", "title": "WhatsApp rebuffs U.K. government request for backdoor", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 20, 2017", "body": "WhatsApp over the summer apparently refused the U.K. government's entreaties to build what would essentially be a backdoor into its app.\n\nThe government wanted a way to tap into encrypted messages, but WhatsApp declined, according to a report by Sky News.\n\nTerrorists have become “frequent users of encrypted apps,” creating a blind spot for law enforcement, the report cites an anonymous source in security as saying. \"It is crucially important that we can access their communications - and when we can't, it can provide a black hole for investigators.”\n\nThe summer's request wouldn't be the first time government officials have expressed the desired for a backdoor into WhatsApp. Following the terror attack on Parliament last March, U.K. Home Secretary Amber Rudd suggested law enforcement must be able to listen in to WhatsApp conversations, as British-born Khalid Masood, who carried out the attack, is said to have used WhatsApp moments before murdering pedestrians with his car, and stabbing an unarmed police officer to death.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/encryption/topic/47214/", "topic_name": "Encryption"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Manafort seeks probe of FISA Court order leak", "news_link": "https://www.scmagazine.com/manafort-seeks-probe-of-fisa-court-order-leak/article/690111/", "title": "Manafort seeks probe of FISA Court order leak", "author": "", "author_link": "", "date": "September 20, 2017", "body": "Former Trump Campaign Manager Paul Manafort, now a target in Robert S. Mueller's probe of potential collusion between the Trump campaign and Russia, wants a probe into a leak that revealed he was the subject of a Foreign Intelligence Surveillance Court order.\n\n\"If true, it is a felony to reveal the existence of a FISA warrant, regardless of the fact that no charges ever emerged,\" Manafort said in a statement released by his spokesman, Jason Maloni. \"The U.S. Department of Justice's Inspector General should immediately conduct an investigation into these leaks and to examine the motivations behind a previous administration's effort to surveil a political opponent,\" he said.\n\nThe U.S. government, under a FISA Court order, wiretapped Manafort starting in 2014, initially over his suspicious dealings with Ukraine's ruling party and then again beginning in 2016 when investigators began to suspect he might be colluding with Russia to help the Trump campaign, according to a report by CNN.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Investigators wiretapped Manafort under FISA court order", "news_link": "https://www.scmagazine.com/investigators-wiretapped-manafort-under-fisa-court-order/article/689635/", "title": "Investigators wiretapped Manafort under FISA court order", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 18, 2017", "body": "After a brief respite in 2016, when the probe failed to yield compelling evidence of wrongdoing, the government obtained a second order later that year to conduct surveillance with the express purpose of probing potential collusion between members of the Trump campaign and Russian operatives, CNN reported. The surveillance included a time when Manafort was having conversations with Trump that extended long beyond his employment by the campaign - Manafort was pushed out of his position as campaign manager in August 2016.\n\n\"This means a federal judge reviewed evidence & concluded there was probable cause Manafort engaged in crimes or was agent of foreign power,\" Rep. Ted Lieu, D-Calif., tweeted.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}]}, {"news_name": "Reporter listens in as Trump attorneys discuss Russian probe in D.C. restaurant", "news_link": "https://www.scmagazine.com/reporter-listens-in-as-trump-attorneys-discuss-russian-probe-in-dc-restaurant/article/689554/", "title": "Reporter listens in as Trump attorneys discuss Russian probe in D.C. restaurant", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 18, 2017", "body": "Attorneys Ty Cobb and John Dowd did nothing to disabuse the notion that the White House is as leaky as a sieve, after they apparently sat down to lunch at a D.C. restaurant to discuss Russian collusion probes – within earshot of a New York Times reporter dining at the next table.\n\nThe Times's Kenneth Vogel reported the two were discussing Jared Kushner, the controversial meeting at Trump Tower between Donald Trump, Jr. and a Russian lawyer, and White House counsel Donald F. McGahn, with whom Cobb has clashed over the releasing of documents to investigators. \n\n“The White House Counsel's Office is being very conservative with this stuff,” the Times cited Cobb as saying. “Our view is we're not hiding anything.” \n\n\n\nContinue Reading Below\n\nMcGahn, on the other hand, said he has “got a couple documents locked in a safe,” Cobb told Dowd.\n\nCobb at one point also made reference to a person who was responsible “for some of these earlier leaks.” Cobb and Dowd were dining at BLT Steak, next door to the Times's D.C. office.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "New technique can manipulate encrypted Fitbit data", "news_link": "https://www.scmagazine.com/researchers-intercept-and-manipulate-encrypted-fitbit-data/article/689545/", "title": "New technique can manipulate encrypted Fitbit data ", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "September 18, 2017", "body": "Fitbit devices are prone to vulnerabilities which could enable an attacker to access personal information and even create false activity records. \n\nUniversity of Edinburgh researchers developed a technique to exploit weaknesses in the device's communication procedures to intercept messages transmitted between fitness trackers and cloud servers in order to bypass its end to end encryption and ultimately manipulate user data, according to a Sept. 15 post. \n\nThis attack could also be used by Fitbit owners themselves to manipulate data sent to insurance companies in an effort to obtain cheaper coverage from firm's that reward physical activity. \n\nResearchers notified Fitbit, who has since developed software patches for the vulnerabilities, and provided guidelines to help manufacturers remove similar weaknesses from future system designs to ensure users' personal data is kept private and secure. \n\n“Our work demonstrates that security and privacy measures implemented in popular wearable devices continue to lag behind the pace of new technology development,” Dr Paul Patras School of Informatics said in the post. “We welcome Fitbit's receptiveness to our findings, their professional attitude towards understanding the vulnerabilities we identified and the timely manner in which they have improved the affected services.”\n\n\n\nContinue Reading Below\n\n“While the current monetary impact is small, the future is likely going to have this data being more and more valuable,” Lyon said. “Wearables in general are evolving to collect much more data to provide increased benefits, but this also increases the potential risks.”\n\nAt the same time, Lyon warns the data collected by these devices could be misused by insurance companies as well if they detect that a patient may have movement disorders this information could then be relayed to raise a user's premiums. \n\n“The Fitbit example highlights one element of good design in that they are able to release software updates to address the issue,” Lyon said. “The ability to deliver secure software updates is a crucial design element that many devices do not have.\"\n\nEarlier this year, researchers developed attacks to manipulate accelerometers in devices like Fitbits to add extra step counts to the device using sound.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybersecurity/topic/47223/", "topic_name": "Cybersecurity"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "eport: Without safeguards, Internet and IoT may create surveillance states in near future", "news_link": "https://www.scmagazine.com/report-without-safeguards-internet-and-iot-may-create-surveillance-states-in-near-future/article/689534/", "title": "Report: Without safeguards, Internet and IoT may create surveillance states in near future", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "September 18, 2017", "body": "A catastrophic worldwide cyberattack, the emergence of an IoT-enabled surveillance state, and the weakening of encryption were among the chief security and privacy fears expressed by experts who were polled for a sweeping new report about the internet and its future impact on mankind.\n\nThe 2017 Global Internet Report, published by the non-profit Internet Society (ISOC), is the culmination of an 18-month research project aimed at predicting what factors will most influence the internet's evolution in the next five-to-seven years, and the impact of such changes. To get a consensus view of the internet's prospects, the organization surveyed 3,000 members, professionals and partners in 160 countries.\n\nAccording to the study, stakeholders worldwide still believe that the internet's benefits will continue to outweigh the risks in the coming years, transforming lives through the efficient delivery of critical services and revolutionizing industries across multiple sectors. But they also sense that the threat is growing, especially as businesses create new attack vectors by relying on a growing number of interconnected data sources.\n\n\"Cybersecurity will be the most pressing challenge of the next decade,\" the report states. \"Responses to date have been thoroughly insufficient and the costs are escalating.\" And based on recent precedent, \"...it is not far-fetched to imagine a digital pandemic with attacks crippling entire economies.\"\n\nThe ISOC also expects to see more destructive acts of cyber war, coupled with online disinformation campaigns in an effort to destabilize countries and their economies. However, the organization believes these acts will be perpetrated by not only nation-states, but also \"their surrogates, and by independent political movements and private actors.\"\n\nUltimately, the growth of the internet could largely depend on how well the security community at large responds to attacks, the report cautions. With the stakes so high, some nations may feel compelled to scale back online freedoms and restrict global connectivity in the name of national security, resulting in the creation of \"walled gardens,\" the balkanization of the internet, and the weakening or banishment of encryption technologies. Indeed, ISOC's survey-takers generally said they believe future government regulations will be more intrusive and restrictive than they are today.\n\nTo prevent such a scenario, the report calls for \"new accountability, incentive and liability models\" to \"increase cybersecurity readiness and reduce vulnerabilities but also to ensure end-user security.\" The ISOC is also pushing for worldwide, multi-stakeholder collaboration to address these threats, as opposed to fragmented, unilateral efforts.\n\n\"I think there are some major architectural changes which need to take place in the internet, and I'd like to see more effort put forward [toward] new innovative architectural changes,\" said Leonard Kleinrock, a renowned computer scientist, considered among the fathers of the internet, in an ISOC webcast panel discussion on Monday. \n\nBut even such architectural changes won't necessarily secure the \"edge\" of the internet, where IOT devices reside. This unprotected edge, where you'll find devices \"put together by a small company, thrown on your wall with a camera, with a microphone, with access to the internet in a typically unprotected, insecure fashion – that's where the penetrations will take place,\" Kleinrock added.\n\nPerhaps it's no surprise then that the ISOC devoted a large section of its report to IoT devices, noting that as we rapidly approach a connected world, devices will generate and collect vast amounts of personal user data that nations could potentially leverage to create a surveillance state.\n\nIn addition to seeing even more attacks from threats modeled after the Mirai IoT botnet, \"We may see increased mass surveillance, the further erosion of privacy, and a growing dependence on data collection, analytics, and curation,\" the report states. \"The implications for privacy are profound. Without essential safeguards, greater amounts of data will be collected and used without the user's knowledge or control.\"\n\nISOC has recommended pursuing a collaborative and proactive effort among stakeholders to instill effective IoT safeguards. For instance, device manufacturers and service providers should be taking steps to bake privacy and security into the actual design process, the report suggests, while the insurance industry could do its part by requiring IoT devices to have security certifications before owners of these products can be insured.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/iot/topic/47241/", "topic_name": "IoT"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/research/topic/47237/", "topic_name": "Research"}, {"topic_link": "https://www.scmagazine.com/web-security/topic/47254/", "topic_name": "Web Security"}]}, {"news_name": "Motel 6 to revamp privacy, data sharing policies after Phoenix locations send guest info to ICE", "news_link": "https://www.scmagazine.com/motel-6-to-revamp-privacy-data-sharing-policies-after-phoenix-locations-send-guest-info-to-ice/article/689360/", "title": "Motel 6 to revamp privacy, data sharing policies after Phoenix locations send guest info to ICE", "author": "", "author_link": "", "date": "September 18, 2017", "body": "Motel 6 employees in the Phoenix area who voluntarily and routinely handed guest registers to ICE officials without the benefit of a warrant may not have run afoul of the company's privacy policy, but the hotel chain said it would take steps to shut down or prevent similar operations at its other properties nationwide.\n\nThe Phoenix New Times reported last week quoted an employee at one of two Phoenix-area Motel 6 locations as saying, “every morning at about 5 o'clock we do the audit and push a button and it sends it to ICE,” prompting the American Civil Liberties Union (ACLU) to call out the motel chain on both Twitter and Facebook. “Is this your official company policy?” the ACLU tweeted.\n\nThe company's privacy policy not only notes that it collects an abundance of data on its guests but that it “may disclose guest information to law enforcement agencies, or may be required to disclose it during the discovery process in litigation, pursuant to a court order, or in compliance with any applicable law, regulation, rule or ordinance.\"\n\nHowever, as experts have pointed out there is no law that compels hotels to voluntarily give up guest information to law enforcement.\n\n\n\nContinue Reading Below\n\nThe Motel Six had said the Phoenix operation was orchestrated by locals and was shut down when corporate caught wind of it. \n\n“Moving forward, to help ensure that this does not occur again, we will be issuing a directive to every one of our more than 1,400 locations nationwide, making clear that they are prohibited from voluntarily providing daily guest lists to ICE,” according to a Motel 6 statement. “Additionally, to help ensure that our broader engagement with law enforcement is done in a manner that is respectful of our guests' rights, we will be undertaking a comprehensive review of our current practices and then issue updated, company-wide guidelines.”\n\nWhile ICE hasn't offered any additional information, it did say, “It's worth noting that hotels and motels, including those in the Phoenix area, have frequently been exploited by criminal organizations engaged in highly dangerous illegal enterprises, including human trafficking and human smuggling.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Facebook hands over ads, account info to Mueller", "news_link": "https://www.scmagazine.com/facebook-hands-over-ads-account-info-to-mueller/article/689319/", "title": "Facebook hands over ads, account info to Mueller", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 18, 2017", "body": "After issuing repeated denials, Facebook said last week that an internal investigation found a Russian \"troll farm\" bought ads from the social media giant that and apparently planted them, some in targeted markets, \"to focus on amplifying divisive social and political messages across the ideological spectrum — touching on topics from LGBT matters to race issues to immigration to gun rights,\" company CSO Alex Stamos wrote in a blog post.\n\n\n\nContinue Reading Below\n\nThe Wall Street Journal reported that Facebook shared copies of ads with Mueller's investigation as well as the criteria the accounts used to target the those ads.\n\nRep. Adam Schiff, D-Calif., ranking Democrat on the House Intelligence Committee, told ABC News his panel was “requesting a lot more information from Facebook\" since there are still \"a lot of unanswered questions.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}, {"topic_link": "https://www.scmagazine.com/social-media/topic/47245/", "topic_name": "Social Media"}]}, {"news_name": "Trump lawyer, confidante Cohen to testify before Senate committee", "news_link": "https://www.scmagazine.com/trump-lawyer-confidante-cohen-to-testify-before-senate-committee/article/689312/", "title": "Trump lawyer, confidante Cohen to testify before Senate committee", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 17, 2017", "body": "Donald Trump's lawyer, Michael Cohen, who once drafted a letter arguing for sanctions against Russia to be lifted, will testify Tuesday before the Senate Intelligence Committee, which is investigating Russian interference in the U.S. presidential election and possible collusion with members of the Trump campaign, according to an NBC News report.\n\nCohen dismissed Sater's words as boasting and, later, in a letter to the House Intelligence Committee denied claims about his relationship with the Kremlin asserted in the now infamous (and sometimes salacious) Steele dossier on Trump in which Cohen was a main figure.   \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}]}, {"news_name": "Justice Department: Google won't challenge overseas warrants", "news_link": "https://www.scmagazine.com/google-silently-reverses-stance-on-oversea-warrant-challenges/article/689199/", "title": "Justice Department: Google won't challenge overseas warrants", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "September 15, 2017", "body": "Google has silently stopped challenging most warrants from U.S. judges in cases involving data requests stored in overseas servers, according to a Justice Department brief sent to the Supreme Court. \n\nThe department told the High Court that the tech giant reversed its previous stance and informed the government that it will comply with the warrants and request for customer data.\n\n“Google has reversed its previous stance and informed the government that it will comply with new Section 2703 warrants outside the 2nd Circuit (while suggesting that it will appeal the adverse decisions in one or more existing cases),” the department said in court documents. “Consequently, the government's ability to use Section 2703 warrants to obtain communications stored abroad — which may contain evidence critical to criminal or national-security investigations — now varies depending on the jurisdiction and the identity of the provider.”\n\nThe news comes amid pressure from the Trump administration for justices to declare U.S. search warrants served on the U.S. tech sector extend to data stored on foreign servers as Google and other tech giants such as Microsoft began challenging U.S. warrants for overseas data.\n\nThe push comes after a federal appeals court sided with Microsoft on a first of its kind challenge which convinced the New York-based Second US Circuit Court of Appeals that U.S. search-and-seizure laws don't require compliance with a warrant to concerning data on servers located overseas. \n\nGoogle told ARS that it supports recently introduced legislation authorizing internet service providers (ISPs) to surrender overseas data with a warrant and that it is continuing to follow the Second Circuit Court of Appeals' decision and will decline to produce data stored overseas in courts that fall within that circuit.\n\n“To seek consistency in the law, we are appealing some of the cases where lower courts have decided not to follow the ruling of the Second Circuit Court of Appeals,” Google told the publication. “This discrepancy in court decisions is yet another reminder that data surveillance laws need to be modernized to safeguard users' privacy, protect law enforcement's legitimate need to collect digital evidence, and provide clarity.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/legal-action/topic/47242/", "topic_name": "Legal Action"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Mnuchin hails FIDO authentication standards", "news_link": "https://www.scmagazine.com/mnuchin-hails-fido-authentication-standards/article/688903/", "title": "Mnuchin hails FIDO authentication standards", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 14, 2017", "body": "Speaking at the Federal Identity Forum & Exposition, Treasury Secretary Steve Mnuchin hailed FIDO authentication standards \n\n“We've seen great innovations through public-private partnerships like the emergence of FIDO authentication – where major firms in IT, software, device manufacturers, banking, health care and security have partnered with government (NIST in particular) to deliver on this vision,” said Mnuchin, who called identity “the rails that financial services runs on” and solving it “key to enabling financial inclusion and to banking the unbanked.”\n\nHe noted that \"with these commitments from industry, we're at the point where it will be hard for a consumer to buy a device or launch a browser that doesn't support strong authentication out of the box.  It's an innovation – driven by industry and supported by government – that is improving security and transforming digital commerce.”\n\n\n\nContinue Reading Below\n\nMnuchin's remarks drew praise from Brett McDowell, executive director of the FIDO Alliance, which has created an open standards-based approach for authentication. “I applaud Secretary Mnuchin and the administration for recognizing the role, responsibility and opportunity for industry, and in particular the FIDO Alliance and FIDO standards, to play in improving the identity ecosystem and the overall security of American citizens,” said McDowell. “The Secretary's references to the importance of NSTIC, launched by the previous administration, is a good example of how the administration views government as playing a supporting role to private sector innovation.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Trump associates unmasked in probe of UAE prince's NYC trip", "news_link": "https://www.scmagazine.com/trump-associates-unmasked-in-probe-of-uae-princes-nyc-trip/article/688715/", "title": "Trump associates unmasked in probe of UAE prince's NYC trip", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 14, 2017", "body": "The prince, who arrived in New York in December after the presidential election, but before Donald Trump took office, met with former National Security Advisor Michael Flynn, Jared Kushner, Steve Bannon, who recently resigned as the president's adviser and other Trump officials, Rice reportedly told the House Intelligence Committee. The meeting was a precursor to another gathering in the Seychelles Islands that allegedly sought to establish a back channel between Russia and the new administration.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "ACLU, EFF sue DHS over electronic device searches at border", "news_link": "https://www.scmagazine.com/aclu-eff-sue-dhs-over-electronic-device-searches-at-border/article/688570/", "title": "ACLU, EFF sue DHS over electronic device searches at border", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 13, 2017", "body": "The American Civil Liberties Union, the Electronic Frontier Foundation (EFF), and the ACLU of Massachusetts filed suit against the Department of Homeland Security (DHS) for searching the laptops and smartphones of travelers at the U.S. border. \n\nThe suit was filed on behalf of 10 U.S. citizens and a lawful permanent resident, most of them Muslim or people of color, whose devices were searched as they reentered the country after business or personal trips. In some cases officers seized the devices and in several cases kept them for extended periods or did not return them at all. \n\n“The government cannot use the border as a dragnet to search through our private data,” ACLU attorney Esha Bhandari said in a release. “Our electronic devices contain massive amounts of information that can paint a detailed picture of our personal lives, including emails, texts, contact lists, photos, work documents, and medical or financial records. The Fourth Amendment requires that the government get a warrant before it can search the contents of smartphones and laptops at the border.”\n\nEFF Staff Attorney Sophia Cope said, “People now store their whole lives, including extremely sensitive personal and business matters, on their phones, tablets, and laptops, and it's reasonable for them to carry these with them when they travel.\"\n\nCope noted, \"It's high time that the courts require the government to stop treating the border as a place where they can end-run the Constitution.\"\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/legal-action/topic/47242/", "topic_name": "Legal Action"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Sessions, Coats call for reauthorization of FISA", "news_link": "https://www.scmagazine.com/sessions-coats-call-for-reauthorization-of-fisa/article/688378/", "title": "Sessions, Coats call for reauthorization of FISA", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "September 13, 2017", "body": "The U.S. Attorney General and the Director of National Intelligence penned a letter to the Congressional majority and minority leadership urging them to permanently reauthorize Title VII of the Foreign Intelligence Surveillance Act (FISA), which is set to expire at the end of this year.\n\nAG Jeff Sessions and DNI Daniel Coats specifically cited Section 702 stating it produces significant foreign intelligence needed to protect the nation against various foreign threats, including terrorism. adding FISA is necessary as it gives their departments the ability to “collect vital information about international terrorists, cyber actors, individuals and entities engaged in the proliferation of weapons of mass destruction and other important foreign intelligence targets located outside the United States.” All while under the oversight of all three branches of the government, the letter stated.\n\nHowever, members of Congress and privacy advocates have fought against the powers included in Section 702 as it allows for the warrantless incidental gathering of data on Americans.\n\nIn July Sen. Chuck Grassley, R-Iowa, during a Senate Judiciary Committee hearing praised the data collected under 702, but noted “Still, the unknown scope of this incidental collection is concerning to many.  Some are also concerned with the way in which the FBI is permitted to search already-collected 702 material.”\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "New UK data protection bill to be published tomorrow", "news_link": "https://www.scmagazine.com/new-uk-data-protection-bill-to-be-published-tomorrow/article/688367/", "title": "New UK data protection bill to be published tomorrow ", "author": "Staff Report", "author_link": "https://www.scmagazine.com/staff-report/author/3603/", "date": "September 13, 2017", "body": "The UK's new Data Protection Bill is to be published tomorrow, minister for digital Matt Hancock announced today in a keynote address to the UK Internet Governance Forum.  The bill, “Will bring our data protection regime into the twenty first century, giving citizens more sovereignty over their data, and greater penalties for those who break the rules,” said Hancock.\n\nHe noted how the bill formed part of a multi-billion pound National Cyber Security Strategy being spearheaded by the new National Cyber Security Centre, \n\nThe bill and the strategywere put into the context of protecting people and business, plus their data, online.  And this was then described as part of wider aims in terms of enacting laws that enable greater freedom, by protecting us from the actions of others, with Hancock saying: “We must build an internet based on liberal and not libertarian values, where we cherish freedom yet prevent harm to others.”\n\nIn addition to clamping down on cyber-bullying and child protection, part of protecting people online was acknowledged to be protecting their data online. \n\n“With AI and machine learning, data use is moving fast. Good use of data isn't just about complying with the regulations, it's about the ethical use of data too,” said Hancock, noting that, “good governance of data isn't just about legislation - as important as that is - it's also about establishing ethical norms and boundaries, as a society. And this is something our Digital Charter will address too.”\n\n\n\nContinue Reading Below\n\nAs the internet comes of age, it needs to acknowledge its responsibilities he said.\n\nA second part of the Digital Charter is about ensuring a fair economic landscape online, thus the penalty for copyright infringement is to be the same online as offline, and where value is created online, it must be appropriately rewarded.\n\nCommenting on Brexit, Hancock said: “As the UK leaves the EU we will ensure we have one of the most robust systems for protection of intellectual property anywhere in the world, for all civilised societies are based on the fair and equal protection of property rights,” noting how streaming now worked for Music,  while the news media, and high quality journalism was yet to find such a sustainable business model.\n\nHancock concluded: “Our task is to strike the right balance between freedoms and responsibilities online, such that the solutions can be applied globally, and the whole free world can emulate our approach. That is our plan.”\n\n", "topics": []}, {"news_name": "Apple iPhone X swaps Touch ID for 'Face ID' facial recognition unlock", "news_link": "https://www.scmagazine.com/apple-swaps-fingerprint-verification-for-facial-recognition/article/688256/", "title": "Apple iPhone X swaps Touch ID for 'Face ID' facial recognition unlock ", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "September 12, 2017", "body": "Apple is swapping fingerprint verification for face recognition software in the newly revealed iPhone X, a move the company said makes the phone more secure.\n\nThe deleted the home button and Touch ID have been replaced by a slim bar of cameras and facial recognition sensors at the top of the device which will scan a user's face when the device is lifted creating what it claims is a more secure method of unlocking a user's phone, Apple executives said at the September 12 event at the Apple Park in Cupertino, Calf.\n\nWhile Apple said one in 50,000 people are able to unlock an iPhone by having a similar fingerprint the firm claimed only one in a million will have a face similar enough to trick the new system. The feature can also be paired with a six-digit lock code in case for added security or those with a nosy identical twin and requires an “active user” to ensure a sleeping person or inadvertent glance doesn't unlock the device.\n\nApple says the feature will work regardless of hairstyles, glasses, hats and even through gradual facial changes such as with facial hair in light and dark environments. The new iOS 11 which comes standard with the devices also includes additional security features to prevent law enforcement from accessing user data without the six-digit code. The update also includes a feature called S.O.S. mode which will launch a new lock screen with options to make an emergency call or offer up the owner's emergency medical information after a user taps the phone's home button five times.\n\nAlthough details on how the software will work aren't fully known, all the evidence suggests the update should be considered a simplified form of authentication, Positive Technologies Cyber Security Resilience Officer Leigh-Anne Galloway told SC Media. \n\n\"Fingerprint scanning, facial recognition, Bluetooth, geolocation and even a short PIN are all ways to simplify access not only for yourself, but also for a potential attacker,\" Galloway said. \"Even if the new Apple algorithm for facial recognition cannot be fooled by photography, vertical self-videos can easily be found in the public domain - for example, on Instagram - and could be used to crack the device.\"\n\n\n\nGalloway added the new feature has a clear advantage over the as a replacement for fingerprint authentication, since it is unlikely to be able to unlock the phone when the owner is asleep.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Staffer with access to Ted Cruz's Twitter responsible for porn 'like'", "news_link": "https://www.scmagazine.com/staffer-with-access-to-ted-cruzs-twitter-responsible-for-porn-like/article/688243/", "title": "Staffer with access to Ted Cruz's Twitter responsible for porn 'like'", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 12, 2017", "body": "The Twitter post \"like\", which was up only briefly, but at first raised speculation that the senator had been hacked.\n\nWhether a staffer who mistakenly clicked “like” on pornographic porn post on Sen. Ted Cruz's Twitter feed will retain access to the Texas Republican's account is \"still being discussed,\" the senator told reporters Tuesday.\n\nThe post shared by @SexuallPosts, which included a graphic video and pictures, was only up briefly, but long enough to prompt a Tweet storm ragging on the conservative Cruz and to raise speculation that the senator, who as solicitor general in Texas, argued to maintain a ban on sex toys, had been hacked. \n\nBut Cruz said Tuesday, the “like” had been a non-malicious mistake made by a staffer.\n\n\"There are a number of people on the team who have access on the account,” Politico quoted Cruz as telling reporters. “It appears that someone inadvertently hit the like button.” And the post came down an hour or two later, he said.\n\n\"It was a staffing issue. And it was inadvertent, it was a mistake. It was not a deliberate act,” Cruz said. “We're dealing with it internally, but it was a mistake. It was not malicious.\"\n\nCruz's senior communications adviser, Catherine Frazier tweeted that the “offensive tweet” had “been removed by staff and reported to Twitter.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}, {"topic_link": "https://www.scmagazine.com/social-media/topic/47245/", "topic_name": "Social Media"}]}, {"news_name": "Apple iOS 11 makes it harder for law enforcement to access data", "news_link": "https://www.scmagazine.com/apple-ios-11-includes-at-least-two-new-privacy-features-to-safeguard-data/article/687950/", "title": "Apple iOS 11 makes it harder for law enforcement to access data", "author": "Robert Abel", "author_link": "https://www.scmagazine.com/robert-abel/author/3631/", "date": "September 11, 2017", "body": "Apple appears to have not buried the hatchet with law enforcement and is doubling down on its privacy beliefs with the latest iOS 11 which will reportedly add at least two new features designed to safeguard its owners' privacy.\n\nSecurity researchers and forensic analysts who've seen early developer versions of iOS 11 told Wired the new features include tweaks designed to make extracting the data from a seized phone far more difficult without the phone's six-digit passcode. \n\nEven if the device is confiscated in an unlocked state, if the iPhone is plugged into an unfamiliar computer the screen would ask the user if they are willing to trust that new machine before exchanging any data. If the users prompts yes they will be asked to enter the six digit pass code before being allowed to continue.\n\nIf the owner refuses to divulge the passcode, it will be harder for forensic tools to access its data in the far more digestible format for analysis known as SQLite which is capable of reviewing deleted messaged and other sensitive information within a device. \n\nThe update will also include a feature called S.O.S. mode which will launch a new lockscreen with options to make an emergency call or offer up the owner's emergency medical information after a user taps the phone's home button five times. The feature could be used to prevent the owner's finger from being used to unlock their phone while they're sleeping or otherwise incapacitated.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Instagram buys up Doxagram domains to stop hackers", "news_link": "https://www.scmagazine.com/instagram-buys-up-doxagram-domains-to-stop-hackers/article/687030/", "title": "Instagram buys up Doxagram domains to stop hackers", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 06, 2017", "body": "To thwart hackers who created Doxagram, a searchable website that houses and sells information stolen from six million Instagram users, many of them celebrities, Instagram and Facebook began buying up Doxagram domains.\n\nBut the move likely won't boot the hackers offline as the companies hope, the Daily Beast reported, saying that the hackers had already taken up residence on the dark web, where they're continuing to charge $10 per search.\n\nDoxagram had already been kicked off .com and .ws, the report said, citing a source associated with the hackers as claiming, “Apparently Facebook complained about us selling ‘stolen' information.”\n\nIt appears that Instagram so far has scooped up 280 domains.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "21 EU members not complying with court ordered privacy rules: report", "news_link": "https://www.scmagazine.com/21-eu-members-not-complying-with-court-ordered-privacy-rules-report/article/687016/", "title": "21 EU members not complying with court ordered privacy rules: report", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "September 06, 2017", "body": "The global privacy advocacy group Privacy International has found that 21 European Union members continue to retain personal data despite going against both their own and EU legal mandates.\n\nThe group's research uncovered that Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, France, Germany, Hungary, Ireland, Italy, Luxembourg, the Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, and the United Kingdom continue hold an illegal level of personal information, which goes against the Court of Justice of the European Union's (CJEU) ruling in the  Tele-2/ Watson case.\n\n“The Report concludes that all EU member States surveyed are not in compliance with the Tele-2/Watson decision. The report further notes that in many EU member States legislation is not even in conformity with the earlier Digital Rights Ireland decision,” the report stated, adding this is the situation eight months after the Tele-2/Watson ruling.\n\nIn Tele-2/Watson the CJEU found that traffic and location data can allow for precise information to be drawn concerning people's lives, including, where they live, work, their daily movements and activities. Having information retained by a group that could be used to discover such intimate personal details should only be done when that organization is fighting serious crime, the CJEU ruled.\n\nThe group also took exception to the fact that most of the changes taking place in these counties that worked to enforce the CJEU rulings did not come from the governments, but from outside organizations.\n\n“Change is being promoted through litigation by human rights NGOs instead of through proactive reform of the laws by Parliament,” it wrote.\n\nPrivacy International made several recommendations based on the report:\n\n·       All EU member States should review their legislation and, if necessary, amend it to comply with European standards, including the CJEU jurisprudence; \n\n·       Telecommunications and other companies subject to data retention obligations should challenge existing data retention legislation which are not compliant with European standards, including the CJEU jurisprudence; \n\n·       The European Commission should provide guidance on reviewing national data retention laws to ensure its conformity with fundamental rights, as interpreted by the CJEU.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/legal-action/topic/47242/", "topic_name": "Legal Action"}, {"topic_link": "https://www.scmagazine.com/legislation/topic/47221/", "topic_name": "Legislation"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Judge compares FBI malware to tracking device in child porn case ruling", "news_link": "https://www.scmagazine.com/judge-compares-fbi-malware-to-tracking-device-denies-suppression-of-evidence-in-child-porn-case/article/686835/", "title": "Judge compares FBI malware to tracking device, denies suppression of evidence in child porn case", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "September 06, 2017", "body": "Weighing in on the FBI's use of malware to identify and arrest users of the dark web child pornography site Playpen, a Texas federal judge last week ruled in favor of the U.S. Department of Justice, rejecting a motion to suppress evidence obtained in the course of the investigation.\n\nIn 2015, the FBI in Virginia secretly took over a server used by Playpen and used what the agency calls a network investigative technique (NIT) -- more commonly known as malware -- to track the IP addresses of individuals querying this server. Among the alleged Playpen visitors who were subsequently identified and arrested were Zachary Halgren of San Antonio, Tex. -- the defendant in this case.\n\nWestern Texas U.S. District Court Judge Xavier Rodriguez ruled that the warrant the FBI obtained from a local magistrate judge to implant the NIT was not too broad in its scope to violate the Fourth Amendment's particularity requirement.\n\nWhile Rodriguez agreed that under the laws of 2015, local magistrate judges were prohibited from issuing warrants to collect evidence located outside their jurisdictions, he noted that an exception applied to tracking devices that were initially installed in the magistrate's district, only to move outside the jurisdiction along with the individual under surveillance. Rodriguez opined that this scenario was \"exactly analogous to what the NIT Warrant authorized,\" in that the defendant's computer allegedly contacted an FBI-controlled server in Virginia, which tracked the device back to its location in Texas.\n\nThe judge also ruled that the defendant \"lacked a reasonable expectation of privacy in his IP address when using the internet\" and allegedly accessing the Playpen website. And even if Halgren did have a reasonable expectation of privacy, or the local magistrate judge did exceed her jurisdictional authority, the \"good faith\" exception would still apply to the search of the defendant's property.\n\nFinally, the judge rules that the affidavit used to establish probable cause for the search did not contain misrepresentations.\n\nThe legality of FBI investigations relying on an NIT warrant has been closely scrutinized in recent years, with courts in different jurisdictions issuing conflicting rulings. Earlier this month, a federal judge in Minnesota ruled that the FBI exceeded the scope of the Virginia magistrate's Playpen search warrant, but did not suppress evidence in the case because he believed the agency acted in good faith.\n\nIn April 2016, a Massachusetts federal court judge did suppress evidence in another Playpen case, after ruling that the Eastern Virginia magistrate overstepped her authority. One month later, a Washington State judge also tossed evidence in a Playpen case because the FBI refused to disclose the NIT code used to obtain the evidence. And in another case, a judge in Eastern Virginia sided definitively with U.S. law enforcement, ruling that investigators do not even need a warrant to remotely hack into suspects' computers. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/legal-action/topic/47242/", "topic_name": "Legal Action"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "MLB: Red Sox used Apple watches to steal, transmit pitching signs", "news_link": "https://www.scmagazine.com/mlb-red-sox-used-apple-watches-to-steal-transmit-pitching-signs/article/686757/", "title": "MLB: Red Sox used Apple watches to steal, transmit pitching signs", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 05, 2017", "body": "Major League Baseball investigators have found that the Boston Red Sox used Apple watches to steal hand signals from competitors' catchers and pass them on to their own players, according to a report in the New York Times. \n\nThe conclusion is the culmination of a two-week investigation launched after the New York Yankees lodged a complaint with the MLB commissioner and provide video that showed the Boston dugout when the Bronx Bombers faced the Red Sox on their own home turf during a three-game series in August.\n\nStealing signals is not illegal per se as long as teams don't rely on anything more than what they visually observe. Teams are prohibited from using electronic devices to pass along the signals they've pilfered. \n\nIn the video submitted with the Yankees's complaint, Red Sox Athletic Trainer Jon Jochim looks at his Apple Watch then gives the information to two players, one of whom in at least one instance passes the information to a Red Sox batter, the Times reported. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Lenovo settles privacy charges with FTC, 32 states", "news_link": "https://www.scmagazine.com/lenovo-settles-privacy-charges-with-ftc-32-states/article/686610/", "title": "Lenovo settles privacy charges with FTC, 32 states", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 05, 2017", "body": "Lenovo has settled privacy charges with the Federal Trade Commission and attorney generals in 32 states stemming from man-in-the-middle (MitM) software pre-installed on it consumer laptops.\n\nThe VisualDiscovery software created “serious security vulnerabilities” for those laptop users because it served as a MitM between and even encrypted websites, allowing the software program access to consumers' personal information, including Social Security numbers, medical information, financial and payment information and login credentials, the FTC said.\n\nThe information transmitted to VisualDiscovery's maker Superfish, Inc. was limited to websites browse and IP user addresses used then to deliver pop-up ads from its retail partners, the company could have accessed much more than that. Additionally, the FTC complaint charged that Superfish employed an insecure method to display pop-ups on encrypted sites replaced those sites' digital certificates with those signed by VisualDiscovery. \n\nThe security vulnerabilities prevented consumers' browsers from warning them when a site they visited could have been spoofed or was a malicious site with an invalid certificate and made their sensitive information subject to theft by hackers who only had to crack a pre-installed password to access it. The FTC complaint accused Lenovo of failing to uncover the vulnerabilities because it didn't properly vet and set requirements for third-party software that was preinstalled on its computers.\n\n“Lenovo compromised consumers' privacy when it preloaded software that could access consumers' sensitive information without adequate notice or consent to its use,” Acting FTC Chairman Maureen K. Ohlhausen said in a release. “This conduct is even more serious because the software compromised online security protections that consumers rely on.”\n\nAs part of the settlement, Lenovo agreed not to “make a misrepresentation, in any manner, expressly or by implication, about any feature of the covered software” and to obtain consumer consent before installing the software. Lenovo must also commit to a comprehensive security program for preloaded software that spans the next 20 years and which is to be audited by independent third parties.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "'Doxagram' searchable database of pilfered info on Instagram users back up and running", "news_link": "https://www.scmagazine.com/doxagram-searchable-database-of-pilfered-info-on-instagram-users-back-up-and-running/article/686406/", "title": "'Doxagram' searchable database of pilfered info  on Instagram users back up and running", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "September 05, 2017", "body": "A searchable database called Doxagram that allegedly houses information on more than six million Instagram users was back online Monday after being down late Friday \n\nHackers, who exposed photos of Selena Gomez and other celebrities after exploiting a bug that Instagram has since said it fixed, told the Daily Beast that they initially aimed their scraper at accounts with one million or more followers but them expanded their efforts to include others with fewer followers. \n\nThey're charging $10 per search. Instagram claimed last week that the bug had been fixed and only a small percentage of the social media site's users had been affected. Company co-founder and CTO Mike Krieger cautioned customers to use an \"abundance of caution\" and \"be vigilant\" about account security, reporting any suspicious activity to Instagram.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/hacking/topic/47220/", "topic_name": "Hacking"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Wells Fargo finds 1.4 million additional fake accounts created", "news_link": "https://www.scmagazine.com/wells-fargo-finds-14-million-additional-fake-accounts-created/article/685738/", "title": "Wells Fargo finds 1.4 million additional fake accounts created", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "September 01, 2017", "body": "Wells Fargo admitted today that an additional 1.4 million fraudulent accounts may have been created by its employees over an eight year span, in addition to the 2.1 million such accounts that were revealed last year.\n\nThe new figure is the result of a second company investigation that delved into 165 million retail banking accounts that were opened between January 2009 and September 2016, the company said in a statement. The original 2.1 million fake accounts were found during a separate study of 93 million accounts that were created between May 2011 and 2015.\n\nIn order to make the false accounts appear legitimate the workers accessed their customer's personal records and created fake email addresses and enrolled the accounts in various online banking programs using the names and personal information of actual Wells Fargo customers. Debit cards and PINs were also issued in the customer's name. \n\nThe scheme resulted in about 130,000 customers being charged fines for having insufficient funds and overdraft fees on the fake accounts that they did not know existed in their names. Customers were also charged finance and interest charges on the unauthorized cards created in their name.\n\nThe new study found additional 60,000 people had been similarly charged. Wells Fargo said in a statement these victims will be reimbursed.\n\n“We apologize to everyone who was harmed by unacceptable sales practices that occurred in our retail bank,” said Wells Fargo CEO Tim Sloan.\n\nSloan replaced John Stumpf, who was forced out of his position by the scandal that also saw 5,300 Wells Fargo employees fired. In addition, the Consumer Financial Protection Bureau fined the company $185 million. The Bureaus report found that employees created the false accounts in order to meet sales goals. \n\n“Spurred by sales targets and compensation incentives, employees boosted sales figures by covertly opening accounts and funding them by transferring funds from consumers' authorized accounts without their knowledge or consent, often racking up fees or other charges,” the CFPB wrote.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/credit-card/topic/47243/", "topic_name": "Credit Card"}, {"topic_link": "https://www.scmagazine.com/finance/topic/47209/", "topic_name": "Finance"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Report: Uber to discontinue post-ride tracking of app users", "news_link": "https://www.scmagazine.com/report-uber-to-discontinue-post-ride-tracking-of-app-users/article/684873/", "title": "Report: Uber to discontinue post-ride tracking of app users", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "August 29, 2017", "body": "Uber Technologies will no longer track its app users' physical locations once a ride ends, Reuters has reported.\n\nThe company's security officer Joe Sullivan told Reuters in an interview that the company, which has been subject to criticism over its privacy and data collection policies, will discontinue a feature on its app that tracks riders for up to five minutes following the conclusion of a trip.\n\nAccording to Reuters, Uber updated its app last November so that users no longer had the ability to restrict location tracking to only when the app is actively in use. Instead, they had to choose between allowing the company to always collect location data (even after a ride ends) or shutting off the feature entirely. However, eliminating all location tracking means users must then enter their pick-up locations manually.\n\nUber claims that post-ride tracking was introduced to improve user safety, and that it never began using the feature on iPhone users and suspended the feature for Android users, the news report states. Reuters has further reported that Uber will restore the option of limiting location tracking to when the app is actively being used, and will roll this update to iPhone users this week.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Hackers leak nude pics of actress Dakota Johnson", "news_link": "https://www.scmagazine.com/hackers-leak-nude-pics-of-actress-dakota-johnson/article/684562/", "title": "Hackers leak nude pics of actress Dakota Johnson", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 28, 2017", "body": "The same hackers behind the unauthorized access of celebrities' iCloud accounts and the subsequent postings of nude photographs are believed to be behind the recent leak of nude photos of “Fifty Shades” actress Dakota Johnson.\n\nThe actress is reportedly “horrified” at the release of the photos, which show her semi-nude in her shower with another actress and topless poolside with friends, according to a report by India.com.\n\n\n\nContinue Reading Below\n\nAn unnamed source, calling for a crackdown on hackers, allegedly told media outlets that the actress, daughter of Don Johnson and Melanie Griffin, was considering joining the ranks of other celebrities who are suing the website that posted the pictures, the report said.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/hacking/topic/47220/", "topic_name": "Hacking"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Court tells DreamHost to hand over data on DisruptJ20 visitors, limits scope of gov't request", "news_link": "https://www.scmagazine.com/court-tells-dreamhost-to-hand-over-data-on-disruptj20-visitors-limits-scope-of-govt-request/article/684162/", "title": "Court tells DreamHost to hand over data on DisruptJ20 visitors, limits scope of gov't request", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 24, 2017", "body": "No sooner had a federal judge ordered DreamHost to turn over information about visitors to DisruptJ20, a website that organized a protest of Donald Trump on Inauguration Day, to the court, than the company was hit with a distributed denial of service (DDoS) attack.\n\nThe Justice Department, investigating Inauguration Day riots, this week narrowed the scope of its original warrant, which would have forced DreamHost to cough up more than 1.3 million IP records of the activist website.\n\nThe July 12 search warrant authorized by a federal district court in Washington, D.C., for “the individuals who participated, planned, organized, or incited the January 20 riot,\" was initially rebuffed by DreamHost as \"a strong example of investigatory overreach and a clear abuse of government authority.”\n\nThursday's ruling, which reduced the time period specified by the search warrant, had D.C. Superior Court Judge Robert E. Morin toeing a thin line between free speech and investigators' needs in probing the protests, which broke into a riot that injured numerous people and resulted in hundreds of arrests.\n\nDreamHost's legal team had argued that the modified warrant was still too broad. “They are requesting all database and database records,” the Washington Post cited attorney Raymond Aghaian as saying. “With one warrant, they are trying to obtain content from multiple email accounts. That is unconstitutional.”\n\nWhile Morin said “there is a need to review the data and decide what is relevant,” he told DreamHost to turn over the data to his court where it will sit until an appeals court rules, and ordered prosecutors to inform the court who would conduct the review and what criteria they would use to determine if data is “critical.” Additionally, any unrelated information that prosecutors run across is to be sealed, Morin said.\n\n“The de-scoping of the original warrant, combined with the court's additional restrictions on the use of, and access to, that data, is a clear victory for user privacy,” DreamHost wrote in a blog post. “We're pleased that the court further limited the government's access to this data today. Judge Morin confirmed the validity of the Department of Justice's amended request, with some changes, and he is enforcing the DOJ's motion to compel.”\n\nThe company said it is “now obligated to comply with the court's request.”\n\nDreamHost later announced that its engineers had determined a DDoS attack by an unknown assailant was behind its DNS degradation. “We are beginning to mitigate the attack and will update this post as new information becomes available,\" the company said.\n\nSome speculated the site had been taken down by those disappointed with the ruling. “All my sites are on Dreamhost and they've apparently been taken down by hackers for standing up for freedom and democracy,” one Twitter user posted while another wrote that the company “should [have] expected this” from hacktivists. \n\nBut others said DreamHost had been targeted for “hosting the newest version of the Daily Stormer website,” the Punish Stormer.\n\nGoDaddy, Google and others refused to host the neo-Nazi website in the wake of the violence in Charlottesville, Va., that resulted in the death of Heather Heyer, a young woman protesting neo-Nazis and white supremacists who met in the college town for a “Unite the Right” rally.\n\nAfter GoDaddy booted the Daily Stormer, the site was allegedly commandeered by Anonymous.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Blumenthal: Committee should release transcript of testimony on Trump dossier", "news_link": "https://www.scmagazine.com/blumenthal-committee-should-release-transcript-of-testimony-on-trump-dossier/article/684006/", "title": "Blumenthal: Committee should release transcript of testimony on Trump dossier", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 24, 2017", "body": "Sen. Richard Blumenthal (D-Conn.) called for the Senate Judiciary Committee investigating Russian interference in the U.S. presidential election to make public recent and lengthy testimony by Glenn Simpson about the now infamous dossier on Donald Trump that his research firm drafted from information gathered by former British intelligence officer Christopher Steele.\n\n“I believe they will be. I certainly will vote to make them public.” Blumenthal told MSNBC in reference to the transcript of Simpson's 10-hour testimony. “They should be made public, but even more important Glenn Simpson should testify before the committee in the open, under oath, and so should the others who have been subpoenaed to do so as well. Donald Trump Jr. and the person who – anyone involved in that meeting in early June that involved apparently Jared Kushner and others.”\n\nSimpson, a former reporter for the Wall Street Journal and the co-founder of Fusion GPS, a firm hired by a group of Republicans in 2015 to gather opposition research on Trump, met privately Tuesday with committee staff and said afterwards that he stood by the contents of the dossier – some of it salacious – which indicated potential collusion between members of the Trump campaign and Russian operatives.\n\n\"Mr. Simpson told Congress the truth and cleared the record on many matters of interest to congressional investigators,” ABC News quoted Simpson's attorney Josh Levy as saying, noting that the committee had “the right to disclose the transcript” of Simpson's testimony if it so desired. The Judiciary Committee's probe is one of several exploring possible collusion between the Trump team and Russia, while trying to steer clear of interference with an investigation by Robert S. Mueller, who was made special counsel after Trump fired former FBI Director James Comey, ostensibly to put an end to his investigation of members of Trump's inner circle.\n\nSimpson “has potentially knowledge about matters relating to Trump collusion with the Russian meddling as well as possible obstruction of justice, and we're going to proceed with our investigation, but as you well know, the special counsel is proceeding as well,” said Blumenthal. “And we want to make sure, whether it's the release of the transcript or anything else, that we in no way conflict with the special counsel's role.”\n\nHouse Intelligence Committee staffers drew fire for seeking the elusive Steele in an unannounced visit to his attorneys' U.K. office this summer. The unusual trip was reportedly sanctioned by committee Staff Director Damon Nelson and made without informing either the Republican in charge of the committee's investigation into Russian interference in the U.S. presidential election or its ranking Democrat.\n\nSteele allegedly has already met with the FBI and has turned over the sources he used to compile the dossier, ABC News reported.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/cyberespionage/topic/47252/", "topic_name": "Cyberespionage"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}]}, {"news_name": "Justice agrees to narrow DreamHost warrant for disruptj20.org data", "news_link": "https://www.scmagazine.com/justice-agrees-to-narrow-dreamhost-warrant-for-disruptj20org-data/article/683914/", "title": "Justice agrees to narrow DreamHost warrant for disruptj20.org data ", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 23, 2017", "body": "After web hosting provider DreamHost pressed the U.S. government in superior court over a warrant to access more than 1.3 million IP records of a website, the Justice Department backed off its request and modified the warrant to narrow its scope.\n\n“The Warrant – like the criminal investigation – is singularly focused on criminal activity,” according to a brief filed with the court by the U.S. Attorney's Office in Washington and published by The Hill. “It will not be used for any other purpose.” \n\nDreamHost had argued last week in a blog post that the data requested by the government in its investigation of disruptj20.org, a site that was used to coordinate the massive anti-Trump protest that occurred on Inauguration Day, \"could be used to identify any individuals who used this site to exercise and express political speech protected under the Constitution's First Amendment. That should be enough to set alarm bells off in anyone's mind.\"\n\nAfter its bid that the government narrow the scope of its request was rebuffed, DreamHost petitioned a superior court in D.C. to deny the government's motion because it violates both the Fourth Amendment and the Privacy Protection Act (PPA).\n\nAccording to the Justice Department brief filed Monday, “what the government did not know when it obtained the Warrant – what it could not have reasonably known – was the extent of visitor data maintained by DreamHost that extends beyond the government's singular locus in this case of investigating the planning, organization, and participation in the January 20, 2017 riot.”\n\nDreamHost called the government's concession, “a huge win for internet privacy,” saying it “absolutely appreciate[s] the DOJ's willingness to look at and reconsider both the scope and the depth of their original request for records. That's all we asked them to do in the first place, honestly.”\n\nBut, the company said, the matter is not settled. “We're not done,” a Tuesday blog post read. “Much of the DOJ's original demand for information is still in place, and there are still a few issues that we consider to be problematic for a number of reasons.”\n\nThe company said it is “moving forward with a filing to address the remaining First and Fourth Amendment issues raised by this warrant,” which it will voice during a Thursday hearing in superior court.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/governmentdefense/section/7675/", "topic_name": "Government/Defense"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}, {"news_name": "Latest leak of hacked celebrity photos includes images of Tiger Woods and Lindsay Vonn", "news_link": "https://www.scmagazine.com/latest-leak-of-hacked-celebrity-photos-includes-images-of-tiger-woods-and-lindsay-vonn/article/683590/", "title": "Latest leak of hacked celebrity photos includes images of Tiger Woods and Lindsay Vonn", "author": "Bradley  Barth", "author_link": "https://www.scmagazine.com/bradley--barth/author/3635/", "date": "August 22, 2017", "body": "A website known for publishing images stolen from celebrity's hacked accounts has struck again, according to multiple reports -- this time posting nude or revealing photos of former sports couple Tiger Woods and Lindsey Vonn, actress Kristen Stewart, performers Miley Cyrus and Katharine McPhee, and model Stella Maxwell.\n\nIn response to the unauthorized publishing of private photos, Woods and McPhee have already threatened legal action against the website, Celebrity Jihad, if it does not remove the content, TMZ has reported.\n\n\n\nContinue Reading Below\n\nTMZ also reported that an intimate photo of Vonn and Woods, who were dating for roughly two years before their 2015 split, was stolen from Vonn's personal files. “It is an outrageous and despicable invasion of privacy for anyone to steal and illegally publish private intimate photos,” Vonn's spokesman said in an exclusive statement issued to People.\n\nIn April 2017, Celebrity Jihad and other websites reportedly published celebrity photos that were stolen in an iCloud hacking campaign that came to be known as Celebgate 2.0. The name was derived from the original Celebgate photo hacking scandal, which resulted in the 2017 conviction of Ryan Collins, who was sentenced to 18 months in prison after being convicted of using phishing scams to gain access to various personalities' iCloud and Gmail accounts.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cybercrime/topic/47218/", "topic_name": "Cybercrime"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/web-security/topic/47254/", "topic_name": "Web Security"}]}, {"news_name": "Top 10 Security Challenges for 2017", "news_link": "https://www.scmagazine.com/top-10-security-challenges-for-2017/article/682314/", "title": "Top 10 Security Challenges for 2017", "author": "Doug Olenick", "author_link": "https://www.scmagazine.com/doug-olenick/author/3633/", "date": "August 17, 2017", "body": "The first half of 2017 has not exactly been a ride in the park for cybersecurity professionals. \n\nSome of the highlight events so far this year have been the Shadow Brokers regularly dumping NSA hacking tools for public consumption, cybercriminals then using these shiny new toys to run amok producing WannaCry and NotPetya and most recently HBO being threatened with having its hottest show unveiled early unless a $6 million ransom is paid.\n\nSo will the last few months of 2017 see a continued level of activity or will things calm down as the bad guys take off for the holidays? SC Media asked some of the top executives in the field for what they see as the biggest threats and problems that will be faced in the next few months. This will be a living list with more threats being added as they appear.\n\n1. Malware with worm capabilities \n\nJerome Segura - Lead malware intelligence analyst at Malwarebytes\n\nWannacry shocked the world by its rapid spread and this wouldn't have been possible without its worm component. It reminded us of how quickly malware can propagate with devastating effects. Sadly, other malware authors have realized it also and are starting to add worm capabilities to their malware, such as recently with the Trickbot banking trojan.\n\n\n\n2. Release of more Shadow Brokers tools\n\nJeff Schilling - Chief Security Officer at ‎Armor\n\nEternalBlue and DoublePulsar, the critical component of the WannaCry worm are potentially just the tip of the iceberg of what may be coming from the Shadow Brokers.  These sophisticated tools, in the hands of a less than a sophisticated adversary, had massive global impact.  Expect more to come.\n\n3. Getting back to basics (patching, endpoint, hygiene)\n\nMatt Pascucci - Cybersecurity Practice Manager at CCSI \n\nThis is the biggest issue of the year and the malware has shown just how easy it is to comprise systems.\n\n4. The vulnerability of mobile carriers\n\n Elad Yoran - Executive Chairman of KoolSpan\n\n“Undoubtedly one of the more important security challenges facing us today is the growing realization that the carrier networks that transport the world's voice and data communications are systemically vulnerable to interception and monitoring. Hackers, terrorist organizations, foreign governments and others take advantage of these internetworking protocols and exploit them on a regular basis from anywhere around the world.\n\n5. Stop overwhelming clients with alerts!\n\nBen Herzberg, head of application security research at Imperva \n\nSecurity controls generate a lot of alerts that can easily overwhelm an organization. In large organizations such as banks, it is common to have over 100,000 security alerts per day.  As you can imagine, this requires a battalion of security engineers and analysts to sort through.\n\n6. Adapting the firewall to face new threats\n\nJody Brazil, co-founder and chief product strategist, FireMon\n\n“The evolution of the firewall is not complete. Networking technology is changing rapidly and the firewall will have to adapt. Cloud, SDN and containers threaten the traditional role of the firewall. The traditional network segmentation is being replaced with very flat networks - which removes a lot of network complexity, but introduces a significant challenge to the firewall.\n\n7. Monitoring Cloud Configuration and Security\n\nTim Erlin, Vice President, product management and strategy at Tripwire\n\nOrganizations continue to adopt cloud technologies at a rapid rate, but information security isn't keeping up. There have been discovered misconfigurations leading to data leaks, but for every one of these found, there are likely many more that aren't published. With a rapid rate of technological change, huge variation of skills, and fast paced adoption, it's clear that monitoring cloud assets and infrastructure will continue to be a challenge.  \n\n8. High Impact Attacks\n\nLimor Kessem - executive security advisor at IBM Security \n\nThinking about the biggest challenges for the remainder of the year, the one that stands out the most to me is “impact.” No one can deny the destructive effect of attacks we encountered this year so far, from Shamoon v2, to WannaCry, and NotPetya, the world witnessed the power of malicious code at its highest impact to date. For the rest of year, organizations cannot ignore the overall increasing risk of highly advanced leaked code which has been used widely against organizations of all types and sizes and spreads quickly without discrimination. These attacks have shown us that it's not just simply an organizations customer data, trade secrets, or finances that are at stake – entire operations have been shut down with devastating effects on business, employees and end users. \n\n9. The Insider Threat\n\nItsik Mantin - head of data security research at Imperva\n\nSimilar to previous years, many of the breaches seen in the last year were not the result of hackers penetrating the organization and stealing data from it, but employees and third-parties that have access to sensitive data for the sake of their work, that in some cases steal the data, where in other cases leak it by sending it accidentally to unauthorized recipients. The challenge with data breaches involving insiders and third-parties is double. Not only do the attackers have much more inside info than an external attacker, but since no malware is involved and no penetration happens through the organization perimeter, many of the common security mechanisms, like firewalls and anti-viruses, become blind to these attacks happening.\n\n10. Operationalizing GDPR\n\nChris Olson - CEO of The Media Trust  \n\nThe EU's pending data protection regulation ushers in a world of change for enterprise security teams. Beyond identifying and documenting data elements and data collection activity, IT and security professionals will join forces with privacy, risk and compliance officers to operationalize data governance policies. Implementation of compliance mechanisms to ensure data protection policies--including data unknowingly collected by third parties from everyday website operations--are actively monitored and enforced will be a key focus leading up to May 2018. \n\n", "topics": [{"topic_link": "https://www.scmagazine.com/cloud-security/topic/49913/", "topic_name": "Cloud Security"}, {"topic_link": "https://www.scmagazine.com/hacking/topic/47220/", "topic_name": "Hacking"}, {"topic_link": "https://www.scmagazine.com/insider-threat/topic/52185/", "topic_name": "Insider Threat"}, {"topic_link": "https://www.scmagazine.com/mobile-security/topic/47225/", "topic_name": "Mobile Security"}, {"topic_link": "https://www.scmagazine.com/patch/topic/47236/", "topic_name": "Patch"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}, {"topic_link": "https://www.scmagazine.com/ransomware/topic/47247/", "topic_name": "Ransomware"}]}, {"news_name": "Justice presses DreamHost for info on visitors to Trump protest site", "news_link": "https://www.scmagazine.com/justice-presses-dreamhost-for-info-on-visitors-to-trump-protest-site/article/681804/", "title": "Justice presses DreamHost for info on visitors to Trump protest site", "author": "Teri Robinson", "author_link": "https://www.scmagazine.com/teri-robinson/author/3627/", "date": "August 15, 2017", "body": "The Justice Department has pressed DreamHost to hand over what amounts to more than 1.3 million IP addresses associated with visitors to disruptj20.org, the group that organized protests against President Donald Trump on Inauguration Day 2017. \n\n\nAfter its bid that the government narrow the scope of its request was rebuffed, DreamHost petitioned a Superior Court in D.C. to deny the government's motion because it violates both the Fourth Amendment and the Privacy Protection Act.\n\n\"Because it requires the disclosure of every piece of electronic information related to a website, including a large amount of information about the protected activities of third parties, the government's Search Warrant requires scrutiny of 'particular exactitude.' Scrutiny of this type demonstrates that the warrant lacks the specificity required by the Fourth Amendment and is unreasonable as a whole,\" the company wrote in its motion before the court. \"Without any specification from the government, particularly given the over-expansive language of the Search Warrant, the Court should not compel DreamHost to provide all material to the government without a determination whether such material is intended for publication and if such material qualifies either as 'work product' or 'documentary material'\" protected by the Privacy Act.\n\nDigital rights advocates have thrown their support behind the web-hosting company. \"No plausible explanation exists for a search warrant of this breadth, other than to cast a digital dragnet as broadly as possible. But the Fourth Amendment was designed to prohibit fishing expeditions like this,\" the Electronic Frontier Foundation (EFF) Staff Attorney Mark Rumold wrote in a blog post that applauded DreamHost for its response. \"Those concerns are especially relevant here, where DOJ is investigating a website that served as a hub for the planning and exercise of First Amendment-protected activities.\"\n\nThe Superior Court will entertain the DreamHost motion at an August 18 hearing.\n\n", "topics": [{"topic_link": "https://www.scmagazine.com/government/topic/47207/", "topic_name": "Government"}, {"topic_link": "https://www.scmagazine.com/network-security/topic/47224/", "topic_name": "Network Security"}, {"topic_link": "https://www.scmagazine.com/privacy/topic/47216/", "topic_name": "Privacy"}, {"topic_link": "https://www.scmagazine.com/privacy--compliance/topic/49765/", "topic_name": "Privacy & Compliance"}]}]}]